{
    "major_id": "ANTH-AD",
    "file": "./2015-2016/Anthropology_(ANTH-AD).html",
    "courses": [
        {
            "course_id": "ANTH-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12936",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W007",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Balzani, Marzia"
                }
            ],
            "course_name": "Introduction to Anthropology",
            "description": "ANTH-AD  101 Introduction to Anthropology \nThis course provides students with a broad overview of the discipline, history, research methods, and selected contemporary issues in the field. The approach taken selects key ethnographies and uses them to explore questions of a methodological, theoretical, and substantive nature. This course is\ndesigned to introduce students to anthropological investigation and to facilitate understanding of how the discipline engages with and represents the everyday realities, challenges, and concerns of the people with whom anthropologists work.",
            "offering": true
        },
        {
            "course_id": "ANTH-AD 102",
            "course_name": "J",
            "description": "ANTH-AD  102J\n\n   Anthropology of Indigenous Australia:  Art, Politics and Cultural Futures\n\nThis course offers an introduction to some of the current issues in the anthropology of Indigenous Australia, considering a range of Aboriginal forms of social being, ranging historically and geographically and giving significant focus to the changing relationships between Indigenous people and the settler nation of Australia.  We will explore a range of sites of representation and imagination – in the expressions of visual art, film, and the performativity of political activism – in studying how Aboriginal people have struggled to reproduce themselves and their traditions in their own terms. ...\n\n      more description for ANTH-AD  102J »\n\n      \n\n\n\nThis course offers an introduction to some of the current issues in the anthropology of Indigenous Australia, considering a range of Aboriginal forms of social being, ranging historically and geographically and giving significant focus to the changing relationships between Indigenous people and the settler nation of Australia.  We will explore a range of sites of representation and imagination – in the expressions of visual art, film, and the performativity of political activism – in studying how Aboriginal people have struggled to reproduce themselves and their traditions in their own terms.  While those in the dominant society thought at first that Aboriginal people and their culture would “die out” and later that they would or could be simply “assimilated,” we will trace a history of Indigenous people from urban and remote communities intervening on what W.E.H. Stanner called “the great Australian silence” and asserting their right to a cultural future.  This will include assessing the contentious history of debates over the very rights of representation of Aboriginal culture and realities. This course will make use of several museums in Sydney, and a few prominent Indigenous scholars and artists will present their work relevant to the theme.\n\n      less description for ANTH-AD  102J «",
            "offering": false
        },
        {
            "course_id": "ANTH-AD 110",
            "course_name": "",
            "description": "ANTH-AD  110\n\n   India: Topics in Anthropology & History\n\nThis course offers multiple approaches to India under two broad conceptual frameworks: Caste and Communalism. The geographical focus for the course is India, broadly conceived to include its diaspora and in relation to other South  Asian states. The disciplinary location for the course is in Social and Cultural Anthropology and History.  Caste is the lens through which a range of social and cultural issues such as gender, class, modernity and food are considered and communalism is the lens through which key historical moments are examined. Such key moments may include some of the following: Pa...\n\n      more description for ANTH-AD  110 »\n\n      \n\n\n\nThis course offers multiple approaches to India under two broad conceptual frameworks: Caste and Communalism. The geographical focus for the course is India, broadly conceived to include its diaspora and in relation to other South  Asian states. The disciplinary location for the course is in Social and Cultural Anthropology and History.  Caste is the lens through which a range of social and cultural issues such as gender, class, modernity and food are considered and communalism is the lens through which key historical moments are examined. Such key moments may include some of the following: Partition (1947), the State of Emergency (1975-77), Operation Bluestar (1984), the destruction of the Babri Masjid, Ayodhya (1992) and the Gujarat riots (2002).  In each case the events are studied from multiple perspectives both anthropological and historical to examine, for example, secularism and nationalism in India.\n\n      less description for ANTH-AD  110 «",
            "offering": false
        },
        {
            "course_id": "ANTH-AD 198",
            "course_name": "Directed Study",
            "description": "ANTH-AD  198 Directed Study \nOffered by application Prerequisite: permission of the instructor Closely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        }
    ]
}