{
    "major_id": "ACS-AD",
    "file": "./2015-2016/Arab_Crossroads_(ACS-AD).html",
    "courses": [
        {
            "course_id": "ACS-AD 101",
            "course_name": "X",
            "description": "ACS-AD  101X\n\n   Anthropology and the Arab World\n\nHow have anthropologists encountered, written about, and produced the “Arab world” over the past century? Beginning with early Western travelers’ imaginaries of Arabia and ending with a reflection on the role of anthropology in the Arab world (and more globally) today, this course provides an introduction to the anthropological project and to the everyday realities of people living in the region.  Through ethnography, literature, film and fieldwork, we will explore such topics as Orientalism and its legacy; constructs of youth, gender, family and tribe; poetry and mediation; generational and s...\n\n      more description for ACS-AD  101X »\n\n      \n\n\n\nHow have anthropologists encountered, written about, and produced the “Arab world” over the past century? Beginning with early Western travelers’ imaginaries of Arabia and ending with a reflection on the role of anthropology in the Arab world (and more globally) today, this course provides an introduction to the anthropological project and to the everyday realities of people living in the region.  Through ethnography, literature, film and fieldwork, we will explore such topics as Orientalism and its legacy; constructs of youth, gender, family and tribe; poetry and mediation; generational and social change; oil, development and globalization; transnational labor, migration and diaspora; Indian Ocean networks; pilgrimage and piety; the Islamic Revival; faith, medicine, and bioethics; displacement and dispossession; refugees and human rights; and the Arab uprisings.\n\n      less description for ACS-AD  101X «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 111",
            "course_name": "X Emirati Literature and Culture",
            "description": "ACS-AD  111X Emirati Literature and Culture \nIn this course, we discuss the salient features of Emirati culture and of the literature that expresses cultural life. Guest speakers who are experts on aspects of Emirati culture will participate in several class meetings.",
            "offering": false
        },
        {
            "course_id": "ACS-AD 112",
            "course_name": "X UAE from Pre-History to 2030: History, Environment, Society and Culture",
            "description": "ACS-AD  112X UAE from Pre-History to 2030: History, Environment, Society and Culture \nA selection of themes and topics providing a broad perspective of Emirati history and culture are covered in this introduction to the United Arab Emirates. The class consists largely of presentations by guest experts as well as a selection of readings designed to provide a deep insight into the past and future of the nation.  Students are required to keep a journal and submit a research paper on a relevant topic of their choice.",
            "offering": false
        },
        {
            "course_id": "ACS-AD 118",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12843",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "COMP_RES 004"
                }
            ],
            "course_name": "X Introduction to Modern Arabic Literature",
            "description": "ACS-AD  118X Introduction to Modern Arabic Literature \nThis course provides an overview of Arabic literature since the nineteenth century. The transformation of poetic form and the emergence of modern genres, such as drama, the novel, and the short story, will be examined in relation to classical Arabic and European genres. We will also discuss the relationship between aesthetic developments and their historical, political, and intellectual contexts.",
            "offering": true
        },
        {
            "course_id": "ACS-AD 131",
            "course_name": "X",
            "description": "ACS-AD  131X\n\n   Emergence of the Modern Middle East\n\nAt the crossroads between Asia, Africa and Europe, the region that Europeans and North Americans labeled “The Middle East” presents a dynamic and heterogeneous landscape of peninsulas and isthmuses, republics and monarchies, oil producing countries, and labor exporting nations. This course examines the recent history of the region from the mid-18th century until the Arab uprisings of 2010–2012. We explore the last Islamic empires, the intrusion of European colonial powers, the modernist, nationalist and Islamic reactions to aggression, the creation of authoritarian systems of power and the mul...\n\n      more description for ACS-AD  131X »\n\n      \n\n\n\nAt the crossroads between Asia, Africa and Europe, the region that Europeans and North Americans labeled “The Middle East” presents a dynamic and heterogeneous landscape of peninsulas and isthmuses, republics and monarchies, oil producing countries, and labor exporting nations. This course examines the recent history of the region from the mid-18th century until the Arab uprisings of 2010–2012. We explore the last Islamic empires, the intrusion of European colonial powers, the modernist, nationalist and Islamic reactions to aggression, the creation of authoritarian systems of power and the multiform protests that have shaken them. The Egyptian, Iranian, Palestinian, and Saudi experiences are examined more closely.\n\n      less description for ACS-AD  131X «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 201",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12926",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 003",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Stearns, Justin K"
                }
            ],
            "course_name": "X Making of the Muslim Middle East",
            "description": "ACS-AD  201X Making of the Muslim Middle East \nIslam changed and shaped the Middle East, the Mediterranean world, and South Asia following its emergence in the seventh century. Muslims subsequently developed and expressed their faith in the disciplines of law, theology, and mysticism, even as their religious communities fractured into a variety of Sunni and Shi’a groups. This course focuses on primary sources to examine the richness of Islamicate civilization in the pre-modern world, including inter-religious relations as well as political and economic trends.",
            "offering": true
        },
        {
            "course_id": "ACS-AD 202",
            "course_name": "Paradise Lost: Muslims, Christians and Jews in al-Andalus",
            "description": "ACS-AD  202 Paradise Lost: Muslims, Christians and Jews in al-Andalus \nFrom the beginning of the 8th to the beginning of the 17th century, Islam played a crucial role in the history of the Iberian peninsula. Today this period is often portrayed as one of inter-religious harmony, while al-Andalus is simultaneously mourned in contemporary Islamist discourse as a lost paradise. In this course we investigate the rich and complex history of al-Andalus, focusing on the changing relationships between Muslim, Christian, and Jewish communities.",
            "offering": false
        },
        {
            "course_id": "ACS-AD 203",
            "course_name": "X",
            "description": "ACS-AD  203X\n\n   Heritage, History and Memory in the Modern \"Middle East\"\n\nHow do those who live in “the Middle East” relate to their past(s), and what discourses do they draw on to represent and authorize it today?  How is “the past” recovered, commemorated, embodied, erased, marketed and consumed in the modern Middle East? This course focuses on various thematics of history, heritage, and memory practices: national commemorations and contested sites and events; embodied and gendered memories; invented traditions and structural nostalgia; the problems of writing oral histories; the politics of archaeology; museums and exhibitions; and the construction (and destructi...\n\n      more description for ACS-AD  203X »\n\n      \n\n\n\nHow do those who live in “the Middle East” relate to their past(s), and what discourses do they draw on to represent and authorize it today?  How is “the past” recovered, commemorated, embodied, erased, marketed and consumed in the modern Middle East? This course focuses on various thematics of history, heritage, and memory practices: national commemorations and contested sites and events; embodied and gendered memories; invented traditions and structural nostalgia; the problems of writing oral histories; the politics of archaeology; museums and exhibitions; and the construction (and destruction) of tangible, intangible, and world heritage.\n\n      less description for ACS-AD  203X «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 204",
            "course_name": "J",
            "description": "ACS-AD  204J\n\n   Interwoven Pasts of Spain and Morocco\n\nAt the western end of the Mediterranean, the religious, political, and economic histories of North Africa and Iberia have always been intertwined. This was especially the case during the eight centuries from 711–1492 when various parts of the Iberian peninsula were ruled over by Muslims. In this course we look both at how what are today Morocco and Spain were connected in this period in both history and imagination, and at how the Spanish colonial presence in Morocco in the 20th century played a important role in the Spanish civil war. The course includes an extended trip through Morocco and S...\n\n      more description for ACS-AD  204J »\n\n      \n\n\n\nAt the western end of the Mediterranean, the religious, political, and economic histories of North Africa and Iberia have always been intertwined. This was especially the case during the eight centuries from 711–1492 when various parts of the Iberian peninsula were ruled over by Muslims. In this course we look both at how what are today Morocco and Spain were connected in this period in both history and imagination, and at how the Spanish colonial presence in Morocco in the 20th century played a important role in the Spanish civil war. The course includes an extended trip through Morocco and Spain.\n\n      less description for ACS-AD  204J «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 205",
            "course_name": "J",
            "description": "ACS-AD  205J\n\n   Arab Crossroads in China\n\nIn this course we immerse ourselves in the lives and culture of the Arab merchant communities that settled in China from the early days of Islam until the early modern period. We learn about Arab seafaring and trade in the Indian Ocean and the creation of the “Arabian Seas.” We read the narratives of Arab merchants, such as Suleiman the Merchant and Abu Hassan al-Sirafi who came to China from the Gulf in the 9th and the 10th centuries, and the great travelogue by Abu Abdallah Ibn Battuta, who traveled to China all the way from North Africa in the 14th century. We study the history of the corre...\n\n      more description for ACS-AD  205J »\n\n      \n\n\n\nIn this course we immerse ourselves in the lives and culture of the Arab merchant communities that settled in China from the early days of Islam until the early modern period. We learn about Arab seafaring and trade in the Indian Ocean and the creation of the “Arabian Seas.” We read the narratives of Arab merchants, such as Suleiman the Merchant and Abu Hassan al-Sirafi who came to China from the Gulf in the 9th and the 10th centuries, and the great travelogue by Abu Abdallah Ibn Battuta, who traveled to China all the way from North Africa in the 14th century. We study the history of the corresponding periods in Chinese history—the Tang, Song, and Yuan dynasties, and to complement the Arab travelogues, read the narrative of Ma Huan, the Chinese Muslim who sailed from China to Mecca and other cities in the region in the 15th century. The class visits Quanzhou, better known as Zaytoon, a city dominated by Arabs for several centuries, and other port cities in the Yangzi Delta and north in the Grand Canal on the way to Beijing.\n\n      less description for ACS-AD  205J «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 206",
            "course_name": "X",
            "description": "ACS-AD  206X\n\n   Jews in the Muslim World in the Middle Ages\n\nThis course examines the history and culture of the Jews in the medieval Islamic world, beginning with the historiographical debate about this contentious subject. The syllabus moves from the early encounter between Islam and the Jews at the time of the Prophet Muhammad, discussing the Qur’an and other foundational texts, to the legal and actual status of the Jews. We will examine how the famous Cairo Geniza documents illuminate Jewish (and Islamic) life, and how changes in the economy affected developments in Jewish law. The course will also examine the organization and functions of the Jewis...\n\n      more description for ACS-AD  206X »\n\n      \n\n\n\nThis course examines the history and culture of the Jews in the medieval Islamic world, beginning with the historiographical debate about this contentious subject. The syllabus moves from the early encounter between Islam and the Jews at the time of the Prophet Muhammad, discussing the Qur’an and other foundational texts, to the legal and actual status of the Jews. We will examine how the famous Cairo Geniza documents illuminate Jewish (and Islamic) life, and how changes in the economy affected developments in Jewish law. The course will also examine the organization and functions of the Jewish community and will address the large question of how much autonomy the Jews actually had. We will also read literary sources showing how deeply influenced the Jews were by Arabic culture. Where relevant, comparisons will be drawn with the situation of the Christian minority in the Islamic world and with that of Jews living in Medieval Latin Europe.\n\n      less description for ACS-AD  206X «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 207",
            "course_name": "JX",
            "description": "ACS-AD  207JX\n\n   History of Modern Iran\n\nThis course will cover major turning points in modern Iran, from the 1906 Constitutional Revolution to the 1979 Islamic Revolution  and since. Throughout, we will be focusing on gender, class, ethnic, and religious cleavages. Part I will cover late nineteenth-century religious practices as well as social and gender relations. Part II will explore the role of imperialist powers during the Constitutional Revolution and subsequent politics of oil in the Pahlavi period. Part III will turn to the social, cultural, and economic reasons for the emergence of Islamism. Here we concentrate on the links ...\n\n      more description for ACS-AD  207JX »\n\n      \n\n\n\nThis course will cover major turning points in modern Iran, from the 1906 Constitutional Revolution to the 1979 Islamic Revolution  and since. Throughout, we will be focusing on gender, class, ethnic, and religious cleavages. Part I will cover late nineteenth-century religious practices as well as social and gender relations. Part II will explore the role of imperialist powers during the Constitutional Revolution and subsequent politics of oil in the Pahlavi period. Part III will turn to the social, cultural, and economic reasons for the emergence of Islamism. Here we concentrate on the links between Islamist and Leftist intellectual discourses during the 1970s, Khomeini’s appropriation of these discourses during the Islamic Revolution, and the Islamist state’s consolidation of power during the Iran-Iraq war of the 1980s. Part IV will focus on the process whereby, during the 1990s, many leftist Islamists gravitated towards a human rights discourse and declared themselves Muslim Reformists. Here we will give special attention to debates over democratization and human rights, gender/sexuality, and religious/ethnic diversity.\n\n      less description for ACS-AD  207JX «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 208",
            "course_name": "J",
            "description": "ACS-AD  208J\n\n   Oasis, Coast and Mountain: Landscapes of History and Culture in the UAE and Oman\n\nThis course challenges preconceptions of Arabian landscapes as mainly desert by exploring three distinct ecological zones in relation to each other: desert, maritime coast, and mountain chain. How have these zones been constituted naturally and historically, and how they are changing in the present era? Topics include the impacts of human settlement, especially on water resources, inter-regional and global trade, colonization, and urbanization. Finally, we will look at what governments and global institutions have done to address some problems emerging in these zones. Learning will take place ...\n\n      more description for ACS-AD  208J »\n\n      \n\n\n\nThis course challenges preconceptions of Arabian landscapes as mainly desert by exploring three distinct ecological zones in relation to each other: desert, maritime coast, and mountain chain. How have these zones been constituted naturally and historically, and how they are changing in the present era? Topics include the impacts of human settlement, especially on water resources, inter-regional and global trade, colonization, and urbanization. Finally, we will look at what governments and global institutions have done to address some problems emerging in these zones. Learning will take place through informal lectures, guided tours of key sites, activities such as walking, boating, and swimming to get an embodied sense for these zones, recording through sketching or photography, interviewing various people knowledgeable about the issues at hand, not to mention people affected by their changing surroundings. Daily diary writing is required, along with group discussions with instructors during the day, and a short final reflective paper.\n\n      less description for ACS-AD  208J «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 231",
            "course_name": "JX Oil and Energy in the Middle East",
            "description": "ACS-AD  231JX Oil and Energy in the Middle East \nThis course provides an overview of the issues surrounding global energy supplies, oil’s unique economic properties, and its role in shaping the political economy of the Middle East and U.S. strategic interests in the region. We begin by discussing the basic science and availability of energy sources, the state of technology, the functioning of energy markets, the challenges of coping with global climate change and the key role of the oil reserves in the Middle East. The second part of the course focuses on the history of oil in the Middle East and its impact on societies in the region.",
            "offering": false
        },
        {
            "course_id": "ACS-AD 232",
            "course_name": "X Society and Politics of Saudi Arabia",
            "description": "ACS-AD  232X Society and Politics of Saudi Arabia \nThis course is an introduction to the study of Saudi Arabia and can be taken as a gateway course to the Arab Crossroads concentration. Its aim is to present various aspects of Saudi society and politics, from tribes and tribalism to oil, state building, Islamic activism and women. Saudi history has shifted since the 18th century, when a remote polity was confronting the Ottoman Empire and powerful Bedouin tribes. Since the creation of the modern state in 1932 and the discovery of oil in 1937, the country has become an essential albeit poorly understood player on the international scene.",
            "offering": false
        },
        {
            "course_id": "ACS-AD 233",
            "course_name": "| ACS-AD  233X",
            "description": "ACS-AD  233 | ACS-AD  233X\n\n   War and Media in the Middle East\n\nThis course examines two simultaneous processes in the Middle East since the mid-20th century: 1) how war has become mediatized, and 2) how media has been militarized. Beginning with the wave of independence and anti-colonial movements in the region, this course will analyze wars and political violence as mediated moments that rely on communicative acts and technologies. Simultaneously, the course will analyze how various media technologies – including radio, film, satellite TV, and internet – are formed through moments of war, conflict, and violence. Through these analyses, students will gain...\n\n      more description for ACS-AD  233 | ACS-AD  233X »\n\n      \n\n\n\nThis course examines two simultaneous processes in the Middle East since the mid-20th century: 1) how war has become mediatized, and 2) how media has been militarized. Beginning with the wave of independence and anti-colonial movements in the region, this course will analyze wars and political violence as mediated moments that rely on communicative acts and technologies. Simultaneously, the course will analyze how various media technologies – including radio, film, satellite TV, and internet – are formed through moments of war, conflict, and violence. Through these analyses, students will gain an understanding of the experiences of, conflicts over, and representations of notions such as territory, landscape, body, nation, gender, memory, terror, freedom, and spectacle.\n\n      less description for ACS-AD  233 | ACS-AD  233X «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 234",
            "course_name": "X",
            "description": "ACS-AD  234X\n\n   Arabs, Sex and Modernity | Arabs, X and Modernity\n\nThis course explores the centrality of sex to the construction of modernity through case studies drawn primarily from the Arab world. Attention will be paid to both the construction of the male and female sexes in relation to the notion of the modern, as well as the issue of modern desires and sexual identities, in an attempt to recast the relation between the Arab world and sex from a broader perspective, including imperial and colonial relations. The focus on specific case studies will allow us to reflect critically on Eurocentric theories of gender and sexuality. Major themes under explorat...\n\n      more description for ACS-AD  234X »\n\n      \n\n\n\nThis course explores the centrality of sex to the construction of modernity through case studies drawn primarily from the Arab world. Attention will be paid to both the construction of the male and female sexes in relation to the notion of the modern, as well as the issue of modern desires and sexual identities, in an attempt to recast the relation between the Arab world and sex from a broader perspective, including imperial and colonial relations. The focus on specific case studies will allow us to reflect critically on Eurocentric theories of gender and sexuality. Major themes under exploration will comprise the question of the veil, the structure of the family, the use of sexual pleasures, the debates around female genital cutting, the conflicts over reproduction, and the politics of sexual identity. Writers include Michel Foucault, Judith Butler, Ann Laura Stoler, Lisa Pollard, Joseph Massad, Leila Abu-Lughod, Chandra Mohanty, Mehammed Mack, Beatriz Preciado, Joan Wallach Scott, Saba Mahmood, Farha Ghannam, Homa Hoodfar, Afsaneh Najmabadi, Ayan Hirsi Ali, Marcia Inhorn, Madawi al Rasheed, Douglas Northrop, Silvia Federici, and Goran Therborn.\n\n      less description for ACS-AD  234X «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 235",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19963",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 003",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Menoret, Pascal"
                }
            ],
            "course_name": "X",
            "description": "ACS-AD  235X\n\n   Contentious Politics in the Arab World\n\nThe Arab region currently lives through an intense period of repression. Surveillance and control engulf the daily lives of millions of citizens; political activists are silenced, jailed, tortured, sometimes executed; wars are waged against unruly political movements, regions, even entire countries. This unprecedented level of repression shows the resilience of authoritarianism. It also shows, paradoxically, the vitality and efficiency of political movements in the Arab World. How do citizens organize under surveillance and repression? What resources do they draw on, what strategies do they ad...\n\n      more description for ACS-AD  235X »\n\n      \n\n\n\nThe Arab region currently lives through an intense period of repression. Surveillance and control engulf the daily lives of millions of citizens; political activists are silenced, jailed, tortured, sometimes executed; wars are waged against unruly political movements, regions, even entire countries. This unprecedented level of repression shows the resilience of authoritarianism. It also shows, paradoxically, the vitality and efficiency of political movements in the Arab World. How do citizens organize under surveillance and repression? What resources do they draw on, what strategies do they adopt to propose alternative political projects? Students will study contentious politics in the region since 1945, from Arab nationalism to socialism, unionism, communism, and Islamism. They will explore the making of contention in the various sites where organized action crystallized, from fields, factories, and oilrigs to streets, universities, and mosques. They will analyze the 2011 uprisings and their aftermaths, including the latest episodes of repression and militarization.\n\n      less description for ACS-AD  235X «",
            "offering": true
        },
        {
            "course_id": "ACS-AD 236",
            "course_name": "J",
            "description": "ACS-AD  236J\n\n   Anthropology of the Arabian Peninsula\n\nThis course examines the ways in which anthropologists have studied the Arabian Peninsula since the 1950s. Once constructed as an isolated land of desert and Bedouins, the Arabian Peninsula has become since the 1973 oil boom a highly globalized region, where flows of people, ideas, capital, and commodities weave a rich and dynamic social fabric. First, we’ll look at how imperial anthropologists, in particular these embedded in oil companies or development projects, constructed the dichotomies (traditional/modern, rural/urban, collective/individual) in which we operate today. Second, we’ll read...\n\n      more description for ACS-AD  236J »\n\n      \n\n\n\nThis course examines the ways in which anthropologists have studied the Arabian Peninsula since the 1950s. Once constructed as an isolated land of desert and Bedouins, the Arabian Peninsula has become since the 1973 oil boom a highly globalized region, where flows of people, ideas, capital, and commodities weave a rich and dynamic social fabric. First, we’ll look at how imperial anthropologists, in particular these embedded in oil companies or development projects, constructed the dichotomies (traditional/modern, rural/urban, collective/individual) in which we operate today. Second, we’ll read Arabian anthropologists, in particular on questions of gender and power. It is by starting with the “women’s question” that Arabian anthropologists devised novel ways to think about power and contestation. Third, we’ll examine current directions in Arabian Peninsula anthropology, in particular the study of structural violence through the experience of migrant workers and youth.\n\n      less description for ACS-AD  236J «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 261",
            "course_name": "J Cities and Modern Arabic Literature",
            "description": "ACS-AD  261J Cities and Modern Arabic Literature \nWe use fiction as a tool to visit (figuratively) five cities: Cairo, Alexandria, Beirut, Haifa, and Baghdad. The novels are our guides in order to understand the multiple layers of a city, and to build knowledge about the relationship between literature and social life. We read works by Naguib Mahfouz, Sunalla Ibrahim, Huda Barakat, Hanan Al Sheikh, Tawfic Yussuf Awad, Sinan Antoun, and Ghassan Kanafani. We read the novels as both individual and collective experiences, and we discuss how the new literary genre reflected and participated in the process of social change.",
            "offering": false
        },
        {
            "course_id": "ACS-AD 263",
            "course_name": "J",
            "description": "ACS-AD  263J\n\n   Modern Architecture in Abu Dhabi\n\nThis course is an exploration of modern architecture in the city. Gulf countries have witnessed an unprecedented construction boom since the beginning of oil exploitation. New cities have been built and old cities have been renewed, often with the help of such world-class architects as Le Corbusier, Frank Lloyd Wright, Walter Gropius, and Constantinos Doxiadis. In Abu Dhabi, infrastructures, public buildings, and residential projects have been designed by Roger Taillibert, Benjamin Thompson, Norman Foster, and Zaha Hadid, to name but a few. Students contribute to writing the story of modern ar...\n\n      more description for ACS-AD  263J »\n\n      \n\n\n\nThis course is an exploration of modern architecture in the city. Gulf countries have witnessed an unprecedented construction boom since the beginning of oil exploitation. New cities have been built and old cities have been renewed, often with the help of such world-class architects as Le Corbusier, Frank Lloyd Wright, Walter Gropius, and Constantinos Doxiadis. In Abu Dhabi, infrastructures, public buildings, and residential projects have been designed by Roger Taillibert, Benjamin Thompson, Norman Foster, and Zaha Hadid, to name but a few. Students contribute to writing the story of modern architecture in the city. They visit and document remarkable buildings, explore local archives, and reconstitute the trajectories of architectural forms and patterns. The final project is an architectural guide designed for students, faculty, and the Abu Dhabi community.\n\n      less description for ACS-AD  263J «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 264",
            "course_name": "J",
            "description": "ACS-AD  264J\n\n   The Orientalism Debates\n\nIn 1978 Edward Said published Orientalism, a book that presented a strong critique of Western scholarship on the Middle East. Thirty-five years later it is hard to find a discipline in the humanities and the social sciences that has not been influenced by the book, which is often credited with having founded the field of post-colonial studies. In this course we will read Orientalism, study Said’s complex relationship with the work of Foucault, his long feud with Bernard Lewis, the influence of Orientalism on fields as disparate as art history and political science, and read the works of recent...\n\n      more description for ACS-AD  264J »\n\n      \n\n\n\nIn 1978 Edward Said published Orientalism, a book that presented a strong critique of Western scholarship on the Middle East. Thirty-five years later it is hard to find a discipline in the humanities and the social sciences that has not been influenced by the book, which is often credited with having founded the field of post-colonial studies. In this course we will read Orientalism, study Said’s complex relationship with the work of Foucault, his long feud with Bernard Lewis, the influence of Orientalism on fields as disparate as art history and political science, and read the works of recent critics of Said such as Daniel Varisco and Robert Irwin.\n\n      less description for ACS-AD  264J «",
            "offering": false
        },
        {
            "course_id": "ACS-AD 298",
            "course_name": "Directed Study",
            "description": "ACS-AD  298 Directed Study \nUnder the supervision of a faculty member, students develop a research plan and complete a 25-page research paper, which is assessed based on the strength of research (both primary and secondary materials), the robustness and originality of the argument, and the quality of the student’s writing.",
            "offering": false
        },
        {
            "course_id": "ACS-AD 290",
            "course_name": "X | ACS-AD  390X",
            "description": "ACS-AD  290X | ACS-AD  390X\n\n   Problems and Methods in Arab Crossroads Studies\n\nTaken the junior year, this seminar introduces students to the main theoretical and epistemological trends in the study of the Arab crossroads region, and offers practical examples of the methodologies used by scholars in the humanities and the qualitative social sciences. We begin with the strengths and weaknesses of area studies, and the politics of producing knowledge on a region of global economic and political importance, then turn to specific areas of research that have attracted attention in the fields of history, anthropology, literature, and politics, before exploring the various meth...\n\n      more description for ACS-AD  290X | ACS-AD  390X »\n\n      \n\n\n\nTaken the junior year, this seminar introduces students to the main theoretical and epistemological trends in the study of the Arab crossroads region, and offers practical examples of the methodologies used by scholars in the humanities and the qualitative social sciences. We begin with the strengths and weaknesses of area studies, and the politics of producing knowledge on a region of global economic and political importance, then turn to specific areas of research that have attracted attention in the fields of history, anthropology, literature, and politics, before exploring the various methodological approaches used by practitioners of these fields. The course culminates in an extended research proposal for a capstone project.\n\n      less description for ACS-AD  290X | ACS-AD  390X «",
            "offering": false
        }
    ]
}