{
    "major_id": "ARTT-GE",
    "file": "./2015-2016/Art_Therapy_(ARTT-GE).html",
    "courses": [
        {
            "course_id": "ARTT-GE 2010",
            "course_name": "Introduction to Art Therapy",
            "description": "ARTT-GE 2010 Introduction to Art Therapy \nFundamental principles of art therapy practice will be presented through theoretical discussion & case presentations. Students will learn the historical development of the profession, its distinction from other disciplines & its commonalities to social sciences. This course will examine the art of making processes & products through basic pictorial analysis. Students will study the artistic expression of children, adolescents, adults, & geriatric populations struggling with varied emotional & physical issues in different settings.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2032",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4079",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 403",
                    "time": "Thu 4.05 PM - 6.35 PM",
                    "open": true,
                    "professor": "Acosta, Ikuko"
                }
            ],
            "course_name": "Art Therapy With Groups",
            "description": "ARTT-GE 2032 Art Therapy With Groups \nDeals primarily with the theory and application of art therapy techniques for various types of groups in mental health facilities.  Lecture, discussion, and studio work emphasize practical utilization of group techniques.",
            "offering": true
        },
        {
            "course_id": "ARTT-GE 2033",
            "course_name": "",
            "description": "ARTT-GE 2033\n\n   Art Therapy With Children\n\nArt as therapy with the emotionally disturbed, children with physical disabilies, the intellectually and/or neurologically impaired, and socioeconomically deprived children. Considers the problems and methods of art therapy for children with either aculte or mild disturbances. Demonstrations of art therapy techniques (utlizing studio activities) used in long-or short-term treatment. The role of art therapist in relation to other members of the therapeutic team in bringing about character change or improved ability to deal with immediate life situations. Methods of evaluation and treatment are ...\n\n      more description for ARTT-GE 2033 »\n\n      \n\n\n\nArt as therapy with the emotionally disturbed, children with physical disabilies, the intellectually and/or neurologically impaired, and socioeconomically deprived children. Considers the problems and methods of art therapy for children with either aculte or mild disturbances. Demonstrations of art therapy techniques (utlizing studio activities) used in long-or short-term treatment. The role of art therapist in relation to other members of the therapeutic team in bringing about character change or improved ability to deal with immediate life situations. Methods of evaluation and treatment are discussed. Illustrated lectures, reading, and discussion.\n\n      less description for ARTT-GE 2033 «",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2034",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4080",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 403",
                    "time": "Thu 6.45 PM - 9.15 PM",
                    "open": true,
                    "professor": "de Bethune, Marie"
                }
            ],
            "course_name": "Art Therapy With Adolscents",
            "description": "ARTT-GE 2034 Art Therapy With Adolscents \nArt as therapy for adolescent populations. Topics will cover a range of disorders such as the emotionally disturbed, the disabled, the intellectually and/or neurologically impaired, and the socioeconomically deprived. There will be a demonstration of techniques used in long or short-term treatment. Students will learn the role of the art therapist as a member of the therapeutic team in bringing about behavioral change or improved ability to deal with immediate life situations, methods, of evaluation, and treatment will be addressed.",
            "offering": true
        },
        {
            "course_id": "ARTT-GE 2036",
            "course_name": "Art Therapy With Families",
            "description": "ARTT-GE 2036 Art Therapy With Families \nTheoretical foundation and close study of assessment techniques in family art therapy. Art intervention techniques will also be introduced. Several theoretical approaches to family therapy will be studied - psychodynamics and systems theory. Lecture, slide and videotape presentation included.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2037",
            "course_name": "Art Therapy With Adults",
            "description": "ARTT-GE 2037 Art Therapy With Adults \nAn investigation of art therapy in numerous settings for adults with either acute or mild disturbances. Demonstration of art therapy techniques (utilizing studio activities) used in long-or short-term treatment. Discussion and art experience appropriate to use with talented adult group.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2040",
            "course_name": "Pictorial Analysis for Assessment & Diagnosis",
            "description": "ARTT-GE 2040 Pictorial Analysis for Assessment & Diagnosis \nDeveloping basic skills in evaluating form and content of pictorial and sculptural work produced in art therapy sessions.  Developing skills in integrating evidence of developmental level, perceptual capacities, psychodynamic processes, emotional handicaps, environmental stimuli in art work, and behavior. Students should be prepared to furnish some art work from child, adolescent or adult population.  Studio component included.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2145",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4081",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 403",
                    "time": "Tue 6.45 PM - 9.15 PM",
                    "open": true,
                    "professor": "Obstfeld, Renee"
                }
            ],
            "course_name": "Theory & Practice of Art Therapy",
            "description": "ARTT-GE 2145 Theory & Practice of Art Therapy \nEnrollment limited to art therapy candidates. Requires eight hours per week in the field. Discussion of art therapy history, theories, and technique. Introduction to clinical skills through class and fieldwork experience.",
            "offering": true
        },
        {
            "course_id": "ARTT-GE 2149",
            "course_name": "Ethical Issues in Art Therapy",
            "description": "ARTT-GE 2149 Ethical Issues in Art Therapy \nCourse is focused on ethical principles in art therapy & designed to deepen personal & professional values. Students will enhance their theoretical knowledge by art experientials & role playing. Course topics are organized to reflect the professional Ethics Code established by the American Art Therapy Association.  Particular emphasis will be placed on confidentiality dilemmas in therapy & research, dual-role relationships, & the personal & professional development of students’ identities as ethically minded art therapists.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2150",
            "course_name": "Techniques/Supervision in Art Therapy",
            "description": "ARTT-GE 2150 Techniques/Supervision in Art Therapy \nThis course prepared clinicians in art therapy to perform as supervisors of students and less experienced art therapists.  Methods and theoretical issues are examined.  Class participation includes a close study of case examples from students' experience.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2160",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4082",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 403",
                    "time": "Tue 4.05 PM - 6.35 PM",
                    "open": true,
                    "professor": "Acosta, Ikuko"
                }
            ],
            "course_name": "Art for Art Therapists",
            "description": "ARTT-GE 2160 Art for Art Therapists \nStudio work focused on enabling artists functioning as therapists to use their creative capacities in the service of individuals with adjustment problems and emotional disabilities.",
            "offering": true
        },
        {
            "course_id": "ARTT-GE 2220",
            "course_name": "Diverse Populations in Art Therapy",
            "description": "ARTT-GE 2220 Diverse Populations in Art Therapy \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2221",
            "course_name": "Diverse Populations Art Ther:Substance Abusers",
            "description": "ARTT-GE 2221 Diverse Populations Art Ther:Substance Abusers \nTheoretical and practical aspects of working with alcoholics and other substance abusers in short and long-term programs.  Various treatment models and philosophies will be discussed: a range of treatment techniques will be presented.  Common themes in art, physiological problems which affect drawing ability and problems of assessment and interpretation will be considered.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2222",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4083",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": "BARN"
                }
            ],
            "course_name": "Diverse Populations in Art Therapy: Trauma",
            "description": "ARTT-GE 2222 Diverse Populations in Art Therapy: Trauma \nThis course provides an overview of the psychological & neurological consequences of exposure to profound trauma, & the corresponding clinical & countertransferential implications for art therapists",
            "offering": true
        },
        {
            "course_id": "ARTT-GE 2224",
            "course_name": "Cultural Diversity in Art Therapy",
            "description": "ARTT-GE 2224 Cultural Diversity in Art Therapy \nSurvey of the ways in which art therapy may be used with the geriatric population including individuals with dementia, depression, psychiatric disorders, frail elders & healthy elders.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2240",
            "course_name": "Seminar in Art Therapy",
            "description": "ARTT-GE 2240 Seminar in Art Therapy \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2241",
            "course_name": "Seminar in Art Therapy: Psychology of Artist",
            "description": "ARTT-GE 2241 Seminar in Art Therapy: Psychology of Artist \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2280",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4084",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 506",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Grosso, Christina"
                }
            ],
            "course_name": "Research in Art Therapy",
            "description": "ARTT-GE 2280 Research in Art Therapy \nAn introduction to research methods used in art therapy with an emphasis on qualitative research design. Students work on the formulation of research questions and develop a thesis proposal.",
            "offering": true
        },
        {
            "course_id": "ARTT-GE 2300",
            "course_name": "Independent Study",
            "description": "ARTT-GE 2300 Independent Study",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2301",
            "course_name": "Final Project in Art Therapy",
            "description": "ARTT-GE 2301 Final Project in Art Therapy \nStudents complete a thesis project that integrates their acquired theoretical knowledge, clinical intership experience, and applied critical thinking.",
            "offering": false
        },
        {
            "course_id": "ARTT-GE 2302",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4085",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 304",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Grosso, Christina"
                },
                {
                    "format": "Lecture",
                    "class_id": "4086",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 508",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Berberian, Marygrace"
                },
                {
                    "format": "Lecture",
                    "class_id": "4087",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 506",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Wisniewski, Kim"
                }
            ],
            "course_name": "Internship in Art Therapy",
            "description": "ARTT-GE 2302 Internship in Art Therapy \nFieldwork consists of a minimum of 12 points (or 1,000 hours) including 110 hours of supervision by an experienced art therapist.   Fieldwork experience provides the student with practical involvement in acquiring the basic skills of an art therapist in a variety of medical and non medical settings, including mental hospitals, psychiatric wards, outpatient clinics, and mental health centers.",
            "offering": true
        },
        {
            "course_id": "ARTT-GE 2910",
            "course_name": "Graduate Projects in Art Therapy",
            "description": "ARTT-GE 2910 Graduate Projects in Art Therapy \nA classroom or praxis based course, focusing on current issues in studio art or the art professions. Topics examine a broad range of art and visual culture foci, with an emphasis on new approaches to both subject material and pedagogical methods.",
            "offering": false
        }
    ]
}