{
    "major_id": "ARTCR-GE",
    "file": "./2015-2016/Art_Theory_&_Critical_Studies_(ARTCR-GE).html",
    "courses": [
        {
            "course_id": "ARTCR-GE 2050",
            "course_name": "Modern Art Seminar: Andy Warhol",
            "description": "ARTCR-GE 2050 Modern Art Seminar: Andy Warhol \nLectures, readings, discussions, and reports on the major movements, schools, and styles of modern painting and sculpture.  Periods and styles discussed include, impressionism, postimpressionism, cubism, dadaism, surrealism, social realism, abstract expressionism, neodadaism, pop art, optical art, hard-edge painting, and minimal art.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2051",
            "course_name": "Modern Art Seminar:Andy Warhol The Man, The Myth",
            "description": "ARTCR-GE 2051 Modern Art Seminar:Andy Warhol The Man, The Myth \nFocus on Andy Warhol, one of the most important artists of the 20th century. Organized chronologically, this course explores his earlier works and his continued influence on contemporary art.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2060",
            "course_name": "Introduction to Critical Theory",
            "description": "ARTCR-GE 2060 Introduction to Critical Theory \nThis class will serve as an introduction to the category critical theory as it pertains to art and aesthetics and some of its major thinkers and concepts. Particular attention will be paid to the ways new perspectives on subjectivity, representation, and power/politics have influences, and had been influences by the visual field. Authors to be addressed include but will not be limited to Kant, Hegel, Marx, Nietzsche, Freud, Heiddiger, Benjamin, Foucault, Derrida, Lacan, Deleuze, and Zizek.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2099",
            "course_name": "Contemporary Photography and Ideas",
            "description": "ARTCR-GE 2099 Contemporary Photography and Ideas \nStudent work in analyzed in terms of issues in contemporary artmaking within the medium of photography.  Emphasis is placed on the cultural significance of photography and the interchange of imagery between society and the work of the individual artist.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2111",
            "course_name": "History of 19th Century Photography",
            "description": "ARTCR-GE 2111 History of 19th Century Photography \nA theoretical and historical analysis of photography from its inception in 1824 to its emergence as an acknowledged art form at the turn of the century. The evolution of the photographic process and materials, its use within the culture, its serious recognition and study, and the pervasive effects of the photographic image are examined. Works by recognized photographers and unknown artists are viewed as contributions to the making of photographic history.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2112",
            "course_name": "History of 20th Century Photography",
            "description": "ARTCR-GE 2112 History of 20th Century Photography \nThe widespread use of photography at all levels of our society is evaluated critically and theoretically. The class analyzes the effects of new equipment, materials and processes, the place of photography in journalism and mass media, and the transformation of the photographic statement into high art.  The art photograph, snapshot and Polaroid are seen as elements within a larger continuum.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2121",
            "course_name": "Visual & Critical Analysis for Artists",
            "description": "ARTCR-GE 2121 Visual & Critical Analysis for Artists \nThis class introduces students to the wide range of contemporary visual & critical methodologies used in art criticism & visual culture by means of a focus on a specific topic for analysis such as representation & identity, gender, & sexuality. In this way, students develop a specific & in-depth understanding of visual & critical analysis.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2140",
            "course_name": "The History of Taste",
            "description": "ARTCR-GE 2140 The History of Taste \nExamines the growth of the audience for the visual arts from ancient Greece to the ascendancy of Napoleon, in terms of style, patterns of collecting, and the economics of art.  Particular styles are covered in detail with an eye to their later impact on taste.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2141",
            "course_name": "",
            "description": "ARTCR-GE 2141\n\n   History of Taste: 1850-Present\n\nA survey that examines sources and influences that contributed to the formation of taste and style from about 1850 to the present. Through a concept-driven, cross-disciplinary approach that includes art, architecture, decorative arts, and material culture, taste will be explore thematically and chronologically within a broad cultural context. Factors and forces that shape this context include political events, social customs and fads, fashion, pastimes, entertainment and technological advances. Emphasis is placed on developing critical skills through discussion of connections and relationships...\n\n      more description for ARTCR-GE 2141 »\n\n      \n\n\n\nA survey that examines sources and influences that contributed to the formation of taste and style from about 1850 to the present. Through a concept-driven, cross-disciplinary approach that includes art, architecture, decorative arts, and material culture, taste will be explore thematically and chronologically within a broad cultural context. Factors and forces that shape this context include political events, social customs and fads, fashion, pastimes, entertainment and technological advances. Emphasis is placed on developing critical skills through discussion of connections and relationships between the historical development of taste and current trends.\n\n      less description for ARTCR-GE 2141 «",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2151",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4650",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 502",
                    "time": "Tue 2.00 PM - 3.40 PM",
                    "open": true,
                    "professor": "Danoff, I Michael"
                }
            ],
            "course_name": "History of Art Since 1945",
            "description": "ARTCR-GE 2151 History of Art Since 1945 \nStudy of painting & sculpture in America in 1945 to the present with background information concerning development of styles & movements in art in the 20th century.  Lectures, discussions, slides, gallery & museum visits.",
            "offering": true
        },
        {
            "course_id": "ARTCR-GE 2160",
            "course_name": "Tipics in Visual Arts and Culture",
            "description": "ARTCR-GE 2160 Tipics in Visual Arts and Culture \nAn advanced class for  visual artists in visual culture that investigates the changing methodologies and topics in the field. It is an 'umbrella'  course, designed to respond to what is a very rapidly evolving field and to provide a wide range of topics for in-depth study. This class will offer 'cutting-edge' research and methods, drawing on staff research and adjunct teaching from leading figures in the New York art world.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2161",
            "course_name": "Topics Visual Arts/Culture:  Art Contemporary Culture",
            "description": "ARTCR-GE 2161 Topics Visual Arts/Culture:  Art Contemporary Culture \nThis course seeks to investigate what history, & particularly recent history, tells us about the role of art in contemporary culture. We will look at the concept of the avant-garde & the notion of “criticality” that dominates the current art system & how that shapes art making, education, patronage, dissemination, & canonization. Mostly, we will ask ourselves questions like, what, if any, is the artist’s (& writer’s) responsibility as a producer of culture? What role does art play in global culture? How do politics affect aesthetics?",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2196",
            "course_name": "The Documentary as Art",
            "description": "ARTCR-GE 2196 The Documentary as Art \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2201",
            "course_name": "History of Video Art",
            "description": "ARTCR-GE 2201 History of Video Art \nThe moving image is an art form that has largely been propelled by technology.  Still in it's infancy - the first film was made in 1895 - it is a form that has quickly evolved from the desire to capture motion, generating almost as many uses & traditions both conceptual & material as there are makers.  Through screenings, readings, lectures & discussions this course investigates the ways in which certain artists have used film and video to explore meaning, experiment with form, & reshape the way we see.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2235",
            "course_name": "History of Contemporary Art and New Media",
            "description": "ARTCR-GE 2235 History of Contemporary Art and New Media \nThis course surveys developments since the 60s in video, performance art, film-installations, digitized photography, CD Rom, computer art or art on the internet. New Dance, New Music, Visual Theater and the Spoken Word will be also discussed in this broad understanding of the term new media, as it applies to the history of fine arts.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2252",
            "course_name": "",
            "description": "ARTCR-GE 2252\n\n   Dynamics of Twentieth Century Art Theories\n\nExamination of major events and movements of twentieth-century art together with the critical ideas animating and motivating their dynamics. Changes in art production and reception in the past century have resulted from massive transformations within society, and theoretical discourses try to grapple with the meaning of art in relationship to politicos, history and technology. Topics to be addressed will include the pioneers of abstraction, dada, and conceptual art, public art, changing approaches to viewing the art object after the advent of photography, film and video, performance and new me...\n\n      more description for ARTCR-GE 2252 »\n\n      \n\n\n\nExamination of major events and movements of twentieth-century art together with the critical ideas animating and motivating their dynamics. Changes in art production and reception in the past century have resulted from massive transformations within society, and theoretical discourses try to grapple with the meaning of art in relationship to politicos, history and technology. Topics to be addressed will include the pioneers of abstraction, dada, and conceptual art, public art, changing approaches to viewing the art object after the advent of photography, film and video, performance and new media, the politics of gender and race in modern art.\n\n      less description for ARTCR-GE 2252 «",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2300",
            "course_name": "Independent Study",
            "description": "ARTCR-GE 2300 Independent Study",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2450",
            "course_name": "Art and Ideas",
            "description": "ARTCR-GE 2450 Art and Ideas \nThis umbrella course develops a critical discourse between physical artworks and the ideas and issues that are embedded within them. Artwork will be analyzed, compared and contrasted with philosophical, literary and critical writings covering a range that includes both the traditional and nontraditional visual arts, film, architecture, and political and cultural events. Course topics will vary from semester to semester.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2451",
            "course_name": "Art and Ideas: Redefinition of Art",
            "description": "ARTCR-GE 2451 Art and Ideas: Redefinition of Art \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2452",
            "course_name": "Art and Ideas: The Sixties I",
            "description": "ARTCR-GE 2452 Art and Ideas: The Sixties I \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2453",
            "course_name": "Art and Ideas: The Sixties II",
            "description": "ARTCR-GE 2453 Art and Ideas: The Sixties II \nAgainst the backdrop of the cultural and political climate of the Sixties, lectures and class discussions will incorporate such subjects as the evolution of the Beat Generation into the hippie movement and the new lifestyles that emerged in the charged environment of protest and change.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2454",
            "course_name": "Art and Ideas:Film as Art",
            "description": "ARTCR-GE 2454 Art and Ideas:Film as Art \nThis course explores the visual styles and formal concerns that link cinematic traditions ranging from Hollywood films to conceptual, underground, and avant-garde cinema to visual art practice. Both well-known and lesser-known films are examined and analyzed from a visual standpoint as a major part of 20th century art history. The course includes readings, screenings, and slide lectures, which foreground the relationship between classic filmic themes such as alienation, abjection, artifice, camp, identification, and voyeurism with the representations of modern and contemporary art.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2455",
            "course_name": "Art and Ideas: Deconstruction of Art",
            "description": "ARTCR-GE 2455 Art and Ideas: Deconstruction of Art \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2456",
            "course_name": "Art and Ideas: Abjection",
            "description": "ARTCR-GE 2456 Art and Ideas: Abjection \nThe topic of abjection as it has been deployed in contemporary art and post-structural philosophy will be explored through close readings of artist's writings and art historical, philosophical, psychoanalytic, and literary texts. Emphasis will be given to the influence of post-structural thought on artists working from 1970 to present.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2457",
            "course_name": "",
            "description": "ARTCR-GE 2457\n\n   Art and Ideas:  Service\n\nThe idea of service lurks under the surface of much contemporary art. This course will explore themes of power, obligation, social class, hierarchy, & the construction of the self through classic texts such as Hegel, Kojeve, Marx, Freud, & Lacan, as a way to expand the dialogue around visual art. To this end we will consider works by a wide range of artists such as Sophie Calle, Walid Raad, Hans Haacke, Daniel Buren, Marcel Broodthaers, Adrian Piper, Vienna Aktionismus, Merle Ukeles, & the Art Workers Coalition, as well as works of film & literature in which servitude & duty are central forces...\n\n      more description for ARTCR-GE 2457 »\n\n      \n\n\n\nThe idea of service lurks under the surface of much contemporary art. This course will explore themes of power, obligation, social class, hierarchy, & the construction of the self through classic texts such as Hegel, Kojeve, Marx, Freud, & Lacan, as a way to expand the dialogue around visual art. To this end we will consider works by a wide range of artists such as Sophie Calle, Walid Raad, Hans Haacke, Daniel Buren, Marcel Broodthaers, Adrian Piper, Vienna Aktionismus, Merle Ukeles, & the Art Workers Coalition, as well as works of film & literature in which servitude & duty are central forces.\n\n      less description for ARTCR-GE 2457 «",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2458",
            "course_name": "Art & Ideas: Dummies: Ineptitude in Art & Film",
            "description": "ARTCR-GE 2458 Art & Ideas: Dummies: Ineptitude in Art & Film \nThis seminar bends the word dummy in different directions to shape an enquiry about the ways in which artists, filmmakers & critics  produce form & meaning out of the apparent lack thereof; in other  words, how does dumbness propel certain artistic practices?  Of  course, dummy denotes various states of being, including the stupid,  the mute, the copy, the stand-in (the prosthesis), & the  ventriloquist's other half.  It will be our agenda to track these  appearances to discover how each reveals the limits placed on art  production & promotes an alternate \"creative intelligence.\"",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2459",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4801",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 403",
                    "time": "Wed 4.30 PM - 6.30 PM",
                    "open": true,
                    "professor": "Desai, Dipti"
                }
            ],
            "course_name": "",
            "description": "ARTCR-GE 2459\n\n   Art & Ideas: What is Social Practice Art?\n\nThis course explores the burgeoning field of social practice art. Today artists working in the field of social practice focus on aesthetics, ethics, collaboration, media strategies, & social activism as central issues that inform their artworks & projects that are designed for public & social spaces. In the United States, visual art that engaged the public directly began in the late 1950s & coincided with the local “decentralization” efforts that, in the arts, resulted in community-based art practices that envisioned the public as diverse, socially-engaged, & contributed to an expansive aesthe...\n\n      more description for ARTCR-GE 2459 »\n\n      \n\n\n\nThis course explores the burgeoning field of social practice art. Today artists working in the field of social practice focus on aesthetics, ethics, collaboration, media strategies, & social activism as central issues that inform their artworks & projects that are designed for public & social spaces. In the United States, visual art that engaged the public directly began in the late 1950s & coincided with the local “decentralization” efforts that, in the arts, resulted in community-based art practices that envisioned the public as diverse, socially-engaged, & contributed to an expansive aesthetic consciousness. Understanding this history contextualizes social practice art & allows us to interrogate the ways artists blur the lines between object making, performance, activism, grass roots organizing & pedagogy.\n\n      less description for ARTCR-GE 2459 «",
            "offering": true
        },
        {
            "course_id": "ARTCR-GE 2470",
            "course_name": "Seminar in Art: The Artist in Venice",
            "description": "ARTCR-GE 2470 Seminar in Art: The Artist in Venice \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2801",
            "course_name": "Art Theory and Criticism I",
            "description": "ARTCR-GE 2801 Art Theory and Criticism I \nThis course surveys the evolution of ideas about modern art in the avant-garde traditions from the early twentieth century to the 1970s. The critical analysis of art will be addressed in terms of the changing status and perceptions of the work of art. Also addressed will be theories of the subject, society, authorship, and semiotics.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2802",
            "course_name": "Art Theory and Criticism II",
            "description": "ARTCR-GE 2802 Art Theory and Criticism II \nThis class surveys theories of contemporary art from the 1970s to the present. Class meetings provide an overview of the parallel appearance of new art forms and the critical theories associated with them. Areas to be explored include contemporary media culture, the politics of the image and identity, social constructions, memory and history as these relate to art theory and criticism.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2803",
            "course_name": "Art Criticism I",
            "description": "ARTCR-GE 2803 Art Criticism I \nThe methods & means of interpreting art are explored through writings with primary emphasis on major stylistic models from the historical & recent solutions to art criticism. The impact that current systems of criticality have on art making, curatorial practice, & patronage is investigated.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2804",
            "course_name": "Art Criticism II",
            "description": "ARTCR-GE 2804 Art Criticism II \nA wide range of contemporary visual & critical methodologies used in art criticism are explored, along with an extensive evaluation of writing techniques from a variety of sources including major international newspapers, journals, books, & on-line & print art publications.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2860",
            "course_name": "Intro to Critical Theory",
            "description": "ARTCR-GE 2860 Intro to Critical Theory \nThis class will serve as an introduction to the category critical theory as it pertains to art & aesthetics & some of its major thinkers & concepts. Particular attention will be paid to the ways new perspectives on subjectivity, representation, & power/politics have influences, & had been influences by the visual field. Authors to be addressed include but will not be limited to Kant, Hegel, Marx, Nietzsche, Freud, Heiddiger, Benjamin, Foucault, Derrida, Lacan, Deleuze, & Zizek.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2865",
            "course_name": "Art History as Critical Theory",
            "description": "ARTCR-GE 2865 Art History as Critical Theory \nThis class explores the role of critical theory in changing approaches to art history, from traditional modes of inquiry, through the innovations of the 'new art history,' to the current explosion of visual and/or cultural studies. Through specific case studies, we will attempt to gain familiarity with some of the critical issues in critical theory and art history today.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2869",
            "course_name": "Advanced Critical Theory",
            "description": "ARTCR-GE 2869 Advanced Critical Theory \nExpanding on the authors and topics addressed in the introductory course in this sequence, advances critical theory further explores the ways recent thinking and writing has redefined the field of aesthetics in relation to philosophy, literature, linguistics, psychoanalysis, sociology, and anthropology. The class will also engage a selection of 'minor masters' of critical theory, such as Barthes, Bhabba, Butler, Kristeva, Ronell, Silverman and Spivak.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2910",
            "course_name": "Graduate Projects in Art Theory/Critical Studies",
            "description": "ARTCR-GE 2910 Graduate Projects in Art Theory/Critical Studies \nA classroom or praxis based course, focusing on current issues in studio art or the art professions. Topics examine a broad range of art and visual culture foci, with an emphasis on new approaches to both subject material and pedagogical methods.",
            "offering": false
        },
        {
            "course_id": "ARTCR-GE 2911",
            "course_name": "History of Fashion Photography",
            "description": "ARTCR-GE 2911 History of Fashion Photography",
            "offering": false
        }
    ]
}