{
    "major_id": "AHC-AD",
    "file": "./2015-2016/Arts_&_Humanities_Colloquia_(AHC-AD).html",
    "courses": [
        {
            "course_id": "AHC-AD 100",
            "course_name": "Varieties of Memory",
            "description": "AHC-AD  100 Varieties of Memory \nEveryone talks about memory, yet nobody knows quite what it is. The basic question, what is memory, is unresolved: is memory located in the brain, or is it\na complex of activities characteristic of the mind or psyche? We speak of personal memories, repressed memories, communal memories—the list goes on. This course introduces the rich variety of ideas, activities, and artifacts all said to be about memory. Among them are memory and place, memory and\ntime, how societies remember, the art of memory, remembering the future, memory and creativity, and metaphors of memory.",
            "offering": false
        },
        {
            "course_id": "AHC-AD 113",
            "course_name": "",
            "description": "AHC-AD  113\n\n   Before Globalization: Understanding Premodern World History\n\nHumans have created a stunning variety of cultures, yet different civilizations have often developed in comparable ways. This course explores similarities and differences in the long run: are there patterns in world history, and why did civilizations develop the way they did? How did humanity come to grow together by forging connections over ever greater distances? We address these questions by taking a global view of humanity, from hunter-gatherers up to the beginnings of modern globalization 500 years ago. We examine the biological evolution of humans; the creation of art and religion; the o...\n\n      more description for AHC-AD  113 »\n\n      \n\n\n\nHumans have created a stunning variety of cultures, yet different civilizations have often developed in comparable ways. This course explores similarities and differences in the long run: are there patterns in world history, and why did civilizations develop the way they did? How did humanity come to grow together by forging connections over ever greater distances? We address these questions by taking a global view of humanity, from hunter-gatherers up to the beginnings of modern globalization 500 years ago. We examine the biological evolution of humans; the creation of art and religion; the origins of agriculture; the invention of hierarchy, gender inequality, and slavery; and the rise of cities, states, and empires.\n\n      less description for AHC-AD  113 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 114",
            "course_name": "",
            "description": "AHC-AD  114\n\n   Translation as Multimedia Practice and Metaphor\n\nThis course concerns the aesthetics and politics of translation, both as a historically and culturally situated practice and as a rich metaphor for cultural production, cross-cultural encounter, and other types of creation, appropriation, and change. The course emphasizes transformations that occur in cross-media translations, such as when poems are set to music and books are turned into films. In addition to writing a number of short, critical essays on translations broadly conceived, studies create literary and/or cross-media translations of their own. Students perform their translations at ...\n\n      more description for AHC-AD  114 »\n\n      \n\n\n\nThis course concerns the aesthetics and politics of translation, both as a historically and culturally situated practice and as a rich metaphor for cultural production, cross-cultural encounter, and other types of creation, appropriation, and change. The course emphasizes transformations that occur in cross-media translations, such as when poems are set to music and books are turned into films. In addition to writing a number of short, critical essays on translations broadly conceived, studies create literary and/or cross-media translations of their own. Students perform their translations at the end of the semester.\n\n      less description for AHC-AD  114 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 115",
            "course_name": "",
            "description": "AHC-AD  115\n\n   A World Transformed: The Global \"Sixties\"\n\nThis course explores the artistic and intellectual avant-gardes, counter-cultures, and protest movements of the 1960s and 1970s from a global perspective, assessing their impact on individual identities, social and gender hierarchies, domestic politics, and international relations during the Cold War. It traces the history of the various protest movements and the plethora of national experiences with respect to domestic and transnational networks of dissent as well as global imaginaries. Taking into account the aesthetics and performativity of protest, the course examines the role of cultural ...\n\n      more description for AHC-AD  115 »\n\n      \n\n\n\nThis course explores the artistic and intellectual avant-gardes, counter-cultures, and protest movements of the 1960s and 1970s from a global perspective, assessing their impact on individual identities, social and gender hierarchies, domestic politics, and international relations during the Cold War. It traces the history of the various protest movements and the plethora of national experiences with respect to domestic and transnational networks of dissent as well as global imaginaries. Taking into account the aesthetics and performativity of protest, the course examines the role of cultural practices, action repertoires,\nthe media, visual representations, lifestyle and fashion, the politics of memory, and the impact of dissent on political decision-makers and society at large. Course materials draw on the most recent historiography, as well as literature, film, art, music, and oral history.\n\n      less description for AHC-AD  115 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 120",
            "course_name": "Art/Science Collisions: Communicating with Data",
            "description": "AHC-AD  120 Art/Science Collisions: Communicating with Data \nThe aim of this course is to explore and draw inspiration from the scientific process, its representations, and data. The goal is to cultivate purposeful science communication and to encourage critical responses to scientific and technological practice in modern culture. Students focus on a particular area of science and become familiar with its process, language, and data. From direct experiences with scientists and science students, students propose their own art/science collisions and develop one idea as a media/interactive presentation for the final project.",
            "offering": false
        },
        {
            "course_id": "AHC-AD 123",
            "course_name": "",
            "description": "AHC-AD  123\n\n   Postcolonial Memory: Representing Cultures of Displacement\n\nWith the growing numbers of immigrants and refugees from the Middle East/North Africa in cities such as London, Paris, Berlin, Barcelona,\nNew York, Los Angeles, Montreal, Mexico City, Buenos Aires, and Sao Paulo, the construction of “us” versus “them” can no longer correspond to one geography, simplistically imagined as “over there.” This seminar studies questions of displacement as represented, mediated, and narrated in a wide variety of texts. It focuses especially on memoirs, whether in written or audiovisual form, which confront exclusionary and essentialist discourses with a rich cultura...\n\n      more description for AHC-AD  123 »\n\n      \n\n\n\nWith the growing numbers of immigrants and refugees from the Middle East/North Africa in cities such as London, Paris, Berlin, Barcelona,\nNew York, Los Angeles, Montreal, Mexico City, Buenos Aires, and Sao Paulo, the construction of “us” versus “them” can no longer correspond to one geography, simplistically imagined as “over there.” This seminar studies questions of displacement as represented, mediated, and narrated in a wide variety of texts. It focuses especially on memoirs, whether in written or audiovisual form, which confront exclusionary and essentialist discourses with a rich cultural production that foregrounds a complex understanding of such issues as “home,” “homeland,” “exile,” “hybridity,” and “minorities.”\n\n      less description for AHC-AD  123 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 126",
            "course_name": "",
            "description": "AHC-AD  126\n\n   The Age of Warhol\n\nAt the global art market’s most recent peak in 2007, American Pop artist Andy Warhol (1928–1987) edged out Pablo Picasso to become the world’s\nhighest priced painter at auction. Although he has recently ceded that position to Chinese artists Zhang Daqian (1899–1983) and Qi Baishi (1864–1957), Warhol remains one of the most influential forces in contemporary art worldwide. From his famous Campbell’s soup cans to his enduring aphorism that “In the future, everyone will be world-famous for fifteen minutes,” Warhol’s art and thinking saturate contemporary culture. This seminar uses his diaries and...\n\n      more description for AHC-AD  126 »\n\n      \n\n\n\nAt the global art market’s most recent peak in 2007, American Pop artist Andy Warhol (1928–1987) edged out Pablo Picasso to become the world’s\nhighest priced painter at auction. Although he has recently ceded that position to Chinese artists Zhang Daqian (1899–1983) and Qi Baishi (1864–1957), Warhol remains one of the most influential forces in contemporary art worldwide. From his famous Campbell’s soup cans to his enduring aphorism that “In the future, everyone will be world-famous for fifteen minutes,” Warhol’s art and thinking saturate contemporary culture. This seminar uses his diaries and other writing as a base-line against which we examine his 25-year career as a painter, filmmaker, publisher and music producer, TV personality, and artistic mentor and collaborator, as well as his legacy in what has been described as our “Warhol economy.” What can Warhol’s output and reception tell us about class,\ngender and sexuality, religion, and media over the last half century? And how should we understand his role in the making of global culture today?\n\n      less description for AHC-AD  126 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 127",
            "course_name": "",
            "description": "AHC-AD  127\n\n   Global Text: Moby-Dick\n\nIs there such a thing as global cultural heritage? This course resituates Herman Melville’s Moby- Dick—often described as “The Great American Novel”—as a global text that is “worldly” in its outlook and its legacy. The course examines\nthe novel’s relation to Christian, Muslim, and Zoroastrian religious traditions; to Greco-Roman tragedy and epic; to Shakespeare; to Western and Eastern philosophical traditions; and to a variety of European, British, and American Romantic traditions. It also examines the novel’s engagement with the visual arts. The course poses three sets of questions: 1) In wha...\n\n      more description for AHC-AD  127 »\n\n      \n\n\n\nIs there such a thing as global cultural heritage? This course resituates Herman Melville’s Moby- Dick—often described as “The Great American Novel”—as a global text that is “worldly” in its outlook and its legacy. The course examines\nthe novel’s relation to Christian, Muslim, and Zoroastrian religious traditions; to Greco-Roman tragedy and epic; to Shakespeare; to Western and Eastern philosophical traditions; and to a variety of European, British, and American Romantic traditions. It also examines the novel’s engagement with the visual arts. The course poses three sets of questions: 1) In what ways was Moby-Dick a “global” text in its own day, adopting a “worldly” approach that transcends its particular local milieu? 2) How has the history of the publication, criticism, and\nteaching of the novel transformed it into a global cultural work? 3) What is the cultural legacy of the book today throughout a variety of global media forms, including plays, films, novels, operas, and works of visual art?\n\n      less description for AHC-AD  127 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 128",
            "course_name": "J",
            "description": "AHC-AD  128J\n\n   Children and Childhood: Medical, Historical and Cultural Perspectives\n\nEvery society cares deeply about its children, but every society cares for its children differently. This global examination of children will discuss common themes and cultural variations. We will consider child labor, children in cities, children and war, and the changing historical nature of the family in America, Europe, and China. We will discuss education and health in global perspective, looking at children in the urban world of the 21st century, with field trips to the Shanghai Children’s Palace, the Shanghai Children’s Hospital, a school, an orphanage. Each student will report to the c...\n\n      more description for AHC-AD  128J »\n\n      \n\n\n\nEvery society cares deeply about its children, but every society cares for its children differently. This global examination of children will discuss common themes and cultural variations. We will consider child labor, children in cities, children and war, and the changing historical nature of the family in America, Europe, and China. We will discuss education and health in global perspective, looking at children in the urban world of the 21st century, with field trips to the Shanghai Children’s Palace, the Shanghai Children’s Hospital, a school, an orphanage. Each student will report to the class on some particular theme of childhood in comparative cultural perspective.\n\n      less description for AHC-AD  128J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 129",
            "course_name": "J",
            "description": "AHC-AD  129J\n\n   Memory and the City: Berlin in 20th Century History and Literature\n\nOne may well call European and especially German history in the 20th century eventful. As the German capital, Berlin saw the transition of the German Empire to a functioning if turbulent democratic state in 1918. The rise of the Nazis to power and their defeat in WW II led to the notorious division of the city which then belonged to two states. When the Berlin Wall came down in 1989, German reunification was imminent. The course will engage with Berlin as a city of memory as represented in places and reflected in literature. Visits include: Checkpoint 5 Charlie; the Berlin Wall; the Reichstag;...\n\n      more description for AHC-AD  129J »\n\n      \n\n\n\nOne may well call European and especially German history in the 20th century eventful. As the German capital, Berlin saw the transition of the German Empire to a functioning if turbulent democratic state in 1918. The rise of the Nazis to power and their defeat in WW II led to the notorious division of the city which then belonged to two states. When the Berlin Wall came down in 1989, German reunification was imminent. The course will engage with Berlin as a city of memory as represented in places and reflected in literature. Visits include: Checkpoint 5 Charlie; the Berlin Wall; the Reichstag; the Olympic stadium and village; the Bauhaus Archive and Museum; and the Gemäldegalerie.\n\n      less description for AHC-AD  129J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 130",
            "course_name": "J",
            "description": "AHC-AD  130J\n\n   Miracle of Florence\n\nIn the 15th and 16th centuries, the city of Florence was a center of immense creativity in every area of human understanding and endeavor. It was the\ncenter of that extraordinary moment we call “the Renaissance”—the revolution in art, architecture, politics, philosophy, and science that has shaped our view of the world, and the place of human beings in it. In this seminar, we read\nrepresentative writings from several of the great Florentine thinkers of the period—Alberti, Machiavelli, Pico, and Galileo. Our goal is twofold: to discover what was original in each, and to grasp how all were conne...\n\n      more description for AHC-AD  130J »\n\n      \n\n\n\nIn the 15th and 16th centuries, the city of Florence was a center of immense creativity in every area of human understanding and endeavor. It was the\ncenter of that extraordinary moment we call “the Renaissance”—the revolution in art, architecture, politics, philosophy, and science that has shaped our view of the world, and the place of human beings in it. In this seminar, we read\nrepresentative writings from several of the great Florentine thinkers of the period—Alberti, Machiavelli, Pico, and Galileo. Our goal is twofold: to discover what was original in each, and to grasp how all were connected by a shared set of ideals and beliefs. Our readings and discussions are supplemented by visits to the main cultural monuments of Florence, where we see (among other wonders) the palaces and churches that Alberti designed, the telescope through which\nGalileo spied the moons of Jupiter, and the tomb where Machiavelli lies.\n\n      less description for AHC-AD  130J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 131",
            "course_name": "J",
            "description": "AHC-AD  131J\n\n   The Enlightenment and Its Institutions\n\nWith astonishing speed—mere decades in the middle of the eighteenth century—the Enlightenment not only transformed how we think about ourselves, through new concepts of individuality and community, liberty and verifiable truth, it also remade Britain’s cities and institutions. Imagine London without the British Museum (1759) or the Royal Academy (1768). Imagine our curriculum\nwithout Johnson’s Dictionary (1755) or the Encyclopedia Britannica (1768). 250 years later, we use the resources of the Global Network University to recover how this revolution in methods, tools, and institutions recast i...\n\n      more description for AHC-AD  131J »\n\n      \n\n\n\nWith astonishing speed—mere decades in the middle of the eighteenth century—the Enlightenment not only transformed how we think about ourselves, through new concepts of individuality and community, liberty and verifiable truth, it also remade Britain’s cities and institutions. Imagine London without the British Museum (1759) or the Royal Academy (1768). Imagine our curriculum\nwithout Johnson’s Dictionary (1755) or the Encyclopedia Britannica (1768). 250 years later, we use the resources of the Global Network University to recover how this revolution in methods, tools, and institutions recast inquiry and enterprise in the West and to consider what we might do with our Enlightenment inheritance now. Behind-the-scenes adventures into London’s museums, galleries, and civic societies allow us to add our own tracks to the intellectual map we draw in class.\n\n      less description for AHC-AD  131J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 132",
            "course_name": "J",
            "description": "AHC-AD  132J\n\n   Prague, Capital of Europe\n\nPrague should have been destroyed during the Second World War, like other major cities in Europe, but somehow it wasn’t. The remarkable survival\nof this exquisite city allows us to explore Central European history and culture in the context of a completely preserved inner urban core dating back to the Middle Ages. Drawing upon primary source readings, cartography, musical performances, art and architecture, the course illuminates the way crosscurrents of European culture became focused in Prague between 1400 and the present. In addition to academic encounters with such figures as Mucha, Kafka,...\n\n      more description for AHC-AD  132J »\n\n      \n\n\n\nPrague should have been destroyed during the Second World War, like other major cities in Europe, but somehow it wasn’t. The remarkable survival\nof this exquisite city allows us to explore Central European history and culture in the context of a completely preserved inner urban core dating back to the Middle Ages. Drawing upon primary source readings, cartography, musical performances, art and architecture, the course illuminates the way crosscurrents of European culture became focused in Prague between 1400 and the present. In addition to academic encounters with such figures as Mucha, Kafka, Mozart, and Kundera, the course includes walking tours around Prague, trips to museums and concerts, excursions outside the city, and interactions\nwith leading local performers and thinkers.\n\n      less description for AHC-AD  132J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 133",
            "course_name": "J",
            "description": "AHC-AD  133J\n\n   Idea of the Renaissance in Modern Thought\n\nEver since the late seventeenth century, thinkers calling themselves \"modern\" have sought to establish a sense of their relationship to ancient history and thought. Florence has played a major role in these efforts and in the very idea of what modernity is. First, because Florence has remained intimately associated with the Renaissance, and thus with a literary, aesthetic, and scientific return\nto the Ancients. And second, because it is seen as a birthplace of modern political thought—especially republicanism and the theory of the state. In this\nclass we study the place of Florence in the mode...\n\n      more description for AHC-AD  133J »\n\n      \n\n\n\nEver since the late seventeenth century, thinkers calling themselves \"modern\" have sought to establish a sense of their relationship to ancient history and thought. Florence has played a major role in these efforts and in the very idea of what modernity is. First, because Florence has remained intimately associated with the Renaissance, and thus with a literary, aesthetic, and scientific return\nto the Ancients. And second, because it is seen as a birthplace of modern political thought—especially republicanism and the theory of the state. In this\nclass we study the place of Florence in the modern imagination. We follow in the footsteps, both textual and actual, of thinkers who looked back to the past, and even at themselves, through the Florentine lens, and who asked what it means to be modern, to look to “the ancients,” and to look at the Renaissance as a cultural rebirth, by way of the city and its cultural heroes.\n\n      less description for AHC-AD  133J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 134",
            "course_name": "",
            "description": "AHC-AD  134\n\n   Women’s Voices\n\nAs cultural traditions have for the most part carried the voices of men, this course will consider the question: what can we learn from listening to women?  We will listen to a range of women’s voices: novelists and poets, including Emily Dickinson, Adrienne Rich, Virginia Woolf, Toni Morrison, and Arundhati Roy; film-makers, including Shawn Slovo (“A World Apart”) and Haifaa al-Mansour (“Wadjda”); and scholars, including Martha Nussbaum (The Fragility of Goodness) and Leila Ahmed (Border Passage). Students will be asked to consider how these readings illuminate the human condition or throw li...\n\n      more description for AHC-AD  134 »\n\n      \n\n\n\nAs cultural traditions have for the most part carried the voices of men, this course will consider the question: what can we learn from listening to women?  We will listen to a range of women’s voices: novelists and poets, including Emily Dickinson, Adrienne Rich, Virginia Woolf, Toni Morrison, and Arundhati Roy; film-makers, including Shawn Slovo (“A World Apart”) and Haifaa al-Mansour (“Wadjda”); and scholars, including Martha Nussbaum (The Fragility of Goodness) and Leila Ahmed (Border Passage). Students will be asked to consider how these readings illuminate the human condition or throw light on aspects of human experience that challenge traditional assumptions, including assumptions about women and men.\n\n      less description for AHC-AD  134 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 135",
            "course_name": "",
            "description": "AHC-AD  135\n\n   Reading the Earth: World Literature and the Environment\n\nThis course introduces students to several genres of literature—drama, the novel, poetry, and the short story—and to some fundamental categories of literary criticism including Marxism, feminism, post-colonial theory, and eco-criticism.  We will be examining conceptions of nature and how “the natural” is represented in texts, especially after the explosive growth of industrialization in Victorian England and its subsequent global diffusion.  Each unit of the course is constructed around a particular problem that will be contextualized historically through a variety of primary and secondary rea...\n\n      more description for AHC-AD  135 »\n\n      \n\n\n\nThis course introduces students to several genres of literature—drama, the novel, poetry, and the short story—and to some fundamental categories of literary criticism including Marxism, feminism, post-colonial theory, and eco-criticism.  We will be examining conceptions of nature and how “the natural” is represented in texts, especially after the explosive growth of industrialization in Victorian England and its subsequent global diffusion.  Each unit of the course is constructed around a particular problem that will be contextualized historically through a variety of primary and secondary readings.  In an attempt to address a representative range of eco-critical dilemmas, we will examine texts from around the world not only in terms of local and regional issues, but also with an eye towards a more global perspective.  In attempting to conceptualize nature and the environment, it has become difficult not to think globally.  Thinking about literature is increasingly becoming a parallel kind of exercise and students will be encouraged to explore the connections between a global world of texts and the larger natural environment that both shapes and is, in turn, shaped by them.\n\n      less description for AHC-AD  135 «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 136",
            "course_name": "J",
            "description": "AHC-AD  136J\n\n   Art, Culture and Self\n\nAn interdisciplinary look at different ways of construing the self and how they both affect and are affected by culture, with a focus on China and the arts.  Topics will include the contrast afforded by the West; originality and the Chinese copycat phenomenon; the autobiographical impulse; and hybridity.  Exercises in cultural psychology and readings and lectures on art, architecture and literature will be supplemented by field trips to a variety of museums, such as the Shanghai Museum, the Shikumen Museum, the Rockbund Art Museum, the Chinese Imperial Examination System Museum, and the Propag...\n\n      more description for AHC-AD  136J »\n\n      \n\n\n\nAn interdisciplinary look at different ways of construing the self and how they both affect and are affected by culture, with a focus on China and the arts.  Topics will include the contrast afforded by the West; originality and the Chinese copycat phenomenon; the autobiographical impulse; and hybridity.  Exercises in cultural psychology and readings and lectures on art, architecture and literature will be supplemented by field trips to a variety of museums, such as the Shanghai Museum, the Shikumen Museum, the Rockbund Art Museum, the Chinese Imperial Examination System Museum, and the Propaganda Poster Art Museum, as well as to the Novartis research lab, where cross-cultural issues affecting scientific research are being addressed through architecture.\n\n      less description for AHC-AD  136J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 137",
            "course_name": "J",
            "description": "AHC-AD  137J\n\n   Imagining the Renaissance City: Florence and Siena\n\nMany institutions central to today’s cities – banks, hospitals, civic governments, museums, communal systems of welfare and sustainability – had their testing grounds in the small Tuscan towns of medieval and Renaissance Italy.  These towns also pioneered recognizably modern artistic, cultural, and engineering practices. Florence and Siena were especially vibrant in this transformation of urban life: the one a powerhouse of culture and industry, the other the Wall Street of Europe as it financed entrepreneurs, popes, and Europe’s kings.  Our project for our three weeks together is to figure ou...\n\n      more description for AHC-AD  137J »\n\n      \n\n\n\nMany institutions central to today’s cities – banks, hospitals, civic governments, museums, communal systems of welfare and sustainability – had their testing grounds in the small Tuscan towns of medieval and Renaissance Italy.  These towns also pioneered recognizably modern artistic, cultural, and engineering practices. Florence and Siena were especially vibrant in this transformation of urban life: the one a powerhouse of culture and industry, the other the Wall Street of Europe as it financed entrepreneurs, popes, and Europe’s kings.  Our project for our three weeks together is to figure out what made Florence and Siena tick. We’ll come to know these cities intimately, visiting seats of government and Renaissance orphanages, climbing towers, exploring the home of a fifteenth-century merchant, and prowling a recently-excavated crypt under Siena’s cathedral. We’ll also read and study the utopian (and dystopian) visions of these cities – Lorenzetti’s frescoes of Good Government and Dante’s Inferno -- along with diaries, letters, and constitutions. And to help you hone your writing skills, we’ll read the travelogues of two of Italy’s greatest story-tellers: Marco Polo and Italo Calvino.\n\n      less description for AHC-AD  137J «",
            "offering": false
        },
        {
            "course_id": "AHC-AD 311",
            "course_name": "NYUAD Summer Capstone Research",
            "description": "AHC-AD  311 NYUAD Summer Capstone Research \nSummer Capstone Research",
            "offering": false
        }
    ]
}