{
    "major_id": "CLI-UG",
    "file": "./2015-2016/Community_Learning_(CLI-UG).html",
    "courses": [
        {
            "course_id": "CLI-UG 1330",
            "course_name": "Euripedes' Medea and Morrison'S Beloved",
            "description": "CLI-UG 1330 Euripedes' Medea and Morrison'S Beloved",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1402",
            "course_name": "Community Learning Theory and Practice",
            "description": "CLI-UG 1402 Community Learning Theory and Practice",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1403",
            "course_name": "",
            "description": "CLI-UG 1403\n\n   Tools for Social Change\n\nThis one-semester course serves as the anchor for community-engaged course work at Gallatin.  It complements the range of course offerings at Gallatin and NYU by focusing on connection between theories of social change and the practice of social change.  This course thus gives students a platform to question and start defining their roles in social change, through readings, case studies, conversations with activists, and reflection exercises.  “Tools for Social Change” is a course for proactive, humble-yet-ambitious students who are motivated to engage deeply with the challenges of this course...\n\n      more description for CLI-UG 1403 »\n\n      \n\n\n\nThis one-semester course serves as the anchor for community-engaged course work at Gallatin.  It complements the range of course offerings at Gallatin and NYU by focusing on connection between theories of social change and the practice of social change.  This course thus gives students a platform to question and start defining their roles in social change, through readings, case studies, conversations with activists, and reflection exercises.  “Tools for Social Change” is a course for proactive, humble-yet-ambitious students who are motivated to engage deeply with the challenges of this coursework.  This hands-on course will help students make important decisions about their own values and belief systems, and figure out how to put those into practice.  Students will then reflect on the experience in the form of small writing exercises and a final project.  Guest speakers will include activists from local organizations and former Gallatin students who have gone on to pursue activism.  Readings will include a range of “classic” and more contemporary texts on the connection between critical theories and practice, including: Paulo Freire, Martin Luther King, Cornel West, Frances Moore Lappe, among others.\n\n      less description for CLI-UG 1403 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1405",
            "course_name": "Community Learning Workshop",
            "description": "CLI-UG 1405 Community Learning Workshop",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1410",
            "course_name": "Memory, Identity and Community",
            "description": "CLI-UG 1410 Memory, Identity and Community",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1412",
            "course_name": "Memory and Creativity",
            "description": "CLI-UG 1412 Memory and Creativity",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1415",
            "course_name": "Charting Sustainability in The Real World",
            "description": "CLI-UG 1415 Charting Sustainability in The Real World",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1418",
            "course_name": "Map The Vote",
            "description": "CLI-UG 1418 Map The Vote",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1419",
            "course_name": "Research Methods for Organizing",
            "description": "CLI-UG 1419 Research Methods for Organizing",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1420",
            "course_name": "Mapping for Soc Change",
            "description": "CLI-UG 1420 Mapping for Soc Change",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1422",
            "course_name": "",
            "description": "CLI-UG 1422\n\n   Cultural Mapping for Social Change\n\nWhere do forces of gentrification intersect with grassroots efforts to preserve the cultural identity of a marginalized community?  How are demographics used as a tool by political activists to organize campaigns?  How is mapping being used in campaigns to affect social change?  This course explores how to use Geographic Information Systems (GIS), a powerful application in mapping technology, as a tool for cultural documentation, community engagement, and public policy analysis.  We will explore the effectiveness of GIS as a mapping tool to help understand historical patterns of demographics, ...\n\n      more description for CLI-UG 1422 »\n\n      \n\n\n\nWhere do forces of gentrification intersect with grassroots efforts to preserve the cultural identity of a marginalized community?  How are demographics used as a tool by political activists to organize campaigns?  How is mapping being used in campaigns to affect social change?  This course explores how to use Geographic Information Systems (GIS), a powerful application in mapping technology, as a tool for cultural documentation, community engagement, and public policy analysis.  We will explore the effectiveness of GIS as a mapping tool to help understand historical patterns of demographics, and to empower community members to become informed citizens in the decision-making process.  Specific skills we'll learn include how to geocode addresses, do a spatial analysis, and use census data to map the racial and income composition of New York neighborhoods.  You will also work with local community-based organizations to understand how community nonprofits are using GIS mapping as a tool for research and strategic planning.\n\n      less description for CLI-UG 1422 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1425",
            "course_name": "Conflict, Leadership and Reconciliation",
            "description": "CLI-UG 1425 Conflict, Leadership and Reconciliation",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1430",
            "course_name": "NYC: a Practicum in Conflict & Consensus",
            "description": "CLI-UG 1430 NYC: a Practicum in Conflict & Consensus",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1432",
            "course_name": "Community Activism in Lower Manhattan",
            "description": "CLI-UG 1432 Community Activism in Lower Manhattan",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1435",
            "course_name": "",
            "description": "CLI-UG 1435\n\n   Walls of Power: Public Art\n\nThis workshop will explore how visual art, performance art, and activist art in the public sphere contribute to political dialogue and community building. The course will integrate the hands-on practice of public art making with the study of politics, community building, culture, and social issues as they relate to public art, with a special focus on New York City. A major component of the course will be a public art project that students will plan and execute during the semester, in collaboration with the Brooklyn School for Collaborative Studies, a Title 1 middle school. Selected readings wi...\n\n      more description for CLI-UG 1435 »\n\n      \n\n\n\nThis workshop will explore how visual art, performance art, and activist art in the public sphere contribute to political dialogue and community building. The course will integrate the hands-on practice of public art making with the study of politics, community building, culture, and social issues as they relate to public art, with a special focus on New York City. A major component of the course will be a public art project that students will plan and execute during the semester, in collaboration with the Brooklyn School for Collaborative Studies, a Title 1 middle school. Selected readings will include: Bachelard, The Poetics of Space; Deutsche, Evictions: Art and Spatial Politics; Lacy, ed., Mapping the Terrain: New Genre Public Art; Malraux, Museum Without Walls; Raven, Art in the Public Interest; Rochfort, Mexican Muralists: Orozco, Rivera, Siqueiros.\n\n      less description for CLI-UG 1435 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1436",
            "course_name": "",
            "description": "CLI-UG 1436\n\n   Hip-Hop Trails: Tracing and Rediscovering the Origins and Legacy of Hip-Hop Culture\n\nThere is no doubt that Hip-Hop is ubiquitous through radio and television commercials, music videos, films, magazines, billboards, and video games. However, the Hip-Hop we see today is not the same Hip-Hop that we saw when early pioneers formed a distinct sub-culture (encompassing MCing, Beatboxing, DJing, bboying, and graffiti) to speak to the experiences of disenfranchised youth across the world. Commercialization has created two kinds of Hip-Hop: one is focused on the community and connected to a long legacy and history of Black/Caribbean experience, and a second focused on individualism an...\n\n      more description for CLI-UG 1436 »\n\n      \n\n\n\nThere is no doubt that Hip-Hop is ubiquitous through radio and television commercials, music videos, films, magazines, billboards, and video games. However, the Hip-Hop we see today is not the same Hip-Hop that we saw when early pioneers formed a distinct sub-culture (encompassing MCing, Beatboxing, DJing, bboying, and graffiti) to speak to the experiences of disenfranchised youth across the world. Commercialization has created two kinds of Hip-Hop: one is focused on the community and connected to a long legacy and history of Black/Caribbean experience, and a second focused on individualism and celebrating instant gratification, funded by big corporations to sell brands and consumption as a lifestyle. What determining factors caused this evolution and what does it mean? This course tracks Hip-Hop’s history and its influences through participatory action research, media literacy, archiving, and service learning. Students will research, analyze, interpret, chronicle, and sample Hip-Hop by organizing and curating a Hip-Hop project. We will visit Hip-Hop archives, landmarks and organizations, and hear first-hand accounts from Hip-Hop pioneers and leaders. Books include: Yes, Yes Ya’ll by Jim Fricke and Charlie Ahearn, Born To Use Mics  by Michael Eric Dyson and Sohail Daulatzai, The Tanning of America by Steve Stoute, and The Big Payback by Dan Charnas.\n\n      less description for CLI-UG 1436 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1440",
            "course_name": "Public Art and Technology",
            "description": "CLI-UG 1440 Public Art and Technology",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1442",
            "course_name": "Public Spaces in Action",
            "description": "CLI-UG 1442 Public Spaces in Action",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1443",
            "course_name": "",
            "description": "CLI-UG 1443\n\n   Lyrics on Lockdown: Young Women in the Prison System\n\nRates of detention amongst girls in the US continue to increase even as overall rates of incarceration amongst youth have steadily declined in the last decade. Yet, because girls represent a proportionally smaller population within the juvenile justice system fewer resources are allocated to address the underlying causes of incarceration and recidivism amongst young women ages 12-19. This course investigates the causes and experiences of incarceration amongst girls and women, as well as helps students design and facilitate an arts and education program for incarcerated girls. What are the uniq...\n\n      more description for CLI-UG 1443 »\n\n      \n\n\n\nRates of detention amongst girls in the US continue to increase even as overall rates of incarceration amongst youth have steadily declined in the last decade. Yet, because girls represent a proportionally smaller population within the juvenile justice system fewer resources are allocated to address the underlying causes of incarceration and recidivism amongst young women ages 12-19. This course investigates the causes and experiences of incarceration amongst girls and women, as well as helps students design and facilitate an arts and education program for incarcerated girls. What are the unique concerns presented by incarcerated female populations? What must we understand about the policing of gender and sexuality in order to meet the needs of incarcerated girls and women? What role does trauma play in the experiences of girls remitted to the juvenile justice system? What is the role of the arts in empowering inmate populations? Exploring these and other questions enables students to better understand the role of the Prison Industrial Complex in defining and policing gender roles and sexual minorities. Readings include The Color of Violence: The Incite! Anthology by INCITE! Women of Color Against Violence; Global Lockdown: Race, Gender, and the Prison-Industrial Complex by Julia Sudbury; Queer Injustice by Andrea Ritchie, and Girls Like Us by Rachel Lloyd.\n\n      less description for CLI-UG 1443 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1444",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12318",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 601",
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Anderson, Piper"
                }
            ],
            "course_name": "",
            "description": "CLI-UG 1444\n\n   Lyrics On Lockdown\n\nThis course will focus on the uses of the visual and performing arts as tools for positive social change. Through hands-on collaboration with the East River Academy, students will create artistic and dialogical spaces for critically thinking about the crisis of incarceration in this country and how this crisis impacts the lives of youth and their communities. Speakers may include representatives from the Institute for Juvenile Justice & Alternatives, Voices Unbroken, and Fortune Society. Readings include writings by scholar/activists such as Augusto Boal, Paulo Freire, Michelle Alexander and A...\n\n      more description for CLI-UG 1444 »\n\n      \n\n\n\nThis course will focus on the uses of the visual and performing arts as tools for positive social change. Through hands-on collaboration with the East River Academy, students will create artistic and dialogical spaces for critically thinking about the crisis of incarceration in this country and how this crisis impacts the lives of youth and their communities. Speakers may include representatives from the Institute for Juvenile Justice & Alternatives, Voices Unbroken, and Fortune Society. Readings include writings by scholar/activists such as Augusto Boal, Paulo Freire, Michelle Alexander and Angela Davis. Students will create arts-in-education workshops, which they will facilitate with incarcerated youth at Rikers Island. Students do not need to be artists to participate in the course, however, creativity, community building, and collaboration will be an integral part of the curriculum. To participate in this course you must be available on Friday afternoons from 2:30-6pm for visits to Rikers in November-December. Students are also required to attend two Saturday workshop prep sessions in October from 10-5pm.\n\n      less description for CLI-UG 1444 «",
            "offering": true
        },
        {
            "course_id": "CLI-UG 1445",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12319",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "LSTC MACLB",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Read, Mark"
                }
            ],
            "course_name": "",
            "description": "CLI-UG 1445\n\n   Shifting Focus: Video Production and Community Activism\n\nThe moving image has long been used by grassroots political movements and community organizers to mobilize constituencies in order to effect social change. Today, video has become an essential tool for social and political actors working on a wide array of issues. In this hands-on class, students will examine the role of media in the construction of our social and political reality; learn the theory and history of video advocacy; develop basic camera skills; and reflect on lessons learned in the field. Outside of class students will break into groups and collaborate with local community organi...\n\n      more description for CLI-UG 1445 »\n\n      \n\n\n\nThe moving image has long been used by grassroots political movements and community organizers to mobilize constituencies in order to effect social change. Today, video has become an essential tool for social and political actors working on a wide array of issues. In this hands-on class, students will examine the role of media in the construction of our social and political reality; learn the theory and history of video advocacy; develop basic camera skills; and reflect on lessons learned in the field. Outside of class students will break into groups and collaborate with local community organizations in the conception and production of a short piece of “tactical video” that can be utilized by the organization in their work. Readings will include selections from Todd Gitlin, Thomas Harding, and Harvey Molotch.\n\n      less description for CLI-UG 1445 «",
            "offering": true
        },
        {
            "course_id": "CLI-UG 1446",
            "course_name": "Electronic Civil Disobedience",
            "description": "CLI-UG 1446 Electronic Civil Disobedience",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1447",
            "course_name": "",
            "description": "CLI-UG 1447\n\n   Urban Policy and Neighborhood Change\n\nTwo questions inspire this course. First, what determines urban policy in New York City? What are the political and economic forces shaping the priorities and policies of the City of New York? Second, how do NYC neighborhoods—especially poor and minority ones—influence public policy in a context where the dominant \"expert-knows-best\" model of city planning makes it harder for those community members, not already conversant in the language of public policy, to make their voices heard? Using specific NYC neighborhoods as case studies—the Lower East Side, East Harlem, and the South Bronx—our goal...\n\n      more description for CLI-UG 1447 »\n\n      \n\n\n\nTwo questions inspire this course. First, what determines urban policy in New York City? What are the political and economic forces shaping the priorities and policies of the City of New York? Second, how do NYC neighborhoods—especially poor and minority ones—influence public policy in a context where the dominant \"expert-knows-best\" model of city planning makes it harder for those community members, not already conversant in the language of public policy, to make their voices heard? Using specific NYC neighborhoods as case studies—the Lower East Side, East Harlem, and the South Bronx—our goal is to develop a nuanced account of how urban and economic development works at the local level, and to deepen our understanding of the opportunities and challenges confronting community organizations that work on policy advocacy issues. Readings include: Harvey Molotch's Urban Fortunes, Tom Angotti's New York for Sale, Arlene Dávila's Barrio Dreams, Evelyn González's The Bronx.\n\n      less description for CLI-UG 1447 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1448",
            "course_name": "Digital Activism",
            "description": "CLI-UG 1448 Digital Activism",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1449",
            "course_name": "Intro to Grassroots Organizing",
            "description": "CLI-UG 1449 Intro to Grassroots Organizing",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1450",
            "course_name": "Strategic Campaigning and Advocacy",
            "description": "CLI-UG 1450 Strategic Campaigning and Advocacy",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1451",
            "course_name": "Guerrilla Persuasion: Writing & Graphicdesign",
            "description": "CLI-UG 1451 Guerrilla Persuasion: Writing & Graphicdesign",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1452",
            "course_name": "Law and Community Activism",
            "description": "CLI-UG 1452 Law and Community Activism",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1453",
            "course_name": "",
            "description": "CLI-UG 1453\n\n   Gentrification and Its Discontents\n\nThis course takes a close look at the process of community restructuring known as \"gentrification\" - namely the displacement of poor residents and local stores by affluent and middle class households and businesses. Through social theory, literature, and walking tours, we will explore the intersection of global, local, and institutional mechanisms driving the gentrification process. More specifically, we will look at the ways in which gentrification in NYC, while triggered by macroeconomic forces, is in turn mediated by local 'growth machines' led by real estate coalitions - and community resi...\n\n      more description for CLI-UG 1453 »\n\n      \n\n\n\nThis course takes a close look at the process of community restructuring known as \"gentrification\" - namely the displacement of poor residents and local stores by affluent and middle class households and businesses. Through social theory, literature, and walking tours, we will explore the intersection of global, local, and institutional mechanisms driving the gentrification process. More specifically, we will look at the ways in which gentrification in NYC, while triggered by macroeconomic forces, is in turn mediated by local 'growth machines' led by real estate coalitions - and community resistance. And we will also explore at the geography of gentrification in the context of several NYC neighborhoods (i.e., the Lower East Side, Chinatown, and East Harlem).\n\n      less description for CLI-UG 1453 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1454",
            "course_name": "Urban Space and Resistance",
            "description": "CLI-UG 1454 Urban Space and Resistance",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1456",
            "course_name": "",
            "description": "CLI-UG 1456\n\n   Immigrant Rights\n\nIn the last twenty years immigrants from an ever-increasingly diverse set of countries continue to flood the United States to find work to support their families, as the federal government simultaneously strips these immigrants of their rights as workers and residents of our nation. This course will outline basic immigration patterns in the last century, fundamental changes in the law that have affected these immigrants, including the drastic changes implemented after September 11th, and the ways in which immigrant workers are organizing in the workplace and elsewhere to sustain rights they ha...\n\n      more description for CLI-UG 1456 »\n\n      \n\n\n\nIn the last twenty years immigrants from an ever-increasingly diverse set of countries continue to flood the United States to find work to support their families, as the federal government simultaneously strips these immigrants of their rights as workers and residents of our nation. This course will outline basic immigration patterns in the last century, fundamental changes in the law that have affected these immigrants, including the drastic changes implemented after September 11th, and the ways in which immigrant workers are organizing in the workplace and elsewhere to sustain rights they have and win even more. As field placements, students will be working with immigrant workers? centers that organize immigrant workers in different industries citywide.\n\n      less description for CLI-UG 1456 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1457",
            "course_name": "Artful Activism:Culture as a Tool for Soc Change",
            "description": "CLI-UG 1457 Artful Activism:Culture as a Tool for Soc Change",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1458",
            "course_name": "Street Performance in The Mediated Age",
            "description": "CLI-UG 1458 Street Performance in The Mediated Age",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1459",
            "course_name": "Earth Rights",
            "description": "CLI-UG 1459 Earth Rights",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1460",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12320",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-7",
                    "time": "Tue 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Ramdeholl, Dianne M"
                }
            ],
            "course_name": "",
            "description": "CLI-UG 1460\n\n   Literacy in Action\n\nThis course combines volunteer work in New York City adult literacy and English as a second language programs with an academic introduction to the philosophy, history, and current issues of adult literacy. An important emphasis of the class is to critically examine adult literacy through a social justice lens. Students will work as volunteer teachers of reading and writing oral English or mentors at such institutions as the University Settlement, International Rescue Committee, Turning Point, and Fortune Society. In class they will read about and discuss such key issues as adult literacy educa...\n\n      more description for CLI-UG 1460 »\n\n      \n\n\n\nThis course combines volunteer work in New York City adult literacy and English as a second language programs with an academic introduction to the philosophy, history, and current issues of adult literacy. An important emphasis of the class is to critically examine adult literacy through a social justice lens. Students will work as volunteer teachers of reading and writing oral English or mentors at such institutions as the University Settlement, International Rescue Committee, Turning Point, and Fortune Society. In class they will read about and discuss such key issues as adult literacy education policy and the impact on the field—including instruction, implications of being marginalized by educational systems, instructional approaches developed for adults and the steps that might be taken to build support for high-quality, adult basic-skills programs. Throughout the course, students will relate such issues to their own on-site experiences in class discussion and role-playing, and create a portfolio of writing that includes on-site observations, lesson plans, reflections, and a final analytical paper. Readings may include Making Meaning, Making Change (Auerbach); We Make the Road by Walking (Horton and Freire); Pedagogy of the Oppressed (Freire), as well as other articles and journals (Focus on Basics and The Change Agent).\n\n      less description for CLI-UG 1460 «",
            "offering": true
        },
        {
            "course_id": "CLI-UG 1464",
            "course_name": "",
            "description": "CLI-UG 1464\n\n   Shiffing Focus II: Video Prod & Comm. Activism\n\nIn Shifting Focus II, students will focus on the concrete tasks associated with video production and distribution, while at the same time investigating recent theoretical work relating to the impact of social networks on political organizing and how web 2.0 technologies alter the dynamics of video distribution. New tools and an ever changing technological environment call for a radical re-thinking of how video is, and can be, used within the context of community organizing, and yet the basic rules for how to make powerful, influential work remain mostly the same.  In this course students will ...\n\n      more description for CLI-UG 1464 »\n\n      \n\n\n\nIn Shifting Focus II, students will focus on the concrete tasks associated with video production and distribution, while at the same time investigating recent theoretical work relating to the impact of social networks on political organizing and how web 2.0 technologies alter the dynamics of video distribution. New tools and an ever changing technological environment call for a radical re-thinking of how video is, and can be, used within the context of community organizing, and yet the basic rules for how to make powerful, influential work remain mostly the same.  In this course students will hone their craft as young media makers, while at the same time become web 2.0 strategists on how to deploy the media they make.\n\n      less description for CLI-UG 1464 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1465",
            "course_name": "Organizing and Unions in New York City",
            "description": "CLI-UG 1465 Organizing and Unions in New York City",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1466",
            "course_name": "",
            "description": "CLI-UG 1466\n\n   Policy Community and The Self\n\nIntended to introduce policy, this course will include an internship at a policy and/or advocacy organization.  Community building, service integration and child welfare will be featured in readings, discussion, and internships.  Through examples such as ethnic-matching placements in foster care, zero-tolerance approaches to drug abuse, or public financing of political campaigns, students will come to understand how government, schools, gangs, religious institutions and families can, with varying degrees of explicitness and formality, all make policy.  Students will at the course conclusion be...\n\n      more description for CLI-UG 1466 »\n\n      \n\n\n\nIntended to introduce policy, this course will include an internship at a policy and/or advocacy organization.  Community building, service integration and child welfare will be featured in readings, discussion, and internships.  Through examples such as ethnic-matching placements in foster care, zero-tolerance approaches to drug abuse, or public financing of political campaigns, students will come to understand how government, schools, gangs, religious institutions and families can, with varying degrees of explicitness and formality, all make policy.  Students will at the course conclusion be able to: identify policies within their lives; argue all sides of a policy question; appreciate the importance of evidence; and distinguish implementation from formulation.  Readings will include Bowling Alone, by Robert Putnam, and The Lost Children of Wilder, by Nina Bernstein.  Students will be helped to connect meetings they attend and the policy concepts taught and discussed in class.  The goal is to leave no student unaware of the importance of policy in their own and their community?s life.  The course will focus on policies that are empowering.  Assignments will include an internship journal.\n\n      less description for CLI-UG 1466 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1467",
            "course_name": "Popular Education and Community Organizing",
            "description": "CLI-UG 1467 Popular Education and Community Organizing",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1468",
            "course_name": "School Reform, Public Policy & Human Rights",
            "description": "CLI-UG 1468 School Reform, Public Policy & Human Rights",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1469",
            "course_name": "",
            "description": "CLI-UG 1469\n\n   Public Policy in Action\n\nThis course looks at the intersection of public policy, participatory action research and community organizing. Through case-studies of ongoing grassroots campaigns in New York City, we will explore ways in which historically disenfranchised communities have used the tools of policy advocacy and research to create and sustain highly-effective campaigns and organizations. Specifically we will look at  some of the challenges confronting community organizations dealing with policy issues (such as how to deal with the tension between ?experts? and  neighborhood residents in defining and controllin...\n\n      more description for CLI-UG 1469 »\n\n      \n\n\n\nThis course looks at the intersection of public policy, participatory action research and community organizing. Through case-studies of ongoing grassroots campaigns in New York City, we will explore ways in which historically disenfranchised communities have used the tools of policy advocacy and research to create and sustain highly-effective campaigns and organizations. Specifically we will look at  some of the challenges confronting community organizations dealing with policy issues (such as how to deal with the tension between ?experts? and  neighborhood residents in defining and controlling campaign issues);  and what are some of the logistics behind designing community research (i.e., what goes into creating good survey instruments). Readings may include among others, Paolo Freire, Miles Horton, Patricia Maguire, Rinku Sen, Morten Levin, and Michelle Fine.   Note: This course entails an average of five hours of fieldwork per week in addition to assigned readings.\n\n      less description for CLI-UG 1469 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1470",
            "course_name": "Beyond The Village: Community Planning",
            "description": "CLI-UG 1470 Beyond The Village: Community Planning",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1471",
            "course_name": "Environmental Impact Study of NYU",
            "description": "CLI-UG 1471 Environmental Impact Study of NYU",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1472",
            "course_name": "The Concrete Jungle: Urban Environmentalism",
            "description": "CLI-UG 1472 The Concrete Jungle: Urban Environmentalism",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1473",
            "course_name": "The Global Neighborhoods of Lower Manhattan",
            "description": "CLI-UG 1473 The Global Neighborhoods of Lower Manhattan",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1475",
            "course_name": "Advanced Community Projects",
            "description": "CLI-UG 1475 Advanced Community Projects",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1476",
            "course_name": "",
            "description": "CLI-UG 1476\n\n   Language,Imagination, Community & Activism\n\nIn this course we explore the imaginative process at work in personal narrative, political essay and journalism, and how these genres in turn relate to advocacy and community building. We will work from the premise that creating social justice relies on community building, and that to build community we need to voice our own stories as well as listen to the stories of others. As we explore expression and collaboration we will critically examine definitions of identity, ideas of authentic voice, the relationship between the individual and collective imaginations, the way that power is leveraged...\n\n      more description for CLI-UG 1476 »\n\n      \n\n\n\nIn this course we explore the imaginative process at work in personal narrative, political essay and journalism, and how these genres in turn relate to advocacy and community building. We will work from the premise that creating social justice relies on community building, and that to build community we need to voice our own stories as well as listen to the stories of others. As we explore expression and collaboration we will critically examine definitions of identity, ideas of authentic voice, the relationship between the individual and collective imaginations, the way that power is leveraged in media and popular culture, and the possibilities of democratizing information in the twenty-first century. During the semester, there will be guest speakers, field trips, and group projects. Readings include authors who traverse genres, such as Martin Espada, June Jordan, Eduardo Galeano, Arundhati Roy, Edwidge Danticat, Joy Harjo, Suheir Hammad, Sinan Antoon, Mahmoud Darwish, James Baldwin, Alice Walker, Toni Morrison.\n\n      less description for CLI-UG 1476 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1477",
            "course_name": "",
            "description": "CLI-UG 1477\n\n   Latino Cartographies\n\nThis course looks at the ways in which Latino communities are transforming urban space and politics in NYC. Through films, social science theory, and fieldwork in NYC neighborhoods such as Washington Heights, East Harlem and the South Bronx?and in partnership with grassroots organizations?we will explore and contextualize the many challenges and opportunities facing the Latino population. Specifically, we will look at the ways in which economics, history, race, culture, gentrification, and public policy congeal to create cartographies of community resistance and Latino identity. Because of the...\n\n      more description for CLI-UG 1477 »\n\n      \n\n\n\nThis course looks at the ways in which Latino communities are transforming urban space and politics in NYC. Through films, social science theory, and fieldwork in NYC neighborhoods such as Washington Heights, East Harlem and the South Bronx?and in partnership with grassroots organizations?we will explore and contextualize the many challenges and opportunities facing the Latino population. Specifically, we will look at the ways in which economics, history, race, culture, gentrification, and public policy congeal to create cartographies of community resistance and Latino identity. Because of the fieldwork component of this class, fluency in Spanish is strongly recommended, even though it is not required.  Readings may include among others, Arlene D?vila?s Barrio Dreams, Michael Jones-Correa?s Between Two Nations, Robert Smith?s Mexican New York, Kim Moody?s From Welfare State to Real Estate. Please note: this course entails an average of five hours of fieldwork per week in addition to assigned readings.\n\n      less description for CLI-UG 1477 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1478",
            "course_name": "Theory and Practice of Women'S Activism",
            "description": "CLI-UG 1478 Theory and Practice of Women'S Activism",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1479",
            "course_name": "",
            "description": "CLI-UG 1479\n\n   Social Enterprising: Redefining Social Change\n\nSocial entrepreneurs around the world are redefining the way we tackle social problems using effective business acumen and human capital. For these renegades, it is not business as usual, they are breaking out of the old corporate model and are developing new organizational patterns and markets. This course teaches the fundamentals of turning a powerful problem solving idea into a responsible enterprise with a blended social and financial value. From conducting research, community organizing, developing a business plan, crafting a viral marketing and fund raising campaign, and measuring impact...\n\n      more description for CLI-UG 1479 »\n\n      \n\n\n\nSocial entrepreneurs around the world are redefining the way we tackle social problems using effective business acumen and human capital. For these renegades, it is not business as usual, they are breaking out of the old corporate model and are developing new organizational patterns and markets. This course teaches the fundamentals of turning a powerful problem solving idea into a responsible enterprise with a blended social and financial value. From conducting research, community organizing, developing a business plan, crafting a viral marketing and fund raising campaign, and measuring impact, advance students will learn about the essential tools, practices and challenges to develop the capacity and sustainability for a social enterprise. Students are expected to develop and present a project proposal. Throughout the course scholars and leaders in the field are invited to share best practices and provide feedback to student projects. Readings include: Beyond Resistance! Youth Activism and Community Change: New Democratic Possibilities for Practice and Policy for America's Youth by Shawn Ginwright, Pedro Noguera, Julio Cammarota; How to Change the World: Social Entrepreneurs and the Power of New Ideas by David Bornstein; Selling Social Change (Without Selling Out): Earned Income Strategies for Nonprofits by Andy Robinson; Unmarketable: Brandilism, Copyfighting, Mocketing, and the Erosion of Integrity by Anne Elizabeth Moore; and, What Would Google Do? by Jeff Jarvis.\n\n      less description for CLI-UG 1479 «",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1480",
            "course_name": "The Public Conversation on the Urban Environment",
            "description": "CLI-UG 1480 The Public Conversation on the Urban Environment",
            "offering": false
        },
        {
            "course_id": "CLI-UG 1601",
            "course_name": "Gallatin in New Orleans: Community, Empowerment",
            "description": "CLI-UG 1601 Gallatin in New Orleans: Community, Empowerment",
            "offering": false
        }
    ]
}