{
    "major_id": "CONM1-GC",
    "file": "./2015-2016/Construction_Management_MA-GC_(CONM1-GC).html",
    "courses": [
        {
            "course_id": "CONM1-GC 1",
            "course_name": "Intro to Accounting",
            "description": "CONM1-GC    1 Intro to Accounting",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 2",
            "course_name": "Introduction to Law",
            "description": "CONM1-GC    2 Introduction to Law",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 1005",
            "course_name": "Principls of Real Estate Accounting & Taxation",
            "description": "CONM1-GC 1005 Principls of Real Estate Accounting & Taxation \nThis course provides students with an understanding of the uses of accounting in the real estate and construction industries. It reviews concepts, principles, rules, regulations, and reporting requirements and the accounting and tax procedures needed to understand financial statements related to management, operations and investments, including income tax analysis. As such it provides a first introduction to the Time Value of Money concept and to Appraisal.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 1015",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2609",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "2610",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Construction Cost Estimating",
            "description": "CONM1-GC 1015 Construction Cost Estimating \nThis course examines various systematic approaches to cost estimating for the purposes of developing estimates and budgets to be used for competitive bidding, negotiation, cost tracking and analysis. Topics include: quantity surveys; detail take-offs; equipment and labor costs; equipment utility; subcontracting; overhead; insurance and surety bonds; contract document analysis; risk identification and management; changes; value engineering; profit and evaluation of intangibles; and bidding strategies. Prerequisite: the ability to read construction drawings and knowledge of construction math.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1025",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2611",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2612",
                    "section": "002",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3050",
                    "section": "003",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CONM1-GC 1025\n\n   Construction Methods & Technology\n\nThis course provides an understanding of construction methods, building systems, material and equipment selection.  It provides the Construction Manager and Developer with the knowledge required to effectively understand the various components of a building. This will include: the mechanical, electrical, plumbing and sprinkler systems; the exterior and roofs of buildings; the structural make-up of a project (concrete, steel, wood and stone); types of foundations that could be used for a project; materials for interior construction work.   Some discussion will be held in regard to cost differen...\n\n      more description for CONM1-GC 1025 »\n\n      \n\n\n\nThis course provides an understanding of construction methods, building systems, material and equipment selection.  It provides the Construction Manager and Developer with the knowledge required to effectively understand the various components of a building. This will include: the mechanical, electrical, plumbing and sprinkler systems; the exterior and roofs of buildings; the structural make-up of a project (concrete, steel, wood and stone); types of foundations that could be used for a project; materials for interior construction work.   Some discussion will be held in regard to cost differences of materials and systems used and the efficiency of potential systems being considered.\n\n      less description for CONM1-GC 1025 «",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1035",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2613",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3066",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CONM1-GC 1035\n\n   Construction Financial & Cost Control\n\nThe course covers financial accounting and cost control concepts with the integration and management of both the construction company and project level revenue and expenses. Reviews the management of Risk and how to avoid mistakes. Reviews the procurement of subcontractors, material, and equipment and labor portions of the construction projects.\nThe use of cost control to monitor (1) the owner’s budget (2)  General Conditions expenses (3)  profit margins (4) Change Orders and their impact on the project budget. Shows how to submit requisitions and the requirements for having adequate waiver o...\n\n      more description for CONM1-GC 1035 »\n\n      \n\n\n\nThe course covers financial accounting and cost control concepts with the integration and management of both the construction company and project level revenue and expenses. Reviews the management of Risk and how to avoid mistakes. Reviews the procurement of subcontractors, material, and equipment and labor portions of the construction projects.\nThe use of cost control to monitor (1) the owner’s budget (2)  General Conditions expenses (3)  profit margins (4) Change Orders and their impact on the project budget. Shows how to submit requisitions and the requirements for having adequate waiver of liens and proper insurance.  Reviews the consequences of tax law and its application to the construction industry and the implication of the type of corporation that is established.\n\n      less description for CONM1-GC 1035 «",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1040",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2614",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Project Management",
            "description": "CONM1-GC 1040 Project Management \nThis course presents the theory and practice of project management as a distinct discipline with applications in time, cost, and performance management.  Managerial, organizational, behavioral and cost benefit aspects of project management are covered, as well as various applied models for organizing, executing, and monitoring a project. Models include the Critical Path Method (CPM), Precedence Diagramming Method (PDM), Program Evaluation and Review Technique (PERT), and Gantt charts.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1050",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2615",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2945",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Legal Principles & Practices",
            "description": "CONM1-GC 1050 Legal Principles & Practices \nThis course teaches students the principles and instruments of real property and construction law, as well as when and how to utilize the legal system.  It reviews the contracts and issues that arise in the course of construction, development, ownership and operations and examines the roles, rights, obligations and liabilities of the major parties involved in transactions including the owner, architect, engineer, contractor and allied professionals.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1060",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2616",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2617",
                    "section": "002",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2618",
                    "section": "003",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2619",
                    "section": "004",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2620",
                    "section": "005",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2621",
                    "section": "006",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "The Development Process",
            "description": "CONM1-GC 1060 The Development Process \nThis course provides a step by step analysis of the phases utilized in the real estate development process including conceptualization, site acquisition, zoning and permits, planning and design, the construction phase, financing, and financial reporting and evaluation.  The key components of construction contracts and subcontracts are covered including lump sum, unit price, and cost-plus delivery methods. Leadership, management and control of the development team are featured issues.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1065",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2622",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Construction Safety Management",
            "description": "CONM1-GC 1065 Construction Safety Management \nThis course examines the management of worker and public safety for construction projects. It provides a comprehensive review of industry construction safety standards and public safety laws; OSHA regulations; legal and economic issues of safety; risk reduction; hazard recognition; accident investigation and analysis; and the development and management of worker safety programs.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1070",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2623",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CONM1-GC 1070\n\n   Operating & Managing a Construction Organizatn\n\nThis course details the skills, knowledge, and principles required to effectively manage a construction organization in today's highly competitive and changing environment.  It emphasizes strategies to control the risks, variables and unforseen conditions inherent in the business of construction.  Topics include: legal and organizational structure; administrative systems; financial management; sales and marketing; request for proposals and qualification (RFPs and RFQs); project evaluation and risk analysis; collective bargaining; human resource administration; insurance requirements; bonding a...\n\n      more description for CONM1-GC 1070 »\n\n      \n\n\n\nThis course details the skills, knowledge, and principles required to effectively manage a construction organization in today's highly competitive and changing environment.  It emphasizes strategies to control the risks, variables and unforseen conditions inherent in the business of construction.  Topics include: legal and organizational structure; administrative systems; financial management; sales and marketing; request for proposals and qualification (RFPs and RFQs); project evaluation and risk analysis; collective bargaining; human resource administration; insurance requirements; bonding and banking relationships; networking and trade associations; joint ventures; and measurements of success.\n\n      less description for CONM1-GC 1070 «",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 1075",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2624",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Construction Scheduling",
            "description": "CONM1-GC 1075 Construction Scheduling \nThis course provides advanced techniques in schedule development and implementation for effective project management during the programming or construction phase of a project.  It examines monitoring, updating, and controlling the project schedule; analyzing time-related change orders and delays; claims control; network and non-network models; resource leveling and algorithms, project diagnostics, optimum labor and equipment movement, relational databases, and dispute-avoidance considerations. Students will prepare a construction project schedule using computer software applications.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 2000",
            "course_name": "Business Development & Management",
            "description": "CONM1-GC 2000 Business Development & Management \nThis course exposes students to a higher level of managerial decision-making than previously encountered focussing on the core issues of securing new business and ensuring project and company profitability. Topics include creating and implementing  marketing and business development strategies; customer relations management; developing public relations strategies; dealing with public and civic affairs and public officials; managing contractual arrangements with outside consulting and governing agencies; managerial leadership; strategic planning; corporate finance.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 2010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2789",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Negotiation & Dispute Resolution",
            "description": "CONM1-GC 2010 Negotiation & Dispute Resolution \nThis course presents an examination of major negotiation theories, strategies and tactics as applied to real estate and construction transactions and disputes. Proposed and completed transactions are analyzed before or after each negotiation process as a benchmark for measuring the effectiveness of negotiators. Alternative dispute resolution techniques examined and practiced in the course include mediation, arbitration, and litigation settlement techniques.  Students also review the defense of claims, liens and law suits. The role of ethics in professional practice is addressed.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 2099",
            "course_name": "Applied Project in Finance & Development",
            "description": "CONM1-GC 2099 Applied Project in Finance & Development \nIn this project-oriented capstone course, students develop pro forma and proposal preparations for real estate projects and bids.  They also review the importance of ensuring quality throughout all phases of the project.  Topics include: construction project evaluation and financing; financial analysis and forecasting for planning purposes; presentation for bonding and banking relationships; financial management;  project feasibility - risk assessment; life-cycle analysis;  broker negotiations and the public/private funding environment.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 2120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2625",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CONM1-GC 2120\n\n   The Construction Process\n\nIn this course, Construction Managers learn the skills to coordinate, sequence, monitor, supervise work, and to control schedules and costs on projects. The students are given the tools: to review and analyze risk; to create logistics plans; manage, Request for Information (RFI), shop drawings, and other critical documents; to work with subcontractors and how they are selected for a project ( including bidding and the leveling process); for review of drawings and to make sure a project can be constructed based on the available information;  for the implementation of test and quality control pr...\n\n      more description for CONM1-GC 2120 »\n\n      \n\n\n\nIn this course, Construction Managers learn the skills to coordinate, sequence, monitor, supervise work, and to control schedules and costs on projects. The students are given the tools: to review and analyze risk; to create logistics plans; manage, Request for Information (RFI), shop drawings, and other critical documents; to work with subcontractors and how they are selected for a project ( including bidding and the leveling process); for review of drawings and to make sure a project can be constructed based on the available information;  for the implementation of test and quality control procedures; to review new technologies that are being used in the construction industry; to evaluate sustainability in construction.\n\nStudents learn about the attributes it takes to be good leaders and how ethics plays a part in the total construction process. They are also taught how contracts are used and how to mitigate claims.\n\n      less description for CONM1-GC 2120 «",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 2130",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17284",
                    "section": "001",
                    "period": "10/21/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Labor Relations in Construction",
            "description": "CONM1-GC 2130 Labor Relations in Construction \nLabor relations can be the most variable and unpredictable component of a construction project and can require the largest appropriation of time and diligence from the management team. This course covers the history of labor and management relations, union and open shop organization; labor laws, legislation, regulations, and agreements; economic power, jurisdictional disputes, grievance procedures, and negotiating techniques.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 2199",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2626",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CONM1-GC 2199\n\n   App Proj:Planng, Control & Completion Strategies\n\nThis project-oriented capstone course teaches the project executive the fundamental principles of risk and decision analysis applying such models as Baysian Theory, decision theory, utility theory, and modeling management's value system and simulation.  Students are challenged to understand construction as a process and to develop management skills based on systematic, logical analysis of available resources and imposed constraints. Students apply skills and knowledge to formulate a theoretical construction company and estimate, evaluate, plan and administer an actual construction project. The...\n\n      more description for CONM1-GC 2199 »\n\n      \n\n\n\nThis project-oriented capstone course teaches the project executive the fundamental principles of risk and decision analysis applying such models as Baysian Theory, decision theory, utility theory, and modeling management's value system and simulation.  Students are challenged to understand construction as a process and to develop management skills based on systematic, logical analysis of available resources and imposed constraints. Students apply skills and knowledge to formulate a theoretical construction company and estimate, evaluate, plan and administer an actual construction project. They also review the importance of ensuring quality throughout all phases of the project.\n\n      less description for CONM1-GC 2199 «",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 2200",
            "course_name": "Management & Control of Public Works Project",
            "description": "CONM1-GC 2200 Management & Control of Public Works Project",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 2210",
            "course_name": "Meth/Mat/Equip for Heavy Construction",
            "description": "CONM1-GC 2210 Meth/Mat/Equip for Heavy Construction \nThis course covers the methods, materials and equipment used in heavy construction.  It provides project executives with the technical expertise needed to effectively manage a major infrastructure project.  Topics include: street and highway, bridge, tunnel and airport design and construction; economics and application of construction equipment; public transportation systems; water and drainage issues; waste management; and communications systems.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 2220",
            "course_name": "Cost Estimating for Infrastructure Develop",
            "description": "CONM1-GC 2220 Cost Estimating for Infrastructure Develop \nThis course presents advanced construction cost estimating  theory and practice for the construction of highways, bridges, tunnels, airports and other public engineering projects.  Topics include: modeling and statistical analysis; pricing and markup strategies; historic cost data development; life cycle costing, and cost integration with computer-aided design.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 2230",
            "course_name": "Managing Municipal Contracts & Claims",
            "description": "CONM1-GC 2230 Managing Municipal Contracts & Claims",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 2299",
            "course_name": "Public Private Finance & Development Capstone",
            "description": "CONM1-GC 2299 Public Private Finance & Development Capstone \nIn this project-oriented capstone course, students examine the selection, funding and development process of public infrastructure and economic development projects.  They examine the complex political, financial, social, and environmental factors that emerge during the development of long-range public projects and review the importance of ensuring quality throughout all phases of the project. Topics include: the roles of local, state, regional, and federal agencies as well as private interest groups.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 3024",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17396",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CONM1-GC 3024\n\n   Real Estate Development & Construction Finance\n\nThis course will provide the student with important knowledge and understanding of the financial markets for real estate development and construction activities and the analytical methods used by real estate developers, lenders and investors in assessing these projects.  The goal is for students to further their understanding of, and facility with, the various tools used in evaluating the financial feasibility of real estate development projects; to apply these analytical capabilities in making critical comparisons of various real estate development proposals; and to utilize these tools in for...\n\n      more description for CONM1-GC 3024 »\n\n      \n\n\n\nThis course will provide the student with important knowledge and understanding of the financial markets for real estate development and construction activities and the analytical methods used by real estate developers, lenders and investors in assessing these projects.  The goal is for students to further their understanding of, and facility with, the various tools used in evaluating the financial feasibility of real estate development projects; to apply these analytical capabilities in making critical comparisons of various real estate development proposals; and to utilize these tools in formulating the capital structure of debt and equity for development and construction projects.\n\n      less description for CONM1-GC 3024 «",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 3100",
            "course_name": "Managing Municipal Contracts & Claims",
            "description": "CONM1-GC 3100 Managing Municipal Contracts & Claims \nThis course examines management techniques for planning, coordinating, controlling, and evaluating complex civil engineering projects. It prepares the project executive to handle the complexities and to direct major public and private infrastructure development projects. Topics include: specialized trades, activities, dealing with municipalities. Environmental impact analysis.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 3105",
            "course_name": "Mgmt & Control of Public Wrks Infrastrctr Projcts",
            "description": "CONM1-GC 3105 Mgmt & Control of Public Wrks Infrastrctr Projcts \nExamines management techniques for planning, coordinating. Controlling and evaluating complex infrastructure projects. This will include discussion of PPP (Public Private Partnerships) and complex design build projects. Review of special contract provisions that have to be evaluated when working with government agencies. The review of the complexities when dealing with much organization and the impact on payments, change orders and communications. Special laws will be reviewed such as the Wicks Law, bidding and bonding requirements.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 3200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17282",
                    "section": "001",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Technology for the Construction Industry",
            "description": "CONM1-GC 3200 Technology for the Construction Industry \nThe course will instruct the students on how to use the latest construction industry technological tools so that they can be more effective when performing their designated tasks as a Project Manager, including: review of the various programs and applications that are currently used in the construction industry; using information \\ and uses the techniques learned to develop a small building project.",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 3222",
            "course_name": "Planning & Design Issues Development",
            "description": "CONM1-GC 3222 Planning & Design Issues Development \nThis course addresses planning at the regional, community, neighborhood and site as practiced by both the public and private sectors.  It examines the public master planning process as well as the project site planning and trends in planning and regulation such as smart growth and sustainability.  In the design area, the course addresses building design and design theory for various product types as well as urban design.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 3240",
            "course_name": "Land Use & Environmental Regulation",
            "description": "CONM1-GC 3240 Land Use & Environmental Regulation \nThis course addresses in detail the full range of federal, state and local governmental regulations that a developer may have to deal with relating to issues such as water and  air quality as well as hazardous materials.  It also covers regional land use regulatory programs such as those found in select states, and local subdivision, zoning and special purpose ordinances.  Emphasis would be on identifying what measures apply to a given project, formulating a strategy for addressing each, and understanding the reasons for their adoption.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 3250",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2627",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CONM1-GC 3250\n\n   Green Building & Sustainable Development\n\nFocusing on sustainability for building development and construction process, this course will cover the history, financial, regulatory and technical aspects involved with ecologically friendly construction, materials, technology and the art of recycling materials. Using the process to acquire LEEDS certification rating as the backbone for the course structure, students will examine the entire construction process and the life cycle costs and benefits involved in securing various rating levels. The course will also review the latest state energy code requirements and ASHRAE specifications as t...\n\n      more description for CONM1-GC 3250 »\n\n      \n\n\n\nFocusing on sustainability for building development and construction process, this course will cover the history, financial, regulatory and technical aspects involved with ecologically friendly construction, materials, technology and the art of recycling materials. Using the process to acquire LEEDS certification rating as the backbone for the course structure, students will examine the entire construction process and the life cycle costs and benefits involved in securing various rating levels. The course will also review the latest state energy code requirements and ASHRAE specifications as they relate to good and economical building designs.\n\n      less description for CONM1-GC 3250 «",
            "offering": true
        },
        {
            "course_id": "CONM1-GC 3900",
            "course_name": "Independent Study",
            "description": "CONM1-GC 3900 Independent Study \nIndividual coursework with related topics in Construction Management.  Approval by academic department.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 3905",
            "course_name": "Independent Study Capstone",
            "description": "CONM1-GC 3905 Independent Study Capstone \nIndividual coursework with related topics in Construction Management.  Approval by academic department.",
            "offering": false
        },
        {
            "course_id": "CONM1-GC 3911",
            "course_name": "Professional Internship",
            "description": "CONM1-GC 3911 Professional Internship \nProfessional practice under supervision within public agency or private firm.  Required of those with no construction field experience.",
            "offering": false
        }
    ]
}