{
    "major_id": "COREA-AD",
    "file": "./2015-2016/Core:_Art,_Technology_&_Invention(COREA-AD).html",
    "courses": [
        {
            "course_id": "COREA-AD 1",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17883",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "COMP_RES 021"
                }
            ],
            "course_name": "",
            "description": "COREA-AD    1\n\n   The Human Voice\n\nThis course explores the complexity, strangeness, socio-historical resonance, and expressive power of the human voice, as well as a number of the factors\nthat condition and delimit that power. We begin by discussing the voice’s relationship to the body (both in terms of anatomy and contemporary discourse\non “embodiment”) and to a number of technologies, from amplification to autotune. In the second half of the course, we focus in on the salience of voice\nwithin the experimental music scene in New York. Perhaps most importantly, we treat our class as an experimental vocal collective, composing ...\n\n      more description for COREA-AD    1 »\n\n      \n\n\n\nThis course explores the complexity, strangeness, socio-historical resonance, and expressive power of the human voice, as well as a number of the factors\nthat condition and delimit that power. We begin by discussing the voice’s relationship to the body (both in terms of anatomy and contemporary discourse\non “embodiment”) and to a number of technologies, from amplification to autotune. In the second half of the course, we focus in on the salience of voice\nwithin the experimental music scene in New York. Perhaps most importantly, we treat our class as an experimental vocal collective, composing and performing together throughout the term. No prior musical experience is necessary, but a willingness to make vocal sounds in public is required.\n\n      less description for COREA-AD    1 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 2",
            "course_name": "J",
            "description": "COREA-AD    2J\n\n   Idea of the Portrait\n\nThis course explores the ways in which the portrait has been used as a vehicle for artistic expression, for the construction of social identity, for self examination,\nand for the representation of cultural difference. It examines many kinds of portraits and self-portraits in painting and photography from different times and cultures and encourages engagement with a range of major issues that include the nature of personhood, of private and public identities, and of art itself. The course draws upon the rich resources of London’s museums and galleries, especially the National Gallery, the Natio...\n\n      more description for COREA-AD    2J »\n\n      \n\n\n\nThis course explores the ways in which the portrait has been used as a vehicle for artistic expression, for the construction of social identity, for self examination,\nand for the representation of cultural difference. It examines many kinds of portraits and self-portraits in painting and photography from different times and cultures and encourages engagement with a range of major issues that include the nature of personhood, of private and public identities, and of art itself. The course draws upon the rich resources of London’s museums and galleries, especially the National Gallery, the National Portrait Gallery, the Victoria & Albert Museum, the British Museum, and the Queen’s Collection.\n\n      less description for COREA-AD    2J «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 3",
            "course_name": "",
            "description": "COREA-AD    3\n\n   Instruments of World Cultures\n\nMusical instruments have been created by humans for at least 35,000 years. How do diverse musical cultures view the significance of the sounds and playing techniques of musical instruments? From instrumental story-telling in Siberia, Central Asian shaman-bards, dervish flutes, folk, Gypsy and classical fiddling, dulcimers, psalteries and keyboards to drumming in several parts of the world, the course examines why musical cultures need instruments; how these instruments interact with or take the place of vocal music; where they are connected to dance and where they have evolved far from dance; ...\n\n      more description for COREA-AD    3 »\n\n      \n\n\n\nMusical instruments have been created by humans for at least 35,000 years. How do diverse musical cultures view the significance of the sounds and playing techniques of musical instruments? From instrumental story-telling in Siberia, Central Asian shaman-bards, dervish flutes, folk, Gypsy and classical fiddling, dulcimers, psalteries and keyboards to drumming in several parts of the world, the course examines why musical cultures need instruments; how these instruments interact with or take the place of vocal music; where they are connected to dance and where they have evolved far from dance; how diverse cultures attribute positive or negative moral values to different instruments and their players; and how a single musical culture may feel the need to exchange, develop or exclude particular musical instruments over time.\n\n      less description for COREA-AD    3 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 4",
            "course_name": "J",
            "description": "COREA-AD    4J\n\n   Gardens of Eden\n\nThe Garden of Eden haunts the history of the peoples of the Book—Jews, Christians, Muslims— as primal site of creation, bounty, betrayal, and loss,\nas spur to repentance and redemption, as preview of heaven and model of earthly Utopia. The exile of Adam and Eve from the garden that God planted for\nthe first man and filled with all the Earth’s creatures and plants set their descendants on an infinite quest to find, describe, and recreate it. The course studies the efforts by people of the Abrahamic religions to specify the site, form, and meaning of the first Garden, in theology, literature, vi...\n\n      more description for COREA-AD    4J »\n\n      \n\n\n\nThe Garden of Eden haunts the history of the peoples of the Book—Jews, Christians, Muslims— as primal site of creation, bounty, betrayal, and loss,\nas spur to repentance and redemption, as preview of heaven and model of earthly Utopia. The exile of Adam and Eve from the garden that God planted for\nthe first man and filled with all the Earth’s creatures and plants set their descendants on an infinite quest to find, describe, and recreate it. The course studies the efforts by people of the Abrahamic religions to specify the site, form, and meaning of the first Garden, in theology, literature, visual art, film, and garden design. It seeks convergences and differences among these interpretations across millennia and media, and ask whether the Garden of\nEden continues to hold productive meanings today. All students participate in a garden design project. This course includes field trips to gardens in Abu\nDhabi and abroad.\n\n      less description for COREA-AD    4J «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 6",
            "course_name": "",
            "description": "COREA-AD    6\n\n   Photography and Narrative\n\nThis course explores photography’s relationship to language and narrative by examining photography’s rich interactions with literature and film. How do images complement, replace, challenge, or exceed language in narrative works? Can images create alternative forms of narrative? What kind of narratives do photographs generate in fiction? What is the relationship of photography\nand memory in works of autobiography or of photography and witnessing in social documentary? In what form are such dialogues present in films? We look at a variety of works from around the world which are entirely or alm...\n\n      more description for COREA-AD    6 »\n\n      \n\n\n\nThis course explores photography’s relationship to language and narrative by examining photography’s rich interactions with literature and film. How do images complement, replace, challenge, or exceed language in narrative works? Can images create alternative forms of narrative? What kind of narratives do photographs generate in fiction? What is the relationship of photography\nand memory in works of autobiography or of photography and witnessing in social documentary? In what form are such dialogues present in films? We look at a variety of works from around the world which are entirely or almost entirely visual; works in which images and text are combined in creative partnership; and works which are about photographs but in which no images are actually reproduced.\n\n      less description for COREA-AD    6 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 9",
            "course_name": "W",
            "description": "COREA-AD    9W\n\n   Reinventions of Love\n\nThis course explores how the mythology, poetics, imagery, and emotion associated with romantic love have varied dramatically over time and in\ndifferent cultures. Spanning several millennia and many continents, our material challenges us to think about gender, family, biology, and faith as manifestations of an attempt to reconcile human needs and desires. We work with ancient\ntexts like the Ramayana, the Upanishads, and the Song of Songs; the poetry of Kalidasa, Rumi, and Neruda; plays by Zeami, Euripides, Shakespeare,\nLorca, Tennessee Williams, and Sarah Kane; the music of PJ Harvey, Antony & ...\n\n      more description for COREA-AD    9W »\n\n      \n\n\n\nThis course explores how the mythology, poetics, imagery, and emotion associated with romantic love have varied dramatically over time and in\ndifferent cultures. Spanning several millennia and many continents, our material challenges us to think about gender, family, biology, and faith as manifestations of an attempt to reconcile human needs and desires. We work with ancient\ntexts like the Ramayana, the Upanishads, and the Song of Songs; the poetry of Kalidasa, Rumi, and Neruda; plays by Zeami, Euripides, Shakespeare,\nLorca, Tennessee Williams, and Sarah Kane; the music of PJ Harvey, Antony & The Johnsons, and Thom Yorke; the photography of Cindy Sherman;\nandthe films of David Lynch. Students move towards creating their own inventions, employing creative writing, physical improvisations, ensemble\nperformance, and photography.\n\n      less description for COREA-AD    9W «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 10",
            "course_name": "",
            "description": "COREA-AD   10\n\n   Scapegoat\n\nThe scapegoat, however unwillingly, has played a role in human culture since the earliest times. This course examines the phenomena of scapegoating\nfrom both a historical and psychological perspective, and examines its treatment in films, literature, music, and new technology. Tracing the origins of scapegoating as a tribal rite and as one of the defining aspects of Greek tragedy, this course ultimately poses the question—what is it, in the human psyche, that causes us to demonize and dehumanize the “other,” and demand, in the most\nextreme cases, witch trials throughout the centuries, mob lync...\n\n      more description for COREA-AD   10 »\n\n      \n\n\n\nThe scapegoat, however unwillingly, has played a role in human culture since the earliest times. This course examines the phenomena of scapegoating\nfrom both a historical and psychological perspective, and examines its treatment in films, literature, music, and new technology. Tracing the origins of scapegoating as a tribal rite and as one of the defining aspects of Greek tragedy, this course ultimately poses the question—what is it, in the human psyche, that causes us to demonize and dehumanize the “other,” and demand, in the most\nextreme cases, witch trials throughout the centuries, mob lynchings, the Holocaust, and the more recent genocide in Rwanda. This course also touches on the technological forms of scapegoating such as cyber-bullying and examines how the Internet itself is used as a scapegoating device.\n\n      less description for COREA-AD   10 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 12",
            "course_name": "Catastrophe",
            "description": "COREA-AD   12 Catastrophe \nHow does the idea of catastrophe shape artistic studies in the 21st-century? This interdisciplinary course explores catastrophe through a variety of disciplinary thematics. Students use films and literary texts to explore a range of real or fictional disasters. Can catastrophe serve as a lens to understand notions such as capitalism, globalization, network theory, and ecology?",
            "offering": false
        },
        {
            "course_id": "COREA-AD 13",
            "course_name": "W Maps",
            "description": "COREA-AD   13W Maps \nWhat are maps, and what do they tell us? From prehistoric cave paintings to Mercator projection maps to contemporary mobile apps, maps combine the innovation and rigor of art and science. Maps interpret space in and over time. This course examines maps from the ancient and modern worlds, alongside reinterpretations of mapping in paintings, films, video games, and new media, to understand ways that maps produce knowledge visually.",
            "offering": false
        },
        {
            "course_id": "COREA-AD 16",
            "course_name": "Men and Machines",
            "description": "COREA-AD   16 Men and Machines \nThe course explores how technology has influenced the arts and investigates the use of technology by artists over the ages.  “Media arts” and other concepts such as “digital arts” are discussed as modern manifestations of the merging of technology with arts and media.  A broad historical, cultural and technological understanding of main achievements of use of media in relation to arts is provided.  New technologies and their use and influence on media and arts are surveyed.",
            "offering": false
        },
        {
            "course_id": "COREA-AD 17",
            "course_name": "J",
            "description": "COREA-AD   17J\n\n   Nature of Code\n\nCan we capture the unpredictable evolutionary and emergent properties of nature in software? Can understanding the mathematical principles behind our physical world world help us to create digital worlds? This class focuses on\nthe programming strategies and techniques behind computer simulations of natural systems. We explore topics ranging from basic mathematics and physics concepts to more advanced simulations of complex systems. Subjects covered include forces, trigonometry, fractals, cellular automata, self-organization, and genetic algorithms. No computer programming experience is require...\n\n      more description for COREA-AD   17J »\n\n      \n\n\n\nCan we capture the unpredictable evolutionary and emergent properties of nature in software? Can understanding the mathematical principles behind our physical world world help us to create digital worlds? This class focuses on\nthe programming strategies and techniques behind computer simulations of natural systems. We explore topics ranging from basic mathematics and physics concepts to more advanced simulations of complex systems. Subjects covered include forces, trigonometry, fractals, cellular automata, self-organization, and genetic algorithms. No computer programming experience is required; the course starts with the basics of code using the Processing environment.\n\n      less description for COREA-AD   17J «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 18",
            "course_name": "Ritual and Play",
            "description": "COREA-AD   18 Ritual and Play \nUnderlying performances of all kinds—theatre, dance, music, the performances of everyday life, sports, and popular entertainments—are ritual and play. These must be understood from multiple perspectives. In the course, we investigate roots of human ritual and play in animal behavior; human religious and social rituals; and children and adults at play. Examples include the Taziyeh of Shi’a Islam, the Ramlila of Hinduism, the Olympic Games, Noh Drama of Japan, American baseball, “deep” and “dark” play.",
            "offering": false
        },
        {
            "course_id": "COREA-AD 19",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20483",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 001",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Protzel, Craig"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   19\n\n   Communication and Technology\n\nFrom cave paintings to live video streams on smartwatches, this course will explore the development, reaction, and impact of some of humankind's most transformative inventions - its forms of communication. How have these inventions, such as writing, printing, photography, the telegraph, television, radio, and the internet, influenced human behavior throughout the course of history? What role do they play in shaping our lives today? Toward the end of the course, students will speculate on the future of communication technologies in a connected world by prototyping their own inventions and exper...\n\n      more description for COREA-AD   19 »\n\n      \n\n\n\nFrom cave paintings to live video streams on smartwatches, this course will explore the development, reaction, and impact of some of humankind's most transformative inventions - its forms of communication. How have these inventions, such as writing, printing, photography, the telegraph, television, radio, and the internet, influenced human behavior throughout the course of history? What role do they play in shaping our lives today? Toward the end of the course, students will speculate on the future of communication technologies in a connected world by prototyping their own inventions and experiences. Readings and discussion will cover communication theory, technical processes, and creative applications. Writing assignments will be paired with practical assignments where students will be challenged to bring their analysis and ideas to life. We will also utilize the world wide web as a test bed for experiencing and experimenting with various forms of communication both old and new, ranging anywhere from the printing press to the 3D printer and everything in between.\n\n      less description for COREA-AD   19 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 21",
            "course_name": "Gesture in Speech, Poetry, Music, and Dance",
            "description": "COREA-AD   21 Gesture in Speech, Poetry, Music, and Dance \nGesture lies at the interface of the verbal and the non-verbal in human communication and expression. Through bodily movement, intonation, and stress gesture can transcend the distinctions between normal speech, poetry, song, and dance. Gaining a deeper understanding of the multiple meanings of gesture in a variety of media across different cultures enables the student to\napproach fundamental means of human expression, and to learn to recognize constants in human communication within the myriad of culturally specific conventions of language, prosody, music, and dance.",
            "offering": false
        },
        {
            "course_id": "COREA-AD 23",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12876",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 045",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Toussaint, Godfried"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   23\n\n   Rhythm\n\nRhythm has been described as patterns of events in time and space, and is a prominent feature of life and learning. This interdisciplinary course examines what rhythm is and how it manifests itself in a wide variety of domains that range from music and the visual decorative arts traditions spanning cultures across the globe and throughout history, to how it emerges in, and is informed by, areas such as mathematics, computer science, music theory, music technology, biology, psychology, linguistics, sociology, evolution and human migrations, ethnology, crystallography, nuclear physics, calendar ...\n\n      more description for COREA-AD   23 »\n\n      \n\n\n\nRhythm has been described as patterns of events in time and space, and is a prominent feature of life and learning. This interdisciplinary course examines what rhythm is and how it manifests itself in a wide variety of domains that range from music and the visual decorative arts traditions spanning cultures across the globe and throughout history, to how it emerges in, and is informed by, areas such as mathematics, computer science, music theory, music technology, biology, psychology, linguistics, sociology, evolution and human migrations, ethnology, crystallography, nuclear physics, calendar design, radio astronomy, architecture, computer graphics, and the visual arts. Students read from books and journal articles, solve problems, listen to music, drum with their hands on their desks, learn how to use computer software systems to analyze as well as generate rhythms, solve puzzles of musical time patterns, and write on a variety of topics. They complete an individual research project that showcases the application of knowledge in their selected discipline and culture to an open question concerned with rhythm. They discuss progress on their projects during the term, and present their results to the class at the end of term. No computer programming experience or musical training is required.\n\n      less description for COREA-AD   23 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 24",
            "course_name": "",
            "description": "COREA-AD   24\n\n   Conviction and Doubt\n\nOf what can we be certain? The course explores the role of doubt throughout history and in various cultures. It explores the capacity of doubt to endow human experience and knowledge with complexity and dimension. While belief can provide the scaffolding of a life, a community, and worldview, doubt has, throughout history, and in every part of the world, wrestled firmly held beliefs toward new invention and discovery creating pivotal moments of scientific, cultural, social, and personal development. The course also focuses on the role\nof conviction and doubt in storytelling, examining precepts...\n\n      more description for COREA-AD   24 »\n\n      \n\n\n\nOf what can we be certain? The course explores the role of doubt throughout history and in various cultures. It explores the capacity of doubt to endow human experience and knowledge with complexity and dimension. While belief can provide the scaffolding of a life, a community, and worldview, doubt has, throughout history, and in every part of the world, wrestled firmly held beliefs toward new invention and discovery creating pivotal moments of scientific, cultural, social, and personal development. The course also focuses on the role\nof conviction and doubt in storytelling, examining precepts and dramatic principles that employ conviction and doubt toward a greater plurality. Through our readings and discussion students examine the role of doubt and conviction in their daily lives. Close readings of select essays, texts, fables, koans, poetry, novels, plays, short stories, and films serve to map this exploration. Texts include Plato, Timaeus and Critias; Aesop’s Fables; Mahabarata; Ludwig Wittgenstein, On Certainty; Athol Fugard, The Road to Mecca; and John Patrick Shanley, Doubt.\n\n      less description for COREA-AD   24 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 25",
            "course_name": "",
            "description": "COREA-AD   25\n\n   Idea of the Exotic\n\nDesert Odysseys, Dark Continents, Virgin Lands, Harem Fantasies; this interdisciplinary course explores the role of visual culture in shaping our outlook of “other” geographies and cultures as “exotic.” We analyze the role of the diverse technologies in mediating between distant geographies, and making the unknown known. Moving across various texts, arts, media, and institutions – museums, maps, photographs, films, TV programs, and digital spaces – the course reflects on how our imagination of ourselves is intertwined with the ways that we imagine other places. The reading includes: Daniel Def...\n\n      more description for COREA-AD   25 »\n\n      \n\n\n\nDesert Odysseys, Dark Continents, Virgin Lands, Harem Fantasies; this interdisciplinary course explores the role of visual culture in shaping our outlook of “other” geographies and cultures as “exotic.” We analyze the role of the diverse technologies in mediating between distant geographies, and making the unknown known. Moving across various texts, arts, media, and institutions – museums, maps, photographs, films, TV programs, and digital spaces – the course reflects on how our imagination of ourselves is intertwined with the ways that we imagine other places. The reading includes: Daniel Defoe, Robinson Crusoe; Mark Twain, The Innocents Abroad; David F. Dorr, A Colored Man Round the World; Jules Verne, Around the World in Eighty Days; and The letters of Gertrude Bell.\n\n      less description for COREA-AD   25 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 26",
            "course_name": "W Ways of Seeing: Colonialism, Race, and Multiculturalism",
            "description": "COREA-AD   26W Ways of Seeing: Colonialism, Race, and Multiculturalism \nThis seminar is devoted to the interrelated issues of colonialism, postcolonialism, comparative race, and multiculturalism as apprehended through diverse disciplines, media, and colonial histories. Throughout our focus will be comparative, transnational, and transdisciplinary, mingling the theories and methods of media studies, literary studies, philosophy, and social studies. The goal is to reflect in a polycentric way on a multicultural world still shaped by the legacies of (post) colonialism, as reflected, refracted, translated, and resisted by the media.",
            "offering": false
        },
        {
            "course_id": "COREA-AD 27",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17881",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Cook, Douglas D"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   27\n\n   Creativity and Innovation\n\nThis course probes the heuristics of human innovation as understood by ancient and modern inventors and philosophers. The central questions of this course are the following: What are the sources, requirements, and factors that influence human ingenuity? Is creativity a gift or a skill? How does creativity differ from innovation? To address these questions, we consider the earliest human inventions such as spears and simple tools technological innovations that affected the course of human history and inventions that shape our modern world. Throughout the course, a strong emphasis is placed on d...\n\n      more description for COREA-AD   27 »\n\n      \n\n\n\nThis course probes the heuristics of human innovation as understood by ancient and modern inventors and philosophers. The central questions of this course are the following: What are the sources, requirements, and factors that influence human ingenuity? Is creativity a gift or a skill? How does creativity differ from innovation? To address these questions, we consider the earliest human inventions such as spears and simple tools technological innovations that affected the course of human history and inventions that shape our modern world. Throughout the course, a strong emphasis is placed on developing a personal philosophy and methodology for creativity.\n\n      less description for COREA-AD   27 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 28",
            "course_name": "",
            "description": "COREA-AD   28\n\n   Fame\n\nHistorian Leo Braudy notes that: “the history of fame is also the history of the shifting definition of achievement in the social world.” We will track early discourses of heroism and immortality from Alexander the Great to today’s reality celebrities like Kim Kardashian. Beginning with concepts of fame in antiquity, we investigate Virgil’s The Aeneid, The Bible, Homer’s The Odyssey, and Shakespeare’s King Richard III. The rise of contemporary stars across film, television, and theatre raises questions about the ways in which celebrities help manage historically conditioned categories of class...\n\n      more description for COREA-AD   28 »\n\n      \n\n\n\nHistorian Leo Braudy notes that: “the history of fame is also the history of the shifting definition of achievement in the social world.” We will track early discourses of heroism and immortality from Alexander the Great to today’s reality celebrities like Kim Kardashian. Beginning with concepts of fame in antiquity, we investigate Virgil’s The Aeneid, The Bible, Homer’s The Odyssey, and Shakespeare’s King Richard III. The rise of contemporary stars across film, television, and theatre raises questions about the ways in which celebrities help manage historically conditioned categories of classification, such as gender, sexuality, race, class, and nationality. Case studies of non-Western celebrities,\nhighlight the formatting of modern stardom in Asia (Jackie Chan and Jet Li), Africa (Fela Kuti), and the Middle East (Umm Kulthum).\n\n      less description for COREA-AD   28 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 29",
            "course_name": "",
            "description": "COREA-AD   29\n\n   Performing Body in History\n\nThis class examines the representation and theorization of the human body as evident in acting theory and performance practices. We will be particularly attentive to the international circulation of ideas of the body. To what extent are the commentaries of Ibn  Rushd (Averroes) on Galen and Plato important to Renaissance Europe’s understanding of the performing body? How has Tadashi Suzuki’s interest in Noh, Kabuki , and Ancient Greek theatre informed his collaborations with major figures of the European theatre? Authors will include: Ibn Rushd, Plato, Zeami, Shakespeare, Diderot, Coleridge, L...\n\n      more description for COREA-AD   29 »\n\n      \n\n\n\nThis class examines the representation and theorization of the human body as evident in acting theory and performance practices. We will be particularly attentive to the international circulation of ideas of the body. To what extent are the commentaries of Ibn  Rushd (Averroes) on Galen and Plato important to Renaissance Europe’s understanding of the performing body? How has Tadashi Suzuki’s interest in Noh, Kabuki , and Ancient Greek theatre informed his collaborations with major figures of the European theatre? Authors will include: Ibn Rushd, Plato, Zeami, Shakespeare, Diderot, Coleridge, Leigh Hunt, Brecht, Suzuki.\n\n      less description for COREA-AD   29 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 30",
            "course_name": "W",
            "description": "COREA-AD   30W\n\n   Representations\n\nThis course considers representations of social and historical realities within which notions of cultural identity, citizenship, and power are imagined and presented. Using examples from the performing arts, film and photography, we explore formal technologies of creating representations and cultural modes of interpreting them, and compare how reality is abstracted and codified by\nrepresentations from different parts of the world. Some of the examples are films, such as Lawrence of Arabia, Mother India, Xala and Al Za’eem; plays\nsuch as The Road, Al-Malik huwa I-Malik, and St Joan; photographs...\n\n      more description for COREA-AD   30W »\n\n      \n\n\n\nThis course considers representations of social and historical realities within which notions of cultural identity, citizenship, and power are imagined and presented. Using examples from the performing arts, film and photography, we explore formal technologies of creating representations and cultural modes of interpreting them, and compare how reality is abstracted and codified by\nrepresentations from different parts of the world. Some of the examples are films, such as Lawrence of Arabia, Mother India, Xala and Al Za’eem; plays\nsuch as The Road, Al-Malik huwa I-Malik, and St Joan; photographs by Annie Liebovitz, Brian Duffy, and Yousef Karsh. Basic semiotic, materialist and reception theories will offer prisms for our study. Key essays such as Postcoloniality and the Artifice of History: Who Speaks for the Pastness of\nIndia by Dipesh Charkravorty, Fictions of the Pose by Harry Berger, Imperialist Nostalgia by Renato Rosaldo, and Theorizing the Male Gaze by Edward\nSnow are read side by side videos of performances, films, and slides of photographs.\n\n      less description for COREA-AD   30W «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 31",
            "course_name": "W",
            "description": "COREA-AD   31W\n\n   Machine Dreams\n\nMachines have provided the means for artists to dream different worlds into existence. Machines impact how we structure our thoughts, our language,\nand even our bodies. We will examine how writers, visual artists, filmmakers, and performers have creatively engaged both obsolete and emerging technologies—mirrors, camera obscuras, phonographs, photocopiers, projectors, telephones, computers, and satellites—to communicate shifts in how we perceive time, movement, space, similarity and difference among human beings, and operations of political power. We study a variety of philosophers, scientists,...\n\n      more description for COREA-AD   31W »\n\n      \n\n\n\nMachines have provided the means for artists to dream different worlds into existence. Machines impact how we structure our thoughts, our language,\nand even our bodies. We will examine how writers, visual artists, filmmakers, and performers have creatively engaged both obsolete and emerging technologies—mirrors, camera obscuras, phonographs, photocopiers, projectors, telephones, computers, and satellites—to communicate shifts in how we perceive time, movement, space, similarity and difference among human beings, and operations of political power. We study a variety of philosophers, scientists, anthropologists, cultural theorists, visual artists and playwrights including Horace, Euripides, Walter Benjamin, Donna Haraway, Michael Taussig, David Hockney, Ingres, Vermeer, Caravaggio, Chuck Close, films by the Lumiere Brothers and Jean Rouch, Apple Computer television commercials, and web-based performance/installation art by Stelarc, Electronic\nDisturbance Theatre, Emily Jacir, and Ai Weiwei.\n\n      less description for COREA-AD   31W «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 32",
            "course_name": "",
            "description": "COREA-AD   32\n\n   Identity, Image and Place\n\nThe course explores how image-based representations, written texts, and aspects of the built environment reflect certain conceptions of identity. The course considers paintings, photographs, video, ego documents, and journals.\nWe focus on artistic practices that examine and/or demonstrate personal or preconceived notions of identity through acts of self-representation. Our questions include: Why do artists from a particular region privilege certain issues over others? What extenuating circumstances may influence an artist's practice? How do artists consider identity through examination of plac...\n\n      more description for COREA-AD   32 »\n\n      \n\n\n\nThe course explores how image-based representations, written texts, and aspects of the built environment reflect certain conceptions of identity. The course considers paintings, photographs, video, ego documents, and journals.\nWe focus on artistic practices that examine and/or demonstrate personal or preconceived notions of identity through acts of self-representation. Our questions include: Why do artists from a particular region privilege certain issues over others? What extenuating circumstances may influence an artist's practice? How do artists consider identity through examination of place?\nWhat role does gender or gender stereotypes play in the production of art? How do artists represent themselves in order to challenge gender or cultural\nstereotypes? We explore several media and methods of self-representation in artistic practice. Basic visual criticism techniques and theory is introduced in order to understand and differentiate between a wide range of artistic practices and intentions. The course considers artists from the U.S.A., Europe, the Middle East and Asia, and includes visits to local galleries and artist studios.\n\n      less description for COREA-AD   32 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 33",
            "course_name": "Perception in Music and Sound",
            "description": "COREA-AD   33 Perception in Music and Sound \nWhat is perception and how is it mediated by culture and technology? How much of music is a function of the way our auditory system works and how much is learned as a part of culture? To what extent do objects of perception look the same and sound the same across individuals, cultures, and means of representation? This class examines these questions by looking at the scientific literature (to understand the basics of perception), by looking at cultural objects (for specific examples that bring the ideas into focus) and by looking at the various technologies for storing and reproducing sound.",
            "offering": false
        },
        {
            "course_id": "COREA-AD 34",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17884",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 112 with Guedes, Carlos08/30/2015 - 12/17/2015 Tue 9.15 AM - 11.55 AM at ARTS_CENT 112",
                    "time": "Sun 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Guedes, Carlos"
                }
            ],
            "course_name": "What is Music?",
            "description": "COREA-AD   34 What is Music? \nThis course analyzes what we understand as “music.” Drawing on music of different styles from all over the world, we explore what constitutes musical meaning, how it is produced, and how music expresses feelings. Taking advantage of the multicultural nature of NYUAD, we conisder the cultural and universal mechanisms at play when we listen and understand music. A lab portion of the class guides students through basic musical elements such as notation systems, scales, and simple compositional techniques.",
            "offering": true
        },
        {
            "course_id": "COREA-AD 35",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17882",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Copti, Scandar"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   35\n\n   Lies and Lying\n\nLying is an integral part of human communication. It is only in contrast to lies that we are able to construct the concept of truth and “choose” our perception of reality. From white lies and exaggerations to advanced techniques of persuasion such as propaganda and brainwashing, this course will examine the psychological, philosophical, ethical and social aspects of several contexts in which lying commonly occurs: Art, Culture, Literature, Science, Politics, Advertising, Journalism, Relationships, Digital World and History. We will discuss and analyze the motives, techniques, technology and ou...\n\n      more description for COREA-AD   35 »\n\n      \n\n\n\nLying is an integral part of human communication. It is only in contrast to lies that we are able to construct the concept of truth and “choose” our perception of reality. From white lies and exaggerations to advanced techniques of persuasion such as propaganda and brainwashing, this course will examine the psychological, philosophical, ethical and social aspects of several contexts in which lying commonly occurs: Art, Culture, Literature, Science, Politics, Advertising, Journalism, Relationships, Digital World and History. We will discuss and analyze the motives, techniques, technology and outcomes of some of the biggest lies and liars throughout history, from mythological\ngods in ancient Greece through fake alchemists in the Islamic Golden Age to contemporary schemers. We will study examples of lying in texts, films, biographies, cartography, visual arts, internet, social networking, mass media, advertisement as well as guest liars and lying experts.\n\n      less description for COREA-AD   35 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 36",
            "course_name": "W",
            "description": "COREA-AD   36W\n\n   Death: Myths, Histories, Metamorphoses\n\nDeath is a universal fact of human life, powerfully defining the exigencies of our experience. From ancient times until the present, artistic works have registered changing attitudes towards death in the stories they tell. In this seminar, we\nexamine artistic responses to mortality across a wide range of historical and cultural contexts— including in the myths of Orpheus and Osiris, the Epic of Gilgamesh, and the text of the Ramayana; the poetry of Darwish, Neruda, and Rilke; stories by Tolstoy, Mishima, and Benjamin; and music of Dowland, Wagner, and Adams. Selected films and plays, including...\n\n      more description for COREA-AD   36W »\n\n      \n\n\n\nDeath is a universal fact of human life, powerfully defining the exigencies of our experience. From ancient times until the present, artistic works have registered changing attitudes towards death in the stories they tell. In this seminar, we\nexamine artistic responses to mortality across a wide range of historical and cultural contexts— including in the myths of Orpheus and Osiris, the Epic of Gilgamesh, and the text of the Ramayana; the poetry of Darwish, Neruda, and Rilke; stories by Tolstoy, Mishima, and Benjamin; and music of Dowland, Wagner, and Adams. Selected films and plays, including the Noh Drama of Japan, also are considered. Students develop a collaborative or individual artistic project and related critical paper demonstrating their engagement with the topic.\n\n      less description for COREA-AD   36W «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 37",
            "course_name": "W",
            "description": "COREA-AD   37W\n\n   Staging the Self\n\nThis course examines the representation of personal experience in its biographical and autobiographical forms in the arts with a focus on performance. We pay particular attention to the ways in which personhood is aesthetically, psychologically, and politically theorized in different contexts. What\ndoes an individual’s experience represent in specific art works? How is the relationship of individual experience to collective experience reconstructed\nin different arts works? Can individual experience portray collective historical reality? Should we understand an artist’s oeuvre in relation to th...\n\n      more description for COREA-AD   37W »\n\n      \n\n\n\nThis course examines the representation of personal experience in its biographical and autobiographical forms in the arts with a focus on performance. We pay particular attention to the ways in which personhood is aesthetically, psychologically, and politically theorized in different contexts. What\ndoes an individual’s experience represent in specific art works? How is the relationship of individual experience to collective experience reconstructed\nin different arts works? Can individual experience portray collective historical reality? Should we understand an artist’s oeuvre in relation to their personal life? In what ways do individual art works bestow human experience with specific\nepistemologies and with social and historical realities? Texts for the course include works by Irving Goffman, Errol Morris, Erik Erikson, Joseph Roach, Freddie Rokem, Deirdre Heddon, and selected plays, films, and museum displays.\n\n      less description for COREA-AD   37W «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 38",
            "course_name": "J",
            "description": "COREA-AD   38J\n\n   Memory\n\nMemory is a dynamic process influenced by internal and external factors. Internally, a person’s individual memory content is overwritten each and every time something is remembered. Externally, memory is determined by social practices and, not least, our physical environment, shaping what may be called social or collective memory. The stability of the physical environment is a guarantor of an individual’s memory and, by implication, identity, to a much greater extent than individual memory itself; it was as early as 2000 years ago that the nexus of the urban space and a stable memory was estab...\n\n      more description for COREA-AD   38J »\n\n      \n\n\n\nMemory is a dynamic process influenced by internal and external factors. Internally, a person’s individual memory content is overwritten each and every time something is remembered. Externally, memory is determined by social practices and, not least, our physical environment, shaping what may be called social or collective memory. The stability of the physical environment is a guarantor of an individual’s memory and, by implication, identity, to a much greater extent than individual memory itself; it was as early as 2000 years ago that the nexus of the urban space and a stable memory was established (Cicero, Quintilian). The class focuses on theoretical concepts of memory in the fields of the arts, technology and invention in antiquity and the 20th century (Warburg, Halbwachs, Nora), discuss a novel that satirically memorises the fall of the Wall (Brussig) and provide numerous field trips that exemplify the concepts of social/collective memory based upon the urban space of Berlin (the replacement of the GDR Palace of the Republic by a reconstructed City Palace, Holocaust Memorial, Sinti and Roma Memorial, Jewish Museum, book burning memorial, Berlin Wall, Berlin Museums, the Third Reich Germania project).\n\n      less description for COREA-AD   38J «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 39",
            "course_name": "",
            "description": "COREA-AD   39\n\n   Tools\n\nWe are habituated to think of tools as physical objects that facilitate utilitarian actions. Pencils, glassware, and hammers are tools of this type . However, the definition of a tool can be expanded beyond material objects, to include things like storytelling and the internet. Tools can facilitate interpersonal interactions and enable intimate communication, yet have no physical manifestation.\nThis course studies the invention and use of tools across cultures and time. We examine a large number of examples, starting with languages, moving through tools like the wheel and metalwork to modern t...\n\n      more description for COREA-AD   39 »\n\n      \n\n\n\nWe are habituated to think of tools as physical objects that facilitate utilitarian actions. Pencils, glassware, and hammers are tools of this type . However, the definition of a tool can be expanded beyond material objects, to include things like storytelling and the internet. Tools can facilitate interpersonal interactions and enable intimate communication, yet have no physical manifestation.\nThis course studies the invention and use of tools across cultures and time. We examine a large number of examples, starting with languages, moving through tools like the wheel and metalwork to modern tools like software and network topologies, asking how our choice of tools changes the way we think about our goals.\n\n      less description for COREA-AD   39 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 40",
            "course_name": "",
            "description": "COREA-AD   40\n\n   Records\n\nWhat drives us to create records of human events or experience? And how has that drive shaped not only the history of human communication but of record-keeping itself? What is the relationship between an event and the records or recordings we make of it? Is there tension between the promise of mimetic or documentary fidelity and new possibilities for art and imagination? When is the memorializing goal better served by invention than recording? This course will examine a series of technological innovations in record-keeping and record-making, from cuneiform to cassette culture, mp3s, and beyond...\n\n      more description for COREA-AD   40 »\n\n      \n\n\n\nWhat drives us to create records of human events or experience? And how has that drive shaped not only the history of human communication but of record-keeping itself? What is the relationship between an event and the records or recordings we make of it? Is there tension between the promise of mimetic or documentary fidelity and new possibilities for art and imagination? When is the memorializing goal better served by invention than recording? This course will examine a series of technological innovations in record-keeping and record-making, from cuneiform to cassette culture, mp3s, and beyond. Readings will address histories and theories of orality and literacy, archives, print, photography, film, sound recording, and other media as we explore fundamental questions about memory, history, technology, and the relationship between art and life.\n\n      less description for COREA-AD   40 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 41",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19223",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 043 with Darts, David08/30/2015 - 12/17/2015 Wed 12.45 PM - 2.00 PM at ARTS_CENT 043",
                    "time": "Mon 12.45 PM - 3.25 PM",
                    "open": true,
                    "professor": "Darts, David"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   41\n\n   Nomads\n\nWhat can the unique human ecology and worldview that emerges from mobile ways of life teach us about human ingenuity and culture? This course uses the lenses of philosophy, art, and design to examine the history, influence, and cultural underpinnings of nomadism and nomadic dwelling. Paying special attention to kinetic objects and the built environment, we will probe historical and contemporary conceptions of ownership and ecology, transience and permanence, home and homelessness, and citizenship and belonging. We will study writings by Deleuze and Guattari, Walter Benjamin, and Rosi Braidotti...\n\n      more description for COREA-AD   41 »\n\n      \n\n\n\nWhat can the unique human ecology and worldview that emerges from mobile ways of life teach us about human ingenuity and culture? This course uses the lenses of philosophy, art, and design to examine the history, influence, and cultural underpinnings of nomadism and nomadic dwelling. Paying special attention to kinetic objects and the built environment, we will probe historical and contemporary conceptions of ownership and ecology, transience and permanence, home and homelessness, and citizenship and belonging. We will study writings by Deleuze and Guattari, Walter Benjamin, and Rosi Braidotti, artworks by Andrea Zittel, Lucy Orta, and Krzysztof Wodiczko and cinematic works including Lawrence of Arabia and Dances with Wolves. All aspects of mobile dwellings, from familiar vernacular models such as tents and huts to developments in humanitarian design and contemporary art, will be considered. Students will be presented with a series of design challenges and will be asked to solve problems by creating new designs and producing prototypes. No previous background or training in design is required.\n\n      less description for COREA-AD   41 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 42",
            "course_name": "",
            "description": "COREA-AD   42\n\n   Art and Emotion\n\nWhile Aristotle celebrated the capacity of art to elicit emotion, Plato treated it with suspicion. Suspected of irrationality, emotion has continued to hold a contested position in the understanding of art. This course will explore the ways that art both expresses and arouses the emotions and to what value and ends. It asks how stories engage us in prototypical, emotional human situations such as suffering, separation, loss, recognition and reunion. We will think about what aspects of our emotional responses are universal, what are culturally specific, what are gendered, what are individual an...\n\n      more description for COREA-AD   42 »\n\n      \n\n\n\nWhile Aristotle celebrated the capacity of art to elicit emotion, Plato treated it with suspicion. Suspected of irrationality, emotion has continued to hold a contested position in the understanding of art. This course will explore the ways that art both expresses and arouses the emotions and to what value and ends. It asks how stories engage us in prototypical, emotional human situations such as suffering, separation, loss, recognition and reunion. We will think about what aspects of our emotional responses are universal, what are culturally specific, what are gendered, what are individual and personal, and the similarities and differences between art emotions and actual emotions. We will draw on a wide range of artworks from a variety of periods and cultures as case studies, including visual and narrative representations of the Passion of Christ; canonical love stories, like Laila Majnun and Romeo and Juliet; classical and modern tragedy; romantic, popular, and program music; and comic art like The Comedy of Errors and silent film comedy. These studies will be framed by the theories of, among others, Aristotle, Abhinavagupta, Tolstoy, Langer, Bergson, Freud, analytic philosophy (Carroll, Kivy), and cognitive theory (Hogan).\n\n      less description for COREA-AD   42 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 43",
            "course_name": "",
            "description": "COREA-AD   43\n\n   War\n\nWhat is war?  Why do wars exist? What are the differences between wars in the past and those being waged today and how have the conditions of conflict changed throughout history? Is there an art of war? These questions are central to the purview of this course, which examines artistic responses to war across a wide range of historical and cultural contexts from antiquity to the present.  The course explores how the arts, particularly music and musical practices, play a critical role in accompanying the sociological rituals of war from the military marches part of deployment, to the  laments  a...\n\n      more description for COREA-AD   43 »\n\n      \n\n\n\nWhat is war?  Why do wars exist? What are the differences between wars in the past and those being waged today and how have the conditions of conflict changed throughout history? Is there an art of war? These questions are central to the purview of this course, which examines artistic responses to war across a wide range of historical and cultural contexts from antiquity to the present.  The course explores how the arts, particularly music and musical practices, play a critical role in accompanying the sociological rituals of war from the military marches part of deployment, to the  laments  and requiems that figure centrally in process of mourning in the aftermath of conflict.  Drawing on histories and philosophies of war, we will engage with issues related to propaganda, censorship, detention, internment, torture, heroism, sacrifice, bravery, justice, history, memory, and death and with reference to work by Homer, Thuclydides, Sun Tzu, Clausewitz, Tolstoy, Shostakovitch, Britten, Picasso,  Dix, Mishima, Wiesel, Tarkovsky, Kubrick, and John Lennon, among  others.\n\n      less description for COREA-AD   43 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 44",
            "course_name": "",
            "description": "COREA-AD   44\n\n   Time\n\nThis course explores the multifaceted nature of time, in different historical, social and religious contexts.  We will pursue three main strands: 1) changing conceptions of time, time-keeping systems, and states of time consciousness from antiquity to the present; 2) representations of time in works of art that heighten our apprehension or aim to escape the rule of time and induce a quality of timeless suspension; and 3) the technologies of time-keeping from sundials to atomic watches, calendars to timelines.  Denaturalizing our own conventions of keeping time, we will consider the purposes of...\n\n      more description for COREA-AD   44 »\n\n      \n\n\n\nThis course explores the multifaceted nature of time, in different historical, social and religious contexts.  We will pursue three main strands: 1) changing conceptions of time, time-keeping systems, and states of time consciousness from antiquity to the present; 2) representations of time in works of art that heighten our apprehension or aim to escape the rule of time and induce a quality of timeless suspension; and 3) the technologies of time-keeping from sundials to atomic watches, calendars to timelines.  Denaturalizing our own conventions of keeping time, we will consider the purposes of time measurement, the history of the hour, the development of the mechanical clock and its impact on society, the relationship between clock time and industrialization, the shift from local to international standard time, and the question whether the human experience of time is common across cultures or is culturally specific and variable.\n\n      less description for COREA-AD   44 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 45",
            "course_name": "J",
            "description": "COREA-AD   45J\n\n   Sound(ings)\n\nThis course will explore the meaning of sound in the urban and natural environments within Abu Dhabi and the UAE. An assumption which this course will make and explore is that all situations in the real world have a musical potential. This potential is defined and realized by discovering, recording and mapping the many ways in which the physical reality of places are dynamic systems of significant acoustic patterns. This seminar will start with an introduction to mobile sound recording that explores sound as it travels through the air in acoustic space using varieties of microphones and space ...\n\n      more description for COREA-AD   45J »\n\n      \n\n\n\nThis course will explore the meaning of sound in the urban and natural environments within Abu Dhabi and the UAE. An assumption which this course will make and explore is that all situations in the real world have a musical potential. This potential is defined and realized by discovering, recording and mapping the many ways in which the physical reality of places are dynamic systems of significant acoustic patterns. This seminar will start with an introduction to mobile sound recording that explores sound as it travels through the air in acoustic space using varieties of microphones and space mapping techniques.  The course will also explore using acoustic measurement technologies such as accelerometers and hydrophones to investigate how sound exists within structures, the sea and other types of fluids. This course will start out with a large group sound mapping project about Saadiyat Island and expand to other environments in Abu Dhabi and the UAE. In addition to the group project, students will also be required to develop their own unique soundscape works. The course will cover all aspects of environmental field recording, editing and presentation of the final results.\n\n      less description for COREA-AD   45J «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 46",
            "course_name": "J Narrative, Media, and Technology",
            "description": "COREA-AD   46J Narrative, Media, and Technology \nTelling stories is a fundamental human activity, but the ways these stories are told depends upon the means in which they are created and transmitted.  This course examines the role of technologies ranging from print, cave painting, comics, animation, and film, to hypertext, social media, and viral video.  In addition to reading and viewing, the assignments will also include creative technological projects and excursions to the Museum of Moving Image, the Museum of Comics Art, and The Moth storytelling theater.",
            "offering": false
        },
        {
            "course_id": "COREA-AD 47",
            "course_name": "",
            "description": "COREA-AD   47\n\n   Listening\n\nThis course explores ways of listening, and of being a listener, in human experience, with attention to the role of the ear in the constitution of subjects, communities, and societies of different times and places. Topics include debates about the listening subject in Western philosophy and media studies; the role of the ‘ethnographic ear’ in cultural anthropology and ethnomusicology; theories and methods of ‘soundscape research’ and ‘acoustemology’; and aurality as an aspect of culture, explored through case studies ranging from the development of sound reproduction technologies, to deaf cult...\n\n      more description for COREA-AD   47 »\n\n      \n\n\n\nThis course explores ways of listening, and of being a listener, in human experience, with attention to the role of the ear in the constitution of subjects, communities, and societies of different times and places. Topics include debates about the listening subject in Western philosophy and media studies; the role of the ‘ethnographic ear’ in cultural anthropology and ethnomusicology; theories and methods of ‘soundscape research’ and ‘acoustemology’; and aurality as an aspect of culture, explored through case studies ranging from the development of sound reproduction technologies, to deaf culture, to the ethics of sounding and listening in religious practice. Course readings, drawn from a wide range of disciplines, include foundational texts in the emerging interdisciplinary field of ‘sound studies’. In addition to engaging critically with a range of ideas and debates through discussion, presentations, and writing, students will try their ears at specialized modes of training and data collection developed by sound-oriented researchers and artists.\n\n      less description for COREA-AD   47 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 48",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13069",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 043",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Peters, Sandra"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   48\n\n   Vision\n\nThis seminar concerns the phenomenon of vision. The sense of vision is closely related to processes of understanding, thought, and linguistic interpretation. Seeing is an activity in which the eye and brain work together, but the imagination also affects vision, for we sometimes imagine what we say we see. We will study the connection of image and language using the example of Hollis Frampton’s film Nostalgia, which suggests that vision entails an aspect of imagining. We will approach questions about the nature of vision on the basis of texts, cinematic materials, art works, and experiments we...\n\n      more description for COREA-AD   48 »\n\n      \n\n\n\nThis seminar concerns the phenomenon of vision. The sense of vision is closely related to processes of understanding, thought, and linguistic interpretation. Seeing is an activity in which the eye and brain work together, but the imagination also affects vision, for we sometimes imagine what we say we see. We will study the connection of image and language using the example of Hollis Frampton’s film Nostalgia, which suggests that vision entails an aspect of imagining. We will approach questions about the nature of vision on the basis of texts, cinematic materials, art works, and experiments we conduct. The texts on which we will work include “classical” ones by authors such as Charles Baudelaire and Maurice Merleau-Ponty, but also more recent theoretical approaches by Serge Daney, for example. We will also focus on the phenomenon of synaesthesia as it is emphasized as ‘haptic seeing’ in the work of Lygia Clark.\n\n      less description for COREA-AD   48 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 49",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13075",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Teece, Denise"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   49\n\n   Collecting\n\nWhat motivates human beings to form collections? How do we select, order, preserve and display information and objects? And, what intellectual processes are involved in these activities? What does the content of these collections say about those who created them? And, what kind of narratives can be traced within the display of these collections? This course surveys the phenomenon of collecting, focusing on key moments in its history, from antiquity up to contemporary times.  In the first section of the class, we explore collections of  “thought,” that is, how knowledge has been stored, organiz...\n\n      more description for COREA-AD   49 »\n\n      \n\n\n\nWhat motivates human beings to form collections? How do we select, order, preserve and display information and objects? And, what intellectual processes are involved in these activities? What does the content of these collections say about those who created them? And, what kind of narratives can be traced within the display of these collections? This course surveys the phenomenon of collecting, focusing on key moments in its history, from antiquity up to contemporary times.  In the first section of the class, we explore collections of  “thought,” that is, how knowledge has been stored, organized and retrieved – and some of the tools we have developed to do so – including mnemonic devices, writing, codices, libraries, information architecture and digital technologies. The second section concerns physical objects, and their collection, classification, organization, and display. Finally, we discuss the work of modern and contemporary artists who incorporate concepts of assemblage and curation. In response to the readings and to the materials covered in class, students will conceive, create, describe and display a collection of their own making.\n\n      less description for COREA-AD   49 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 50",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17885",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Kidd, Fiona"
                },
                {
                    "format": "Workshop",
                    "class_id": "19837",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Sun 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Kidd, Fiona"
                }
            ],
            "course_name": "W",
            "description": "COREA-AD   50W\n\n   Identity and Object\n\nThis course asks how objects from the past obtain meaning long after they were made, and how they have come to express the identity of communities, nations, and religions. We will consider fundamental questions of identity by assessing how objects become imbued with meaning.  Who ascribes these objects meaning and why?  How do we relate to objects designated to represent us?  We will explore object biographies from a range of periods, regions and traditions.  We will discuss objects representing contested national and global identities, such as the Cyrus Cylinder from Iraq, and the Koh-i-noor ...\n\n      more description for COREA-AD   50W »\n\n      \n\n\n\nThis course asks how objects from the past obtain meaning long after they were made, and how they have come to express the identity of communities, nations, and religions. We will consider fundamental questions of identity by assessing how objects become imbued with meaning.  Who ascribes these objects meaning and why?  How do we relate to objects designated to represent us?  We will explore object biographies from a range of periods, regions and traditions.  We will discuss objects representing contested national and global identities, such as the Cyrus Cylinder from Iraq, and the Koh-i-noor diamond from India, as well as material that facilitates discussion of socially and culturally defined identities.  In all of these examples politics plays a constant role.  Through case studies of iconic objects from around the world, we will compare significance in the originating society with place and function today to better understand how, why, and by whom identity is constructed.\n\n      less description for COREA-AD   50W «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 51",
            "course_name": "",
            "description": "COREA-AD   51\n\n   Wood\n\nWood is inseparably linked to human history and culture. From mankind’s earliest use of sticks for shelter, warmth and gathering food, the increasingly complex ways that we have used and understood this material reflect the history of civilization itself. What can wood can teach us about ecology, human history, ingenuity and culture? By examining wood's role across several diverse cultures, this class will consider our ever evolving relationship to wood through its use in architecture, art and design. We will study the work of artists and designers including Richard Deacon, Koki Tanaka, Louise...\n\n      more description for COREA-AD   51 »\n\n      \n\n\n\nWood is inseparably linked to human history and culture. From mankind’s earliest use of sticks for shelter, warmth and gathering food, the increasingly complex ways that we have used and understood this material reflect the history of civilization itself. What can wood can teach us about ecology, human history, ingenuity and culture? By examining wood's role across several diverse cultures, this class will consider our ever evolving relationship to wood through its use in architecture, art and design. We will study the work of artists and designers including Richard Deacon, Koki Tanaka, Louise Bourgeois, Giuseppe Penone, Bill Reid, Charles and Ray Eames, El Anatsui, Henry Moore, and Ai Weiwei. We will also examine the lore and mythology of wood through literary works like the Epic of Gilgamesh, Hermann Hesse’s Siddhartha, Shel Silverstein’s The Giving Tree, Kenzaburō Ōe’s Flaming Green Tree Trilogy, Betty Smith’s A Tree Grows in Brooklyn, the Enchanted Forests of the Brothers Grimm, J.R.R. Tolkien’s Lord of the Rings, and Michael Pollan’s Botany of Desire. The class will include a practical studio component in which students learn historic and contemporary woodworking techniques, respond to carpentry design challenges, and develop a kinesthetic knowledge and materials understanding through the exploration and manipulation of wood and wood-based materials. No previous background or training is required.\n\n      less description for COREA-AD   51 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 52",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17781",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Fitzgerald, Scott"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   52\n\n   Play\n\nWe are engaged in play throughout our lives. It socializes and engages us in a deeply meaningful way that serves as an essential component of our education in the world. Beginning with the imaginative and open-ended games of our childhood, and continuing through more structured aspects of play like sport, theatre, board and video games, it serves a vital tool in our development as individuals. It can be collaborative or competitive, open-ended or closed, but always is innately fun. Examining the topic from a variety of perspectives, including psychological, artistic and philosophical, we will ...\n\n      more description for COREA-AD   52 »\n\n      \n\n\n\nWe are engaged in play throughout our lives. It socializes and engages us in a deeply meaningful way that serves as an essential component of our education in the world. Beginning with the imaginative and open-ended games of our childhood, and continuing through more structured aspects of play like sport, theatre, board and video games, it serves a vital tool in our development as individuals. It can be collaborative or competitive, open-ended or closed, but always is innately fun. Examining the topic from a variety of perspectives, including psychological, artistic and philosophical, we will engage with multiple levels of playfulness throughout history, from simple childhood escapism to urban scale games facilitated by new technologies . Students will be challenged to create new forms of play by prototyping and designing their own games and frameworks for play throughout the semester.\n\n      less description for COREA-AD   52 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 53",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17859",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Jeong, Seung-Hoon"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   53\n\n   Abjection\n\nHow do we build an identity? What is rejected or expelled from us? This fundamental aspect of the human condition underlies the notion of abjection: a detached and degraded state or the act of causing it. The abject, renounced in oneself or cast out of society, takes various forms: from the maternal body and the corpse to social minorities and refugees. It implies some trauma or taboo that disturbs the symbolic order of law and norms. This course asks how abjection occurs on many levels and how it can also catalyze new modes of life and community. We trace it in terms of horror, repulsion, bea...\n\n      more description for COREA-AD   53 »\n\n      \n\n\n\nHow do we build an identity? What is rejected or expelled from us? This fundamental aspect of the human condition underlies the notion of abjection: a detached and degraded state or the act of causing it. The abject, renounced in oneself or cast out of society, takes various forms: from the maternal body and the corpse to social minorities and refugees. It implies some trauma or taboo that disturbs the symbolic order of law and norms. This course asks how abjection occurs on many levels and how it can also catalyze new modes of life and community. We trace it in terms of horror, repulsion, beauty, sexuality, multiculturalism, terrorism, etc., and highlight today’s abjection that is generated in global systems and revealed through violence or catastrophe, yet also with positive potential. We explore film (Fassbinder, Sissako, Folman, Eastwood, Von Trier, Sono Shion), literature (Kafka, Genet, Beckett, Yi Sang), art and performance (Bacon, Sherman, Stelarc, Zhu Yu), along with psychoanalysis, feminism, philosophy, aesthetics, and trans-historical material from myths and religions to punk rock and cyber culture.\n\n      less description for COREA-AD   53 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 54",
            "course_name": "",
            "description": "COREA-AD   54\n\n   Site Specificity\n\nThis course explores what it means to be situated in a particular site. Do places have a spirit and identity? Do artists respond to a place in a particular way? Light, landscape, sound, climate—all these things inform the forms created by their makers in different cultures and time periods. Powerpoint presentations, readings, and visits to site-specific works in Abu Dhabi will help the students explore fundamental questions about the impact of the site on artists, objects and architecture. Students will be presented with a series of challenges, or problems, that ask them to respond to a specif...\n\n      more description for COREA-AD   54 »\n\n      \n\n\n\nThis course explores what it means to be situated in a particular site. Do places have a spirit and identity? Do artists respond to a place in a particular way? Light, landscape, sound, climate—all these things inform the forms created by their makers in different cultures and time periods. Powerpoint presentations, readings, and visits to site-specific works in Abu Dhabi will help the students explore fundamental questions about the impact of the site on artists, objects and architecture. Students will be presented with a series of challenges, or problems, that ask them to respond to a specific site. We will read texts written by visionary thinkers, such as Lebbeus Woods and Robert Smithson, and explore iconic sites such as Stonehenge and Shibam Hadhramaut in Yemen. We will also delve deeply in to site specific artworks produced by artists in various times and cultures, with a focus on artistic production in the last 100 years.\n\n      less description for COREA-AD   54 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 55",
            "course_name": "",
            "description": "COREA-AD   55\n\n   Iconoclasm\n\nIt is often said that as long as there has been art, there has been iconoclasm, literally from the Greek breaking (klân) of images (eikon). What does it mean to annihilate an image? What motivates the violent destruction of artworks, and what does this applied criticism, perhaps counter-intuitively, tell us about the fundamental impulse to create? Throughout history and across many societies— from biblical sources to Bamiyan buddhas, Reformation to the Danish cartoon controversy — reformers, idealists and revolutionaries have sought to silence dissent by erasing artworks that give potent mater...\n\n      more description for COREA-AD   55 »\n\n      \n\n\n\nIt is often said that as long as there has been art, there has been iconoclasm, literally from the Greek breaking (klân) of images (eikon). What does it mean to annihilate an image? What motivates the violent destruction of artworks, and what does this applied criticism, perhaps counter-intuitively, tell us about the fundamental impulse to create? Throughout history and across many societies— from biblical sources to Bamiyan buddhas, Reformation to the Danish cartoon controversy — reformers, idealists and revolutionaries have sought to silence dissent by erasing artworks that give potent material presence to ideas. Taking a long view of iconoclasm and censorship via case studies ranging from the ancient world to today’s contemporary crises, we will investigate the power of the negated image or what happened when different technologies of picture-making — sculpture, architecture, painting, print, photograph, cartoon and video — clashed in the heated public square and pushed the politics of representation to its breaking point.\n\n      less description for COREA-AD   55 «",
            "offering": false
        },
        {
            "course_id": "COREA-AD 56",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19645",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 001",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Stemmrich, Gregor"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   56\n\n   The Idea of the Garden\n\nGardens are as diverse as cultures, but the idea of the garden is common to various cultures through the ages and across continents. What do gardens tell us about the human condition? How do gardens relate to the individual and the idea of community? How do they reflect philosophical ideas? In which ways do the real and imagined interfere with each other? Is a garden a representation of nature or culture or both? How does a garden relate to spiritual needs and sensual experience (smell, sound, sight, tactile and kinesthetic bodily feeling)? How is the idea of the garden distinguished from but ...\n\n      more description for COREA-AD   56 »\n\n      \n\n\n\nGardens are as diverse as cultures, but the idea of the garden is common to various cultures through the ages and across continents. What do gardens tell us about the human condition? How do gardens relate to the individual and the idea of community? How do they reflect philosophical ideas? In which ways do the real and imagined interfere with each other? Is a garden a representation of nature or culture or both? How does a garden relate to spiritual needs and sensual experience (smell, sound, sight, tactile and kinesthetic bodily feeling)? How is the idea of the garden distinguished from but related to the notion of a natural landscape? We will look at Zen-gardens and rooftop gardens, monastic and palace gardens, sculpture and pleasure gardens, mythic gardens in various religious traditions. The course is conceived as neither a historical survey nor typological compilation but chooses diverse examples of gardens and representations of gardens from various cultures and historical periods in order to reflect on the ways in which gardens reflect the human condition.\n\n      less description for COREA-AD   56 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 57",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20448",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 021",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Eid, Mohamad"
                }
            ],
            "course_name": "",
            "description": "COREA-AD   57\n\n   Touch\n\nIt is easy to have an idea of the effects of significant loss of vision or hearing by closing our eyes or by wearing earplugs. What about a significant loss of the sense of touch? What would that be like? The answer might not come readily due in part to the subtle, effortless performance of the sense of touch. Far from being just an immediate skin sensation, touching is intimately blended into embodied experiences that are affectionate, expressive, personal and interpersonal. Indeed, the haptic modality is the fundamental mode of access to the physical properties of the world. This course prov...\n\n      more description for COREA-AD   57 »\n\n      \n\n\n\nIt is easy to have an idea of the effects of significant loss of vision or hearing by closing our eyes or by wearing earplugs. What about a significant loss of the sense of touch? What would that be like? The answer might not come readily due in part to the subtle, effortless performance of the sense of touch. Far from being just an immediate skin sensation, touching is intimately blended into embodied experiences that are affectionate, expressive, personal and interpersonal. Indeed, the haptic modality is the fundamental mode of access to the physical properties of the world. This course provides a multidisciplinary, cross-cultural introduction to the dynamics and salience of the human sense of touch, and runs a continuous thread for a number of fundamental questions and critical approaches that twenty-first-century haptic scholars embrace. A wide variety of interpretations, disciplines and experiences exploring the symbolic, cultural, ethical, social and technical aspects of haptic communication will be discussed. Topics covered in this course include social and cultural development, memory, learning, digital design, experiences of visual impairment, tactile therapies, human computer interaction, multimodal interaction and sensory substitution, funneling illusion and apparent motion, and privacy and security.\n\n      less description for COREA-AD   57 «",
            "offering": true
        },
        {
            "course_id": "COREA-AD 58",
            "course_name": "J",
            "description": "COREA-AD   58J\n\n   Light\n\nFrom its physical properties that create life to its metaphorical association with beauty and goodness, light is integral to our experience of being human. Playing out over the millennia, from the Chinese tradition of the Lantern Festival at the Lunar New Year to the current production and manufacture of LED components, our relationship with light has played a significant role culturally and materially in our understanding of the world around us. This course will examine the perceptual, psychological, and metaphorical ways in which we encounter light in stories, art and culture. We will examin...\n\n      more description for COREA-AD   58J »\n\n      \n\n\n\nFrom its physical properties that create life to its metaphorical association with beauty and goodness, light is integral to our experience of being human. Playing out over the millennia, from the Chinese tradition of the Lantern Festival at the Lunar New Year to the current production and manufacture of LED components, our relationship with light has played a significant role culturally and materially in our understanding of the world around us. This course will examine the perceptual, psychological, and metaphorical ways in which we encounter light in stories, art and culture. We will examine texts from a variety of cultures that use light and darkness as a metaphor for good and evil and study the works of artists like James Turrell, Anthony McCall, Teddy Lo and Erwin Redl who work directly with light. Celebrations, rituals, and ceremonial use of light like the Diwali and the growth and use of pyrotechnics will be considered.  The class will include a practical component in which students develop their own light-based works leveraging the unique and innovative resources of Shanghai as a means of exploring the materiality of light firsthand.\n\n      less description for COREA-AD   58J «",
            "offering": false
        }
    ]
}