{
    "major_id": "CORE-GG",
    "file": "./2015-2016/Core_(CORE-GG).html",
    "courses": [
        {
            "course_id": "CORE-GG 2001",
            "course_name": "Proseminar:Transcultural Performance",
            "description": "CORE-GG 2001 Proseminar:Transcultural Performance",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2003",
            "course_name": "Proseminar: The Search for Community",
            "description": "CORE-GG 2003 Proseminar: The Search for Community",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2004",
            "course_name": "Proseminar:Performance & Culture of The 20th Cent",
            "description": "CORE-GG 2004 Proseminar:Performance & Culture of The 20th Cent",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2005",
            "course_name": "",
            "description": "CORE-GG 2005\n\n   Proseminar: The Function of Art\n\nHistorical forces are transforming the arts and the roles of artists. New innovations are influencing creativity, producing major changes in the lives and work of artists. This proseminar develops an interdisciplinary approach to an understanding of the arts and artists in a social context. What are the key factors that link the evolution of he arts to ancient even prehistoric times and to the present? Is there continuity between the \"ritual dramas\" of First Peoples and the efforts to create arts based rituals in the present? How are the arts influenced by social change? How are artists interp...\n\n      more description for CORE-GG 2005 »\n\n      \n\n\n\nHistorical forces are transforming the arts and the roles of artists. New innovations are influencing creativity, producing major changes in the lives and work of artists. This proseminar develops an interdisciplinary approach to an understanding of the arts and artists in a social context. What are the key factors that link the evolution of he arts to ancient even prehistoric times and to the present? Is there continuity between the \"ritual dramas\" of First Peoples and the efforts to create arts based rituals in the present? How are the arts influenced by social change? How are artists interpreting and challenging the major social forces transforming the  planet? In what ways are artists creating alternative visions of the future that influence our own daily lives? In exploring these issues, the seminar seeks to illuminate the contributions of art to an understanding of our age. Students produce their own evening of arts performances and projects. Readings may include Rilke's Letters to a Young Poet, Sarton's Journal of a Solitude, Berger's Ways of Seeing or Shape of a Pocket, Chaiken's The Presence of the Actor, Staniszewski's Believing is Seeing, Morrison's Playing in the Dark and Shawn's The Fever. Most important, students develop their own insight, vision and creativity, their own commitment to art and social action through brief writing assignments and class presentations.\n\n      less description for CORE-GG 2005 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2007",
            "course_name": "Proseminar: Amer Society & Culture in Transition",
            "description": "CORE-GG 2007 Proseminar: Amer Society & Culture in Transition \nFor over half a century following World War II, the industrialized Western world experienced unprecedented economic expansion and geopolitical dominance. The Cold War epoch, a period of superpower nuclear threat, turned out to be a time of relative global",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2008",
            "course_name": "Proseminar:Gender in The Arts and Culture",
            "description": "CORE-GG 2008 Proseminar:Gender in The Arts and Culture",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2009",
            "course_name": "",
            "description": "CORE-GG 2009\n\n   Master Thesis & Defense\n\nStudents registering for this course meet in the beginning of the semester with the thesis reviewer to discuss the procedures for organizing and presenting the thesis.  It then becomes an independent project with the student’s adviser to complete the thesis.  Students are required to register for Thesis and Defense when they have completed 37 credits in the M.A. program.  Master’s Thesis and Defense is a required graduate core course for students who started the Gallatin M.A. program in Spring 2013 or earlier.  It will be offered for the last time in Fall 2014.  For more details, please see th...\n\n      more description for CORE-GG 2009 »\n\n      \n\n\n\nStudents registering for this course meet in the beginning of the semester with the thesis reviewer to discuss the procedures for organizing and presenting the thesis.  It then becomes an independent project with the student’s adviser to complete the thesis.  Students are required to register for Thesis and Defense when they have completed 37 credits in the M.A. program.  Master’s Thesis and Defense is a required graduate core course for students who started the Gallatin M.A. program in Spring 2013 or earlier.  It will be offered for the last time in Fall 2014.  For more details, please see the information about degree requirements on the Gallatin Web site.\n\n      less description for CORE-GG 2009 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2011",
            "course_name": "Proseminar: Ways of Knowing",
            "description": "CORE-GG 2011 Proseminar: Ways of Knowing",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2013",
            "course_name": "Proseminar: Performance and Text",
            "description": "CORE-GG 2013 Proseminar: Performance and Text \nThis seminar introduces a range of critical perspectives that can be applied to literary, dramatic, and cinematic texts as well as a variety of performance forms.  Several art forms are interdisciplinary in composition?e.g. inter-textual literature and ex",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2014",
            "course_name": "",
            "description": "CORE-GG 2014\n\n   Proseminar:Globalization: Promises and Discontents\n\nIn popular and scholarly discourse, the term \"globalization\" is widely used to put a name to the shape of the contemporary world. In the realms of advertising, policymaking, politics, academia, and everyday talk, \"globalization\" references the sense that we are now living in a deeply and ever-increasingly interconnected, mobile, and speeded-up world that is unprecedented, fueled by technological innovations and geopolitical and economic transformations. Drawing on perspectives from history, anthropology, cultural and literary studies, geography, political economy, and sociology, this course wi...\n\n      more description for CORE-GG 2014 »\n\n      \n\n\n\nIn popular and scholarly discourse, the term \"globalization\" is widely used to put a name to the shape of the contemporary world. In the realms of advertising, policymaking, politics, academia, and everyday talk, \"globalization\" references the sense that we are now living in a deeply and ever-increasingly interconnected, mobile, and speeded-up world that is unprecedented, fueled by technological innovations and geopolitical and economic transformations. Drawing on perspectives from history, anthropology, cultural and literary studies, geography, political economy, and sociology, this course will explore theories, discourses, and experiences of globalization. Running through the course are three central concerns: 1) exploring claims about the \"new-ness\" of globalization from historical perspectives, 2) examining how a variety of social and cultural worlds mediate globalization and 3) analyzing a contested politics of globalization in which the opportunities for social mobility and transformation are pitted against renewed intensifications of exploitation and vulnerability along long-standing vectors of difference and inequality.  While \"globalization\" is often touted as a \"flattening\" of the world, this course moves beyond such clichés to understand the intersection between large-scale transformations in political economy and culture in and through multiple cultural worlds situated unevenly on the world's map.\n\n      less description for CORE-GG 2014 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2015",
            "course_name": "",
            "description": "CORE-GG 2015\n\n   Proseminar: Community Studies and Action\n\nThis proseminar is designed for students interested broadly in social theory and practice, or more narrowly in community studies and/or community-based action, whether in the social services, education, the media, urban planning, grassroots organizing or political movements. It introduces them to interdisciplinary inquiry and action by using ‘community’ as an example of a complex idea in the social domain: exploring its varied meanings and manifestations from the perspectives of different kinds of theorists—sociologists, psychologists, anthropologists and historians, for example—and examining ...\n\n      more description for CORE-GG 2015 »\n\n      \n\n\n\nThis proseminar is designed for students interested broadly in social theory and practice, or more narrowly in community studies and/or community-based action, whether in the social services, education, the media, urban planning, grassroots organizing or political movements. It introduces them to interdisciplinary inquiry and action by using ‘community’ as an example of a complex idea in the social domain: exploring its varied meanings and manifestations from the perspectives of different kinds of theorists—sociologists, psychologists, anthropologists and historians, for example—and examining the ways different kinds of activists and professionals attempt to shape it. Readings, discussions and projects will engage students in understanding some of the dominant paradigms in social thought and approaches to social action. They will also be encouraged to apply these modes of inquiry and practice to their own goals and plans for the graduate program.\n\n      less description for CORE-GG 2015 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2016",
            "course_name": "Proseminar",
            "description": "CORE-GG 2016 Proseminar",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2017",
            "course_name": "",
            "description": "CORE-GG 2017\n\n   Proseminar: Culture & Society\n\nThis interdisciplinaryseminar will examine a critical debate on culture and society.  We will explore theories emphasizing structural or ?material? determinism, as well as intellectual currents privileging ?cultural? explanations.  Excessive emphasis on the cultural unhelpfully blurs the economic and other aspects of social life, while reductive fixation on economic moorings suggests subordination of social life to the structural imperatives of the market.  The course proposes the conceptual exploration and development of an integrative middle way, toward a more dialectically nuanced understan...\n\n      more description for CORE-GG 2017 »\n\n      \n\n\n\nThis interdisciplinaryseminar will examine a critical debate on culture and society.  We will explore theories emphasizing structural or ?material? determinism, as well as intellectual currents privileging ?cultural? explanations.  Excessive emphasis on the cultural unhelpfully blurs the economic and other aspects of social life, while reductive fixation on economic moorings suggests subordination of social life to the structural imperatives of the market.  The course proposes the conceptual exploration and development of an integrative middle way, toward a more dialectically nuanced understanding of human behaviors, social interactions and their forms of subjectivity.  The central question will be: how are hegemonic meanings produced and made to become a ?normal? part of our political, intellectual, and moral life?  And how do such meaning-making processes shape the organization of spaces, policies and population within dominant discourses of modernity and development, as well as the emergence of forms of resistance to these economic imaginaries and practices. We will analyze the ?cultural political economy? problem, or culture and society, within four possible analytical frameworks: 1. The problem of nationalism and religion.  2. The problem of everyday life.  3. The problem of culture and human rights.  4. The problem of state theory. Reading will include selections from the works of Antonio Gramsci, Eugen Weber, Michel Foucault, Talal Asad, Michel de Certeau, Amartya Sen, James Scott, Max Weber, Emile Durkheim and Karl Marx.  This course is a seminar and active student participation in the course is required.\n\n      less description for CORE-GG 2017 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2018",
            "course_name": "",
            "description": "CORE-GG 2018\n\n   Proseminar: Interdisciplinary Critical Theory in Practice\n\nHistorical and technological developments have changed ideas  about cultural consumption.  Is the mass audience itself a product of the goods and entertainment it consumes (as midcentury ideology theorists believed) or is it an outmoded concept lost in the wake of globalization, the sharp focusing techniques of digital marketing, crowd sourcing, and participatory culture? What are the implications of these developments for aesthetic appreciation, the formation of pleasure and desire, the relationship between culture and politics?  Where do you stand as a critic, scholar, or artist in relation ...\n\n      more description for CORE-GG 2018 »\n\n      \n\n\n\nHistorical and technological developments have changed ideas  about cultural consumption.  Is the mass audience itself a product of the goods and entertainment it consumes (as midcentury ideology theorists believed) or is it an outmoded concept lost in the wake of globalization, the sharp focusing techniques of digital marketing, crowd sourcing, and participatory culture? What are the implications of these developments for aesthetic appreciation, the formation of pleasure and desire, the relationship between culture and politics?  Where do you stand as a critic, scholar, or artist in relation to such questions?  This proseminar attempts to reach students with  interests, practical or theoretical, in one or more of the following fields: media studies, literary and art criticism, history, sociology, anthropology, cultural studies, and philosophy (particularly aesthetics).  Among the topics to be discussed are:  the history of asserted differences between high and low art; the mass reproduction and commodification of art; critical judgement and the differences between fans and experts.  Class readings will include a mix of major theoretical writings, histories, and a variety of primary materials including literary texts, films, and performances.  Authors may include Charles Baudelaire, Willa Cather, Walter Benjamin, Dwight Macdonald, Linda Williams, Henry Jenkins, and Carl Wilson.\n\n      less description for CORE-GG 2018 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2019",
            "course_name": "",
            "description": "CORE-GG 2019\n\n   Proseminar:  Silent Subjects\n\nThis seminar introduces students to critique, a mode of questioning and a practice of analysis that exposes the actions of power and denaturalizes social and political hierarchies. In this context, and drawing on perspectives from history, literature, philosophy, and political and critical theory, this seminar will take up the difficulties of speaking and writing about silence in order to consider the importance of what is unsaid or unsayable for our formation as subjects.  How are our psyches and social worlds formed around a multitude of silences--traumatic, enforced, and/or enabling? In Wes...\n\n      more description for CORE-GG 2019 »\n\n      \n\n\n\nThis seminar introduces students to critique, a mode of questioning and a practice of analysis that exposes the actions of power and denaturalizes social and political hierarchies. In this context, and drawing on perspectives from history, literature, philosophy, and political and critical theory, this seminar will take up the difficulties of speaking and writing about silence in order to consider the importance of what is unsaid or unsayable for our formation as subjects.  How are our psyches and social worlds formed around a multitude of silences--traumatic, enforced, and/or enabling? In Western philosophy and political thought silence has often been figured as the Other of speech and reason, and cast as the domain of the abject or excluded, or associated with catastrophic experiences at the limits of human reason (including the extremities of pain, violence, and death).  In the context of this Continental tradition we will familiarize ourselves with recent scholarship on testimony and the “unspeakable,” while also critiquing the assumption that silence is necessarily solipsistic or signals only the failure of speech or freedom.  Some silences are enjoined or imposed; others, like the recent silent protests of the indignados in Spain and Greece, propose alternative politics and constitute their own communities.  Throughout we will consider how critique can help us recognize and account for the operations of silence and those other concealed or disavowed forces that are in fact inseparable from the everyday workings of language, knowledge, and ideology.\n\n      less description for CORE-GG 2019 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2021",
            "course_name": "",
            "description": "CORE-GG 2021\n\n   Proseminar: Modernity & the Human\n\nThe novel Frankenstein (1818) features an ambitious scientist and his \"creation,\" assembled of pieces of dead human bodies. If Frankenstein still haunts us, it is because it raises some quintessentially modern issues. Modernity has not only reshaped the human; in doing so, it has also produced sustained reflections on the nature of human being. Modernity defines the human differentially, over against non-human nature, with ambiguous results for those values modernity allegedly has championed most robustly: the power of science to control nature, the unlimited potential of reason, the individua...\n\n      more description for CORE-GG 2021 »\n\n      \n\n\n\nThe novel Frankenstein (1818) features an ambitious scientist and his \"creation,\" assembled of pieces of dead human bodies. If Frankenstein still haunts us, it is because it raises some quintessentially modern issues. Modernity has not only reshaped the human; in doing so, it has also produced sustained reflections on the nature of human being. Modernity defines the human differentially, over against non-human nature, with ambiguous results for those values modernity allegedly has championed most robustly: the power of science to control nature, the unlimited potential of reason, the individual as the founding unit of the political, among others. This course is intended as an advanced introduction to interdisciplinary study.  The conjunction of the two terms of our title, one a temporal marker, one designating an ontological-epistemological  category, will not only provide us with a kind of laboratory for thinking interdisciplinarily. Questions we will pursue include: What kind of category is the \"human?\" How does it get constructed? On the basis of what exclusions does it get constructed? How have authors across an array of fields articulated the boundaries between human and nature, human and animal? What are some competing models challenging the humanisms that have underwritten so many modern assumptions? Authors whose work we may examine will include Immanuel Kant, Thomas Paine, Mary Shelley, Karl Marx, H.G.Wells, Bruno Latour, Nikolas Luhmann, Michel  Foucault, Donna Haraway, and Judith Butler.\n\n      less description for CORE-GG 2021 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2022",
            "course_name": "",
            "description": "CORE-GG 2022\n\n   Proseminar:  Studying Social Life:  Theories and Methods\n\nFor students whose programs include investigations of the social world, this course provides an opportunity to grapple with a variety of theoretical approaches to the study of individuals, groups, organizations, cultures and societies, and to engage several methods for conducting research in those realms.  Depending on students’ interests and goals, the theoretical frameworks might include behaviorism (Watson, Skinner), interactionism (GH Mead, Blumer), constructivism (Piaget, Vygotsky, Bruner), conflict theory (Marx, the Frankfurt School), psychodynamics (Freud, Erikson), structuralism (Sauss...\n\n      more description for CORE-GG 2022 »\n\n      \n\n\n\nFor students whose programs include investigations of the social world, this course provides an opportunity to grapple with a variety of theoretical approaches to the study of individuals, groups, organizations, cultures and societies, and to engage several methods for conducting research in those realms.  Depending on students’ interests and goals, the theoretical frameworks might include behaviorism (Watson, Skinner), interactionism (GH Mead, Blumer), constructivism (Piaget, Vygotsky, Bruner), conflict theory (Marx, the Frankfurt School), psychodynamics (Freud, Erikson), structuralism (Saussure, Levi-Strauss), and/or postmodernism (Foucault, Baudrillard).  The class will explore the different premises, logics and arguments of various schools of thought.  Moreover, members will conduct pilot-level research using methods appropriate to their own problematics: e.g., ethnographic observations, interviews, discourse analysis, document study, visual anthropology, psychometric tests, and/or case studies.  The course will be a useful preliminary for students expecting to do a research thesis focused on questions about the social world.\n\n      less description for CORE-GG 2022 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2023",
            "course_name": "",
            "description": "CORE-GG 2023\n\n   Proseminar: Works-In-Progress: Criticism and The Creative Process\n\nHistorically, criticism has evoked in the artist a myriad of reactions from antagonism to apathy and everything between.  Yet despite the inherent vulnerability that comes with having one's work criticized, it is possible to constructively engage with and learn from criticism.  This proseminar is designed for students interested in the visual, literary or performing arts.  It is primarily intended for practicing artist/scholars who wish to explore how criticism may productively influence their creative process as well as understand their artwork and the role of criticism in a broader historica...\n\n      more description for CORE-GG 2023 »\n\n      \n\n\n\nHistorically, criticism has evoked in the artist a myriad of reactions from antagonism to apathy and everything between.  Yet despite the inherent vulnerability that comes with having one's work criticized, it is possible to constructively engage with and learn from criticism.  This proseminar is designed for students interested in the visual, literary or performing arts.  It is primarily intended for practicing artist/scholars who wish to explore how criticism may productively influence their creative process as well as understand their artwork and the role of criticism in a broader historical and theoretical context.  In this class we will survey a range of readings that reveal issues about the history and changing purposes of criticism.  Central to our  exploration, however, is the requirement that each student create a piece of art (a screenplay, musical composition, painting, theatre performance, or other medium determined by the student’s concentration), which will receive criticism at various stages of development from a wide hierarchy of sources: peer, faculty, critics and experts in the field.  Over the course of the semester, students will further develop their artwork in response to critique, while concurrently writing critically about their own work and work of their classmates.  This iterative process of creation and criticism will provide an opportunity to deeply examine, through both theory and practice, the intersections between artist, audience, scholar and critic.   Readings may include: John Berger’s Ways of Seeing; Hans Hofmann’s Search for the Real; George Bernard Shaw’s The Sanity of Art; Tolstoy’s What is Art?; Oscar Wilde’s The Critic as Artist; Liz Lerman’s Critical Response; Richard Schechner’s Between Theatre & Anthropology; W.M. Shrum’s  Fringe and Fortune: The Role of Critics in High and Popular Art.\n\n      less description for CORE-GG 2023 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2024",
            "course_name": "",
            "description": "CORE-GG 2024\n\n   Proseminar: Everyday Life\n\nNothing is more taken-for-granted than everyday life: dinner-table conversations, workplace activities, shopping-mall transactions, sidewalk encounters. And yet each situation is shaped by a complex intersection of social forces, individual personalities, moment-to-moment decisions, cultural memes, and institutional histories. This course, designed for MA students in the social sciences and professions, will introduce them to a variety of ways of understanding and analyzing these sorts of quotidian experiences. We will examine talk and non-verbal behavior as they inform activities and relation...\n\n      more description for CORE-GG 2024 »\n\n      \n\n\n\nNothing is more taken-for-granted than everyday life: dinner-table conversations, workplace activities, shopping-mall transactions, sidewalk encounters. And yet each situation is shaped by a complex intersection of social forces, individual personalities, moment-to-moment decisions, cultural memes, and institutional histories. This course, designed for MA students in the social sciences and professions, will introduce them to a variety of ways of understanding and analyzing these sorts of quotidian experiences. We will examine talk and non-verbal behavior as they inform activities and relationships; we will look at the ways practical intelligence operates in different situations; we will track cultural differences in everyday behavior. We will consider the ways in which larger social structures and processes – class, race, gender, and so on – are produced, performed, and changed in the course of everyday life, as well as the ways they shape people’s actions and thoughts. Along the way, we will tackle such issues as human agency vs. structural determinism; the processes of social change; and the construction of identity, self, and nation. While the immediate purpose of the course is to unpack the dynamics of everyday life, the larger goal is to consider several broad approaches to social theory and research: the positivist, the interpretivist, and the poststructuralist. These explorations will give students an opportunity to try out various perspectives on their own studies and professional work, and may move them toward clearer conceptions of their theses. Readings may include sections from Karp et al.’s Sociology in Everyday Life ; Rogoff and Lave’s Everyday Cognition ; Geertz’s The Interpretation of Cultures ; Erickson’s Talk and Social Theory , and de Certeau’s The Practice of Everyday Life .\n\n      less description for CORE-GG 2024 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2025",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4905",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC1",
                    "time": "Tue 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Lukose, Ritty"
                }
            ],
            "course_name": "",
            "description": "CORE-GG 2025\n\n   Proseminar: Theory and Methods in the Social Sciences: Interdisciplinary Perspectives\n\nFor students whose programs have included investigations of the social world, this course provides an opportunity to grapple with a variety of theoretical approaches to the study of individuals, groups, organizations, cultures and societies, and to engage several methods for conducting research in those realms.  Depending on students’ interests and goals, the theoretical frameworks might include behaviorism (Watson, Skinner), interactionism (GH Mead, Blumer), constructivism (Piaget, Vygotsky, Bruner), conflict (Marx, the Frankfurt School), psychodynamics (Freud, Erikson), structuralism (Saussu...\n\n      more description for CORE-GG 2025 »\n\n      \n\n\n\nFor students whose programs have included investigations of the social world, this course provides an opportunity to grapple with a variety of theoretical approaches to the study of individuals, groups, organizations, cultures and societies, and to engage several methods for conducting research in those realms.  Depending on students’ interests and goals, the theoretical frameworks might include behaviorism (Watson, Skinner), interactionism (GH Mead, Blumer), constructivism (Piaget, Vygotsky, Bruner), conflict (Marx, the Frankfurt School), psychodynamics (Freud, Erikson), structuralism (Saussure, Levi-Strauss), and/or postmodernism (Foucault, Baudrillard).  The class will explore the different premises, logics and arguments of various schools of thought.  Moreover, members will conduct pilot-level research using methods appropriate to their problematics: e.g., ethnographic observations, interviews, discourse analysis, document study, visual anthropology, psychometric tests, and/or case studies.  The course will be a useful preliminary for students expecting to do a research thesis focused on questions about the social world.\n\n      less description for CORE-GG 2025 «",
            "offering": true
        },
        {
            "course_id": "CORE-GG 2026",
            "course_name": "",
            "description": "CORE-GG 2026\n\n   Proseminar: Theory and Methods in the  Humanities:  Traditions or Interpretation\n\nThis interdisciplinary seminar for incoming M.A. students introduces a series of key twentieth and twenty-first century theoretical debates about the subject and object of interpretation in the modern humanities.  The course begins with discussions concerning author, text, and context that took place within the British and American literary circles of the 1940s, ’50s, and ’60s – clashes over the origin and location of meaning that challenged the ways in which artists and critics had traditionally conceived of their work.  These debates led to broad reevaluations – sometimes quite radical – of ...\n\n      more description for CORE-GG 2026 »\n\n      \n\n\n\nThis interdisciplinary seminar for incoming M.A. students introduces a series of key twentieth and twenty-first century theoretical debates about the subject and object of interpretation in the modern humanities.  The course begins with discussions concerning author, text, and context that took place within the British and American literary circles of the 1940s, ’50s, and ’60s – clashes over the origin and location of meaning that challenged the ways in which artists and critics had traditionally conceived of their work.  These debates led to broad reevaluations – sometimes quite radical – of the interpretive act itself within both the academic and public spheres.  The course continues with close analysis of the so-called “Linguistic Turn” of the 1970s and early ’80s, which both reflected and fomented broader shifts and revolutions of thought within the contemporary western world.  The final weeks of the semester culminate with an exploration of critical interpretive trends today: theories of culture, narrative, memory, representation, power, disciplinarity, and interdisciplinarity.  Students will emerge from the course with a stronger historical grasp of the interpretive theory of the past century, and will be challenged to use the course’s introductory framework to identify and to develop further the theoretical underpinnings of their own individual graduate work.  Readings will be applicable to all humanities fields and shall include cultural critics such as Bhabha, Butler, and Fish, as well as more philosophical voices such as Barthes, Derrida, Spivak, and Zizek.  Guest appearances by Gallatin faculty will facilitate a broad interdisciplinary discussion of not only the theory, but its application in research and practice.\n\n      less description for CORE-GG 2026 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2027",
            "course_name": "",
            "description": "CORE-GG 2027\n\n   Proseminar: Theory and Methods in the Arts:  Interdisciplinary Perspectives\n\nTheory and critique are not only expected from so-called \"serious artists\", they are also being produced and consumed at increasingly rapid rates by students, established artists, historians, critics, and others.  This course will investigate the foundations and developments of art criticism and analysis. Emphasis will be placed on addressing what it means to be \"critical\" and how analysis has been influenced or shaped by critical theory, semiotics and psychoanalysis. The course will consider how these disciplines have been used in the writings and artworks by figures such as Nicolas Bourriaud...\n\n      more description for CORE-GG 2027 »\n\n      \n\n\n\nTheory and critique are not only expected from so-called \"serious artists\", they are also being produced and consumed at increasingly rapid rates by students, established artists, historians, critics, and others.  This course will investigate the foundations and developments of art criticism and analysis. Emphasis will be placed on addressing what it means to be \"critical\" and how analysis has been influenced or shaped by critical theory, semiotics and psychoanalysis. The course will consider how these disciplines have been used in the writings and artworks by figures such as Nicolas Bourriaud, Julia Kristeva, Meyer Schapiro, Hans Haake, Mary Kelly, Dan Graham, and Andrea Fraser.  In this instance artistic practice is viewed as involving both creating artworks and writing/theorizing. The course will stress the role of discourse in art while also allowing allowing practitioners to produce and present art projects.\n\n      less description for CORE-GG 2027 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2028",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17000",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC3",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Hornick, Karen"
                }
            ],
            "course_name": "Proseminar: Theory and Methods in the Humanities: Interdisciplinary Perspectives",
            "description": "CORE-GG 2028 Proseminar: Theory and Methods in the Humanities: Interdisciplinary Perspectives",
            "offering": true
        },
        {
            "course_id": "CORE-GG 2029",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17005",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 512",
                    "time": "Tue 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Katchadourian, Nina"
                }
            ],
            "course_name": "",
            "description": "CORE-GG 2029\n\n   Proseminar in the Arts: Why Do You Want to Make It, andHow Can You Make It Better?\n\nThis course is intended for Gallatin graduate students with a creative project component to their graduate study. At its heart, the class aims to pose difficult and productive questions that will help you understand your tendencies and priorities as an artist, the methods you employ, and where these are in the service of the work as opposed to where they stand in the way. The class requires rigorous and individualized research into your sources of artistic influence with an emphasis on analytical thinking about the methods and strategies employed by those artists or thinkers you consider key i...\n\n      more description for CORE-GG 2029 »\n\n      \n\n\n\nThis course is intended for Gallatin graduate students with a creative project component to their graduate study. At its heart, the class aims to pose difficult and productive questions that will help you understand your tendencies and priorities as an artist, the methods you employ, and where these are in the service of the work as opposed to where they stand in the way. The class requires rigorous and individualized research into your sources of artistic influence with an emphasis on analytical thinking about the methods and strategies employed by those artists or thinkers you consider key influences. The course includes assignments that explore your existing strategies and subject matter in order to understand what has motivated and generated the work thus far. Other assignments push students to work against the grain of their usual modes in order to discover new ways of working and to undermine default strategies. Towards the end of the term, the accumulated insights will be channeled into writing about your work that will be useful in the future context of an artist’s statement or artistic aims essay. In the personal and lab-like atmosphere that this course hopes to cultivate, the class also aims to connect Gallatin graduate students to each other’s work and practice, and to take advantage of the enormous importance that peer input and critique can have on work in progress. Possible side effects include: focused engagement, enhanced motivation, collaboration.\n\n      less description for CORE-GG 2029 «",
            "offering": true
        },
        {
            "course_id": "CORE-GG 2035",
            "course_name": "Master' Thesis and Defense",
            "description": "CORE-GG 2035 Master' Thesis and Defense \nStudents registering for this course meet in the beginning of the semester with the thesis reviewer to discuss the procedures for organizing and presenting the thesis. It then becomes an independent project with the student's adviser to complete the thesis. Students are required to register for Thesis and Defense when they have completed 37 credits in the M.A. program. This course is required for completion of the master's degree program.",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2040",
            "course_name": "Thesis Advisement",
            "description": "CORE-GG 2040 Thesis Advisement \nStudents who do not defend the thesis successfully or have not completed the thesis during the semester in which they are registered for Master's Thesis and Defense, CORE-GG 2335, are required to register for Thesis Advisement each semester (including the summer, for students graduating in September) until the thesis is defended.  Credits earned through Thesis Advisement are not included in the 40-credit requirement for the master's degree. The special tuition rate for Thesis Advisement is $400.00 plus a non-refundable registration and services fee",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2115",
            "course_name": "",
            "description": "CORE-GG 2115\n\n   Review of The Literature\n\nBefore starting the thesis, students are required to conduct an independent study—usually with their adviser—in which they find, read and critique a substantial body of scholarship related to the thesis.  The purpose of this independent study is to ensure that the student is familiar with the previous scholarly work that forms a context for the thesis.  The required work for Review of the Literature is a critical essay and a bibliography. The aim of the essay is to identify the categories of pertinent studies; report on major concepts, theories, debates, trends, and gaps in the field; and plac...\n\n      more description for CORE-GG 2115 »\n\n      \n\n\n\nBefore starting the thesis, students are required to conduct an independent study—usually with their adviser—in which they find, read and critique a substantial body of scholarship related to the thesis.  The purpose of this independent study is to ensure that the student is familiar with the previous scholarly work that forms a context for the thesis.  The required work for Review of the Literature is a critical essay and a bibliography. The aim of the essay is to identify the categories of pertinent studies; report on major concepts, theories, debates, trends, and gaps in the field; and place the thesis topic in relation to earlier studies.  The adviser sets the length of the paper, but it is typically more than 25 pages.  Review of the Literature is a required graduate core course for students who started the Gallatin M.A. program in Spring 2013 or earlier.  It will be offered for the last time in Spring 2014.  For more details, please see the information about degree requirements on the Gallatin Web site.\n\n      less description for CORE-GG 2115 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2225",
            "course_name": "",
            "description": "CORE-GG 2225\n\n   Master's Thesis Seminar\n\nThis course engages students in the conceptual and technical processes leading to a thesis: articulating a core problem, reviewing appropriate literatures, designing effective methods, and constructing persuasive analyses. Focusing on students' own work, the seminar examines the conventions of scholarly discourse, strategies of analysis and argumentation, and the ways in which writing can serve as a means to discover ideas. The thesis process in Gallatin is reviewed and clarified.  Sections of the course focus on different thesis formats (research, artistic, project) and broad disciplinary cat...\n\n      more description for CORE-GG 2225 »\n\n      \n\n\n\nThis course engages students in the conceptual and technical processes leading to a thesis: articulating a core problem, reviewing appropriate literatures, designing effective methods, and constructing persuasive analyses. Focusing on students' own work, the seminar examines the conventions of scholarly discourse, strategies of analysis and argumentation, and the ways in which writing can serve as a means to discover ideas. The thesis process in Gallatin is reviewed and clarified.  Sections of the course focus on different thesis formats (research, artistic, project) and broad disciplinary categories (arts, humanities, social sciences), but all take the student to the stage of preparing a thesis proposal.\n\n      less description for CORE-GG 2225 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2335",
            "course_name": "Master's Thesis and Defense",
            "description": "CORE-GG 2335 Master's Thesis and Defense \nIn this course supervised by the student's adviser, MA candidates complete and defend their theses. Students registering for this course must also attend a 75-minute workshop, offered only once at the beginning of the semester, to discuss the procedures for organizing and presenting the thesis.  The workshop is led by one of the program directors.  Students must register for Thesis and Defense when they have completed 37 credits in the M.A. program.  This course is required for completion of the master’s degree program.",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2340",
            "course_name": "Thesis Advisement",
            "description": "CORE-GG 2340 Thesis Advisement \nStudents who do not defend the thesis successfully or have not completed the thesis during the semester in which they are registered for Master's Thesis and Defense, CORE-GG 2335, are required to register for Thesis Advisement each semester (including the summer, for students graduating in September) until the thesis is defended.  Credits earned through Thesis Advisement are not included in the 40-credit requirement for the master's degree. The special tuition rate for Thesis Advisement is $400.00 plus a non-refundable registration and services fee.",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2401",
            "course_name": "",
            "description": "CORE-GG 2401\n\n   Thesis Proposal seminar\n\nAs the first step in the sequence leading to the thesis, the Thesis Proposal Seminar will move students toward the completion of an acceptable thesis proposal. Students learn about the structure and content of the thesis proposal as they:  (1) consider ways of integrating their work and articulating a core problem; (2) discuss the conventions of scholarly discourse, documentation, and argumentation; and (3) formulate goals that are ambitious but also achievable in a reasonable amount of time and in accordance with the availability of resources.  Multiple sections of this course will be offered...\n\n      more description for CORE-GG 2401 »\n\n      \n\n\n\nAs the first step in the sequence leading to the thesis, the Thesis Proposal Seminar will move students toward the completion of an acceptable thesis proposal. Students learn about the structure and content of the thesis proposal as they:  (1) consider ways of integrating their work and articulating a core problem; (2) discuss the conventions of scholarly discourse, documentation, and argumentation; and (3) formulate goals that are ambitious but also achievable in a reasonable amount of time and in accordance with the availability of resources.  Multiple sections of this course will be offered for students in the Social Sciences and Professions, the Humanities, and the Arts. Please note: unlike other requirements in the thesis and defense sequence of classes, the Thesis Proposal Seminar is offered only once a year in the spring semester. The course will combine classroom instruction and affinity-group work as well as special events and activities. In some weeks the course sections will meet separately, in other weeks all sections will come together for plenary sessions that may include events and activities such as guest lectures, library visits, and human subjects research instruction. Possible texts will include The Craft of Research (Booth, Colomb, and Williams).  To pass, students must submit an advanced draft of the thesis proposal that has been read and approved by the adviser.\n\n      less description for CORE-GG 2401 «",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2402",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4914",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CORE-GG 2402\n\n   Master's Thesis I\n\nIn Master’s Thesis I, students will complete the basic research for and begin drafting the thesis. The course, which is a two credit course supervised by the student’s advisor, will entail independent work, supported by the writing resources of the MA Program.  Students: (1) must attend a meeting (registered students will be emailed information about place and time at the beginning of the semester) with the MA Program faculty and staff to discuss the overall goals of the course; (2) immerse themselves in the relevant scholarly discourses and literatures and begin drafting the thesis and, in th...\n\n      more description for CORE-GG 2402 »\n\n      \n\n\n\nIn Master’s Thesis I, students will complete the basic research for and begin drafting the thesis. The course, which is a two credit course supervised by the student’s advisor, will entail independent work, supported by the writing resources of the MA Program.  Students: (1) must attend a meeting (registered students will be emailed information about place and time at the beginning of the semester) with the MA Program faculty and staff to discuss the overall goals of the course; (2) immerse themselves in the relevant scholarly discourses and literatures and begin drafting the thesis and, in the case of artistic theses, developing the artwork and accompanying research essay ; (3) meet with their advisers, on a regular basis, to consult on the content, logic, organization and methods for the thesis; (4) draw on the resources of the MA Program (e.g. individual consultations, organized peer writing groups, themed writing workshops) led by Gallatin M.A. program staff; (5) and at the end of the semester, present their work in progress by participating in a forum organized by Gallatin and attended by faculty and peers.   To pass this course, in addition to fulfilling the presentation requirement, students must demonstrate significant progress toward completing the thesis.  For more details, please see the additional information about Master’s Thesis I on the Gallatin website.\n\n      less description for CORE-GG 2402 «",
            "offering": true
        },
        {
            "course_id": "CORE-GG 2403",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "18904",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "18918",
                    "section": "013",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CORE-GG 2403\n\n   Master's Thesis II\n\nTo pass this class, which is a two-credit course supervised by the student’s advisor, the student must submit and defend thesis.  In the first months of the semester, the student continues to work in collaboration with the adviser to complete the thesis paper or, in the case of an artistic thesis, the artwork as well as the related research essay and other required accompanying materials. All students are required to attend one meeting at the start of the semester (registered students will be emailed information about place and time at the beginning of the semester) with MA Program faculty and...\n\n      more description for CORE-GG 2403 »\n\n      \n\n\n\nTo pass this class, which is a two-credit course supervised by the student’s advisor, the student must submit and defend thesis.  In the first months of the semester, the student continues to work in collaboration with the adviser to complete the thesis paper or, in the case of an artistic thesis, the artwork as well as the related research essay and other required accompanying materials. All students are required to attend one meeting at the start of the semester (registered students will be emailed information about place and time at the beginning of the semester) with MA Program faculty and staff to discuss the overall goals of the course. Finally, students should draw on the resources of the MA Program (individual consultations with writing specialists, peer writing groups, themed writing workshops) during the writing process. As prescribed by the online Thesis and Defense calendar (http://www.gallatin.nyu.edu/academics/graduate/thesis/calendars.html), students must receive approval for all work from their adviser far enough in advance of the defense so that the other panelists will have at least four weeks to read and inspect the submission. For more details, please see the additional information about Master's Thesis II on the Gallatin website as well as the thesis and defense calendar and submission forms.\n\n      less description for CORE-GG 2403 «",
            "offering": true
        },
        {
            "course_id": "CORE-GG 2550",
            "course_name": "Fiction Writing",
            "description": "CORE-GG 2550 Fiction Writing",
            "offering": false
        },
        {
            "course_id": "CORE-GG 2999",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4903",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Thesis Advisement",
            "description": "CORE-GG 2999 Thesis Advisement \nStudents who do not defend the thesis successfully or have not completed the thesis during the semester in which they are registered for Master's Thesis and Defense, CORE-GG 2335, or Master's Thesis II, CORE-GG 2403, are required to register for Thesis Advisement each semester (including the summer, for students graduating in September) until the thesis is defended.  Credits earned through Thesis Advisement are not included in the 40-credit requirement for the master's degree. The special tuition rate for Thesis Advisement is $400.00 plus a non-refundable registration and services fee.",
            "offering": true
        }
    ]
}