{
    "major_id": "CAOS-GA",
    "file": "./2015-2016/Ctr_for_Atmosphere_Ocean_Sci_(CAOS-GA).html",
    "courses": [
        {
            "course_id": "CAOS-GA 1001",
            "course_name": "",
            "description": "CAOS-GA 1001\n\n   Geophysical Fluid Dynamics\n\nThis course serves as an introduction to the fundamentals of geophysical fluid dynamics.  No prior knowledge of fluid dynamics will be assumed, but the course will move quickly into the subtopic of rapidly rotating, stratified flows.  Topics to be covered include (but are not limited to): the advective derivative, momentum conservation and continuity, the rotating Navier-Stokes equations and non-dimensional parameters, equations of state and thermodynamics of Newtonian fluids, atmospheric and oceanic basic states, the fundamental balances (thermal wind, geostrophic and hydrostatic), the rotati...\n\n      more description for CAOS-GA 1001 »\n\n      \n\n\n\nThis course serves as an introduction to the fundamentals of geophysical fluid dynamics.  No prior knowledge of fluid dynamics will be assumed, but the course will move quickly into the subtopic of rapidly rotating, stratified flows.  Topics to be covered include (but are not limited to): the advective derivative, momentum conservation and continuity, the rotating Navier-Stokes equations and non-dimensional parameters, equations of state and thermodynamics of Newtonian fluids, atmospheric and oceanic basic states, the fundamental balances (thermal wind, geostrophic and hydrostatic), the rotating shallow water model, vorticity and potential vorticity, inertia-gravity waves, geostrophic adjustment, the quasi-geostrophic approximation and other small-Rossby number limits, Rossby waves, baroclinic and barotropic instabilities, Rayleigh and Charney-Stern theorems, geostrophic turbulence.  Students will be assigned bi-weekly homework assignments and some computer exercises, and will be expected to complete a final project or exam.\n\n      less description for CAOS-GA 1001 «",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 1002",
            "course_name": "",
            "description": "CAOS-GA 1002\n\n   Ocean Dynamics\n\nThe goal of this course is to introduce students to modern dynamical oceanography, with a focus on mathematical models for observed phenomena. The lectures will cover the observed structure of the ocean, the thermodynamics of sea-water, the equations of motion for rotating-stratified flow, and the most useful approximations thereof: the primitive, planetary geostrophic, and quasi-geostrophic equations. The lectures will demonstrate how these approximations can be used to understand boundary layers, wind-driven circulation, buoyancy-driven circulation, oceanic waves (Rossby, Kelvin and inertia-...\n\n      more description for CAOS-GA 1002 »\n\n      \n\n\n\nThe goal of this course is to introduce students to modern dynamical oceanography, with a focus on mathematical models for observed phenomena. The lectures will cover the observed structure of the ocean, the thermodynamics of sea-water, the equations of motion for rotating-stratified flow, and the most useful approximations thereof: the primitive, planetary geostrophic, and quasi-geostrophic equations. The lectures will demonstrate how these approximations can be used to understand boundary layers, wind-driven circulation, buoyancy-driven circulation, oceanic waves (Rossby, Kelvin and inertia-gravity), potential vorticity dynamics, theories for the observed upper-ocean stratification (the thermocline), and for the abyssal circulation. . Students should have some knowledge in geophysical fluid dynamics before taking this course.  Throughout the lectures, the interplay between observational, theoretical, and modeling approaches to problems in oceanography will be highlighted.\n\n      less description for CAOS-GA 1002 «",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 1003",
            "course_name": "",
            "description": "CAOS-GA 1003\n\n   Atmospheric Dynamics\n\nThis course offers a general overview of the physical processes that determine the state of the Earth atmosphere. The focus here is to describe the main features of the planetary circulation, and to explain how they arise as a dynamical response of the atmosphere to different external forcings such as solar radiation or topography. Students should have some knowledge in geophysical fluid dynamics before taking this course. Topics to be covered include: solar forcing, the mean-state of the atmosphere, Hadley and monsoonal circulations, dynamics of the midlatitudes stormtracks, energetics, zonal...\n\n      more description for CAOS-GA 1003 »\n\n      \n\n\n\nThis course offers a general overview of the physical processes that determine the state of the Earth atmosphere. The focus here is to describe the main features of the planetary circulation, and to explain how they arise as a dynamical response of the atmosphere to different external forcings such as solar radiation or topography. Students should have some knowledge in geophysical fluid dynamics before taking this course. Topics to be covered include: solar forcing, the mean-state of the atmosphere, Hadley and monsoonal circulations, dynamics of the midlatitudes stormtracks, energetics, zonally asymmetric circulations, equatorial dynamics, and the interaction between moist convection and large-scale flow. Students will be assigned bi-weekly homework assignments and some computer exercises, and will be expected to complete a final project or exam.\n\n      less description for CAOS-GA 1003 «",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 1004",
            "course_name": "",
            "description": "CAOS-GA 1004\n\n   Applied Mathematics in Atmosphere Ocean Science\n\nThe aim of the course is to provide a concise introduction to deterministic and stochastic methods of applied mathematics that are relevant to theoretical atmosphere ocean science.  On the deterministic side this includes scaling, perturbation methods, and multi-scale techniques.  On the stochastic side it inclThe aim of the course is to provide a concise introduction to deterministic and stochastic methods of applied mathematics that are relevant to theoretical atmosphere ocean science.  On the deterministic side this includes scaling, perturbation methods, and multi-scale techniques.  On the...\n\n      more description for CAOS-GA 1004 »\n\n      \n\n\n\nThe aim of the course is to provide a concise introduction to deterministic and stochastic methods of applied mathematics that are relevant to theoretical atmosphere ocean science.  On the deterministic side this includes scaling, perturbation methods, and multi-scale techniques.  On the stochastic side it inclThe aim of the course is to provide a concise introduction to deterministic and stochastic methods of applied mathematics that are relevant to theoretical atmosphere ocean science.  On the deterministic side this includes scaling, perturbation methods, and multi-scale techniques.  On the stochastic side it includes the representation and analysis of simple random processes and an introduction to stochastic differential equations.\n\n      less description for CAOS-GA 1004 «",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 2001",
            "course_name": "",
            "description": "CAOS-GA 2001\n\n   Climate Dynamics\n\nThe goal of this course is to introduce students to the fundamental principles underlying climate dynamics. The course is primarily lecture oriented but with a laboratory component. Lectures will focus on introducing the main concepts of atmosphere/ocean dynamics while a limited set of laboratory experiments will reinforce the material presented in the lectures. A series of six classical models in climate dynamics will be presented: radiative convective, energy balance, mid-latitude ocean, equatorial ocean, El Nino and simple stochastic climate models. Throughout the lectures, the interplay be...\n\n      more description for CAOS-GA 2001 »\n\n      \n\n\n\nThe goal of this course is to introduce students to the fundamental principles underlying climate dynamics. The course is primarily lecture oriented but with a laboratory component. Lectures will focus on introducing the main concepts of atmosphere/ocean dynamics while a limited set of laboratory experiments will reinforce the material presented in the lectures. A series of six classical models in climate dynamics will be presented: radiative convective, energy balance, mid-latitude ocean, equatorial ocean, El Nino and simple stochastic climate models. Throughout the lectures, the interplay between observational, theoretical, and modeling approaches toward the understanding of climate dynamics will be highlighted. The laboratory component will involve a technical introduction and a series of numerical experiments with the models which will also form part of the assignments. Assignments will also explore the theoretical basis for the models studied.\n\n      less description for CAOS-GA 2001 «",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 2002",
            "course_name": "Vortex Dynamics",
            "description": "CAOS-GA 2002 Vortex Dynamics \nVortices are the basic building blocks of nonlinear fluid dynamics.  This class will look at vortex dynamics from a broad perspective that includes asymptotics, statistics, and numerics.  Some special emphasis is on two-dimensional flows and geophysical applications in atmosphere ocean dynamics, but the choice of topics is general enough to make this class suitable for any graduate student with an interest in fundamental fluid dynamics.",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 2003",
            "course_name": "",
            "description": "CAOS-GA 2003\n\n   Ice Dynamics\n\nThis course introduces students to fundamental principles underlying the behavior and impact of ice within the climate system.  The course is primarily lecture oriented but with a significant numerical laboratory component. Lectures focus on introducing the main mathematical and physical concepts involving ice, while a relatively complete set of This course introduces students to fundamental principles underlying the behavior and impact of ice within the climate system.  The course is primarily lecture oriented but with a significant numerical laboratory component. Lectures focus on introducin...\n\n      more description for CAOS-GA 2003 »\n\n      \n\n\n\nThis course introduces students to fundamental principles underlying the behavior and impact of ice within the climate system.  The course is primarily lecture oriented but with a significant numerical laboratory component. Lectures focus on introducing the main mathematical and physical concepts involving ice, while a relatively complete set of This course introduces students to fundamental principles underlying the behavior and impact of ice within the climate system.  The course is primarily lecture oriented but with a significant numerical laboratory component. Lectures focus on introducing the main mathematical and physical concepts involving ice, while a relatively complete set of numerical laboratory experiments will reinforce the material presented in the lectures. Topics include: microscale ice properties, sea ice thermodynamics and dynamics, ice sheets and their extensions as floating ice, permafrost environments, and snow.\n\n      less description for CAOS-GA 2003 «",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 2004",
            "course_name": "",
            "description": "CAOS-GA 2004\n\n   Lab Experiments in Atmosphere Ocean Science\n\nThe purpose of this course is to introduce students to the instrumentation used in collecting basic data of the earth?s atmosphere, oceans, and cryosphere.  Most of our fundamental knowledge of the earth?s physical environment has been gained from observations taken over the last few decades, using a wide variety of observational techniques ranging from in situ observations at the sea floor to remote sensing satellites at high altitudes in the atmosphere.  In this course the student is introduced to basic meteorological instrumentation using a hands-on approach with equipment on a rooftop, and...\n\n      more description for CAOS-GA 2004 »\n\n      \n\n\n\nThe purpose of this course is to introduce students to the instrumentation used in collecting basic data of the earth?s atmosphere, oceans, and cryosphere.  Most of our fundamental knowledge of the earth?s physical environment has been gained from observations taken over the last few decades, using a wide variety of observational techniques ranging from in situ observations at the sea floor to remote sensing satellites at high altitudes in the atmosphere.  In this course the student is introduced to basic meteorological instrumentation using a hands-on approach with equipment on a rooftop, and basic oceanographic instrumentation deployed in the nearby Hudson estuary.  To help understand and reinforce the underlying theoretical concepts of geophysical fluid dynamics as presented in other course work, the students will operate a laboratory turntable and perform experiments that demonstrate the roles of rotation and stratification in atmospheric and oceanic circulations on a wide range of spatial and temporal scales.  Students will complete an individually-assigned laboratory experiment project.\n\n      less description for CAOS-GA 2004 «",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 2005",
            "course_name": "Atmosphere-Ocean Data Analysis",
            "description": "CAOS-GA 2005 Atmosphere-Ocean Data Analysis \nAn enormous amount of data is gathered worldwide, every day, on the state of various atmospheric and oceanic variables. These data can be used to forecast the weather, to make predictions on climate trends, and to build and validate theories on climate dynamics. This course introduces the student to data analysis for these types of data based on statistical methods and eigen techniques.",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 3001",
            "course_name": "Adv Tpcs Atmosphere Dynamics:",
            "description": "CAOS-GA 3001 Adv Tpcs Atmosphere Dynamics: \nProvides the opportunity for intensive study of specific topics in atmosphere dynamics and focuses on a different theme or topic each semester. The specific topic is listed in each semester?s course schedule.",
            "offering": false
        },
        {
            "course_id": "CAOS-GA 3002",
            "course_name": "Adv Tpcs Ocean Dynamics:",
            "description": "CAOS-GA 3002 Adv Tpcs Ocean Dynamics: \nProvides the opportunity for intensive study of specific topics in ocean dynamics and focuses on a different theme or topic each semester. The specific topic is listed in each semester?s course schedule.",
            "offering": false
        }
    ]
}