{
    "major_id": "ECED-GE",
    "file": "./2015-2016/Early_Childhood_(ECED-GE).html",
    "courses": [
        {
            "course_id": "ECED-GE 2002",
            "course_name": "Integ Sem in Early Child Educ I",
            "description": "ECED-GE 2002 Integ Sem in Early Child Educ I \nFocus on students' evolving teaching philosophy, practices, and research understandings as reflective practitioners based on their field work. Selected community visits.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2003",
            "course_name": "Integ Sem in Early Child Educ II",
            "description": "ECED-GE 2003 Integ Sem in Early Child Educ II \nExtension of work in Integrating Seminar I encouraging deeper understanding and further practices. Focus on development as teach-researcher.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2004",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3389",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 366",
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Alter, Mark"
                }
            ],
            "course_name": "Integ Sem in Early Child Educ III",
            "description": "ECED-GE 2004 Integ Sem in Early Child Educ III \nExtension of work in Integrating Seminar II encouraging examination of practices in early childhood settings through previously acquired skills as teaching-researcher. Exploration of opportunities for advocacy on behalf of children and their families.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2012",
            "course_name": "Multcult Persp Soc Study Early Chldhd",
            "description": "ECED-GE 2012 Multcult Persp Soc Study Early Chldhd \nCurrent theories and practices in multicultural and anti-bias education. Reflection on self and others leading to a critical examination of multiple perspectives. Development of transformative multicultural curricula.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2015",
            "course_name": "Child Study for Early Childhood Teachers",
            "description": "ECED-GE 2015 Child Study for Early Childhood Teachers \nSupports teachers in understanding young children by critically integrating empirical, theoretical, and experiential knowledge about children (prenatal through age eight). Careful observations and extended interactions with children provide a basis for revealing important information about the educational, developmental, familial, cultural, historical, sociological, and political contexts in which these children live.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2024",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4608",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 414",
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Lesser, Ilana"
                }
            ],
            "course_name": "Issues in Early Childhood Education",
            "description": "ECED-GE 2024 Issues in Early Childhood Education \nAddresses both historical and contemporary perspectives of child development, as they relate to early childhood programs. Focus on societal contexts, including culture and international perspectives, refugee and immigrant issues, intergenerational child rearing issues, and economics and political policies, as they relate to early childhood programs, including programs for learners with special needs and learners of English as an additional language. Consideration of research and its impact on early childhood programs, with particular attention to advocacy.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2037",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3390",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "SILV 407"
                }
            ],
            "course_name": "Curr Early Chlhd Educ:",
            "description": "ECED-GE 2037 Curr Early Chlhd Educ: \nThe early childhood classroom explored as nexus for collaborative, integrative curriculum building, with greater focus on theory. Emphasis on child-centered, culturally inclusive approaches. Study of verbal and nonverbal communication, reading, writing, numeracy, science, social studies, the arts, and an expanded vision of technology appropriate for diverse populations of young children.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2038",
            "course_name": "Curric in Early Childhd Ed:Materials and Prac",
            "description": "ECED-GE 2038 Curric in Early Childhd Ed:Materials and Prac \nFurther study of issues of integrated early childhood curriculum with greater focus on implementation. In-depth exploration of materials and practices in early childhood classrooms that support evolving integrated integrated curricula in literacy, numeracy, technology, social studies, science, the arts, and health and safety for young children.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2250",
            "course_name": "Studying of Teaching",
            "description": "ECED-GE 2250 Studying of Teaching \nStudents study the process of teaching through real and stimulated situations.  Emphasis on teacher roles, behavior, alternative teaching models, and decision making in the teaching-learning process.  Students are videotaped twice in their placements for purposes of self-analysis.  Students are expected to apply principles and skills in their fieldwork.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2255",
            "classes": [
                {}
            ],
            "course_name": "Field Placement in Early Childhood",
            "description": "ECED-GE 2255 Field Placement in Early Childhood \nUniversity supervised field experiences with young children in a variety of early childhood settings will be used to support coursework.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2297",
            "course_name": "Working With Parents",
            "description": "ECED-GE 2297 Working With Parents \nDevelopment of teacher competence in working with parents and parent organizations.  Considerations of the role of the teacher in parent-child relationships.  Approaches and techniques for effective solutions to home and school problems.  Current research on these issues is discussed.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3393",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Schwartz, Barbara",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4521",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "ECED-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2314",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3394",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Sat 10.00 AM - 12.00 PM",
                    "open": true,
                    "professor": "BOBS 836"
                }
            ],
            "course_name": "Social Studies and  Science Experiences for Younger Children",
            "description": "ECED-GE 2314 Social Studies and  Science Experiences for Younger Children \nExperiences for developing children’s concepts & skills in social studies & science.  Program planning & use of resources: the out-of-doors, maps, globes, books, pictures & other media.  Includes techniques for integrating the two content areas, evaluating current materials, & adapting programs for special students in regular classrooms.  Hands-on experience with microcomputers & selected software.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2370",
            "course_name": "Culmainating Seminar in Early Childhood Educ",
            "description": "ECED-GE 2370 Culmainating Seminar in Early Childhood Educ \nSynthesis of professional experiences in the Graduate Early Childhood Program. Participation in scholarly research, social action, and creation of early childhood curricula.",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2372",
            "course_name": "Culminating Sem in Early Childhood Education",
            "description": "ECED-GE 2372 Culminating Sem in Early Childhood Education \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "ECED-GE 2701",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4109",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "WAVE 566A"
                }
            ],
            "course_name": "Ed of Infants & Toddlers",
            "description": "ECED-GE 2701 Ed of Infants & Toddlers \nMethods of developmental stimulation, selection, creation, and evaluation of materials, group management, and program planning.  This course is one of four parts of an interdepartmental offering in infant and toddler group care.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2903",
            "classes": [
                {}
            ],
            "course_name": "Student Teaching Early Childhood I",
            "description": "ECED-GE 2903 Student Teaching Early Childhood I \nOne semester supervised student teaching in an early childhood education classroom a minimum of 180 hours within 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 2904",
            "classes": [
                {}
            ],
            "course_name": "Student Teaching in Early Childhood II",
            "description": "ECED-GE 2904 Student Teaching in Early Childhood II \nOne semester supervised student teaching in an early childhood classroom a minimum of 180 hours within 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": true
        },
        {
            "course_id": "ECED-GE 3038",
            "course_name": "Doctoral Seminar",
            "description": "ECED-GE 3038 Doctoral Seminar \nThe systematic study of theory and research in areas related to early childhood and elementary education.",
            "offering": false
        }
    ]
}