{
    "major_id": "EDPLY-GE",
    "file": "./2015-2016/Educational_Policy_(EDPLY-GE).html",
    "courses": [
        {
            "course_id": "EDPLY-GE 2020",
            "course_name": "",
            "description": "EDPLY-GE 2020\n\n   Financing School:\n\nAn introduction to the concepts, practice, and economics of elementary and secondary school finance in the United States. Emphasis on the analysis of equity and adequacy in school funding, and the policies targeted toward meeting these objectives. In part through the use of case studies, the course will examine the causes and consequences of school finance reform, and the impact of funding systems on the level and distribution of resources and student achievement. Other topics will include: the link between school finance and accountability, school-lever resource allocation, facilities financi...\n\n      more description for EDPLY-GE 2020 »\n\n      \n\n\n\nAn introduction to the concepts, practice, and economics of elementary and secondary school finance in the United States. Emphasis on the analysis of equity and adequacy in school funding, and the policies targeted toward meeting these objectives. In part through the use of case studies, the course will examine the causes and consequences of school finance reform, and the impact of funding systems on the level and distribution of resources and student achievement. Other topics will include: the link between school finance and accountability, school-lever resource allocation, facilities financing, and teacher compensation policy.\n\n      less description for EDPLY-GE 2020 «",
            "offering": false
        },
        {
            "course_id": "EDPLY-GE 2025",
            "course_name": "Economics of Education",
            "description": "EDPLY-GE 2025 Economics of Education \nUsing economic principles to analyze K-12 education, beginning with an examination of the demand for education, both by the private and the public sector. Consideration of the production and supply and cost of education. New ways of driving performance and providing choice to students. The class is run as a seminar in which we discuss the content of the assigned  readings. Class time will be used to apply findings from the readings to make recommendation that are empirically and theoretically justified on economic grounds for achieving high performance of students in large urban areas.",
            "offering": false
        },
        {
            "course_id": "EDPLY-GE 2030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4765",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KIMB 301",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Ziol-Guest, Kathleen"
                }
            ],
            "course_name": "",
            "description": "EDPLY-GE 2030\n\n   Education and Social Policy\n\nCourse is designed to introduce students to public policy & provide a foundation for understanding & assessing education policies in particular.  Students will examine the theoretical perspectives in policy as well as examine the policy process & the institutions under which policies are formed, specifically the difference between market systems & the role of government.  Fourth, the methods & tools for policy analysis, both before & after policies are implemented will be studied.  Finally, students will examine the role of institutions as well as policy design.  Topics may include No Child Le...\n\n      more description for EDPLY-GE 2030 »\n\n      \n\n\n\nCourse is designed to introduce students to public policy & provide a foundation for understanding & assessing education policies in particular.  Students will examine the theoretical perspectives in policy as well as examine the policy process & the institutions under which policies are formed, specifically the difference between market systems & the role of government.  Fourth, the methods & tools for policy analysis, both before & after policies are implemented will be studied.  Finally, students will examine the role of institutions as well as policy design.  Topics may include No Child Left Behind, financial aid for higher education, tax reforms to encourage saving for college, school reform in major cities, poverty & inequality, among others.\n\n      less description for EDPLY-GE 2030 «",
            "offering": true
        },
        {
            "course_id": "EDPLY-GE 2050",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4125",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "12WV L111",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Weinstein, Meryle"
                }
            ],
            "course_name": "",
            "description": "EDPLY-GE 2050\n\n   Capstone:Applied Rsch in Education Policy\n\nStudents will work in teams to design and perform a research study developed with a concern for data availability, importance of problem, and ability to ascertain causal relationships. Projects will be designed and written for a particular 'clientele' in the policy community. Emphasis will be placed on the appropriate use of the data set, the methodology, and documenting the research in a written form that will be understood by and useful for the intended audience. The development of effective and efficient teams that utilize and build upon the experience, skills and interests of team members ...\n\n      more description for EDPLY-GE 2050 »\n\n      \n\n\n\nStudents will work in teams to design and perform a research study developed with a concern for data availability, importance of problem, and ability to ascertain causal relationships. Projects will be designed and written for a particular 'clientele' in the policy community. Emphasis will be placed on the appropriate use of the data set, the methodology, and documenting the research in a written form that will be understood by and useful for the intended audience. The development of effective and efficient teams that utilize and build upon the experience, skills and interests of team members is an integral part of the successful completion of the course.\n\n      less description for EDPLY-GE 2050 «",
            "offering": true
        },
        {
            "course_id": "EDPLY-GE 2055",
            "classes": [
                {}
            ],
            "course_name": "Internship: Education & Social Policy",
            "description": "EDPLY-GE 2055 Internship: Education & Social Policy \nThe internship will allow students to apply the skills they are learning in the Education & Social Policy program directly to an organization working in the field of education policy. Students will become acquainted with current practices in the field, & be exposed to everyday life in the profession.  The course will help students build their resume, & allow students to create a professional network as they begin their permanent job search. This is an especially valuable experience for students who are new to the field of education policy.",
            "offering": true
        },
        {
            "course_id": "EDPLY-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4647",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Corcoran, Sean",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4827",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Weinstein, Meryle",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "EDPLY-GE 2300 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per unit. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student’s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        }
    ]
}