{
    "major_id": "EJST-GE",
    "file": "./2015-2016/Education_&_Jewish_Studies_(EJST-GE).html",
    "courses": [
        {
            "course_id": "EJST-GE 2003",
            "course_name": "History of Jewish Educ: The Modern Period",
            "description": "EJST-GE 2003 History of Jewish Educ: The Modern Period \nThis course survery the key ideas, movements, and institutions in modern Jewish education. Students will examine post-Enlightenment European educational practices and their adaptation to the American environment. The course also examines the influence of American educational thought and practice on Jewish education.",
            "offering": false
        },
        {
            "course_id": "EJST-GE 2005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4725",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 403",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Kardos, Susan"
                }
            ],
            "course_name": "Jewish Education in Social Context",
            "description": "EJST-GE 2005 Jewish Education in Social Context \nDebates surrounding Jewish education and the attempts by practitioners to innovate over the last fifty years. Topics covered include the role of Jewish communities and denominations in setting educational agendas, the American religious context, church-state issues that affect Jewish education, and the examination of formal and informal educational settings.",
            "offering": true
        },
        {
            "course_id": "EJST-GE 2006",
            "course_name": "Theory and Practice Experiential Jewish Education",
            "description": "EJST-GE 2006 Theory and Practice Experiential Jewish Education \nExperiential Jewish education is becoming one of the most innovative & important areas of Jewish education. It has the capacity to inspire learners in many educational settings. This course examines the theoretical underpinnings & practical manifestations within the emerging field of experiential Jewish education. The course enables students to participate in varied Jewish educational settings, interact with their fellow students & reflect on their own practices. Student assessments include diverse assignments that reflect the ways our students teach and learn.",
            "offering": false
        },
        {
            "course_id": "EJST-GE 2007",
            "course_name": "Israel Education in Flux",
            "description": "EJST-GE 2007 Israel Education in Flux \nThe course investigates recent educational & research efforts regarding “Israel education” – the teaching & learning about Israel aimed at American Jews. The course will examine long standing debates & tensions in this field, as well as the new developments & directions in a variety of sectors including day schools, travel tours (i.e., birthright), Israel studies in the university.  We will develop a critical, analytic, perspective about this important case of transnational education.",
            "offering": false
        },
        {
            "course_id": "EJST-GE 2008",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3630",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KIMB 301",
                    "time": "Thu 2.00 PM - 4.00 PM",
                    "open": true,
                    "professor": "Wechsler, Harold"
                }
            ],
            "course_name": "",
            "description": "EJST-GE 2008\n\n   Capstone Seminar in Jewish Education I\n\nA yearlong course sequence enable students in the M.A. Program in Education and Jewish Studies to launch and complete their master's essay or a capstone project. The capstone project - designed in collaboration with a school or an agency in the field of Jewish education - allows students to apply their learning to a real life challenge in the field, and to address a need identified by the institution. The thesis requires students to offer new arguments, analyses, or insights, based on the literature and research on their area of interest in Jewish education. The course also instructs students ...\n\n      more description for EJST-GE 2008 »\n\n      \n\n\n\nA yearlong course sequence enable students in the M.A. Program in Education and Jewish Studies to launch and complete their master's essay or a capstone project. The capstone project - designed in collaboration with a school or an agency in the field of Jewish education - allows students to apply their learning to a real life challenge in the field, and to address a need identified by the institution. The thesis requires students to offer new arguments, analyses, or insights, based on the literature and research on their area of interest in Jewish education. The course also instructs students in the design and implementation of education in the major fields of Jewish studies, thus facilitating student entry into the field.\n\n      less description for EJST-GE 2008 «",
            "offering": true
        },
        {
            "course_id": "EJST-GE 2009",
            "course_name": "",
            "description": "EJST-GE 2009\n\n   Capstone Seminar in Jewish Education II\n\nA year long course sequence enable students in the M.A. Program in Education and Jewish Studies to launch and complete their master's essay or a capstone project. The capstone project - designed in collaboration with a school or an agency in the field of Jewish education - allows students to apply their learning to a real life challenge in the field, and to address a need identified by the institution. The thesis requires students to offer new arguments, analyses, or insights, based on the literature and research on their area of interest in Jewish education. The course also instructs students...\n\n      more description for EJST-GE 2009 »\n\n      \n\n\n\nA year long course sequence enable students in the M.A. Program in Education and Jewish Studies to launch and complete their master's essay or a capstone project. The capstone project - designed in collaboration with a school or an agency in the field of Jewish education - allows students to apply their learning to a real life challenge in the field, and to address a need identified by the institution. The thesis requires students to offer new arguments, analyses, or insights, based on the literature and research on their area of interest in Jewish education. The course also instructs students in the design and implementation of education in the major fields of Jewish studies, thus facilitating student entry into the field.\n\n      less description for EJST-GE 2009 «",
            "offering": false
        },
        {
            "course_id": "EJST-GE 2010",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4626",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KIMB 301",
                    "time": "Wed 2.30 PM - 4.30 PM",
                    "open": true,
                    "professor": "Horowitz, Bethamie"
                }
            ],
            "course_name": "Sem Ed/Jewish Stds I",
            "description": "EJST-GE 2010 Sem Ed/Jewish Stds I \nA two year seminar emphasizing ways in which the intellectual orientations of education and Jewish studies can be fruitfully integrated. The seminar acquaints students with the present state of research in both education and Jewish studies, emphasizing the parallels and differences between these multifaceted research areas. In addition, the seminar addresses the research needs and opportunities found in the rapidly expanding field of Jewish education in North America. Throughout this experience, students will be encouraged toward identifying their own research problems in Jewish education.",
            "offering": true
        },
        {
            "course_id": "EJST-GE 2011",
            "course_name": "",
            "description": "EJST-GE 2011\n\n   Sem Ed/Jewish Stds II\n\nA two semester seminar emphasizing ways in which the intellectual orientations of education and Jewish studies can be fruitfully integrated. The seminar acquaints students with the present state of research in both education and Jewish studies, emphasizing the parallels and differences between these multifaceted research areas. In addition, the seminar addresses the research needs and opportunities found in the rapidly expanding field of Jewish education in North America. Throughout this experience, students will be encouraged toward identifying their own research problems in Jewish education....\n\n      more description for EJST-GE 2011 »\n\n      \n\n\n\nA two semester seminar emphasizing ways in which the intellectual orientations of education and Jewish studies can be fruitfully integrated. The seminar acquaints students with the present state of research in both education and Jewish studies, emphasizing the parallels and differences between these multifaceted research areas. In addition, the seminar addresses the research needs and opportunities found in the rapidly expanding field of Jewish education in North America. Throughout this experience, students will be encouraged toward identifying their own research problems in Jewish education.\n\n      less description for EJST-GE 2011 «",
            "offering": false
        },
        {
            "course_id": "EJST-GE 2012",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3631",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KIMB 301",
                    "time": "Wed 2.30 PM - 4.30 PM",
                    "open": true,
                    "professor": "Horowitz, Bethamie"
                }
            ],
            "course_name": "Sem Ed/Jewish Stds III",
            "description": "EJST-GE 2012 Sem Ed/Jewish Stds III \nA two-semester seminar focusing on major research frameworks in education, Jewish studies, and Jewish education. Students will be engaged in practical research experiences in the Jewish education field. These experiences provide opportunities to formulate creative plans for dealing with a variety of educational issues and problems.",
            "offering": true
        },
        {
            "course_id": "EJST-GE 2013",
            "course_name": "Sem Ed/Jewish Stds IV",
            "description": "EJST-GE 2013 Sem Ed/Jewish Stds IV \nA two-semester seminar focusing on major research frameworks in education, Jewish studies, and Jewish education. Students will be engaged in practical research experiences in the Jewish education field. These experiences provide opportunities to formulate creative plans for dealing with a variety of educational issues and problems.",
            "offering": false
        },
        {
            "course_id": "EJST-GE 2090",
            "course_name": "Fieldwork in Education and Jewish Education",
            "description": "EJST-GE 2090 Fieldwork in Education and Jewish Education \nThe course is designed as an opportunity for students to participate in the design & implementation of a field-based, data-based project that utilizes/reflects ideas & concepts developed in the course of  the M.A. program. Students will have hands-on opportunity to work with an educational organization over the course of an academic year. Students may work individually &/or in teams to address challenges & identify opportunities for a client organization.",
            "offering": false
        },
        {
            "course_id": "EJST-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3632",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Wechsler, Harold",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4124",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Horowitz, Bethamie",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "3633",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Chazan, Robert",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "3634",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Jacobs, Benjamin",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "EJST-GE 2300\n\n   Independent Study\n\nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowancIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be o...\n\n      more description for EJST-GE 2300 »\n\n      \n\n\n\nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowancIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.\n\n      less description for EJST-GE 2300 «",
            "offering": true
        }
    ]
}