{
    "major_id": "ENGR-AD",
    "file": "./2015-2016/Engineering_(ENGR-AD).html",
    "courses": [
        {
            "course_id": "ENGR-AD 20",
            "course_name": "",
            "description": "ENGR-AD   20\n\n   Capacity Building Workshop\n\nReal-world engineering problems require engineers with theoretical mastery of their chosen field as well as dexterity with a broad range of digital tools.  Students in this course solve an engineering design challenge that requires utilization of best-practice design methods, application of contemporary digital tools, and discussion of ethical principles.  The course has two components, a lecture and a lab, held each day.  In lecture, short crash-courses are presented on specific topics and tools to quickly and deeply expose students to new subject matter.  During lab sessions, student groups ...\n\n      more description for ENGR-AD   20 »\n\n      \n\n\n\nReal-world engineering problems require engineers with theoretical mastery of their chosen field as well as dexterity with a broad range of digital tools.  Students in this course solve an engineering design challenge that requires utilization of best-practice design methods, application of contemporary digital tools, and discussion of ethical principles.  The course has two components, a lecture and a lab, held each day.  In lecture, short crash-courses are presented on specific topics and tools to quickly and deeply expose students to new subject matter.  During lab sessions, student groups work on their design projects.\n\n      less description for ENGR-AD   20 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 110",
            "course_name": "J",
            "description": "ENGR-AD  110J\n\n   Design and Innovation\n\nThe course introduces students to the history and culture of design and development philosophies and practices, the modern principles of technology design, and concepts of innovation, sourcing, shaping, and evaluating ideas and inventions. The labs emphasize experiential learning and innovation, and require students to use existing innovations to create and build prototypes of new technology/design products, with real-life constraints. The course touches on social, cultural, economic, ethical, and other factors that shape engineering solutions and how to approach incorporating them in conjunct...\n\n      more description for ENGR-AD  110J »\n\n      \n\n\n\nThe course introduces students to the history and culture of design and development philosophies and practices, the modern principles of technology design, and concepts of innovation, sourcing, shaping, and evaluating ideas and inventions. The labs emphasize experiential learning and innovation, and require students to use existing innovations to create and build prototypes of new technology/design products, with real-life constraints. The course touches on social, cultural, economic, ethical, and other factors that shape engineering solutions and how to approach incorporating them in conjunction with problem solving and designing systems, components, or processes.\n\n      less description for ENGR-AD  110J «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 111",
            "course_name": "",
            "description": "ENGR-AD  111\n\n   Engineering Statics\n\nThis course introduces student to the field of mechanics through study of static equilibrium in two dimensions. Knowledge and understanding of static equilibrium is essential for future study of dynamics, robotics, fluid mechanics, astrodynamics, and vibrations. The methods, techniques, theory, and application of equilibrium in the solution of engineering problems are presented for two-dimensional systems. Students have the opportunity for extensive practice in applying these principles. Topics covered include collinear forces, coincident forces, general two-dimensional equilibrium, moments an...\n\n      more description for ENGR-AD  111 »\n\n      \n\n\n\nThis course introduces student to the field of mechanics through study of static equilibrium in two dimensions. Knowledge and understanding of static equilibrium is essential for future study of dynamics, robotics, fluid mechanics, astrodynamics, and vibrations. The methods, techniques, theory, and application of equilibrium in the solution of engineering problems are presented for two-dimensional systems. Students have the opportunity for extensive practice in applying these principles. Topics covered include collinear forces, coincident forces, general two-dimensional equilibrium, moments and torques, the method of sections, the method of joints, analysis of frames and machines, and Coulomb friction.\n\n      less description for ENGR-AD  111 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 112",
            "course_name": "",
            "description": "ENGR-AD  112\n\n   Engineering Conservation Laws\n\nConservation laws play a fundamental role in the analysis of engineering problems by providing a framework to derive relationships between various physical properties of closed and open systems and control volumes. This course aims to introduce the students to these laws namely—the conservation of mass, conservation of force and linear momentum, conservation of torque and angular momentum, conservation of energy, conservation of chemical species, and conservation of charge—will be derived in integral forms. Selected case studies are used to demonstrate the application of these laws for the sim...\n\n      more description for ENGR-AD  112 »\n\n      \n\n\n\nConservation laws play a fundamental role in the analysis of engineering problems by providing a framework to derive relationships between various physical properties of closed and open systems and control volumes. This course aims to introduce the students to these laws namely—the conservation of mass, conservation of force and linear momentum, conservation of torque and angular momentum, conservation of energy, conservation of chemical species, and conservation of charge—will be derived in integral forms. Selected case studies are used to demonstrate the application of these laws for the simplification of complex engineering problems. In addition, this course also helps the students develop a deeper understanding of the concepts of work and heat.\n\n      less description for ENGR-AD  112 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 113",
            "course_name": "",
            "description": "ENGR-AD  113\n\n   Digital Logic\n\nThis module provides a rigorous introduction to topics in digital logic design mostly focusing on combinational circuits but also touching upon basic concepts in sequential circuits. Introductory topics include: classification of digital systems, number systems and binary arithmetic, error detection and correction, and switching algebra. Combinational design analysis and synthesis topics include: logic function optimization, arithmetic units such as adders and subtractors, and control units such as decoders and multiplexers. A brief overview of sequential circuits by introducing basic memory e...\n\n      more description for ENGR-AD  113 »\n\n      \n\n\n\nThis module provides a rigorous introduction to topics in digital logic design mostly focusing on combinational circuits but also touching upon basic concepts in sequential circuits. Introductory topics include: classification of digital systems, number systems and binary arithmetic, error detection and correction, and switching algebra. Combinational design analysis and synthesis topics include: logic function optimization, arithmetic units such as adders and subtractors, and control units such as decoders and multiplexers. A brief overview of sequential circuits by introducing basic memory elements such as flip-flops, and state diagrams concludes the module.\n\n      less description for ENGR-AD  113 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 114",
            "course_name": "",
            "description": "ENGR-AD  114\n\n   Experimental Methods\n\nExperimental methods is presented as a process of investigation starting with an observation, leading to one or more hypotheses tested by experiments involving measurements, collection of results, analysis and conclusion. Students are first introduced to the historical significance of experimental discoveries, the importance of experimental design and measurement. Key examples are discussed. The importance of measurements, errors, uncertainty and its justification will be discussed in detail and students will learn how to estimate, use and report uncertainties. Techniques to compare, analyze a...\n\n      more description for ENGR-AD  114 »\n\n      \n\n\n\nExperimental methods is presented as a process of investigation starting with an observation, leading to one or more hypotheses tested by experiments involving measurements, collection of results, analysis and conclusion. Students are first introduced to the historical significance of experimental discoveries, the importance of experimental design and measurement. Key examples are discussed. The importance of measurements, errors, uncertainty and its justification will be discussed in detail and students will learn how to estimate, use and report uncertainties. Techniques to compare, analyze and report different measurements are studied. Students are introduced to error propagation rules, random and systematic errors and standard deviation as the uncertainty in a single measurement. The measurement system in an engineering context and practical examples of measurement systems and how they work will be discussed, as will be professional ethics within this context. Students will be introduced to the basic concepts in dynamic measurements, first order systems, rejection of data and Chauvenet’s criterion.\n\n      less description for ENGR-AD  114 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 116",
            "course_name": "Instrumentation, Sensors, Actuators",
            "description": "ENGR-AD  116 Instrumentation, Sensors, Actuators \nThe course focuses on electrical circuits and components, passive and active filtering for signal conditioning, dynamic measurement system response characteristics, analog signal processing, digital representation, data acquisition, sensors, actuators and actuator characteristics. Studies of measurement systems via computer simulation also are discussed. The laboratory experiments draw upon examples from all disciplines of engineering such as data acquisition, operational amplifiers, temperature measurement, and motion and force measurements.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 117",
            "course_name": "Simulation and Computational Methods",
            "description": "ENGR-AD  117 Simulation and Computational Methods \nThis course provides an introduction to the methods, techniques, theory, and application of numerical methods in the solution of engineering problems. Topics to be covered include the following: finding roots of equations, numerical differentiation and integration, time marching methods in solving ordinary differential equations, and optimization. MATLAB software is the primary computing environment.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 118",
            "course_name": "",
            "description": "ENGR-AD  118\n\n   Engineering Materials\n\nDesigned as a first course in materials, this course will introduce students to engineering properties of materials, applying basic principles of the atomic and crystal structure of solids to the study of properties as well as to the selection and use of engineering materials. The course content includes examination of engineering materials such as metals, plastics, and composites with an emphasis on material selection. Through an immersive laboratory component, the course has an emphasis on experiential learning of the basic structure and properties of metallic, polymeric, semiconducting, cer...\n\n      more description for ENGR-AD  118 »\n\n      \n\n\n\nDesigned as a first course in materials, this course will introduce students to engineering properties of materials, applying basic principles of the atomic and crystal structure of solids to the study of properties as well as to the selection and use of engineering materials. The course content includes examination of engineering materials such as metals, plastics, and composites with an emphasis on material selection. Through an immersive laboratory component, the course has an emphasis on experiential learning of the basic structure and properties of metallic, polymeric, semiconducting, ceramic, and composite materials.\n\n      less description for ENGR-AD  118 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 119",
            "course_name": "Circuits Fundamentals",
            "description": "ENGR-AD  119 Circuits Fundamentals \nThis course provides an introduction to electrical circuits. The topics covered include DC circuits, passive DC circuit elements, Kirchoff’s laws, electric power calculations, analysis of DC circuits, nodal and loop analysis techniques, voltage and current division, Thevenin’s and Norton’s theorems, and source free and forced responses of RL, RC and RLC circuits. The labs cover various electric circuits concepts such as demonstrating current and voltage division laws, Thevenin’s and Norton’s equivalent circuit, and RL, RC, and RLC circuits analysis.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 180",
            "course_name": "Physiology for Engineers",
            "description": "ENGR-AD  180 Physiology for Engineers \nThe course recognizes the vast diversity and adaptability of the organisms that are observed globally and evaluates the essential components of animal physiology, including their ability to adapt to the diverse global environments. The students will learn the organism’s structure/function relationships, the evolutionary and developmental processes associated with organism’s structure and the impact of the environment on their structure.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 190",
            "course_name": "",
            "description": "ENGR-AD  190\n\n   Analytical Methods\n\nThis module provides an introduction to topics in signals and systems, covering analytical techniques for analyzing, characterizing and synthesizing engineering systems. Systems approaches where the entire system or each of the sub-systems are considered as single units are introduced. The focus is mostly on discrete time systems while basic concepts in continuous time systems are also visited. Introductory topics include: sinusoids, phase and time shift, and complex exponentials. Operations on sinusoidal signals include addition of signals with the same frequency via the phasor addition rule,...\n\n      more description for ENGR-AD  190 »\n\n      \n\n\n\nThis module provides an introduction to topics in signals and systems, covering analytical techniques for analyzing, characterizing and synthesizing engineering systems. Systems approaches where the entire system or each of the sub-systems are considered as single units are introduced. The focus is mostly on discrete time systems while basic concepts in continuous time systems are also visited. Introductory topics include: sinusoids, phase and time shift, and complex exponentials. Operations on sinusoidal signals include addition of signals with the same frequency via the phasor addition rule, conversion between time-shift and phase, and addition of signals with different frequencies via the introduction of the frequency spectrum concept. Topics on discrete time systems include: FIR and IIR filtering, impulse response, causality, linearity, time invariance, and convolution. Time and frequency domain representations of systems and conversions between these representations are also studied. Z-transform domain, the concept of poles and zeros, stability and their relevance to the time and frequency domains are also covered. A brief overview of continuous time signals concludes the module.\n\n      less description for ENGR-AD  190 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 194",
            "course_name": "Engineering Analysis I: Complex Variables",
            "description": "ENGR-AD  194 Engineering Analysis I: Complex Variables \nThe course covers functions of a complex variable. The topics covered are: Derivatives and Cauchy-Riemann equations. Integrals and Cauchy integral\ntheorem. Harmonic functions, the exponential function, trigonometric functions, logarithmic functions. Contour integrals, anti-derivatives, Cauchy-Goursat theorem, Cauchy integral formula, Liouville's theorem, fundamental theorem of\nalgebra. Power and Laurent Series. Residue theory.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 195",
            "course_name": "Engineering Analysis II: Discrete Math Fundamentals",
            "description": "ENGR-AD  195 Engineering Analysis II: Discrete Math Fundamentals \nThe course covers discrete mathematics. Logic, truth tables, mathematical induction and other proof techniques are covered. Sets, relations and\nfunctions, recursive functions, basic algorithms, counting techniques, inclusion-exclusion principle and basic graph theory and trees are also covered.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 201",
            "course_name": "Advanced Digital Logic",
            "description": "ENGR-AD  201 Advanced Digital Logic \nThis course follows Digital Logic and tops it up by covering sequential circuit design. In-depth discussions on memory elements such as various types of latches and flip-flops, finite state machine analysis and design, random access memories, FPGAs, and high-level hardware description language programming such as VHDL or Verilog. The course touches upon concepts such as formal verification and testing of logic designs.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 202",
            "course_name": "Computer System Programming",
            "description": "ENGR-AD  202 Computer System Programming \nThis course provides a perspective of software-hardware interface of computer systems, bridging the gap between high-level programming techniques\nand the actual hardware system implementation. A low-level programming language is used to illustrate the course topics, which may be C or a similar programming language. The topics covered include basic if statements, loops,\nfunctions, arrays, strings, multi-dimensional arrays, structures, pointers, and recursion.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 203",
            "course_name": "Signals and Systems",
            "description": "ENGR-AD  203 Signals and Systems \nThis course builds on Analytical Methods which covers the discrete-time signals and systems, and elaborates on the continuous-time signals, systems, and transforms. It covers analytical techniques for analyzing, characterizing and synthesizing engineering systems in the continuous time domain. The topics include: Continuous-time signals and systems, continuous-time convolution, the Laplace transform, Fourier analysis for continuous-time signals, and the Sampling theorem.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 204",
            "course_name": "Data Structures and Algorithms",
            "description": "ENGR-AD  204 Data Structures and Algorithms \nThis course presents an overview of fundamental Data Structures, which are commonplace in programming, as well as associated basic algorithms. Complexity analysis, linked lists, stacks, queues, trees, hashing, sorting, and basic graphs algorithms are covered. Core topics such as Floyd’s algorithm, minimum spanning tree algorithms, and branch and bound techniques are\nalso covered. Practical Lab Exercises complement the lectures. The students further specialize and consolidate their knowledge through lab projects to demonstrate the operation and applications of various data structures.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 206",
            "course_name": "",
            "description": "ENGR-AD  206\n\n   Computer Organization and Architecture\n\nThe course introduces the principles of computer organization and basic architecture concepts. It discusses the basic structure of a digital computer and study in details formal descriptions, machine instruction sets design, formats and data representation, addressing structures, mechanization of Procedure calls, memory management, Arithmetic and Logical unit, virtual and cache\nmemory organization, I/O processing and interrupts, fundamental of reliability aspects. The course also covers performance and distributed system models. The labs emphasize experiential learning of computer organization...\n\n      more description for ENGR-AD  206 »\n\n      \n\n\n\nThe course introduces the principles of computer organization and basic architecture concepts. It discusses the basic structure of a digital computer and study in details formal descriptions, machine instruction sets design, formats and data representation, addressing structures, mechanization of Procedure calls, memory management, Arithmetic and Logical unit, virtual and cache\nmemory organization, I/O processing and interrupts, fundamental of reliability aspects. The course also covers performance and distributed system models. The labs emphasize experiential learning of computer organization and architecture concepts, and require students to use learned knowledge to create and build prototypes and evaluate their performance.\n\n      less description for ENGR-AD  206 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 208",
            "course_name": "",
            "description": "ENGR-AD  208\n\n   Computer Networks\n\nThe course introduces the basic concepts of computer and communication networks, including flow control, congestion control, end-to-end reliability, routing, framing, error-recovery, multiple access, and statistical multiplexing. There are in-depth presentation of the different networking layers, with emphasis on the Internet reference model. Protocols and architectures such as the TCP, IP, Ethernet, wireless networks etc. are described in order to illustrate important networking concepts. The course includes an introduction to  quantitative analysis and modeling of networks. The labs cover ba...\n\n      more description for ENGR-AD  208 »\n\n      \n\n\n\nThe course introduces the basic concepts of computer and communication networks, including flow control, congestion control, end-to-end reliability, routing, framing, error-recovery, multiple access, and statistical multiplexing. There are in-depth presentation of the different networking layers, with emphasis on the Internet reference model. Protocols and architectures such as the TCP, IP, Ethernet, wireless networks etc. are described in order to illustrate important networking concepts. The course includes an introduction to  quantitative analysis and modeling of networks. The labs cover basic concepts of computer networking and applications, and require students to use existing networking APIs to create and build computer network prototypes and real-life applications.\n\n      less description for ENGR-AD  208 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 211",
            "course_name": "Operating Systems",
            "description": "ENGR-AD  211 Operating Systems \nThis course discusses the operating systems that run computers. The course is designed to familiarize students with operating systems, user and program interfacing concepts. Topics include an overview of user interface, process structure, creation and context switching; system calls; process cooperation, memory management; virtual memory, I/O management; interrupt handling, file structures; directories, fault-tolerance. The course includes discussion of the role of the operative system in security systems and related ethical practice.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 213",
            "course_name": "Database Systems",
            "description": "ENGR-AD  213 Database Systems \nThe course covers modeling an application and logical database design, the relational model and relational data definition and data manipulation\nlanguages, design of relational databases and normalization theory, physical database design, query processing and optimization, transaction processing focusing on concurrency and recovery. The social and ethical responsibility of database architects and administrators are also discussed. Lab sessions emphasize experiential learning of database systems and applications and an insight into various database management systems and query languages.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 214",
            "course_name": "Advanced Circuits",
            "description": "ENGR-AD  214 Advanced Circuits \nThis course builds on the foundations of the Circuits Fundamentals Course. The topics covered include sinusoidal steady-state response, review of complex number analysis, complex voltage, current and the phasor concept; impedance, admittance; average, apparent and reactive power; polyphase circuits; node and mesh analysis for AC circuits; frequency response; operational amplifier circuits. The labs emphasize experiential learning of analyzing and designing advanced circuits.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 216",
            "course_name": "Analog and Digital Communication Theory",
            "description": "ENGR-AD  216 Analog and Digital Communication Theory \nThe course introduces the principles of the various analog communication fundamentals. Topics covered include: amplitude modulation and demodulation; angle modulation and demodulation; noise performance of various receivers; and information theory with source coding theorem are also dealt with. The labs emphasize experiential learning of basic analog and digital communication theory concepts and applications, including experiments demonstrating analog and digital modulation techniques.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 222",
            "course_name": "",
            "description": "ENGR-AD  222\n\n   Electronics\n\nThis course focuses on fundamentals of electronics theory and design. The topics covered include semiconductor physics, diodes, limiters, clamps; Bipolar Junction Transistors; small-signal models, cut-off, saturation and active regions; common emitter, common base and emitter-follower amplifier configurations; Field-Effect Transistors (MOSFET and JFET); biasing; small-signal models; common-source and common gate amplifiers; and integrated circuit MOS amplifiers. The alternate-week laboratory experiments on BJT biasing, large signal operation and FET characteristics. The course studies design a...\n\n      more description for ENGR-AD  222 »\n\n      \n\n\n\nThis course focuses on fundamentals of electronics theory and design. The topics covered include semiconductor physics, diodes, limiters, clamps; Bipolar Junction Transistors; small-signal models, cut-off, saturation and active regions; common emitter, common base and emitter-follower amplifier configurations; Field-Effect Transistors (MOSFET and JFET); biasing; small-signal models; common-source and common gate amplifiers; and integrated circuit MOS amplifiers. The alternate-week laboratory experiments on BJT biasing, large signal operation and FET characteristics. The course studies design and analysis of small-signal bipolar junction transistor and field-effect transistor amplifiers; and, diode circuits. The labs provide experimental hand-on electronics theory and applications, with emphasis on small signal analysis and amplifier design.\n\n      less description for ENGR-AD  222 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 230",
            "course_name": "Computer-Aided Design",
            "description": "ENGR-AD  230 Computer-Aided Design \nThis course provides an introduction to computer-aided design using solid modeling. Students learn to create solid object models using extrusions, revolutions, and swept paths, and learn to modify parts using cutting, patterns, fillets, chamfers, and other techniques. Assemblies of multiple parts will be used to demonstrate the need for geometric tolerances, and students will spend a large portion of class in hands-on use of software tools. The labs emphasize experiential learning of CAD concepts and applications using software tools.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 231",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17731",
                    "section": "001",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": null,
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "SOC_SCI 012"
                },
                {
                    "format": "Laboratory",
                    "class_id": "19909",
                    "section": "002",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": null,
                    "time": "Tue 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "SOC_SCI 012"
                }
            ],
            "course_name": "Fluid Mechanics",
            "description": "ENGR-AD  231 Fluid Mechanics \nThis course introduces students to the basic principles and equations of fluid mechanics. This course covers properties and definitions of fluids, hydrostatics, Bernoulli’s Equation and the use of control volume analysis and conversation\nlaws previously introduced in the curriculum. These concepts are applied to internal flows such as within pipes or ducts to open channel flows and to external flows over flat surfaces.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 232",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "12993",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "CAMP W006",
                    "time": "Tue 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Panindre, Prabodh"
                },
                {
                    "format": "Seminar",
                    "class_id": "12994",
                    "section": "002",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "CAMP W006",
                    "time": "Thu 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Panindre, Prabodh"
                }
            ],
            "course_name": "Vibrations",
            "description": "ENGR-AD  232 Vibrations \nThis course introduces students to vibrations of rigid bodies supported by an elastic component (i.e. simple spring-mass systems). The course covers simple harmonic motion in free, transient, and forced vibration situations, and uses both analytical and numerical solution approaches. Damped vibration is considered, along with a brief introduction to systems of coupled masses.\nPractical applications of this material include vibration isolation, suspension systems, and active vibration control.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 233",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12995",
                    "section": "001",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": "SOC_SCI 012",
                    "time": "Mon,Tue,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Khapli, Sachin"
                },
                {
                    "format": "Laboratory",
                    "class_id": "12996",
                    "section": "002",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": "HUMANITIES 012",
                    "time": "Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Khapli, Sachin"
                }
            ],
            "course_name": "Thermodynamics",
            "description": "ENGR-AD  233 Thermodynamics \nThis course introduces students to the basic concepts of Thermodynamics and their applications to Engineering problems. The following topics are covered in this course: properties of pure substances; concepts of work and heat; closed and open systems; the fundamental laws of thermodynamics; Carnot and Clausius statements of the 2nd law; entropy and entropy production; heat engines, refrigerators, heat pumps; efficiencies, coefficients of performance.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 235",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12997",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "CAMP E047",
                    "time": "Tue,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Khapli, Sachin"
                },
                {
                    "format": "Laboratory",
                    "class_id": "12998",
                    "section": "002",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "CAMP W006",
                    "time": "Wed 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Khapli, Sachin"
                }
            ],
            "course_name": "Heat Transport",
            "description": "ENGR-AD  235 Heat Transport \nThis course introduces students to the three basic modes of heat transfer, develop the pertinent governing equations, and apply them to analyze and design heat transfer systems. Topics covered include: analysis of multidimensional geometries for the conduction mode; unsteady conduction;\nnumerical methods of analysis; introduction to convection; internal and external convection; natural convection, boiling, and condensation; and principles of radiative heat transfer.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 237",
            "course_name": "Solid Mechanics",
            "description": "ENGR-AD  237 Solid Mechanics \nDesigned as a first course in the mechanics of materials, this course introduces students to the basic concepts of stress and strain in the normal and tangential directions, and the two dimensional transformations in various coordinate systems. Topics include stress-strain relationships for members subject to axial forces, torsion, and bending moments.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 239",
            "course_name": "",
            "description": "ENGR-AD  239\n\n   Engineering Dynamics\n\nThis course introduces students to the principles of rigid dynamics. The course covers both kinematic (geometric aspects of motion) and kinetic (analysis of forces causing motion) approaches. The first section of the course focuses on particle dynamics, with rigid body dynamics covered in the second section. The applications of these methods to engineering problems are presented, and students have the opportunity for extensive practice in applying these principles. Specific topics include the following: rectilinear and curvilinear motion, equations of motion for a system of particles, work and...\n\n      more description for ENGR-AD  239 »\n\n      \n\n\n\nThis course introduces students to the principles of rigid dynamics. The course covers both kinematic (geometric aspects of motion) and kinetic (analysis of forces causing motion) approaches. The first section of the course focuses on particle dynamics, with rigid body dynamics covered in the second section. The applications of these methods to engineering problems are presented, and students have the opportunity for extensive practice in applying these principles. Specific topics include the following: rectilinear and curvilinear motion, equations of motion for a system of particles, work and energy for a system of particles, linear impulse and momentum for a system of particles, angular momentum, relative and absolute motion analysis, rigid body rotation, and general 2D rigid body motion.\n\n      less description for ENGR-AD  239 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 262",
            "course_name": "Human Computer Interaction and Tangible Interfaces",
            "description": "ENGR-AD  262 Human Computer Interaction and Tangible Interfaces \nThe course introduces the basic concepts of psychological principles of human-computer interaction, evaluation methods, usability engineering,\nuser-centered design and prototyping, interaction paradigms and models, tangible interfaces that provide physical interaction with digital information. The labs cover practices of user interfaces design and evaluation, and require\nstudents to use existing platforms to create and build human computer interaction applications.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 264",
            "course_name": "Engineering Game Theory",
            "description": "ENGR-AD  264 Engineering Game Theory \nThis course is an introduction to the fundamentals of game theory and mechanism design with a specific emphasis on applications in engineering. Topics include non-cooperative game theory; strategic form games; Nash equilibrium and existence properties; market equilibrium and pricing; Auction and mechanism design; optimal auctions; revenue-equivalence theorem; social choice viewpoint; cooperative game theory; network effects and games over networks.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 270",
            "course_name": "Urban Infrastructure Systems",
            "description": "ENGR-AD  270 Urban Infrastructure Systems \nThe course provides a basic descriptive overview of key urban infrastructure systems and technologies with reference to management, operation, and\nmaintenance of these systems. These systems include infrastructure of water supply; solid and liquid waste treatment and disposal, mass transit, power, communication networks, and buildings, roads and bridges.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 271",
            "course_name": "Monitoring for Smart Cities",
            "description": "ENGR-AD  271 Monitoring for Smart Cities \nThis course covers approaches for instrumentation and monitoring for condition assessment of physical civil infrastructure and the natural environment in cities. These include sensors for monitoring strains, fracture, corrosion, and movements, environmental conditions including air and water quality and techniques for monitoring. The course includes lectures on hardware, signal conditioning, error analysis, data processing and archival methodologies.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 275",
            "course_name": "Geographic Information System",
            "description": "ENGR-AD  275 Geographic Information System \nThe course introduces the concepts and principles of Geographic Information Systems (GIS), techniques.  Covering state-of-the-art GIS methods and tools including: spatial and terrain analysis, geostatistical analysis, time series analysis and development of GIS models. The projects provide experiential insight to geographic information system concepts, and require students to use existing tools to create and build prototypes of real-life applications.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 291",
            "course_name": "Probability and Statistics for Engineers",
            "description": "ENGR-AD  291 Probability and Statistics for Engineers \nIntroductory course to probability and statistics with an emphasis on how these topics are relevant in engineering disciplines.  Topics in probability theory include sample spaces and counting, probability distributions, cumulative density functions, rules and theorems of probability, expectation, and variance.  Topics in statistics include hypothesis testing, error types, and confidence intervals.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 296",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "13125",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 012",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "George, Pradeep"
                }
            ],
            "course_name": "Project Management",
            "description": "ENGR-AD  296 Project Management \nThis course provides students with practical and best practice project management theory and concepts so that they may effectively contribute in and lead multicultural team projects framed for the new global economy. The practical component includes a team-based software development project\nthat runs throughout the duration of the course.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 298",
            "course_name": "Directed Study",
            "description": "ENGR-AD  298 Directed Study \nDirected Study in Engineering",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 303",
            "course_name": "Advanced Algorithms",
            "description": "ENGR-AD  303 Advanced Algorithms \nThis course covers techniques in advanced design and analysis of algorithms. Topics include: amortized analysis of algorithms; advanced data structures; binomial heaps; Fibonacci heaps; data structures for disjoint sets; analysis of union by rank with path compression; graph and algorithms: elementary graph algorithms, maximum flow, matching algorithms. Randomized algorithms theory of NP completeness and approaches to finding (approximate) solutions to NP complete problems. Selected additional topics may vary.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 305",
            "course_name": "Robotics",
            "description": "ENGR-AD  305 Robotics \nThis course presents an overview of robotics, covering a selection of topics including controls, localization, motion planning, sensing, kinematics, and human-robot interaction, and related social-ethical issues. Practical lab and simulation exercises complement the lectures. The students further specialize and consolidate their knowledge through semester-long hands-on projects that involve the design, implementation, and testing of robotic systems and applications.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 306",
            "course_name": "",
            "description": "ENGR-AD  306\n\n   Intelligent Systems\n\nThis course gives an introduction to Artificial Intelligence (AI). Students learn about intelligent agents that can make near-optimal decisions in a timely manner with incomplete information and limited computational resources. The course addresses search with single and multiple agents, Markov decision processes, reinforcement learning, and tracking. The course includes problem solving and search algorithms, reasoning and fuzzy and probabilistic methods, pattern recognition and neural networks, and genetic algorithms and a brief overview of natural language processing and computer vision. The...\n\n      more description for ENGR-AD  306 »\n\n      \n\n\n\nThis course gives an introduction to Artificial Intelligence (AI). Students learn about intelligent agents that can make near-optimal decisions in a timely manner with incomplete information and limited computational resources. The course addresses search with single and multiple agents, Markov decision processes, reinforcement learning, and tracking. The course includes problem solving and search algorithms, reasoning and fuzzy and probabilistic methods, pattern recognition and neural networks, and genetic algorithms and a brief overview of natural language processing and computer vision. The course provides an engineering context to the mind, psychology, and neuroscience and delves into potential ethical and social consequences of adoption of intelligent systems.\n\n      less description for ENGR-AD  306 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 307",
            "course_name": "",
            "description": "ENGR-AD  307\n\n   Very Large Scale Integration Circuit Design\n\nThe course offers an overview of integrated circuit-design process: planning, design, fabrication and testing; device physics: PN junction, MOSFET and Spice models; inverter static and dynamic behavior and power dissipation; interconnects: cross talk, variation and transistor sizing; logic gates and combinational logic networks; sequential machines and sequential system design; subsystem design: adders, multipliers, static memory (SRAM), dynamic memory (DRAM). Topics include floor planning, clock distribution, power distribution and signal integrity; Input/Output buffers, packaging and testing...\n\n      more description for ENGR-AD  307 »\n\n      \n\n\n\nThe course offers an overview of integrated circuit-design process: planning, design, fabrication and testing; device physics: PN junction, MOSFET and Spice models; inverter static and dynamic behavior and power dissipation; interconnects: cross talk, variation and transistor sizing; logic gates and combinational logic networks; sequential machines and sequential system design; subsystem design: adders, multipliers, static memory (SRAM), dynamic memory (DRAM). Topics include floor planning, clock distribution, power distribution and signal integrity; Input/Output buffers, packaging and testing; IC design methodology and CAD tools; implementations: full custom, application-specific integrated circuit (ASIC), field programmable gate arrays (FPGA). The course provides foundations of VLSI design and custom VLSI design methodology and state-of-the-art CAD tools.\n\n      less description for ENGR-AD  307 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 308",
            "course_name": "",
            "description": "ENGR-AD  308\n\n   Machine Vision\n\nThis course presents an introduction to computer vision, and provides students with hands-on knowledge of various techniques enabling machines to enter the visual world of humans, towards various consumer, research, and industrial applications. Data-driven approaches relying on statistical and machine-learning techniques are emphasized. Camera and calibration, transform domains, multi-resolution and pyramids, clustering and classification, grouping and fitting techniques, as well special detection and recognition techniques are covered. Practical Lab Exercises complement the lectures. The stud...\n\n      more description for ENGR-AD  308 »\n\n      \n\n\n\nThis course presents an introduction to computer vision, and provides students with hands-on knowledge of various techniques enabling machines to enter the visual world of humans, towards various consumer, research, and industrial applications. Data-driven approaches relying on statistical and machine-learning techniques are emphasized. Camera and calibration, transform domains, multi-resolution and pyramids, clustering and classification, grouping and fitting techniques, as well special detection and recognition techniques are covered. Practical Lab Exercises complement the lectures. The students further specialize and consolidate their knowledge through semester-long hands-on projects.\n\n      less description for ENGR-AD  308 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 313",
            "course_name": "Embedded Systems",
            "description": "ENGR-AD  313 Embedded Systems \nThis course presents an overview of Embedded Systems covering a selection of topics including Microcontroller Architecture, Assembler Programming, Interrupts, Peripheral Interfacing, Embedded System Design, Higher-Level Languages on Embedded Systems, as well as a brief introduction to Real-Time Operating Systems. Practical Lab Exercises complement the lectures. The students will further specialize and consolidate their knowledge through semester-long hands-on projects.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 315",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12999",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W007 with Eid, Mohamad08/30/2015 - 12/17/2015 Thu 2.10 PM - 3.25 PM at CAMP W007",
                    "time": "Mon 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Eid, Mohamad"
                },
                {
                    "format": "Laboratory",
                    "class_id": "13000",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W007",
                    "time": "Tue 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Eid, Mohamad"
                }
            ],
            "course_name": "",
            "description": "ENGR-AD  315\n\n   Controls\n\nThe course introduces the principles of dynamic system modeling, analysis, and feedback control design with extensive, hands-on computer simulation. Topics include: modeling and analysis of dynamic systems; description of interconnected systems via transfer functions and block/signal-flow diagrams; system response characterization as transient and steady-state responses and error considerations; stability of dynamical systems (Routh-Hurwitz and Nyquist criteria); graphical methods for dynamical system analysis and design (root locus and Bode plot); and computer-aided feedback control design fo...\n\n      more description for ENGR-AD  315 »\n\n      \n\n\n\nThe course introduces the principles of dynamic system modeling, analysis, and feedback control design with extensive, hands-on computer simulation. Topics include: modeling and analysis of dynamic systems; description of interconnected systems via transfer functions and block/signal-flow diagrams; system response characterization as transient and steady-state responses and error considerations; stability of dynamical systems (Routh-Hurwitz and Nyquist criteria); graphical methods for dynamical system analysis and design (root locus and Bode plot); and computer-aided feedback control design for mechanical, aerospace, robotic, thermo-fluid, and vibratory systems.\n\n      less description for ENGR-AD  315 «",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 318",
            "course_name": "Digital Signal Processing",
            "description": "ENGR-AD  318 Digital Signal Processing \nThe course introduces the principle concepts of discrete-time signals and systems, frequency analysis, sampling of continuous time signals, the z-transform, implementation of discrete time systems, the discrete Fourier transform, fast Fourier transform algorithms, filter design techniques. The labs cover experiential learning of digital signal processing concepts, and require students to use knowledge to create and build prototypes that demonstrate their understanding of the material covered in the lecture.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 320",
            "course_name": "Multimedia Systems and Communications",
            "description": "ENGR-AD  320 Multimedia Systems and Communications \nThe course introduces the basic concepts of multimedia enabling technologies, services, and applications. Topics covered in this course include image and video compression and standards, multimedia networking standards and protocols (such as RTP, RTSP, and IRTP), multimodality and synchronization, Multimedia Internet, Quality of Service and Quality of Experience, and Multimedia\nSecurity and digital watermarking. The labs cover practices of multimedia systems design, and require students to use existing platforms to create and build multimedia contents and applications.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 322",
            "course_name": "",
            "description": "ENGR-AD  322\n\n   Computer Graphics and Vision\n\nThe course introduces the basic concepts of computer graphics and vision. Topics covered in this course include 3D modeling and geometry, simulation, animation, and character animation, Graphics pipeline, Geometric transformations, lighting and light transfer, Illumination and color models, and computer vision theory including image transformation and filtering, color vision, feature extraction, and visual recognition. The labs cover practices of computer graphics and 3D modeling and authoring tools, and require students to use existing platforms to create and build 2D and 3D graphics models a...\n\n      more description for ENGR-AD  322 »\n\n      \n\n\n\nThe course introduces the basic concepts of computer graphics and vision. Topics covered in this course include 3D modeling and geometry, simulation, animation, and character animation, Graphics pipeline, Geometric transformations, lighting and light transfer, Illumination and color models, and computer vision theory including image transformation and filtering, color vision, feature extraction, and visual recognition. The labs cover practices of computer graphics and 3D modeling and authoring tools, and require students to use existing platforms to create and build 2D and 3D graphics models and applications.\n\n      less description for ENGR-AD  322 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 331",
            "course_name": "Thermal Energy Systems",
            "description": "ENGR-AD  331 Thermal Energy Systems \nThis course focuses on the analysis and design of energy-conversion systems. It introduces students to power generation systems. Topics covered include gas and vapor power systems and their components; refrigeration and heat pump systems; combustion; radiation heat exchange; boiling heat transfer characteristics; design of heat exchangers and cooling systems. Students gain an understanding of the fundamentals of such systems and the issues related to their operation from economic, environmental, ethical and safety points of view.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 333",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13124",
                    "section": "001",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": "CAMP W006 with Song, Yong Ak08/30/2015 - 10/20/2015 Thu 2.10 PM - 4.50 PM at CAMP W006",
                    "time": "Tue 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Song, Yong Ak"
                }
            ],
            "course_name": "Machine Design",
            "description": "ENGR-AD  333 Machine Design \nThis course introduces students to fundamentals of machine elements thus, enabling them to employ the knowledge gained to design machines for various practical applications. The course begins with a brief review of stress, deformation and failure, followed by friction and wear. Subsequently, loaded columns, pressurized cylinders and shafts are presented. Bearings, gears, screws, springs, brakes, clutches, and belts are discussed.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 335",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13053",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W007",
                    "time": "Mon 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Shahin, Khaled"
                },
                {
                    "format": "Laboratory",
                    "class_id": "13054",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W007",
                    "time": "Mon 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Shahin, Khaled"
                }
            ],
            "course_name": "Structural Components Analysis",
            "description": "ENGR-AD  335 Structural Components Analysis \nThe course introduces students to the fundamentals of structural components analysis thus enabling them to employ that knowledge for structural analysis and for design of structural members. Topics include: three-dimensional analysis of stress; torsion of thin-walled sections; inelastic torsion; analysis of composite and unsymmetric beams; inelastic bending; beam deflections; elastic buckling of columns; and strength failure criteria.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 336",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13160",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "SOC_SCI 012",
                    "time": "Mon 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Shahin, Khaled"
                },
                {
                    "format": "Recitation",
                    "class_id": "13161",
                    "section": "002",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "SOC_SCI 012",
                    "time": "Wed 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Shahin, Khaled"
                }
            ],
            "course_name": "Structural Systems",
            "description": "ENGR-AD  336 Structural Systems \nIn-depth coverage of structural analysis techniques. Topics include: analysis of statically determinate beams, frames and trusses; deflection calculations using geometrical and energy methods; analysis of statically indeterminate structures using superposition; influence lines; slope deflection, moment distribution, and matrix analysis of structures. Structural design is introduced by a project that applies the analysis to design simple structures.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 337",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13162",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "SOC_SCI 012",
                    "time": "Tue 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Shahin, Khaled"
                },
                {
                    "format": "Laboratory",
                    "class_id": "13163",
                    "section": "002",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "SOC_SCI 012",
                    "time": "Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Shahin, Khaled"
                },
                {
                    "format": "Recitation",
                    "class_id": "13164",
                    "section": "003",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "SOC_SCI 012",
                    "time": "Thu 9.30 AM - 11.55 AM",
                    "open": true,
                    "professor": "Shahin, Khaled"
                }
            ],
            "course_name": "Steel Structures Design",
            "description": "ENGR-AD  337 Steel Structures Design \nThis course examines structural design principles and techniques and codes of design and construction. A detailed treatment of material properties and design based on American Institute of Steel Construction (AISC) codes will be provided. Design of steel beams and columns, in addition to bolted and welded connections will be taught based on the Load Resistance Factor Design (LRFD). The course includes design projects in which students work in groups to simulate and solve specific problems using a 3D structural analysis and design software.",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 338",
            "course_name": "Concrete Structures Design",
            "description": "ENGR-AD  338 Concrete Structures Design \nThis course offers a detailed treatment of reinforced concrete design: Material properties, American Concrete Institute (ACI) load factors and design strength; shear and diagonal tension in beams; reinforced concrete beams; one-way slabs and reinforced concrete columns.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 339",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13055",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 006 with Liu, Engui08/30/2015 - 12/17/2015 Tue 9.15 AM - 10.30 AM at CAMP W007",
                    "time": "Mon 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Liu, Engui"
                },
                {
                    "format": "Laboratory",
                    "class_id": "13056",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W007",
                    "time": "Wed 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Liu, Engui"
                }
            ],
            "course_name": "",
            "description": "ENGR-AD  339\n\n   Environmental Engineering\n\nThis course introduces water and wastewater treatment; stream assimilation and public health; introduction to air pollution and solid waste management; and laboratory analysis of water and wastewater samples and treatment process tests. Students gain an understanding of the interrelatedness of environmental problems around the world and how different socioeconomic, technological, ethical, and other factors can impact both the environment and the approach to solving environmental problems. Factors and parameters affecting design of environmental systems are discussed and design in environmental...\n\n      more description for ENGR-AD  339 »\n\n      \n\n\n\nThis course introduces water and wastewater treatment; stream assimilation and public health; introduction to air pollution and solid waste management; and laboratory analysis of water and wastewater samples and treatment process tests. Students gain an understanding of the interrelatedness of environmental problems around the world and how different socioeconomic, technological, ethical, and other factors can impact both the environment and the approach to solving environmental problems. Factors and parameters affecting design of environmental systems are discussed and design in environmental engineering is introduced.\n\n      less description for ENGR-AD  339 «",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 340",
            "course_name": "Water and Wastewater Systems Design",
            "description": "ENGR-AD  340 Water and Wastewater Systems Design \nThis course introduces the students to the concepts of design related to solving problems in environmental engineering. It provides an exposure to real-world problems in water systems and wastewater treatment. Students work in small teams and experience the design process, including the definition of the design objectives and constraints, formation of the design concept, synthesis, and analysis of design options, as well as the development and testing of the proposed solution.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 341",
            "course_name": "Finite Element Modeling, and Analysis",
            "description": "ENGR-AD  341 Finite Element Modeling, and Analysis \nStudents study the basic theory and equations involved in the finite element analysis (FEA) for stimulating behavior of materials and structures. Topics include use of shape functions, numerical integration, assembly of finite elements into a structure, and solution of the resulting system of equations. The course emphasizes both theory and application of modeling for simulation. Students also learn to recognize modeling errors and inconsistencies that could lead to either inaccurate or invalid results.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 342",
            "course_name": "Geotechnical Engineering",
            "description": "ENGR-AD  342 Geotechnical Engineering \nThis course introduces soil mechanics and foundation engineering, including origin of soils; phase relationships; classification of soils; permeability; effective stress; seepage; consolidation; shear strength; slope stability; and bearing capacity. Design in geotechnical engineering is introduced and parameters effecting design are discussed.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 343",
            "course_name": "Foundation Engineering Design",
            "description": "ENGR-AD  343 Foundation Engineering Design \nThis course introduces the development of foundation engineering, including site exploration, soil sampling, interpretation of boring logs, bearing capacity of footings, settlement of structures, lateral earth pressure. Design of retaining walls, design of braced excavations and sheet pile walls; and design of deep foundations are covered.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 344",
            "course_name": "",
            "description": "ENGR-AD  344\n\n   Transportation and Traffic Engineering\n\nThis course introduces the different modes of transportation and their characteristics with emphasis on road users, vehicles, highways and control devices and their impact on traffic operations. It also introduces the quantification of traffic stream characteristics and the design and use of traffic control devices, including a detailed treatment of traffic signal timing and design for both pre-timed and actuated signals. Coordination of signal systems on arterials and in networks is covered. A broad overview of highway traffic safety issues, policies, programs, and mitigation measures are inc...\n\n      more description for ENGR-AD  344 »\n\n      \n\n\n\nThis course introduces the different modes of transportation and their characteristics with emphasis on road users, vehicles, highways and control devices and their impact on traffic operations. It also introduces the quantification of traffic stream characteristics and the design and use of traffic control devices, including a detailed treatment of traffic signal timing and design for both pre-timed and actuated signals. Coordination of signal systems on arterials and in networks is covered. A broad overview of highway traffic safety issues, policies, programs, and mitigation measures are included.\n\n      less description for ENGR-AD  344 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 345",
            "course_name": "Design of Traffic Systems",
            "description": "ENGR-AD  345 Design of Traffic Systems \nThis course provides an introduction to design of traffic systems with emphasis on highway design. Students are introduced to the basic design concepts of horizontal and vertical alignment, super elevation, and cross-section design. The course also covers fundamentals of intersection and interchange design, pavement design, design of parking facilities, as well as bikeway and walkway design.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 346",
            "course_name": "Water Resources Engineering",
            "description": "ENGR-AD  346 Water Resources Engineering \nThis course provides a detailed overview of water resources engineering, including both analysis and design elements. Topics covered: open-channel flow; pipe networks; reservoir balances; hydrologic techniques; surface water and ground-water supplies; water demand; and development of water resources for multiple purposes.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 349",
            "course_name": "Mechatronics",
            "description": "ENGR-AD  349 Mechatronics \nThe course introduces the principles of mechatronic system intended to provide the student with foundational concepts in mechatronics and practical familiarity with common elements making up mechatronic systems. Laboratory experiments are designed to give the student hands-on experience with components and measurement equipment used in the design of mechatronic products.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 368",
            "course_name": "Selected Topics in Information and Computational Systems",
            "description": "ENGR-AD  368 Selected Topics in Information and Computational Systems \nThis course explores advanced topics of special interest and is designed to aid students in gaining extra knowledge in an area not covered in the program's mainstay courses. It may be repeated for credit. The course is open to junior and senior students. Academic mentor's permission is required.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 369",
            "course_name": "Selected Topics in Communication and Electronic Systems",
            "description": "ENGR-AD  369 Selected Topics in Communication and Electronic Systems \nThis course explores advanced topics of special interest and is designed to aid students in gaining extra knowledge in an area not covered in the program's mainstay courses. It may be repeated for credits. The course is open to junior and senior students. Academic mentor's permission is required.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 379",
            "course_name": "Selected Topics in Urban Systems",
            "description": "ENGR-AD  379 Selected Topics in Urban Systems \nThis course explores advanced topics of special interest and is designed to aid students in gaining extra knowledge in an area not covered in the program's mainstay courses. It may be repeated for credits. The course is open to junior and senior students. Academic mentor's permission is required.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 381",
            "course_name": "",
            "description": "ENGR-AD  381\n\n   Bio-sensors and Bio-chips\n\nThis course covers the principles, technologies, methods and applications of biosensors and bioinstrumentation beginning with an examination of the ethical, legal, cultural, religious, and social implications of nanotechnologies. The objective of this course is to link engineering principles to understanding of biosystems in sensors and bioelectronics. It provides the student with detail of methods and procedures used in the design, fabrication, and application of biosensors and bioelectronic devices. The fundamentals of measurement science are applied to optical, electrochemical, mass, and pr...\n\n      more description for ENGR-AD  381 »\n\n      \n\n\n\nThis course covers the principles, technologies, methods and applications of biosensors and bioinstrumentation beginning with an examination of the ethical, legal, cultural, religious, and social implications of nanotechnologies. The objective of this course is to link engineering principles to understanding of biosystems in sensors and bioelectronics. It provides the student with detail of methods and procedures used in the design, fabrication, and application of biosensors and bioelectronic devices. The fundamentals of measurement science are applied to optical, electrochemical, mass, and pressure signal\ntransduction. Upon successful completion of this course, students are expected to be able to explain biosensing and transducing techniques, design, and construct biosensors instrumentation.\n\n      less description for ENGR-AD  381 «",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 382",
            "course_name": "Bioimaging",
            "description": "ENGR-AD  382 Bioimaging \nThis course presents an introduction to image formation, processing, and related techniques, as they pertain to imaging of biological structures for medical and other applications. Ultrasound, Magnetic Resonance Imaging, X-Ray Tomography, and Nuclear Medicine are among the topics covered, together with a hands-on introduction to biomedical image processing and pattern recognition.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 389",
            "course_name": "Selected Topics in BioMedical and Health Systems",
            "description": "ENGR-AD  389 Selected Topics in BioMedical and Health Systems \nThis course explores advanced topics of special interest in biomedical and health care systems and applications and is designed to aid students in gaining extra knowledge in an area not covered in the program's mainstay courses. It may be repeated for credits. The course is open to junior and senior students. Academic mentor's permission is required.",
            "offering": false
        },
        {
            "course_id": "ENGR-AD 400",
            "classes": [
                {},
                {
                    "format": "Laboratory",
                    "class_id": "12851",
                    "section": "002",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": null,
                    "time": "Sun 11.00 AM - 4.50 PM",
                    "open": true,
                    "professor": "SOC_SCI 016"
                }
            ],
            "course_name": "",
            "description": "ENGR-AD  400\n\n   Senior Capstone Seminar\n\nThe goal of the Capstone Design Project is to provide students with a major design experience that leverages the knowledge and skills acquired through their undergraduate studies and co-curricular experiences. Its structure includes a process of design with measurable metrics, and incorporation of appropriate engineering standards and multiple realistic constraints. Emphasis is placed on clearly framing the design problem and following the design process to result in an optimized design solution. Students are encouraged to build prototypes of their designs and seek validation of their solution...\n\n      more description for ENGR-AD  400 »\n\n      \n\n\n\nThe goal of the Capstone Design Project is to provide students with a major design experience that leverages the knowledge and skills acquired through their undergraduate studies and co-curricular experiences. Its structure includes a process of design with measurable metrics, and incorporation of appropriate engineering standards and multiple realistic constraints. Emphasis is placed on clearly framing the design problem and following the design process to result in an optimized design solution. Students are encouraged to build prototypes of their designs and seek validation of their solutions through simulations and experiments, as appropriate. \n\nThe Capstone Project aims to be collaborative and trans-disciplinary across several engineering streams. The emphasis is on students applying the design process to solve real-world problems in a 21st century, global context.  The projects address engineering and technology topics that overlap with the sciences, social sciences, liberal arts or business. The Capstone provides an opportunity to integrate technical, human, aesthetic, business and ethical concerns with engineering design. Students practice critical skills in communication, team-building, and project management. There is a mid-semester review of the projects. Students complete their design, as well as build and test their prototypes, if applicable, in spring semester. The senior year culminates in a comprehensive project report and design review by a committee of faculty and other professionals.\n\nCapstone Seminar (ENGR-AD-400), Capstone Design Project I (ENGR-AD-401) and Capstone Design Project II (ENGR-AD-402) collectively offer the engineering capstone experience to seniors. Capstone Seminar (Fall) and Capstone Design Project I (Fall) are two credits each. Capstone seminar focuses on skill building, project management and Ethics. Capstone Design Project I focus on different aspects of the capstone project such as problem definition and creating the design solution. Capstone Design Project II in spring consists of two, seven week modules. The design solution proposed in Capstone Design Project I is implemented in the first module. It is tested and validated in Module II.\n\n      less description for ENGR-AD  400 «",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 401",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "13145",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": null,
                    "time": "Sun 9.15 AM - 4.50 PM",
                    "open": true,
                    "professor": "SOC_SCI 012"
                }
            ],
            "course_name": "",
            "description": "ENGR-AD  401\n\n   Capstone Design Project l\n\nThe goal of the Capstone Design Project is to provide students with a major design experience that leverages the knowledge and skills acquired through their undergraduate studies and co-curricular experiences. Its structure includes a process of design with measurable metrics, and incorporation of appropriate engineering standards and multiple realistic constraints. Emphasis is placed on clearly framing the design problem and following the design process to result in an optimized design solution. Students are encouraged to build prototypes of their designs and seek validation of their solution...\n\n      more description for ENGR-AD  401 »\n\n      \n\n\n\nThe goal of the Capstone Design Project is to provide students with a major design experience that leverages the knowledge and skills acquired through their undergraduate studies and co-curricular experiences. Its structure includes a process of design with measurable metrics, and incorporation of appropriate engineering standards and multiple realistic constraints. Emphasis is placed on clearly framing the design problem and following the design process to result in an optimized design solution. Students are encouraged to build prototypes of their designs and seek validation of their solutions through simulations and experiments, as appropriate. \n\nThe Capstone Project aims to be collaborative and trans-disciplinary across several engineering streams. The emphasis is on students applying the design process to solve real-world problems in a 21st century, global context.  The projects address engineering and technology topics that overlap with the sciences, social sciences, liberal arts or business. The Capstone provides an opportunity to integrate technical, human, aesthetic, business and ethical concerns with engineering design. Students practice critical skills in communication, team-building, and project management. There is a mid-semester review of the projects. Students complete their design, as well as build and test their prototypes, if applicable, in spring semester. The senior year culminates in a comprehensive project report and design review by a committee of faculty and other professionals.\n\nCapstone Seminar (ENGR-AD-400), Capstone Design Project I (ENGR-AD-401) and Capstone Design Project II (ENGR-AD-402) collectively offer the engineering capstone experience to seniors. Capstone Seminar (Fall) and Capstone Design Project I (Fall) are two credits each. Capstone seminar focuses on skill building, project management and Ethics. Capstone Design Project I focus on different aspects of the capstone project such as problem definition and creating the design solution. Capstone Design Project II in spring consists of two, seven week modules. The design solution proposed in Capstone Design Project I is implemented in the first module. It is tested and validated in Module II.\n\n      less description for ENGR-AD  401 «",
            "offering": true
        },
        {
            "course_id": "ENGR-AD 402",
            "course_name": "",
            "description": "ENGR-AD  402\n\n   Capstone Design Project II\n\nThe goal of the Capstone Design Project is to provide students with a major design experience that leverages the knowledge and skills acquired through their undergraduate studies and co-curricular experiences. Its structure includes a process of design with measurable metrics, and incorporation of appropriate engineering standards and multiple realistic constraints. Emphasis is placed on clearly framing the design problem and following the design process to result in an optimized design solution. Students are encouraged to build prototypes of their designs and seek validation of their solution...\n\n      more description for ENGR-AD  402 »\n\n      \n\n\n\nThe goal of the Capstone Design Project is to provide students with a major design experience that leverages the knowledge and skills acquired through their undergraduate studies and co-curricular experiences. Its structure includes a process of design with measurable metrics, and incorporation of appropriate engineering standards and multiple realistic constraints. Emphasis is placed on clearly framing the design problem and following the design process to result in an optimized design solution. Students are encouraged to build prototypes of their designs and seek validation of their solutions through simulations and experiments, as appropriate. \n\nThe Capstone Project aims to be collaborative and trans-disciplinary across several engineering streams. The emphasis is on students applying the design process to solve real-world problems in a 21st century, global context.  The projects address engineering and technology topics that overlap with the sciences, social sciences, liberal arts or business. The Capstone provides an opportunity to integrate technical, human, aesthetic, business and ethical concerns with engineering design. Students practice critical skills in communication, team-building, and project management. There is a mid-semester review of the projects. Students complete their design, as well as build and test their prototypes, if applicable, in spring semester. The senior year culminates in a comprehensive project report and design review by a committee of faculty and other professionals.\n\nCapstone Seminar (ENGR-AD-400), Capstone Design Project I (ENGR-AD-401) and Capstone Design Project II (ENGR-AD-402) collectively offer the engineering capstone experience to seniors. Capstone Seminar (Fall) and Capstone Design Project I (Fall) are two credits each. Capstone seminar focuses on skill building, project management and Ethics. Capstone Design Project I focus on different aspects of the capstone project such as problem definition and creating the design solution. Capstone Design Project II in spring consists of two, seven week modules. The design solution proposed in Capstone Design Project I is implemented in the first module. It is tested and validated in Module II.\n\n      less description for ENGR-AD  402 «",
            "offering": false
        }
    ]
}