{
    "major_id": "EHSC-GA",
    "file": "./2015-2016/Environmental_Health_Science_(EHSC-GA).html",
    "courses": [
        {
            "course_id": "EHSC-GA 1004",
            "course_name": "Environmental Health",
            "description": "EHSC-GA 1004 Environmental Health \nIntroduction to basic concepts of environmental health, including pollutant sources, their fate, and impacts in the environment (air, water, food, and soil) and occupational settings.  Human hazard recognition and evaluation are presented in terms of toxicology, epidemiology, exposure assessment, and risk assessment, including discussion of ongoing environmental controversies.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 1005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1441",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 125",
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Wirgin, Isaac"
                }
            ],
            "course_name": "",
            "description": "EHSC-GA 1005\n\n   Ecotoxicology: Hudson River Case Study\n\nEcosystems throughout the country are polluted with a variety of toxic chemicals. This course uses the Hudson River as a model to investigate the sources, transport, transformation, toxic effects, management strategies, and remediation of polluted ecosystems. Over 200 miles of the Hudson River estuary has been designated a U.S. federal Superfund site because of contamination from PCBs, dioxins, and metals. As baseline information, this highly interdisciplinary course initially investigates the geological history of the Hudson River, its hydrology, and inventory of species composition. Those ch...\n\n      more description for EHSC-GA 1005 »\n\n      \n\n\n\nEcosystems throughout the country are polluted with a variety of toxic chemicals. This course uses the Hudson River as a model to investigate the sources, transport, transformation, toxic effects, management strategies, and remediation of polluted ecosystems. Over 200 miles of the Hudson River estuary has been designated a U.S. federal Superfund site because of contamination from PCBs, dioxins, and metals. As baseline information, this highly interdisciplinary course initially investigates the geological history of the Hudson River, its hydrology, and inventory of species composition. Those chemical, physical, and biological factors impacting the bioavailability of contaminants to the ecosystem are presented. Efforts to model the trophic transfer of PCBs through the food chain are discussed. Toxic effects (cancer, reproductive disorders, immunological changes, etc.) of these contaminants to Hudson River fish, bird, and mammalian populations are highlighted. Models of resistance of populations to chemical contaminants are explored. Accumulation of toxicants and possible effects on human consumers of Hudson River resources are introduced. Potential beneficial effects of microbial bioremediation strategies are introduced. Problems and issues in the management of Hudson River Superfund sites are discussed by regulatory officials as are the strategies of advocacy groups to remediate these sites. Impacts of remediation of one site on its natural populations are presented.\n\n      less description for EHSC-GA 1005 «",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 1006",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1442",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KIMM 803",
                    "time": "Wed 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Zelikoff, Judith"
                }
            ],
            "course_name": "Toxicology",
            "description": "EHSC-GA 1006 Toxicology \nIntroduction to the science of toxicology, stressing basic concepts essential to understanding the action of exogenous chemical agents on biological systems. Principles underlying the absorption, metabolism, and elimination of chemicals are discussed. Toxicokinetics, specific classes of toxic responses, and experimental methods used to assess toxicity are also examined.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 1007",
            "course_name": "Terrorism: Chemical & Biological Warfare",
            "description": "EHSC-GA 1007 Terrorism: Chemical & Biological Warfare \nSurvey of the agents of terrorism, their immediate effects, long-term consequences, and emerging research questions. Agents of terrorism include chemical weapons, radioactive materials, infectious agents, torture, and ethnic conflict. Long-term consequences include stress disorders, respiratory disorders, and sensitization and conditioned responses to noxious stimuli. Students meet with a broad range of experts for help in dealing with these questions.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 1008",
            "course_name": "",
            "description": "EHSC-GA 1008\n\n   An Introduction to Toxicogenomics\n\nToxicogenomics is an emerging field of study in which genomic and bioinformatic techniques are utilized to assess the effects of toxicants in our environment on living organisms. As currently practiced, toxicogenomics deals primarily with the measurement and interpretation of global gene and protein expression in response to exposure to xenobiotics. This course begins with a comprehensive presentation of various microarray platforms and describes how they are used to measure global gene expression as mRNA. Various methods of measuring protein expression are also presented, as well as methods o...\n\n      more description for EHSC-GA 1008 »\n\n      \n\n\n\nToxicogenomics is an emerging field of study in which genomic and bioinformatic techniques are utilized to assess the effects of toxicants in our environment on living organisms. As currently practiced, toxicogenomics deals primarily with the measurement and interpretation of global gene and protein expression in response to exposure to xenobiotics. This course begins with a comprehensive presentation of various microarray platforms and describes how they are used to measure global gene expression as mRNA. Various methods of measuring protein expression are also presented, as well as methods of data organization and analysis that are necessary for conversion of the massive volume of information generated by microarray technology into useful knowledge. Examples from the published literature are presented throughout that demonstrate both the principles of microarray technology and the practical applications of toxicogenomics. The latter include the classification of tumors in human subjects and prediction of their response to treatment, the identification of biomarkers of disease, the categorization of toxicants, and the elucidation of mechanisms of toxicity.\n\n      less description for EHSC-GA 1008 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 1009",
            "course_name": "",
            "description": "EHSC-GA 1009\n\n   Biomarker Apps in Humans With Environ Exposures\n\nApplication of biomarkers in human populations is a useful approach that incorporates advanced laboratory technology with epidemiology to evaluate the health hazards and risk of exposure to environmental pollutants at low levels. It is increasingly utilized as a tool to understand the interactions between genes and environmental exposures and to identify ?at-risk? populations and individuals. This course covers both the basic concepts and the practical issues involved in conducting biomarker studies in human populations with environmental exposures. Topics include the strengths and limitations...\n\n      more description for EHSC-GA 1009 »\n\n      \n\n\n\nApplication of biomarkers in human populations is a useful approach that incorporates advanced laboratory technology with epidemiology to evaluate the health hazards and risk of exposure to environmental pollutants at low levels. It is increasingly utilized as a tool to understand the interactions between genes and environmental exposures and to identify ?at-risk? populations and individuals. This course covers both the basic concepts and the practical issues involved in conducting biomarker studies in human populations with environmental exposures. Topics include the strengths and limitations of biomarker applications, criteria for the selection and validation of commonly used biomarkers, approaches of newly emerging technologies (e.g., proteomics) relevant to discovery and development of new biomarkers, issues of quality control, and ethical considerations in biomarker research. The course also provides students with lectures focusing on specific environmental carcinogens regarding the current findings and future research needs of their biomarker applications.\n\n      less description for EHSC-GA 1009 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 1010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17385",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL23",
                    "time": "Tue 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "Thurston, George"
                }
            ],
            "course_name": "",
            "description": "EHSC-GA 1010\n\n   Global Climate Change, Air Pollution, and Health\n\nGlobal climate change concerns have made clear the need to better understand the interaction of air pollution and weather. This course gives the student an appreciation for the scientific bases for the known effects of weather on air pollution and, conversely, for the known and hypothesized effects of air pollution on weather and climate change, as well as their respective interactions with human health. Lecture topics include the fundamentals of atmospheric motions and weather; air pollution formation and dispersion in the atmosphere; acidic air pollution and acid rain; the health effects of ...\n\n      more description for EHSC-GA 1010 »\n\n      \n\n\n\nGlobal climate change concerns have made clear the need to better understand the interaction of air pollution and weather. This course gives the student an appreciation for the scientific bases for the known effects of weather on air pollution and, conversely, for the known and hypothesized effects of air pollution on weather and climate change, as well as their respective interactions with human health. Lecture topics include the fundamentals of atmospheric motions and weather; air pollution formation and dispersion in the atmosphere; acidic air pollution and acid rain; the health effects of air pollution and of extreme weather; global-scale weather and air pollution; and the effects of air pollution on the ozone layer and climate change.\n\n      less description for EHSC-GA 1010 «",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 1011",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1443",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL138",
                    "time": "Wed 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "Cromar, Kevin"
                }
            ],
            "course_name": "Global Issues in Environmental Health",
            "description": "EHSC-GA 1011 Global Issues in Environmental Health",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 1012",
            "course_name": "Global Issues in Cancer Cause, Prevent,& Control",
            "description": "EHSC-GA 1012 Global Issues in Cancer Cause, Prevent,& Control",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 1013",
            "course_name": "Environmental Health Policy",
            "description": "EHSC-GA 1013 Environmental Health Policy",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 1014",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17620",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 520",
                    "time": "Thu 4.55 PM - 7.35 PM",
                    "open": true,
                    "professor": "Rom, William"
                }
            ],
            "course_name": "Current Issues in Environment Health Policy",
            "description": "EHSC-GA 1014 Current Issues in Environment Health Policy",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2011",
            "course_name": "Analyt Chem of Env Cont",
            "description": "EHSC-GA 2011 Analyt Chem of Env Cont",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2012",
            "course_name": "Radiation Hygiene Measurements",
            "description": "EHSC-GA 2012 Radiation Hygiene Measurements",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2013",
            "course_name": "Radiation Hygiene Measurements",
            "description": "EHSC-GA 2013 Radiation Hygiene Measurements",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2014",
            "course_name": "Radiochemical Analysis",
            "description": "EHSC-GA 2014 Radiochemical Analysis",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2015",
            "course_name": "Gen Toxicol and Path I",
            "description": "EHSC-GA 2015 Gen Toxicol and Path I",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2016",
            "course_name": "Gen & Toxicol Path II",
            "description": "EHSC-GA 2016 Gen & Toxicol Path II",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2017",
            "course_name": "Environ Radioactivity",
            "description": "EHSC-GA 2017 Environ Radioactivity \nComprehensive evaluation of the levels, distribution, and variability of radioactivity in the environment. Sources and transport of radionuclides in the atmosphere, hydrosphere, and biosphere. Health effects of radioactive pollution from natural sources, nuclear weapons testing, and the nuclear fuel cycle.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2018",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16630",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "12WV L113",
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Klein, Catherine"
                }
            ],
            "course_name": "DNA Replication, Damage & Repair",
            "description": "EHSC-GA 2018 DNA Replication, Damage & Repair \nThe basic processes involved in DNA replication, damage formation, and processing, with an emphasis on eukaryotic cells. Topics include DNA structure and the chemistry of adduct formation, DNA polymerase structure and function, DNA replication mechanisms and fidelity, the enzymology of DNA repair, and mechanisms of mutagenesis.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2020",
            "course_name": "Radiological Physics",
            "description": "EHSC-GA 2020 Radiological Physics",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2025",
            "course_name": "Communication skills for Biomedical Students",
            "description": "EHSC-GA 2025 Communication skills for Biomedical Students \nBasic principles of effective scientific communication are presented in this course. Lectures and hands-on practice sessions cover (1) poster presentations for scientific meetings, (2) brief verbal presentations, and (3) writing papers for publication in a scientific journal. Students are encouraged to use their own data for the various communication formats. Students are expected to attend and to critique seminars given at Sterling Forest by outside speakers that are sponsored by the Department of Environmental Medicine; these seminars are given on the same day as the class.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2026",
            "course_name": "Research Methods in Molecular Toxicology",
            "description": "EHSC-GA 2026 Research Methods in Molecular Toxicology",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2027",
            "course_name": "Sp Top Biochemical Tox",
            "description": "EHSC-GA 2027 Sp Top Biochemical Tox",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2028",
            "course_name": "Sp Top Biochem Toxicolog",
            "description": "EHSC-GA 2028 Sp Top Biochem Toxicolog",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2029",
            "course_name": "Radiation Dosimetry",
            "description": "EHSC-GA 2029 Radiation Dosimetry",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2031",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1444",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorials in Env Hlth Sc",
            "description": "EHSC-GA 2031 Tutorials in Env Hlth Sc \nTutorials arranged on an individual basis with a faculty member for the advanced study of special subjects in the environmental health sciences. A short brief, written description of the topics being covered must be approved in advance of registering for this tutorial. A comprehensive paper or examination is required.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2033",
            "course_name": "Aerosol Science",
            "description": "EHSC-GA 2033 Aerosol Science \nComprehensive introduction to the properties, behavior, and measurement of suspended particles, including background on their underlying physical and chemical characteristics. Presents the properties of ambient atmospheric aerosols and their respiratory deposition.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2035",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16632",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-1",
                    "time": "Tue 4.55 PM - 7.35 PM",
                    "open": true,
                    "professor": "Lall, Ramona"
                }
            ],
            "course_name": "Environmental Hygiene Measurements",
            "description": "EHSC-GA 2035 Environmental Hygiene Measurements \nInstrumentation, procedures, and strategies for quantitative evaluation and control of hazardous exposures. Emphasis is on airborne contaminants, including particles, gases, and bioaerosols, plus physical agents, including ionizing and nonionizing radiations, noise, and abnormal temperatures. Decision-making criteria are considered for each agent, as is the performance of environmental control methods, including ventilation and local exhaust systems.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2037",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "16631",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Gordon, Terry",
                    "time": "Mon 1.00 PM - 3.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Environmental Hygiene Lab I",
            "description": "EHSC-GA 2037 Environmental Hygiene Lab I \nCovers the instrumental techniques and procedures for the subjects covered in G48.2035.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2038",
            "course_name": "Environ Hygiene Lab II",
            "description": "EHSC-GA 2038 Environ Hygiene Lab II \nCovers the instrumental techniques and procedures for the subjects covered in G48.2035.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2039",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1445",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "ARC_ LL02",
                    "time": "Thu 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "Marmor, Michael"
                }
            ],
            "course_name": "",
            "description": "EHSC-GA 2039\n\n   Introduction to Epidemiology\n\nEpidemiology, one of the key sciences of public health, is the study of the distribution and determinants of disease in humans. In this course, principles and methods of epidemiology are developed for students intending to conduct independent research on health-related issues. Topics include measures of disease occurrence and risk, designs for observational and interventional studies, sensitivity and specificity of clinical tests, methods for epidemiologic analyses, and ethical issues regarding conduct of epidemiologic studies. Class time is divided among lectures, discussions evaluating class...\n\n      more description for EHSC-GA 2039 »\n\n      \n\n\n\nEpidemiology, one of the key sciences of public health, is the study of the distribution and determinants of disease in humans. In this course, principles and methods of epidemiology are developed for students intending to conduct independent research on health-related issues. Topics include measures of disease occurrence and risk, designs for observational and interventional studies, sensitivity and specificity of clinical tests, methods for epidemiologic analyses, and ethical issues regarding conduct of epidemiologic studies. Class time is divided among lectures, discussions evaluating classical and current studies that have used epidemiologic methods, and development of projects that form the basis of term papers. Grades are based on class presentations, term papers, pop quizzes, and midterm and final examinations.\n\n      less description for EHSC-GA 2039 «",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2040",
            "course_name": "Molecular and Genetic Toxicology",
            "description": "EHSC-GA 2040 Molecular and Genetic Toxicology \nAnalyzes the modes by which organisms handle damage to DNA by physical and chemical agents, the mechanisms of converting damage to mutations, and the theoretical basis for carcinogenesis screening methods utilizing mutagenesis. Topics include systems for mutagenesis testing, mutational spectra, and inducible responses to DNA damage.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2041",
            "course_name": "Env Physio of Resp Syste",
            "description": "EHSC-GA 2041 Env Physio of Resp Syste",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2042",
            "course_name": "",
            "description": "EHSC-GA 2042\n\n   Genetic Susceptibility & Toxicogenomics\n\nGenetic variation at many loci has been described in human and wildlife populations. Recent studies have explored the relationships between this variation and susceptibility to diseases. This course examines the extent of genetic variation in genomes, the techniques by which sensitive genes and allelic variants are identified, and the consequences of genetic variation on phenotypic expression. Emphasis is on the relationship between genetic variation and susceptibility to environmentally induced diseases, such as cancers, through effects on toxicant metabolism, DNA repair, and signal transduct...\n\n      more description for EHSC-GA 2042 »\n\n      \n\n\n\nGenetic variation at many loci has been described in human and wildlife populations. Recent studies have explored the relationships between this variation and susceptibility to diseases. This course examines the extent of genetic variation in genomes, the techniques by which sensitive genes and allelic variants are identified, and the consequences of genetic variation on phenotypic expression. Emphasis is on the relationship between genetic variation and susceptibility to environmentally induced diseases, such as cancers, through effects on toxicant metabolism, DNA repair, and signal transduction genes. The role of genetic adaptations to resistance of natural populations of wildlife is also presented. In addition, emphasis is on epidemiological techniques used to explore relationships between polymorphisms and disease and the moral and legal ramifications of access to this data.\n\n      less description for EHSC-GA 2042 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2043",
            "course_name": "",
            "description": "EHSC-GA 2043\n\n   Cell Signaling & Environmental Stress\n\nIn the last few years, we have gained extensive knowledge of how cell surface receptors transmit signals to the nucleus, thereby controlling the expression of genetic programs involved in many cellular processes, including normal and aberrant cell growth. Signaling motifs (e.g., nuclear transcription receptors, kinase/phosphatase cascades, G-coupled protein receptors, etc.) are components of signaling webs, which are targets of disruption by environmental pollutants. This course covers various signal transduction pathways such as cytokine signaling and signal transduction to the nucleus by mit...\n\n      more description for EHSC-GA 2043 »\n\n      \n\n\n\nIn the last few years, we have gained extensive knowledge of how cell surface receptors transmit signals to the nucleus, thereby controlling the expression of genetic programs involved in many cellular processes, including normal and aberrant cell growth. Signaling motifs (e.g., nuclear transcription receptors, kinase/phosphatase cascades, G-coupled protein receptors, etc.) are components of signaling webs, which are targets of disruption by environmental pollutants. This course covers various signal transduction pathways such as cytokine signaling and signal transduction to the nucleus by mitogen-activated protein kinase (MAPK). Some of the known detailed mechanisms, such as regulation of MAPK by phosphatases (removal of phosphorylation) and dual phosphorylation of MAPK on the relevant threonine and tyrosine leading to the downstream activator protein-1 (AP-1) activation, are discussed. The course further illustrates that alteration of the pathways by environmental pollutants, such as transition metals and airborne particles, may be implicated in pathological processes, cancer, inflammation, and chronic obstructive pulmonary diseases. Students gain a basic understanding of principles emerging in the signaling field and how they serve as guiding tools for students engaged in basic, clinical, and translational medical research.\n\n      less description for EHSC-GA 2043 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2044",
            "course_name": "Epidemiologic Methods",
            "description": "EHSC-GA 2044 Epidemiologic Methods \nPrinciples introduced in G48.2039 are further developed. Methods to design, analyze, and interpret epidemiologic studies concerned with disease etiology are presented. The main focus is on cohort and case-control studies. Topics include bias, confounding, measurement error, and sample size determination.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2045",
            "course_name": "Methods for Categorical Data Analysis Hlth SCI",
            "description": "EHSC-GA 2045 Methods for Categorical Data Analysis Hlth SCI \nFocuses on statistical techniques for the analysis of categorical data, with specific applications to epidemiologic and clinical studies. Methods for the analysis of contingency tables; risk assessment in retrospective and prospective studies; and adjustment for confounding, matching, and effect modification are discussed. Analytic techniques include Mantel-Haenszel summary chi-square procedures, logistic regression, and log-linear models.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2046",
            "course_name": "Epidemiology of Cancer",
            "description": "EHSC-GA 2046 Epidemiology of Cancer \nThe epidemiology of cancer in its biological context and illustration of how it could be used in the search for cancer etiology and control. Role of viruses, radiation, nutrition, hormones, tobacco, occupational exposures, and genetic factors in the causation of cancer. Strategies for exposure and risk assessment and for cancer control, including screening. Issues of study design and statistical analysis in cancer epidemiology.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2047",
            "course_name": "Intro to Survival Analysis",
            "description": "EHSC-GA 2047 Intro to Survival Analysis \nThis course reviews the basic concept of survival analysis, including hazard functions, survival functions, types of censoring, Kaplan-Meier estimates, and log-rank tests. Parametric inference includes the Exponential and Weibull distribution. The proportional hazard model and its extension to time-dependent covariates are included. Additional topics include accelerated failure time model, competing risks and multistate models. Recurrent event data are also clinical and epidemiological examples used to illustrate the various statistical procedures.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2048",
            "course_name": "Air Pollution Transport and Modeling",
            "description": "EHSC-GA 2048 Air Pollution Transport and Modeling",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2049",
            "course_name": "Applied Epidemiologic Methods",
            "description": "EHSC-GA 2049 Applied Epidemiologic Methods",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2050",
            "course_name": "Epigenetics & Environmental Diseases",
            "description": "EHSC-GA 2050 Epigenetics & Environmental Diseases",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2051",
            "course_name": "Children's Environmental Health",
            "description": "EHSC-GA 2051 Children's Environmental Health",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2100",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1446",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Indep Study: Ergonomics & Biomech",
            "description": "EHSC-GA 2100 Indep Study: Ergonomics & Biomech \nThis course is intended to promote original research in the general fields of ergonomics and biomechanics. Study is carried out under the supervision of one or more faculty members. Students enrolled in this course are encouraged to utilize all appropriate laboratory and computer equipment. At the end of each semester, the student is expected to submit a written report.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2101",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1447",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "EHSC-GA 2101\n\n   Biomechanics\n\nThis course consists of two parts. In the first part, the basic concepts of mechanics, such as force and torque, are introduced. These concepts are first applied to analyze relatively simple mechanical systems. Analogies between basic mechanical elements and human body parts are formed, and the principles of mechanics are then applied to analyze muscle and joint reaction forces controlling and coordinating the movements of major joints of the human musculoskeletal system. The second part of the course is devoted to the analyses of ?moving? systems with applications to human motion analyses and...\n\n      more description for EHSC-GA 2101 »\n\n      \n\n\n\nThis course consists of two parts. In the first part, the basic concepts of mechanics, such as force and torque, are introduced. These concepts are first applied to analyze relatively simple mechanical systems. Analogies between basic mechanical elements and human body parts are formed, and the principles of mechanics are then applied to analyze muscle and joint reaction forces controlling and coordinating the movements of major joints of the human musculoskeletal system. The second part of the course is devoted to the analyses of ?moving? systems with applications to human motion analyses and sports mechanics. The topics covered include description and causes of linear and rotational motion, one- and two-dimensional linear and angular kinematics and kinetics motion analysis as well as concepts of work, energy, power, impulse, and momentum and their application for the analysis of bodies in motion. Course lectures are carried out by solving examples and problems on the covered topics.\n\n      less description for EHSC-GA 2101 «",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2102",
            "course_name": "Biomechanics II",
            "description": "EHSC-GA 2102 Biomechanics II",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2111",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1448",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Weiner, Shira",
                    "time": "Tue 5.30 PM - 8.15 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "EHSC-GA 2111\n\n   Physical Biomechanics\n\nThis course consists of two parts. In the first part, the laws of physics and basic concepts of biology, physiology, and mechanics are applied to explain the effect of applied forces and the biomechanical response of the tissues of the neuromusculoskeletal system. The second part of the course uses basic biomechanical concepts to describe motion undergone by various body/joint segments and the forces acting on these body parts during normal daily activities. To facilitate the understanding of the basic tissue/joint musculoskeletal biomechanics, selected case studies are used over the course of...\n\n      more description for EHSC-GA 2111 »\n\n      \n\n\n\nThis course consists of two parts. In the first part, the laws of physics and basic concepts of biology, physiology, and mechanics are applied to explain the effect of applied forces and the biomechanical response of the tissues of the neuromusculoskeletal system. The second part of the course uses basic biomechanical concepts to describe motion undergone by various body/joint segments and the forces acting on these body parts during normal daily activities. To facilitate the understanding of the basic tissue/joint musculoskeletal biomechanics, selected case studies are used over the course of the semester.\n\n      less description for EHSC-GA 2111 «",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2112",
            "course_name": "",
            "description": "EHSC-GA 2112\n\n   Applied Biomech in The Analysis of Human Perf\n\nThis course builds on the Physical Biomechanics and Biomechanics courses. Its primary purpose is to explore the major processes and mechanisms underlying human motor performance and the pathomechanics of the most relevant occupation-related musculoskeletal disorders (MSDs). Biomechanical principles and their interaction with basic applied sciences are systemically introduced to produce a meaningful conceptual framework and facilitate hypothetical-deductive reasoning. In the first part of the course, specific topics covered include the review of physical biomechanics with increased emphasis on ...\n\n      more description for EHSC-GA 2112 »\n\n      \n\n\n\nThis course builds on the Physical Biomechanics and Biomechanics courses. Its primary purpose is to explore the major processes and mechanisms underlying human motor performance and the pathomechanics of the most relevant occupation-related musculoskeletal disorders (MSDs). Biomechanical principles and their interaction with basic applied sciences are systemically introduced to produce a meaningful conceptual framework and facilitate hypothetical-deductive reasoning. In the first part of the course, specific topics covered include the review of physical biomechanics with increased emphasis on its interaction with other applied sciences, such as neuroscience and energetics physiology. The second part of the course focuses on multisegmental motion analysis and clinical biomechanics of selected case studies on occupation-related MSDs.\n\n      less description for EHSC-GA 2112 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2121",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1449",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Sheikhzadeh, Ali",
                    "time": "Mon 5.30 PM - 8.15 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Practicum in Ergonomics & Biomechanics I",
            "description": "EHSC-GA 2121 Practicum in Ergonomics & Biomechanics I \nFocuses on methods and instruments for data collection and analysis of musculoskeletal disorders (MSDs). Uses lectures and hands-on projects to illustrate theoretical and practical issues with the use of various instruments. Emphasis is on appropriate methods of data collection and analysis of risk factors for MSDs?posture, force, and motion?using electromyography signals. Introduces students to the basic principles underlying the acquisition of a physiological signal via computer and to statistical methods for analysis and interpretation.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2122",
            "course_name": "Practicum in Ergonomics and Biomechanics II",
            "description": "EHSC-GA 2122 Practicum in Ergonomics and Biomechanics II",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2123",
            "course_name": "",
            "description": "EHSC-GA 2123\n\n   Rsch Meth in Ergonomics and Biomech\n\nThis course gives graduate-level students an overview of common study designs in scientific and medical research and specific knowledge in the application of these research methods to the field of ergonomics and biomechanics. Students also learn to critically evaluate scientific papers and draThis course gives graduate-level students an overview of common study designs in scientific and medical research and specific knowledge in the application of these research methods to the field of ergonomics and biomechanics. Students also learn to critically evaluate scientific papers and draw valid conc...\n\n      more description for EHSC-GA 2123 »\n\n      \n\n\n\nThis course gives graduate-level students an overview of common study designs in scientific and medical research and specific knowledge in the application of these research methods to the field of ergonomics and biomechanics. Students also learn to critically evaluate scientific papers and draThis course gives graduate-level students an overview of common study designs in scientific and medical research and specific knowledge in the application of these research methods to the field of ergonomics and biomechanics. Students also learn to critically evaluate scientific papers and draw valid conclusions. The first part of the course is an overview of the scientific method and various study designs that can be used to investigate musculoskeletal disorders (MSDs). The second part focuses on specific topics relevant to research practice, such as issues in measurement, measurement instrument validation, statistical analysis, and the ethical conduct of research. Illustrations of the applications of these methods are presented in the context of ergonomic and biomechanical approaches to the evaluation and control of musculoskeletal disorders.\n\n      less description for EHSC-GA 2123 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2131",
            "course_name": "",
            "description": "EHSC-GA 2131\n\n   Ergonomic Issues I: Physcl Factors in Wrkplc\n\nErgonomics is the study of fitting the workplace to the capabilities of the human worker. Ergonomists apply knowledge from biomechanics, physiology, psychology, and engineering to the design of tasks, work organization, work environment, workstations, and tools. Taking a ?system approach? to the design of work, this course examines the interactions between the human worker and the equipment used at work. The course focuses on the design of the manufacturing process in the context of implementing an ergonomics program for injury prevention. In the first half, it demonstrates how the principles ...\n\n      more description for EHSC-GA 2131 »\n\n      \n\n\n\nErgonomics is the study of fitting the workplace to the capabilities of the human worker. Ergonomists apply knowledge from biomechanics, physiology, psychology, and engineering to the design of tasks, work organization, work environment, workstations, and tools. Taking a ?system approach? to the design of work, this course examines the interactions between the human worker and the equipment used at work. The course focuses on the design of the manufacturing process in the context of implementing an ergonomics program for injury prevention. In the first half, it demonstrates how the principles of physiology and biomechanics apply to workstation and tool design. The second half of the course covers industrial ergonomics applications: controlling cumulative trauma disorders of the upper extremities, office work, and manual material handling.\n\n      less description for EHSC-GA 2131 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2132",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1450",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ergonomic Issues II: Physcl Factors in Wrkplc",
            "description": "EHSC-GA 2132 Ergonomic Issues II: Physcl Factors in Wrkplc \nCovers environmental influences in the workplace that are relevant to the development of musculoskeletal problems. Emphasis is on recognizing and designing safe and productive work environments. Includes sensory-motor processes, temperature, whole-body and segmental vibration, noise, lighting, indoor air quality, and organizational factors. Enables students to appreciate environmental issues that affect ergonomic interventions in the workplace.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2133",
            "course_name": "Appl Ergonomic Methods",
            "description": "EHSC-GA 2133 Appl Ergonomic Methods",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2301",
            "course_name": "Radiological Health",
            "description": "EHSC-GA 2301 Radiological Health \nIntroduction to the physical and biological processes of radioactivity and health effects from radiation exposure. Current principles and philosophies of radiation protection, with reference to the commercial and medical use of radionuclides and electrical sources of radiation.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2302",
            "course_name": "",
            "description": "EHSC-GA 2302\n\n   Radiobiology\n\nThe acute and chronic biological effects of ionizing radiation. Topics include chemical effects and linear energy transfer, target theory, chromosomal and genetic effects, acute cellular responses, physiological and hematological effects, carcinogenesis, treatment of radiation damage, and the biologThe acute and chronic biological effects of ionizing radiation. Topics include chemical effects and linear energy transfer, target theory, chromosomal and genetic effects, acute cellular responses, physiological and hematological effects, carcinogenesis, treatment of radiation damage, and the biolog...\n\n      more description for EHSC-GA 2302 »\n\n      \n\n\n\nThe acute and chronic biological effects of ionizing radiation. Topics include chemical effects and linear energy transfer, target theory, chromosomal and genetic effects, acute cellular responses, physiological and hematological effects, carcinogenesis, treatment of radiation damage, and the biologThe acute and chronic biological effects of ionizing radiation. Topics include chemical effects and linear energy transfer, target theory, chromosomal and genetic effects, acute cellular responses, physiological and hematological effects, carcinogenesis, treatment of radiation damage, and the biological basis for radiation safety practices.\n\n      less description for EHSC-GA 2302 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2303",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1451",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC11",
                    "time": "Wed 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "Zhong, Hua"
                }
            ],
            "course_name": "Intro to Biostatistics",
            "description": "EHSC-GA 2303 Intro to Biostatistics \nIntroduction to probability and statistical methods utilized in the analysis and interpretation of experimental and epidemiological data. Statistical techniques associated with the normal, binomial, Poisson, t, F, and chi-squared distributions plus an introduction to nonparametric methods. Applications in biology, medicine, and the health sciences.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2304",
            "course_name": "Advanced Topics in Biostatistics",
            "description": "EHSC-GA 2304 Advanced Topics in Biostatistics \nIntroduction to statistical methods used in medicine and biology. Topics are selected from the following: survival methods, logistic regression methods, design of experiments, longitudinal data methods, missing data methods, statistical genetics, analysis of gene chip data, and other topics depending on the interests of the participants. Case studies are used to illustrate the methods. Students are required to submit a project.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2306",
            "course_name": "Meth/App Stat & Data Min W/App to Biol & Medicine",
            "description": "EHSC-GA 2306 Meth/App Stat & Data Min W/App to Biol & Medicine \nSurvey of applied statistical and data mining methods, including principles, applications, and computational tools. Emphasis is on conceptual understanding and data analysis using the R or S-plus statistical programming language. Topics may vary and include cluster analysis, multidimensional scaling, principal components analysis, resampling methods (e.g., the bootstrap), linear methods for classification and regression, model selection, bias-variance trade-off, modern classification and regression, tree-based methods, randomization, and nonparametric statistics.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2307",
            "course_name": "Molecular Toxicology of Metals & Trace Elements",
            "description": "EHSC-GA 2307 Molecular Toxicology of Metals & Trace Elements \nMetals represent serious and persistent environmental contaminants. This course describes the source of this contamination and examines the toxic effects of metals such as mercury, cadmium, arsenic, lead, vanadium, nickel, beryllium, cobalt, aluminum, chromate, selenium, and others. Each metal is considered with regard to its major toxic action. Mechanisms are emphasized.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2308",
            "course_name": "Toxicology of The Nervous System",
            "description": "EHSC-GA 2308 Toxicology of The Nervous System \nTopics reflect current research on the nervous system?s response to toxic chemicals and drugs. Typical toxicants include chemical warfare agents, metals, solvents, and pesticides. Nervous system functions are studied using behavioral, physiological, and biochemical responses. Students learn to critically evaluate research publications in this field.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2309",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16629",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "MEYR 157",
                    "time": "Tue 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Dai, Wei"
                }
            ],
            "course_name": "Environmental Carcinogenesis",
            "description": "EHSC-GA 2309 Environmental Carcinogenesis \nIntroductory course that emphasizes current understandings of how environmental agents contribute to human cancer. The approach integrates information from human and experimental animal studies at the population, cellular, and molecular levels. Emphasis is on the basic mechanisms of cancer causation and how these understandings help to mitigate or prevent the disease.",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 2310",
            "course_name": "Principles of Toxicology",
            "description": "EHSC-GA 2310 Principles of Toxicology \nBroad introduction to the science of toxicology, stressing basic concepts essential to the understanding of the action of exogenous chemical agents on biological systems. Principles underlying the absorption, metabolism, and elimination of chemicals are discussed. Toxicokinetics, specific classes of toxic responses, and experimental methods used to assess toxicity are reviewed.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2311",
            "course_name": "Organ System Toxicology",
            "description": "EHSC-GA 2311 Organ System Toxicology \nOverview of the types of injury that may be produced in specific mammalian organs and organ systems by exposure to chemical toxicants.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2312",
            "course_name": "Statistical Computing & Database Design",
            "description": "EHSC-GA 2312 Statistical Computing & Database Design \nBasic concepts in database design and management as well as statistical programming are discussed. Topics discussed include use of relational databases in clinical and biological sciences, design and management of relational databases, Structured Query Language (SQL), retrieval of data into SAS, and writing SAS programs for statistical analysis.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2313",
            "course_name": "",
            "description": "EHSC-GA 2313\n\n   Statistical Problems in Medicine and Biology\n\nIn this course, students participate in the clinical and translational research process with investigators conducting research in a wide variety of areas in medicine and biology. These areas range from clinical trials in cancer, cardiovascular disease, etc., to comparisons of gene expression profiles resulting from different exposures to potential carcinogens in animals or people. Researchers present their problems, and the students develop their skills to (1) find solutions that include appropriate study designs and statistical considerations, (2) collaborate in the development of research pr...\n\n      more description for EHSC-GA 2313 »\n\n      \n\n\n\nIn this course, students participate in the clinical and translational research process with investigators conducting research in a wide variety of areas in medicine and biology. These areas range from clinical trials in cancer, cardiovascular disease, etc., to comparisons of gene expression profiles resulting from different exposures to potential carcinogens in animals or people. Researchers present their problems, and the students develop their skills to (1) find solutions that include appropriate study designs and statistical considerations, (2) collaborate in the development of research proposals, (3) collaborate in the planning of the statistical analysis for a research project, (4) conduct appropriate statistical analysis for a research project in collaboration with an investigator, and (5) prepare a report for a research project in collaboration with an investigator. Students are exposed to realistic statistical and scientific problems as well as the statistical approaches for solving these problems. This course develops experience and skills in statistical collaboration. Researchers present their problems in class sessions (every other week), and students present their solutions to the class and faculty in alternate weeks.\n\n      less description for EHSC-GA 2313 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2314",
            "course_name": "Research Models of Environment Exposures",
            "description": "EHSC-GA 2314 Research Models of Environment Exposures",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2315",
            "course_name": "Environ Immunotoxicology",
            "description": "EHSC-GA 2315 Environ Immunotoxicology \nOverview of the components and functions of the immune system in order to set the stage for a discussion of how toxicants impact the immune response and alter host susceptibility to disease. Provides students with the opportunity to investigate and discuss a relevant topic in the field of immunotoxicology.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2316",
            "course_name": "Aquatic Toxicology",
            "description": "EHSC-GA 2316 Aquatic Toxicology",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2317",
            "course_name": "Nanotechnology and Toxicology",
            "description": "EHSC-GA 2317 Nanotechnology and Toxicology",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2330",
            "course_name": "",
            "description": "EHSC-GA 2330\n\n   Adv Topics in Survival Analysis\n\nThis course provides advanced topics in survival analysis in a seminar setting. The course includes a review of basic concepts followed by in-depth study of advanced methods. These methods include study of survival models with particular reference to time-dependent models, missing data, interval-censored data, recurrent event and multiple endpoints. Particular attention is given to interim analyses in the context of survival models in clinical trials. Bayesian approaches are also considered. Issues of survival analysis in observational data are also included. Readings include seminal research ...\n\n      more description for EHSC-GA 2330 »\n\n      \n\n\n\nThis course provides advanced topics in survival analysis in a seminar setting. The course includes a review of basic concepts followed by in-depth study of advanced methods. These methods include study of survival models with particular reference to time-dependent models, missing data, interval-censored data, recurrent event and multiple endpoints. Particular attention is given to interim analyses in the context of survival models in clinical trials. Bayesian approaches are also considered. Issues of survival analysis in observational data are also included. Readings include seminal research papers in survival analysis.\n\n      less description for EHSC-GA 2330 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2331",
            "course_name": "",
            "description": "EHSC-GA 2331\n\n   Adv Tpcs in Data Mining With Appl to Genomics\n\nThis course introduces, illustrates, and evaluates a variety of statistical data mining methods employed in the context of large-scale genomic experiments, with an emphasis on applications to DNA microarrays. Techniques covered correspond to commonly encountered research questions and study designs. Topics may vary and include preprocessing/normalization of expression array data, exploratory data analysis, hypothesis testing, linear models, clustering, discrimination, prediction, and bootstrap methods. The course features extensive discussion and illustration of data mining techniques covered ...\n\n      more description for EHSC-GA 2331 »\n\n      \n\n\n\nThis course introduces, illustrates, and evaluates a variety of statistical data mining methods employed in the context of large-scale genomic experiments, with an emphasis on applications to DNA microarrays. Techniques covered correspond to commonly encountered research questions and study designs. Topics may vary and include preprocessing/normalization of expression array data, exploratory data analysis, hypothesis testing, linear models, clustering, discrimination, prediction, and bootstrap methods. The course features extensive discussion and illustration of data mining techniques covered in the text The Elements of Statistical Learning, by Hastie et al. (Springer, 2001), and associated computational tools and resources. A brief overview of micro-array technology is included, as is discussion of recent array-related developments and extensions.\n\n      less description for EHSC-GA 2331 «",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2332",
            "course_name": "Methods for The Analysis of Longitudinal Data",
            "description": "EHSC-GA 2332 Methods for The Analysis of Longitudinal Data \nThis course covers statistical methods for analyzing longitudinal data, which mainly are collected in the form of repeated measurements over time. Topics include the linear model for longitudinal continuous data (e.g., multivariate normal model and mixed-effects models) and methods for analyzing longitudinal categorical data in the form of counts and binary data (e.g., generalized linear model and generalized estimating equations). Dropouts, missing mechanisms, and semiparametric methods are also discussed, with emphasis on newly proposed methods in the literature.",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2333",
            "course_name": "Introduction to Measurement Error in Biomedical Research",
            "description": "EHSC-GA 2333 Introduction to Measurement Error in Biomedical Research",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2334",
            "course_name": "Statistical Methods in Genetics and Genetic Epidemiology",
            "description": "EHSC-GA 2334 Statistical Methods in Genetics and Genetic Epidemiology",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2335",
            "course_name": "Sampling Methods and Applications in Health Surveys",
            "description": "EHSC-GA 2335 Sampling Methods and Applications in Health Surveys",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2336",
            "course_name": "Introduction to Statistical Inference",
            "description": "EHSC-GA 2336 Introduction to Statistical Inference",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2337",
            "course_name": "Causal Inference in Observational Studies",
            "description": "EHSC-GA 2337 Causal Inference in Observational Studies",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2338",
            "course_name": "Statistical Methods for Clinical and Translational Researach",
            "description": "EHSC-GA 2338 Statistical Methods for Clinical and Translational Researach",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2339",
            "course_name": "Introduction to Bayesian Modeling",
            "description": "EHSC-GA 2339 Introduction to Bayesian Modeling",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 2340",
            "course_name": "Regression Modeling",
            "description": "EHSC-GA 2340 Regression Modeling",
            "offering": false
        },
        {
            "course_id": "EHSC-GA 3001",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1452",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Master's Thesis Research",
            "description": "EHSC-GA 3001 Master's Thesis Research",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 3002",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1453",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Doctoral Thesis Research",
            "description": "EHSC-GA 3002 Doctoral Thesis Research",
            "offering": true
        },
        {
            "course_id": "EHSC-GA 3003",
            "course_name": "Predoc Colloq Env Health Seminar",
            "description": "EHSC-GA 3003 Predoc Colloq Env Health Seminar",
            "offering": false
        }
    ]
}