{
    "major_id": "EXEC-GP",
    "file": "./2015-2016/Executive_MPA_course_(EXEC-GP).html",
    "courses": [
        {
            "course_id": "EXEC-GP 220",
            "course_name": "Global Public Policy Analysis Discussion",
            "description": "EXEC-GP  220 Global Public Policy Analysis Discussion",
            "offering": false
        },
        {
            "course_id": "EXEC-GP 1194",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5097",
                    "section": "001",
                    "period": "08/26/2015 - 08/26/2015",
                    "location": "SILV 500 with Godsoe, Bethany; Bronznick, Shifra08/27/2015 - 08/27/2015 Thu 9.00 AM - 5.30 PM at SILV 500 with Godsoe, Bethany; Bronznick, Shifra08/31/2015 - 08/31/2015 Mon 9.00 AM - 5.30 PM at SILV 500 with Godsoe, Bethany; Bronznick, Shifra09/01/2015 - 09/01/2015 Tue 9.00 AM - 5.30 PM at SILV 500",
                    "time": "Wed 9.00 AM - 5.30 PM",
                    "open": true,
                    "professor": "Godsoe, Bethany; Bronznick, Shifra"
                },
                {
                    "format": "Lecture",
                    "class_id": "17213",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 369",
                    "time": "Thu 6.45 PM - 8.45 PM",
                    "open": true,
                    "professor": "Bronznick, Shifra"
                }
            ],
            "course_name": "",
            "description": "EXEC-GP 1194\n\n   Strategic Leadership\n\nStrategic Leadership is an advanced seminar designed to equip mid-career students with the tools, perspectives, and frameworks for executing high-impact strategy within mission-driven organizations. Topics include conceptual frameworks for understanding high impact organizations and the role of strategic leadership, analytical tools for developing and assessing strategy, approaches to working with stakeholders to mobilize commitment, and methods for leading change and achieving scale. We will explore a wide range of sources from established approaches to strategic planning and management to em...\n\n      more description for EXEC-GP 1194 »\n\n      \n\n\n\nStrategic Leadership is an advanced seminar designed to equip mid-career students with the tools, perspectives, and frameworks for executing high-impact strategy within mission-driven organizations. Topics include conceptual frameworks for understanding high impact organizations and the role of strategic leadership, analytical tools for developing and assessing strategy, approaches to working with stakeholders to mobilize commitment, and methods for leading change and achieving scale. We will explore a wide range of sources from established approaches to strategic planning and management to emerging practices such as narrative leadership and a campaign approach to change and will draw heavily on the experiences students bring to the classroom as well.\n\n      less description for EXEC-GP 1194 «",
            "offering": true
        },
        {
            "course_id": "EXEC-GP 1821",
            "course_name": "",
            "description": "EXEC-GP 1821\n\n   Financial Management for Nurse Leaders\n\nThe primary objective of this course in financial management is to teach students how to use financial information to make decisions in health organizations.  Its secondary objective is to help students develop their quantitative and communication skills.   \n \nThis course looks at financial management as a process.  The process begins with an organization developThe primary objective of this course in financial management is to teach students how to use financial information to make decisions in health organizations.  Its secondary objective is to help students develop their quantitative and...\n\n      more description for EXEC-GP 1821 »\n\n      \n\n\n\nThe primary objective of this course in financial management is to teach students how to use financial information to make decisions in health organizations.  Its secondary objective is to help students develop their quantitative and communication skills.   \n \nThis course looks at financial management as a process.  The process begins with an organization developThe primary objective of this course in financial management is to teach students how to use financial information to make decisions in health organizations.  Its secondary objective is to help students develop their quantitative and communication skills.   \n \nThis course looks at financial management as a process.  The process begins with an organization developing a plan for the future.  The organization then implements the plan and takes steps to control operations so as to keep to the plan.  Finally, the organization reports the results of operations so that internal managers and outside observers can analyze the organization?s financial health. \n \nThe first half of the course focuses on managerial accounting: tools for developing, implementing, and controlling the plan.  Major topics include operating budgets, cash budgets, capital budgets, long-term financing options, and variance analysis. \n   \nThe second half of the course focuses on financial accounting: tools for reporting on and analyzing an organization?s financial position and the results of its operations.  Major topics include the preparation of financial statements for non-profit organizations, and financial-statement analysis.\n\n      less description for EXEC-GP 1821 «",
            "offering": false
        },
        {
            "course_id": "EXEC-GP 1830",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5182",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Rodwin, Victor",
                    "time": "Tue 4.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "EXEC-GP 1830\n\n   Introduction to Health Policy and Management for Nurse Leaders\n\nOnly open to Executive MPA students.\n\nThis course explores core topics in the study of health and health care delivery in the United States. We will discuss the distribution of health and disease in society, the organization of the U.S. health care system and roles and behaviors of its key actors, the historical context for developments in public health and medicine, the quality and accessibility of health care services, and current events in health care reform. We will examine major themes in health care policy and practice using an interdisciplinary approach that employs sociological, politi...\n\n      more description for EXEC-GP 1830 »\n\n      \n\n\n\nOnly open to Executive MPA students.\n\nThis course explores core topics in the study of health and health care delivery in the United States. We will discuss the distribution of health and disease in society, the organization of the U.S. health care system and roles and behaviors of its key actors, the historical context for developments in public health and medicine, the quality and accessibility of health care services, and current events in health care reform. We will examine major themes in health care policy and practice using an interdisciplinary approach that employs sociological, political, economic and ethical perspectives on health and disease, characteristics of health care in the U.S., and the complexity of achieving high quality and affordability given the varied (and sometimes conflicting) motivations of policy-makers, payers, providers and patients. Students will also consider the U.S. health care system in an international context to provide a comparative lens on its nature and performance versus those of other industrialized nations. The objective of this course is to build understanding of fundamental ideas and problems in the areas of health and medical care and thereby to provide a strong foundation for future studies and careers in the health care field.\n\n      less description for EXEC-GP 1830 «",
            "offering": true
        },
        {
            "course_id": "EXEC-GP 2141",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17333",
                    "section": "001",
                    "period": "09/05/2015 - 09/05/2015",
                    "location": "BOBS LL138 with Smith, Daniel09/19/2015 - 09/19/2015 Sat 2.20 PM - 6.00 PM at SILV 208 with Smith, Daniel10/03/2015 - 10/03/2015 Sat 2.20 PM - 6.00 PM at SILV 208 with Smith, Daniel10/17/2015 - 10/17/2015 Sat 2.20 PM - 6.00 PM at SILV 208 with Smith, Daniel10/31/2015 - 10/31/2015 Sat 2.20 PM - 6.00 PM at SILV 208 with Smith, Daniel11/14/2015 - 11/14/2015 Sat 2.20 PM - 6.00 PM at SILV 208 with Smith, Daniel12/12/2015 - 12/12/2015 Sat 2.20 PM - 6.00 PM at SILV 208",
                    "time": "Sat 2.20 PM - 6.00 PM",
                    "open": true,
                    "professor": "Smith, Daniel"
                }
            ],
            "course_name": "",
            "description": "EXEC-GP 2141\n\n   Financial Decision Making and Management\n\nThis is a course in financial decision-making and management for experienced managers of public, not-for-profit, and health organizations. The first half of the course focuses on managerial accounting and financial planning (i.e., budgeting), with an emphasis on improving prospective operating results. The second half focuses on financial accounting, which emphasizes analyzing operating results in an effort to inform the subsequent fiscal year’s financial plan. This course emphasizes analyzing budget documents and financial statements as opposed to preparing them. Nonetheless, where sufficient...\n\n      more description for EXEC-GP 2141 »\n\n      \n\n\n\nThis is a course in financial decision-making and management for experienced managers of public, not-for-profit, and health organizations. The first half of the course focuses on managerial accounting and financial planning (i.e., budgeting), with an emphasis on improving prospective operating results. The second half focuses on financial accounting, which emphasizes analyzing operating results in an effort to inform the subsequent fiscal year’s financial plan. This course emphasizes analyzing budget documents and financial statements as opposed to preparing them. Nonetheless, where sufficiently understanding an analytical method requires hands-on experience performing calculations or preparing documents, students will learn the requisite calculations and preparation methods.\n\n      less description for EXEC-GP 2141 «",
            "offering": true
        },
        {
            "course_id": "EXEC-GP 2201",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5223",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 265",
                    "time": "Mon 12.20 PM - 1.55 PM",
                    "open": true,
                    "professor": "Gershman, John; Smoke, Paul"
                }
            ],
            "course_name": "",
            "description": "EXEC-GP 2201\n\n   Institutions, Governance, and Public Sector Reform\n\nOnly open to Executive MPA students.\n\nThis course exposes students to contemporary thinking about institutions, governance and the reinvention of the public sector. We focus on specific reforms intended to improve government performance and promote good governance as rapid economic, political and social changes-both global and local-- evolve in different countries at various stages of development. Major topics include establishing and enhancing rule of law, property rights, and regulatory regimes; developing more effective organizational structures, civil service systems and anti-corruption me...\n\n      more description for EXEC-GP 2201 »\n\n      \n\n\n\nOnly open to Executive MPA students.\n\nThis course exposes students to contemporary thinking about institutions, governance and the reinvention of the public sector. We focus on specific reforms intended to improve government performance and promote good governance as rapid economic, political and social changes-both global and local-- evolve in different countries at various stages of development. Major topics include establishing and enhancing rule of law, property rights, and regulatory regimes; developing more effective organizational structures, civil service systems and anti-corruption mechanisms; and creating and enhancing frameworks and policies for public sector fiscal management, decentralization, public-private partnership and citizen engagement. As we work through the topics, we consider competing theoretical perspectives and empirical evidence. An underlying theme is the need to go beyond the mainstream tendency to use pre-packaged tools and narrow frameworks in pursuit of single \"right\" answers. Rather, the course uses diverse case material to challenges students to use rigorous and creative analysis to seek levers of change that matter and are feasible in particular contexts.\n\n      less description for EXEC-GP 2201 «",
            "offering": true
        },
        {
            "course_id": "EXEC-GP 2202",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5222",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 401",
                    "time": "Mon 3.30 PM - 5.40 PM",
                    "open": true,
                    "professor": "Gershman, John; Smoke, Paul"
                }
            ],
            "course_name": "",
            "description": "EXEC-GP 2202\n\n   Global Public Policy Analysis\n\nOnly open to Executive MPA students.\n\nThis course provides students with foundational analytical tools that facilitate their ability to understand the interactions among various interests, institutions, ideas and individuals in the policy-making process. It prepares students to disentangle the dynamics of power and politics throughout the policy process at three distinct levels: at the national level in the U.S. and other OECD countries, in the \"developing\" country context, and at the transnational level. We examine the dynamics of agenda-setting, framing, the role of analysis and evidence in ...\n\n      more description for EXEC-GP 2202 »\n\n      \n\n\n\nOnly open to Executive MPA students.\n\nThis course provides students with foundational analytical tools that facilitate their ability to understand the interactions among various interests, institutions, ideas and individuals in the policy-making process. It prepares students to disentangle the dynamics of power and politics throughout the policy process at three distinct levels: at the national level in the U.S. and other OECD countries, in the \"developing\" country context, and at the transnational level. We examine the dynamics of agenda-setting, framing, the role of analysis and evidence in the policy process and the rise of \"evidence-based\" policy; the role of deliberation and transparency; insights from behavioral economics and social psychology on regulation and incentives; how social movements and advocacy organizations influence the policy process; the role of street-level bureaucrats; and the relationship between evaluation, learning, and policy change. The emphasis throughout is on mixing the development of conceptual and analytical tools with diverse, context-rich case studies and classroom exercises aimed at developing a real world proficiency in policy analysis.\n\n      less description for EXEC-GP 2202 «",
            "offering": true
        },
        {
            "course_id": "EXEC-GP 2810",
            "course_name": "",
            "description": "EXEC-GP 2810\n\n   Serv Excell Nurse Leader\n\nThis course is designed to explore the complex organizational mechanisms that need to be in place for the delivery of world-class service. While many organizations understand the importance of service, the ability to consistently deliver on this service often eludes them. This is especially true in healthcare organizations.  This course will cover a broad range of service delivery topics including: defining service excellence, aligning core organizational and human resource systems for service delivery, seeing service from the customer?s perspective, improving systems and service, service fail...\n\n      more description for EXEC-GP 2810 »\n\n      \n\n\n\nThis course is designed to explore the complex organizational mechanisms that need to be in place for the delivery of world-class service. While many organizations understand the importance of service, the ability to consistently deliver on this service often eludes them. This is especially true in healthcare organizations.  This course will cover a broad range of service delivery topics including: defining service excellence, aligning core organizational and human resource systems for service delivery, seeing service from the customer?s perspective, improving systems and service, service failure and recovery, and benchmarking best practices in world class service organizations. In addition to providing you with an understanding of current issues in service excellence, a second objective of this course is to develop your skills in applying these concepts. To do this, business cases, classroom exercises and assignments will provide individuals and groups an opportunity to practice analyzing and solving actual service problems. \n\n      less description for EXEC-GP 2810 «",
            "offering": false
        },
        {
            "course_id": "EXEC-GP 2811",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5244",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Taylor, Brian",
                    "time": "Tue 6.20 PM - 8.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "EXEC-GP 2811\n\n   Continuous Quality Improvement for Healthcare Leaders\n\nOnly open to Executive MPA students. \n\nThis course is designed to explore the complex organizational mechanisms that need to be in place for the delivery of world-class service. While many organizations understand the importance of service, the ability to consistently deliver on this service often eludes them. This is especially true in healthcare organizations.  Customer service is the end product, the outcome of a well-oiled machine that has the infrastructure, the staff, and the will to deliver on that service. It requires exquisite synergy among key organizational components: human resourc...\n\n      more description for EXEC-GP 2811 »\n\n      \n\n\n\nOnly open to Executive MPA students. \n\nThis course is designed to explore the complex organizational mechanisms that need to be in place for the delivery of world-class service. While many organizations understand the importance of service, the ability to consistently deliver on this service often eludes them. This is especially true in healthcare organizations.  Customer service is the end product, the outcome of a well-oiled machine that has the infrastructure, the staff, and the will to deliver on that service. It requires exquisite synergy among key organizational components: human resources - leveraging recruitment, selection, training, empowerment, coaching, recognition staff for service delivery; organization and systems design - implementation of an organizational structure that facilitates service delivery using customer-focused processes and systems; and the deliberate creation of a service culture that permeates all segments of the organization regardless of role, rank, or function in the organization.\nThis course will cover a broad range of service delivery topics including: defining service excellence, aligning core organizational and human resource systems for service delivery, seeing service from the customer’s perspective, improving systems and service, service failure and recovery, and benchmarking best practices in world class service organizations.\nIn addition to providing you with an understanding of current issues in service excellence, a second objective of this course is to develop your skills in applying these concepts. To do this, business cases, classroom exercises and assignments will provide individuals and groups an opportunity to practice analyzing and solving actual service problems. It is my intention that you leave the course with an expanded toolkit that can be applied to your work contexts as well as being better informed about organizational dynamics that impact customer service.\n\n      less description for EXEC-GP 2811 «",
            "offering": true
        },
        {
            "course_id": "EXEC-GP 3190",
            "course_name": "Executive Mpa Sem: Leadership Confronted",
            "description": "EXEC-GP 3190 Executive Mpa Sem: Leadership Confronted \nThis seminar is designed for students to derive insights from scholars in the field of leadership while continually relating it to their own life as managers and leaders.  At the conclusion of the course students will have had the opportunity to integrate their past work experience, graduate coursework, and new knowledge and skills of leadership so as to be better able to learn and perform at higher levels as an effective individual leader and insightful colleague to others.",
            "offering": false
        },
        {
            "course_id": "EXEC-GP 6601",
            "course_name": "UCL:  Policy Implementation",
            "description": "EXEC-GP 6601 UCL:  Policy Implementation",
            "offering": false
        },
        {
            "course_id": "EXEC-GP 6602",
            "course_name": "UCL: Managing Organizational Change",
            "description": "EXEC-GP 6602 UCL: Managing Organizational Change",
            "offering": false
        },
        {
            "course_id": "EXEC-GP 6603",
            "course_name": "UCL:  Elective",
            "description": "EXEC-GP 6603 UCL:  Elective",
            "offering": false
        },
        {
            "course_id": "EXEC-GP 6604",
            "course_name": "UCL:Elective",
            "description": "EXEC-GP 6604 UCL:Elective",
            "offering": false
        }
    ]
}