{
    "major_id": "GLBL-SHU",
    "file": "./2015-2016/Global_Programs_(GLBL-SHU).html",
    "courses": [
        {
            "course_id": "GLBL-SHU 10",
            "course_name": "",
            "description": "GLBL-SHU   10\n\n   NYU Shanghai Reality Show: Musical Writing, Production, and Performance\n\nThis non-credit, intensive theater course, guides students in creating, producing, directing, and performing all aspects of the NYU Shanghai Reality Show, a performance to be presented in Shanghai in September.  In the course, students will design the show, write lyrics and music of the songs;  choreograph the dance performances; design set, lighting, and other creative production elements of the performance; be guided in acting and directing; learn to direct the performance; participate in peer review of the rehearsals; manage the movement of the show from New York to Shanghai; and perform th...\n\n      more description for GLBL-SHU   10 »\n\n      \n\n\n\nThis non-credit, intensive theater course, guides students in creating, producing, directing, and performing all aspects of the NYU Shanghai Reality Show, a performance to be presented in Shanghai in September.  In the course, students will design the show, write lyrics and music of the songs;  choreograph the dance performances; design set, lighting, and other creative production elements of the performance; be guided in acting and directing; learn to direct the performance; participate in peer review of the rehearsals; manage the movement of the show from New York to Shanghai; and perform the Musical for an audience of several hundred people in Shanghai.   NYU considers this course to constitute a full-time course of study over the ten weeks of the program.  The number of hours per week of classroom instruction will be at least 18.  The course is taught by NYU Tisch School of the Arts faculty.\n\n      less description for GLBL-SHU   10 «",
            "offering": false
        },
        {
            "course_id": "GLBL-SHU 9101",
            "course_name": "Global Orientations: Introduction to Contemporary China",
            "description": "GLBL-SHU 9101 Global Orientations: Introduction to Contemporary China \nThis course is being offered to familiarize all students, irrespective of college or concentration, with a range of issues that inform understanding of life in contemporary China.  To complete the course, students will engage in experiential learning activities, learn about issues pertinent to Chinese society and history, and interact with experts in various fields of Chinese studies.",
            "offering": false
        }
    ]
}