{
    "major_id": "HPAM-GP",
    "file": "./2015-2016/Health_policy_and_management_course(HPAM-GP).html",
    "courses": [
        {
            "course_id": "HPAM-GP 1830",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5084",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 305",
                    "time": "Mon 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Rodwin, Victor"
                },
                {
                    "format": "Lecture",
                    "class_id": "5224",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 307",
                    "time": "Mon 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Victory, Jacob"
                }
            ],
            "course_name": "Introduction to Health Policy and Management",
            "description": "HPAM-GP 1830 Introduction to Health Policy and Management \nRequired for M.P.A. (health) students.\n\nThis course provides an overview of issues related to community health and the evaluation of medical care. Specific areas of study include definitions of health and its relationship to medical care, concepts in epidemiology, analysis of the determinants of health and disease, and evaluation of medical care from a range of social science perspectives.",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 1831",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5085",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL151",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Grepin, Karen"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 1831\n\n   Global Health Policy\n\nWhy are some people in some countries so much healthier than others? This course will explore the factors that explain the unequal distribution of health and disease in the world. The course will begin with an introduction to the language of global health: the burden of disease, epidemiology, cost-effectiveness, and health systems. It will then analyze the rationale for and modes of intervention to improve global health by exploring a number of high-profile topics, including the HIV/AIDS epidemic, access to pharmaceuticals, human resources for health, and maternal and child health. The course ...\n\n      more description for HPAM-GP 1831 »\n\n      \n\n\n\nWhy are some people in some countries so much healthier than others? This course will explore the factors that explain the unequal distribution of health and disease in the world. The course will begin with an introduction to the language of global health: the burden of disease, epidemiology, cost-effectiveness, and health systems. It will then analyze the rationale for and modes of intervention to improve global health by exploring a number of high-profile topics, including the HIV/AIDS epidemic, access to pharmaceuticals, human resources for health, and maternal and child health. The course will incorporate knowledge and views from multiple academic disciplines (public health, economics, politics, management, sociology, etc) and does not require any background knowledge. It is open to students in all degree concentrations.\n\n      less description for HPAM-GP 1831 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 2244",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5098",
                    "section": "001",
                    "period": "10/30/2015 - 11/07/2015",
                    "location": "SILV 408",
                    "time": "Fri,Sat 9.00 AM - 5.00 PM",
                    "open": true,
                    "professor": "Alderslade, Richard"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 2244\n\n   Global Health Governance and Management\n\nThis course takes up the definitions of health in international agreements and the general influences of globalization on health. It explores the roles and responsibilities of national health leadership, primarily Ministries of Health, in assuring the health of their populations and the different strategies and variable capacity of national governments in developed, developing and countries in transition. It then explores the role, functions and effectiveness of global organizations affecting health in the UN, NGO and business sectors as well as multilateral and bilateral donors and how they i...\n\n      more description for HPAM-GP 2244 »\n\n      \n\n\n\nThis course takes up the definitions of health in international agreements and the general influences of globalization on health. It explores the roles and responsibilities of national health leadership, primarily Ministries of Health, in assuring the health of their populations and the different strategies and variable capacity of national governments in developed, developing and countries in transition. It then explores the role, functions and effectiveness of global organizations affecting health in the UN, NGO and business sectors as well as multilateral and bilateral donors and how they interact with each other and with national leadership. Finally the course looks at emerging instruments for global health governance, how they operate and their effectiveness for promoting health action at the country level. \n\n      less description for HPAM-GP 2244 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 2700",
            "course_name": "Topics in Health Policy",
            "description": "HPAM-GP 2700 Topics in Health Policy",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2825",
            "course_name": "Continuous Quality Improvement",
            "description": "HPAM-GP 2825 Continuous Quality Improvement \nproposal for solving a  societal problem.",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2836",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5107",
                    "section": "001",
                    "period": "09/04/2015 - 09/04/2015",
                    "location": "GCASL 279 with Billings, John09/18/2015 - 09/18/2015 Fri 9.00 AM - 5.00 PM at GCASL 279 with Billings, John10/02/2015 - 10/02/2015 Fri 9.00 AM - 5.00 PM at GCASL 279 with Billings, John10/16/2015 - 10/16/2015 Fri 9.00 AM - 5.00 PM at GCASL 279",
                    "time": "Fri 9.00 AM - 5.00 PM",
                    "open": true,
                    "professor": "Billings, John"
                }
            ],
            "course_name": "Current Issues in Health Policy",
            "description": "HPAM-GP 2836 Current Issues in Health Policy \nRequired for M.P.A. health policy specialization students.  This course is an introduction to major health policy issues in the United States and focuses on the role of government in the health care system. Proposals for health policy reform at the national and local levels are discussed throughout the course, with special emphasis on the proposals for reform recently debated at the federal level. The role of the legal system with respect to adverse medical outcomes, economic rights, and individual rights is also discussed.",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 2837",
            "course_name": "Health Services for Vulnerable Communities",
            "description": "HPAM-GP 2837 Health Services for Vulnerable Communities",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2845",
            "course_name": "Advanced Health Care Payment Systems",
            "description": "HPAM-GP 2845 Advanced Health Care Payment Systems \nThis course builds on principles of payment systems that are introduced in P11.1832. One focus is on providing an understanding of payment systems for hospitals, long-term care organizations, ambulatory care, and other health care providers. A second focus is on providing skills for making managerial decisions that consider their revenue implications. The course provides the student with a basis for researching payment regulations and keeping abreast of trends and changes in health care payment systems.",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2848",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5108",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 431",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Vaughan, James"
                }
            ],
            "course_name": "The Business of Health Care",
            "description": "HPAM-GP 2848 The Business of Health Care \nThis course is intended for current and future health care leaders interested in learning about the health insurance industry. Students will gain a better understanding of the dynamics of the relationship between the employer and the insurance organization and its influence on consumer choice, the organization and regulations of health insurance companies, the often conflicting roles of providers and insurance organizations as both health care partners and patient member advocates, and the proposed changes for health care financing.",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 2849",
            "course_name": "Economic Analysis of Global Health Initatives: Hlth Sys & fight Infectious Diseases",
            "description": "HPAM-GP 2849 Economic Analysis of Global Health Initatives: Hlth Sys & fight Infectious Diseases",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2851",
            "course_name": "Gender and Health",
            "description": "HPAM-GP 2851 Gender and Health",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2852",
            "course_name": "",
            "description": "HPAM-GP 2852\n\n   Comparative Health Systems\n\nThis class focuses on the organization and financing of health systems in wealthy nations. We begin with a discussion of conventional health system models around the world and alternative perspectives for studying them and evaluating their performance. The class readings reflect how selective evidence is often marshaled to evaluate health care systems in the U.S. and abroad. Finally, and this is the heart of the class, we discuss a range of different approaches to the empirical analysis of health system performance in selected nations, and examine the extent to which the available evidence sup...\n\n      more description for HPAM-GP 2852 »\n\n      \n\n\n\nThis class focuses on the organization and financing of health systems in wealthy nations. We begin with a discussion of conventional health system models around the world and alternative perspectives for studying them and evaluating their performance. The class readings reflect how selective evidence is often marshaled to evaluate health care systems in the U.S. and abroad. Finally, and this is the heart of the class, we discuss a range of different approaches to the empirical analysis of health system performance in selected nations, and examine the extent to which the available evidence supports or refutes widely shared views of different health care systems. I will ask students to become \"experts\" about a health system of their choice outside the United States, preferably in a nation belonging to the Organization of Economic Cooperation and Development (OECD), but with an option to focus on a health system in one of the so-called BRIC nations (Brazil, Russia, India, China).\n\n      less description for HPAM-GP 2852 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2853",
            "course_name": "Health System and Health Reform in Ghana",
            "description": "HPAM-GP 2853 Health System and Health Reform in Ghana",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2855",
            "course_name": "",
            "description": "HPAM-GP 2855\n\n   Institute in Budgeting for Health Professionals\n\nThe focus of this course in on the budget process for health care organizations.  Participants are exposed to specific techniques of health care budgeting and variance analysis. This course accomplishes its objectives by covering a wide range of budgeting topics from introductory through advanced.  Topics covered include an introduction and overview of health care budgeting covering basic definitions, purposes, and uses of budgets in health care, the long range plan, programming, operating budgets, capital budgets, and fixed and variable costs. A hospital unit operating budget is examined in d...\n\n      more description for HPAM-GP 2855 »\n\n      \n\n\n\nThe focus of this course in on the budget process for health care organizations.  Participants are exposed to specific techniques of health care budgeting and variance analysis. This course accomplishes its objectives by covering a wide range of budgeting topics from introductory through advanced.  Topics covered include an introduction and overview of health care budgeting covering basic definitions, purposes, and uses of budgets in health care, the long range plan, programming, operating budgets, capital budgets, and fixed and variable costs. A hospital unit operating budget is examined in detail.  Additional topics covered include zero based budgeting, cost estimation and forecasting, break-even analysis, performance budgeting, flexible budget variance analysis and capital budgeting.   Health care examples and applications are used throughout all parts of the organization.\n\nThe courseThe focus of this course in on the budget process for health care organizations.  Participants are exposed to specific techniques of health care budgeting and variance analysis. This course accomplishes its objectives by covering a wide range of budgeting topics from introductory through advanced.  Topics covered include an introduction and overview of health care budgeting covering basic definitions, purposes, and uses of budgets in health care, the long range plan, programming, operating budgets, capital budgets, and fixed and variable costs. A hospital unit operating budget is examined in detail.  Additional topics covered include zero based budgeting, cost estimation and forecasting, break-even analysis, performance budgeting, flexible budget variance analysis and capital budgeting.   Health care examples and applications are used throughout all parts of the organization.\n\nThe course is provided as a six week online program.  Each week there are approximately 3 hours of lectures using video streaming, audio, and power point slides.  Students watch lectures online at their convenience via a Blackboard website.  During each week students participate in online discussions that are available 24 hours a day, 7 days a week. The discussions  focus on not only the lectures, but also required readings and homework problem sets that are assigned for that week.  The class also meets online as a group four times during the term.\n\n      less description for HPAM-GP 2855 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 2867",
            "course_name": "",
            "description": "HPAM-GP 2867\n\n   Health Care Reform: International\n\nAll health systems in the industrialized world are grappling with problems of cost, access, eAll health systems in the industrialized world are grappling with problems of cost, access, equity and quality of health care, and the tradeoffs between these objectives. Reforms based on promoting markets, managed competition, public contracting, improved management, and changing financial incentives are some important issues under discussion in many countries. This seminar applies the tools of public policy analysis and draws on international comparisons of health systems to analyze efforts at health...\n\n      more description for HPAM-GP 2867 »\n\n      \n\n\n\nAll health systems in the industrialized world are grappling with problems of cost, access, eAll health systems in the industrialized world are grappling with problems of cost, access, equity and quality of health care, and the tradeoffs between these objectives. Reforms based on promoting markets, managed competition, public contracting, improved management, and changing financial incentives are some important issues under discussion in many countries. This seminar applies the tools of public policy analysis and draws on international comparisons of health systems to analyze efforts at health care reform. The readings, lectures, and class discussions should make students more knowledgeable about policy options and policy changes in different countries. The seminar begins with an examination of the key problems in the financing and organization of health systems. Next we focus on ideas, concepts, and theories of health care reform. We then go on to study concrete proposals, as well as implementation of health care reform in the United States and abroad in the United Kingdom, France, Canada, Germany, and the Netherlands. \n\n      less description for HPAM-GP 2867 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4700",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17353",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "WAVE 567"
                }
            ],
            "course_name": "Topics in Health Policy",
            "description": "HPAM-GP 4700 Topics in Health Policy",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4821",
            "course_name": "Locating the Evidence for Health Management",
            "description": "HPAM-GP 4821 Locating the Evidence for Health Management \nIn this information-seeking methods course, students frame answerable research questions, select specialized databases, develop effective search strategies and critically appraise the literature of healthcare management. Going beyond \"Googling,\" the course illuminates the hierarchical nature of scholarly literature and introduces major U.S. health statistics sources. The course prepares students for the Capstone: Advanced Project in Health Services Management and supports evidence-based decision-making in the workplace.",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4822",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5170",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "GCASL 261",
                    "time": "Thu 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Mherabi, Nader"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 4822\n\n   Healthcare Information Technology:  Public Policy and Management\n\nThis course describes the growing involvement of government in stimulating and directing the development of information technology in healthcare organizations. Included is a discussion of attempts to exchange information for the purposes of improving the quality of personal healthcare and public health. Methods for determining the financial value of information technology are described. Techniques for insuring the security and privacy of health information are presented. How information systems and technology can improve the quality of service provided to consumers and the clinical quality of ...\n\n      more description for HPAM-GP 4822 »\n\n      \n\n\n\nThis course describes the growing involvement of government in stimulating and directing the development of information technology in healthcare organizations. Included is a discussion of attempts to exchange information for the purposes of improving the quality of personal healthcare and public health. Methods for determining the financial value of information technology are described. Techniques for insuring the security and privacy of health information are presented. How information systems and technology can improve the quality of service provided to consumers and the clinical quality of health care is examined.\n\nPrerequisites: HPAM-GP.4833 or permission of instructor\n\n      less description for HPAM-GP 4822 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4823",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5172",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "GCASL 261",
                    "time": "Thu 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Mherabi, Nader"
                }
            ],
            "course_name": "Healthcare Information Technology for Managers",
            "description": "HPAM-GP 4823 Healthcare Information Technology for Managers \nThis course will prepare healthcare managers and clinicians to participate in the management of healthcare information technology. Issues related to organizing and managing the information services function in a health care organization are discussed, including the technology selection, acquisition and implementation processes.\n\nPrerequisites: HPAM-GP.4822, HPAM-GP.4833 or instructor permission",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4830",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5163",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "25W4 C-20",
                    "time": "Mon 8.35 PM - 10.15 PM",
                    "open": true,
                    "professor": "Patel, Ashwinkumar"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 4830\n\n   Health Economics: Principles\n\nThis course provides the core microeconomic theories and concepts needed to understand health and health care issues in both the developed and developing world. It describes how the markets for health and health services are different from other goods, with a particular emphasis on the role of government and market failure. In addition it discusses the theoretical and empirical aspects of key health economics issues, including the demand for health and health services, supply side concerns, health insurance, the provision of public goods, and related topics. The course encourages students to f...\n\n      more description for HPAM-GP 4830 »\n\n      \n\n\n\nThis course provides the core microeconomic theories and concepts needed to understand health and health care issues in both the developed and developing world. It describes how the markets for health and health services are different from other goods, with a particular emphasis on the role of government and market failure. In addition it discusses the theoretical and empirical aspects of key health economics issues, including the demand for health and health services, supply side concerns, health insurance, the provision of public goods, and related topics. The course encourages students to fundamentally and rigorously examine the role of the market for the provision of health and health services and how public policy can influence these markets.\n\nPrerequisites: CORE-GP.1011, CORE-GP.1018\n\n      less description for HPAM-GP 4830 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4831",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5173",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "25W4 C-20",
                    "time": "Mon 8.35 PM - 10.15 PM",
                    "open": true,
                    "professor": "Patel, Ashwinkumar"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 4831\n\n   Health Econ:Top Dom Pol\n\nBuilding on HPAM-GP.4830, this course examines US domestic health policy issues from an economics perspective. Topics covered will be influenced by the current policy topics under discussion in the US. We will focus on the tradeoffs and contrasts between a market-based versus a government-based system, with topics potentially including: choice and behavioral economics, payment policies/pay-for-performance, health insurance, relevant sectors of the US health care system (hospitals, etc), public health and innovation. There will be a strong focus on applying theoretical insights from P.114830 an...\n\n      more description for HPAM-GP 4831 »\n\n      \n\n\n\nBuilding on HPAM-GP.4830, this course examines US domestic health policy issues from an economics perspective. Topics covered will be influenced by the current policy topics under discussion in the US. We will focus on the tradeoffs and contrasts between a market-based versus a government-based system, with topics potentially including: choice and behavioral economics, payment policies/pay-for-performance, health insurance, relevant sectors of the US health care system (hospitals, etc), public health and innovation. There will be a strong focus on applying theoretical insights from P.114830 and interpreting the relevant empirical literature.\n\nPrerequisites: CORE-GP.1011, CORE-GP.1018\n\n      less description for HPAM-GP 4831 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4832",
            "course_name": "Health Economics: Topics in International Health Policy",
            "description": "HPAM-GP 4832 Health Economics: Topics in International Health Policy",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4833",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5161",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "Donnellan, John",
                    "time": "Tue 6.30 PM - 8.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Health Care Management I: Control and Organizational Design",
            "description": "HPAM-GP 4833 Health Care Management I: Control and Organizational Design \nThis is a 2-credit course intended for graduate students and is designed to study how to manage in and lead health care organizations (HCOs). Topics covered will include: the use of evidence-based management in health care, how health services are governed and organized, particularly in non-profit organizations, how performance control systems work in health care organizations, management of acute and chronic care delivery systems, and models of accountable health care systems. \n\nPrerequisites: CORE-GP.1020, HPAM-GP.1830 or HPAM-GP.1831 concurrently",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4834",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5162",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "Donnellan, John",
                    "time": "Tue 6.30 PM - 8.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Health Care Management II: Adaptation and the Professional Manager",
            "description": "HPAM-GP 4834 Health Care Management II: Adaptation and the Professional Manager \nThis is a 2-credit course intended for graduate students and is designed to study how to manage in and lead health care organizations (HCOs). Topics covered will include: strategic planning and marketing in HCOs, particularly in non-profit organizations, how HCOs assess and adapt to change, ethical issues in HCO's, and constraints/opportunities for managerial careers in HCOs.\n\nPrerequisites: CORE-GP.1020, HPAM-GP.1830 or HPAM-GP.1831 concurrently",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4835",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17351",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "SILV 411",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Gurwitz, Sarah"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 4835\n\n   Human Resources Management: Principles\n\nThis 2-credit course is designed to study the essential role of human resources management within health care organizations. It is required for health management students and recommended for health policy and finance students. In order to meet the challenges of the marketplace, organizations will need to improve the quality of the services they provide; streamline their clinical delivery and support systems, and transform their human resources management accordingly. The degree to which organizations manage the people issues will, to a great extent, determine the success of our health care ins...\n\n      more description for HPAM-GP 4835 »\n\n      \n\n\n\nThis 2-credit course is designed to study the essential role of human resources management within health care organizations. It is required for health management students and recommended for health policy and finance students. In order to meet the challenges of the marketplace, organizations will need to improve the quality of the services they provide; streamline their clinical delivery and support systems, and transform their human resources management accordingly. The degree to which organizations manage the people issues will, to a great extent, determine the success of our health care institutions. This course serves as a comprehensive foundation for all aspects of human resources planning, development, and administration and is vital to both the human resources professional and the line manager. Through the text readings, journal articles, case analyses, and student presentations, we will explore key issues and concerns in the human resources field.\n\n      less description for HPAM-GP 4835 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4836",
            "course_name": "Human Resources Management: Advanced Issues",
            "description": "HPAM-GP 4836 Human Resources Management: Advanced Issues",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4840",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5179",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "SILV 401",
                    "time": "Mon 8.35 PM - 10.15 PM",
                    "open": true,
                    "professor": "Calabrese, Thad"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 4840\n\n   Financial Management of Health Care Orgs: Principles\n\nThis course incorporates topics of planning and financial decision making as applied to health-care organizations. This course will cover two main topics: \n-Financial analysis both as a proactive exercise and a tool for organizational control. \n-Issues of budgeting, cost determination, pricing and rate setting in a healthcare environment. \nThe course includes lectures, problem solving and a finance term project. Students should be prepared to discuss assigned problems and readings in class. The course integrates academic and practical approaches and perspectives on current health-care finan...\n\n      more description for HPAM-GP 4840 »\n\n      \n\n\n\nThis course incorporates topics of planning and financial decision making as applied to health-care organizations. This course will cover two main topics: \n-Financial analysis both as a proactive exercise and a tool for organizational control. \n-Issues of budgeting, cost determination, pricing and rate setting in a healthcare environment. \nThe course includes lectures, problem solving and a finance term project. Students should be prepared to discuss assigned problems and readings in class. The course integrates academic and practical approaches and perspectives on current health-care financial problems. \n\nPrerequisites: CORE-GP.1018, CORE-GP.1021\n\n      less description for HPAM-GP 4840 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4841",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5180",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "WAVE 367",
                    "time": "Mon 8.35 PM - 10.15 PM",
                    "open": true,
                    "professor": "Calabrese, Thad"
                }
            ],
            "course_name": "",
            "description": "HPAM-GP 4841\n\n   Financial Management of Health Care Orgs: Advanced Issues\n\nThis is a required 2-credit course for all Wagner students in the health financial management specializations and is recommended for health management students. The course incorporates topics of capital planning and other finance issues making as applied to health-care organizations. This course will cover three main topics: \n-Public payer rate setting \n-Understanding risk and the costs of capital in making financial decisions. \n Issues in working capital and investment management activities of healthcare organizations. \nThe course includes lectures, problem solving and a term finance proj...\n\n      more description for HPAM-GP 4841 »\n\n      \n\n\n\nThis is a required 2-credit course for all Wagner students in the health financial management specializations and is recommended for health management students. The course incorporates topics of capital planning and other finance issues making as applied to health-care organizations. This course will cover three main topics: \n-Public payer rate setting \n-Understanding risk and the costs of capital in making financial decisions. \n Issues in working capital and investment management activities of healthcare organizations. \nThe course includes lectures, problem solving and a term finance project. Students should be prepared to discuss assigned problems and readings in class. The course integrates academic and practical approaches and perspectives on current health-care financial problems. \n\nPrerequisites: CORE-GP.1018, CORE-GP.1021\n\n      less description for HPAM-GP 4841 «",
            "offering": true
        },
        {
            "course_id": "HPAM-GP 4843",
            "course_name": "Private Ends, Public Means",
            "description": "HPAM-GP 4843 Private Ends, Public Means",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4844",
            "course_name": "",
            "description": "HPAM-GP 4844\n\n   Realities of Faculty Practice Management\n\nThe Realities of Faculty Practice Management course is designed to provide students with an up close perspective of how a Faculty Practice Organization operates. The course will provide critical knowledge related to the following areas:\n- Faculty Practice Operating Models\n- Governance Structures\n- Faculty Practice Business Operations\n- Faculty Practice Finance and Revenue Cycle\n- Faculty and the Faculty Practice\n- Risk and Quality Management\n- Performance Improvement\n\nUsing real life case studies, expert insight, and relevant reading materials these sections will outline the problems,...\n\n      more description for HPAM-GP 4844 »\n\n      \n\n\n\nThe Realities of Faculty Practice Management course is designed to provide students with an up close perspective of how a Faculty Practice Organization operates. The course will provide critical knowledge related to the following areas:\n- Faculty Practice Operating Models\n- Governance Structures\n- Faculty Practice Business Operations\n- Faculty Practice Finance and Revenue Cycle\n- Faculty and the Faculty Practice\n- Risk and Quality Management\n- Performance Improvement\n\nUsing real life case studies, expert insight, and relevant reading materials these sections will outline the problems, issues, and possible solutions for each topic. Through interactive class discussion, evidence based research, and access to industry leaders with content expertise each student will develop a detailed understanding of the realities of Faculty Practice Management.\n\n      less description for HPAM-GP 4844 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4845",
            "course_name": "Realities of Academic Medical Centers",
            "description": "HPAM-GP 4845 Realities of Academic Medical Centers",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4846",
            "course_name": "",
            "description": "HPAM-GP 4846\n\n   Health Care Finance in Developing Nations\n\nThe world’s attention has tuned to the struggle of expanding health insurance coverage for 40 million people in the US but is largely ignoring the 4 billion people in low- and middle- income countries face the same hardship. Millions of the poor have already fallen back into poverty as a result of the recent global financial crisis. Millions more are at risk before full recovery. It is the poor and most vulnerable that are at greatest risk from due to lack of protection against the impoverishing effects of illness. \n\nEuropeans, Canadians, Australians and many others who live in countries whe...\n\n      more description for HPAM-GP 4846 »\n\n      \n\n\n\nThe world’s attention has tuned to the struggle of expanding health insurance coverage for 40 million people in the US but is largely ignoring the 4 billion people in low- and middle- income countries face the same hardship. Millions of the poor have already fallen back into poverty as a result of the recent global financial crisis. Millions more are at risk before full recovery. It is the poor and most vulnerable that are at greatest risk from due to lack of protection against the impoverishing effects of illness. \n\nEuropeans, Canadians, Australians and many others who live in countries where universal coverage was achieved many years ago, watched with bewilderment the recent debates in the US Congress and Senate. How could anyone in the world’s richest country be opposed-they ask-to reforms aimed at securing access to affordable health insurance to those who currently do covered in the world’s richest country? What argument-they ask-could anyone possibly give to oppose a reform that would extend protection to vulnerable segments of the population that currently does not enjoy such benefits? Yet, it is precisely the same type of debate-often fuelled by ideologically-oriented stake holders and donors -that one hears in India, Kenya, Pakistan, Senegal, Uganda, and many other countries struggling to introduce health insurance reforms themselves. \n\nThis course will review the key principles of health care financing in the context of low- and middle-income countries in which a large share of the population live below the poverty level of one dollar per day. Students will learn about the following: (a) Role of health financing in addressing key development challenges at low-income levels; (b) Objectives of health care financing (what to expect and what not to expect); (c) health financing sub functions - revenue collection, risk pooling and purchasing; (d) funding sources: general revenues, labor taxes, premiums, households, donors; (e) pooling mechanisms: subsidies, insurance, savings, consumption shifts; (f) spending: targeting, setting priorities, selecting providers, setting prices, payment systems; (g) the politics of health care financing (vested interests); and (h) the devil is in the details (implementation). \n\nCentral message \n• More money is needed to address the health problems in low- and middle-income countries \n• Without specific policies to protect them, the poor often get left out (equity dimension) \n• Ensuring value for money requires spending scarce resources wisely (efficiency dimension). \n\nKey controversial issues \n• Fee exemption vs subsidies \n• Supply-side subsidized national health services vs demand-side strategies under insurance \n• Public vs private insurance \n• Old vs new approaches to development assistance.\n\nPrerequisites: CORE-GP 1018\n\n      less description for HPAM-GP 4846 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4847",
            "course_name": "Caring Dilemmas: Learning from Narrative",
            "description": "HPAM-GP 4847 Caring Dilemmas: Learning from Narrative \nThis course uses novels, plays and films to help health policy and management students analyze the dilemmas that doctors, nurses, managers and caregivers face in caring for the vulnerable. Students learn how they and others think and feel about ways of responding to these dilemmas in best practice. \n\nEnrollment is strictly limited to 18 students.\n\nPrerequisites: None",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4852",
            "course_name": "",
            "description": "HPAM-GP 4852\n\n   Ethical Issues Hlth Care Mgt\n\nThis course will explore the role of ethics in management leadership and organization\nsuccess in today?s health care environment. Learning objectives include:\n\n- Foster critical awareness of the student?s values and the underlying ethical issues\n- Identify and enhance knowledge and skills to respond to specific ethics encountered in today?s environment\n- Promote competence in moral reasoning and skill in applying basic ethics concepts, including identifying, analyzing, and resolving ethics conflicts\n- Explore various ethical issues in health care management\n- Describe ethics resources and tool...\n\n      more description for HPAM-GP 4852 »\n\n      \n\n\n\nThis course will explore the role of ethics in management leadership and organization\nsuccess in today?s health care environment. Learning objectives include:\n\n- Foster critical awareness of the student?s values and the underlying ethical issues\n- Identify and enhance knowledge and skills to respond to specific ethics encountered in today?s environment\n- Promote competence in moral reasoning and skill in applying basic ethics concepts, including identifying, analyzing, and resolving ethics conflicts\n- Explore various ethical issues in health care management\n- Describe ethics resources and tools\n\nThe course will focus on both recognizing and responding to contemporary ethical topics\nin health care management. \n\nClass sessions will explore the application of moral\nreasoning, based on various ethical theories to health care concerns encountered by healthcare administrators, policy makers and clinicians. The course will demonstrate the practical application of philosophy and specifically, moral reasoning to ethical conflicts in health care organizations.  Emphasis will be on critical thinking, real-world\napplication, and decision-making in a professional environment. \n\nStudents should come to class prepared to participate in the discussion of major topics\noutlined for each course session. Each session will consist of faculty and student presentations, group discussion, and case studies. The course is of interest to all students, especially those pursuing careers in health care.\n\n      less description for HPAM-GP 4852 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4853",
            "course_name": "Healthcare Law and Ethics",
            "description": "HPAM-GP 4853 Healthcare Law and Ethics",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4855",
            "course_name": "Introduction to Comparative Cost-Effectiveness",
            "description": "HPAM-GP 4855 Introduction to Comparative Cost-Effectiveness",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4860",
            "course_name": "",
            "description": "HPAM-GP 4860\n\n   Topics in Health Policy: The Affordable Care Act\n\nThe purpose of this seminar is to explore the substance and form of the Affordable Care Act. The course will examine the context and content of the Law, as well as the process from passage to implementation. \n\nBy the end of the course, students will: \n- Be familiar with the major components of the Affordable Care Act \n- Be able to explain the evolution of policy from concept to legislation \n- Understand the process and importance of scoring legislation \n- Recognize the role and process of regulation \n- Be familiar with the arguments around the Constitutionality of the Act \n- Understand the cha...\n\n      more description for HPAM-GP 4860 »\n\n      \n\n\n\nThe purpose of this seminar is to explore the substance and form of the Affordable Care Act. The course will examine the context and content of the Law, as well as the process from passage to implementation. \n\nBy the end of the course, students will: \n- Be familiar with the major components of the Affordable Care Act \n- Be able to explain the evolution of policy from concept to legislation \n- Understand the process and importance of scoring legislation \n- Recognize the role and process of regulation \n- Be familiar with the arguments around the Constitutionality of the Act \n- Understand the challenges of implementing components of the Law \n\n\nPrerequisites:\n\nNone\n\nPuck with Street Sign\n\n      less description for HPAM-GP 4860 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 4865",
            "course_name": "",
            "description": "HPAM-GP 4865\n\n   Obesity Policy Research\n\nObesity is a large, pressing public health problem in the United States and, increasingly, across the globe. In contrast to some other public health problems, we have yet to truly establish population-level solutions. Increasingly attention in the policy and research world is being given to policy and environmental approaches to combat obesity, and as such obesity policy is a topic of increasing research. This is a very new field, and much of the research is contradictory, not well interpreted by the media or policy makers, and generally is sparse, relative to some other fields (like smoking p...\n\n      more description for HPAM-GP 4865 »\n\n      \n\n\n\nObesity is a large, pressing public health problem in the United States and, increasingly, across the globe. In contrast to some other public health problems, we have yet to truly establish population-level solutions. Increasingly attention in the policy and research world is being given to policy and environmental approaches to combat obesity, and as such obesity policy is a topic of increasing research. This is a very new field, and much of the research is contradictory, not well interpreted by the media or policy makers, and generally is sparse, relative to some other fields (like smoking policy).\n\n      less description for HPAM-GP 4865 «",
            "offering": false
        },
        {
            "course_id": "HPAM-GP 6855",
            "course_name": "Institute in Budgeting for Health Professionals",
            "description": "HPAM-GP 6855 Institute in Budgeting for Health Professionals",
            "offering": false
        }
    ]
}