{
    "major_id": "HI-UY",
    "file": "./2015-2016/History_(HI-UY).html",
    "courses": [
        {
            "course_id": "HI-UY 2003",
            "course_name": "W",
            "description": "HI-UY 2003W\n\n   The Age of Conquistadors\n\nThis course will focus on European discovery of Americas since 1492. Emphasis will be given more to the conquest of Americas in Caribbean, Mexico, Peru, Central America, New Mexico and Brazil. In doing so, this course will address the role of the Catholic Church, the imposed imperial system and the sufferings of indigenous people.\nFor many historians, 1492 is the landmark of European-dominated modernity. While the Chinese made a major breakthrough in navigation and while the Arab merchants traded globally, the Europeans were far behind in modernity. But by 1492 Europeans expanded its horizons...\n\n      more description for HI-UY 2003W »\n\n      \n\n\n\nThis course will focus on European discovery of Americas since 1492. Emphasis will be given more to the conquest of Americas in Caribbean, Mexico, Peru, Central America, New Mexico and Brazil. In doing so, this course will address the role of the Catholic Church, the imposed imperial system and the sufferings of indigenous people.\nFor many historians, 1492 is the landmark of European-dominated modernity. While the Chinese made a major breakthrough in navigation and while the Arab merchants traded globally, the Europeans were far behind in modernity. But by 1492 Europeans expanded its horizons to the Americas, Asia and Africa. Was it because of gold? Was it because of religious motivation? Or was it to save the “savages”? What consequences did the indigenous population face? What advancement did the Europeans make in such ventures? This course will address these questions. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 2003W «",
            "offering": false
        },
        {
            "course_id": "HI-UY 2103",
            "course_name": "W Western and Non-Western Societies",
            "description": "HI-UY 2103W Western and Non-Western Societies \nThe course introduces a comparative study of Western and non-Western societies, emphasizing the importance of Western and non-Western relations and the impact Europe made upon the rest of the world. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.",
            "offering": false
        },
        {
            "course_id": "HI-UY 2104",
            "course_name": "MODERN WORLD HISTORY",
            "description": "HI-UY 2104 MODERN WORLD HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 2125",
            "course_name": "THE US CONST: BILL OF RIGHTS",
            "description": "HI-UY 2125 THE US CONST: BILL OF RIGHTS",
            "offering": false
        },
        {
            "course_id": "HI-UY 2204",
            "course_name": "MEDIEVAL TECHNOLOGY",
            "description": "HI-UY 2204 MEDIEVAL TECHNOLOGY \nThis course considers medieval heritage, culture, society, technology and its impact and continuity in modern times. The course looks at the nuclear family as it originated in medieval times, and emphasizes concepts of modern law, religion, war, science, race and class. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.",
            "offering": false
        },
        {
            "course_id": "HI-UY 2204",
            "course_name": "W MEDIEVAL TECHNOLOGY",
            "description": "HI-UY 2204W MEDIEVAL TECHNOLOGY \nThis course considers medieval heritage, culture, society, technology and its impact and continuity in modern times. Special emphasis is given to concepts of modern law, religion, war, science, race, class, and the nuclear family. | Prerequisites: Completion of first writing requirement . Satisfies and HuSS Elective. Co-requisites: None. Notes: Satisfies a HuSS elective.",
            "offering": false
        },
        {
            "course_id": "HI-UY 2210",
            "course_name": "EUROPE 750 - 1700",
            "description": "HI-UY 2210 EUROPE 750 - 1700",
            "offering": false
        },
        {
            "course_id": "HI-UY 2214",
            "course_name": "| HI-UY 2260 INTRO TO HISTORY OF SCIENCE",
            "description": "HI-UY 2214 | HI-UY 2260 INTRO TO HISTORY OF SCIENCE",
            "offering": false
        },
        {
            "course_id": "HI-UY 2215",
            "course_name": "20th CENTURY EASTERN EUROPE",
            "description": "HI-UY 2215 20th CENTURY EASTERN EUROPE",
            "offering": false
        },
        {
            "course_id": "HI-UY 2224",
            "course_name": "| HI-UY 2324 SCIENCE AND INDUSTRY IN THE MODERN WORLD",
            "description": "HI-UY 2224 | HI-UY 2324 SCIENCE AND INDUSTRY IN THE MODERN WORLD",
            "offering": false
        },
        {
            "course_id": "HI-UY 2234",
            "course_name": "",
            "description": "HI-UY 2234\n\n   Introduction to the History of Western Technology\n\nThis course surveys generally the history of technology (from the early modern period to the present) and investigates how technology shapes society, and how society molds technology. Topics include ancient technologies, the printing press, the Industrial Revolution, the replacing of laborers with machines, electricity, transportation, Ford and the invention of the automobile, Taylorism and the organization of labor, technology during World War II (including radar, V1and V2 rockers and the Enigma machine) and the rise of the NASA space program. | Prerequisites: Completion of first year writing...\n\n      more description for HI-UY 2234 »\n\n      \n\n\n\nThis course surveys generally the history of technology (from the early modern period to the present) and investigates how technology shapes society, and how society molds technology. Topics include ancient technologies, the printing press, the Industrial Revolution, the replacing of laborers with machines, electricity, transportation, Ford and the invention of the automobile, Taylorism and the organization of labor, technology during World War II (including radar, V1and V2 rockers and the Enigma machine) and the rise of the NASA space program. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 2234 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 2250",
            "course_name": "MODERN ASIA",
            "description": "HI-UY 2250 MODERN ASIA",
            "offering": false
        },
        {
            "course_id": "HI-UY 2254",
            "course_name": "",
            "description": "HI-UY 2254\n\n   FROM HEAT ENGINES TO BLACK HOLES\n\nWhat is the nature of heat? How does it relate to atoms, black holes, information and a demon in a box full of gas molecules? This course answers these questions by developing the history of thermodynamics. That history begins with early 18th-century caloric theories of heat, 19th-century analyses of steam engines, the kinetic theory of gases, the statistical approach to mechanics, atomic theories of matter, the concept of entropy, early 20th-century concepts of  formation and, finally, current applications to black holes (as well as Maxwell and his famous demon). The course considers theoreti...\n\n      more description for HI-UY 2254 »\n\n      \n\n\n\nWhat is the nature of heat? How does it relate to atoms, black holes, information and a demon in a box full of gas molecules? This course answers these questions by developing the history of thermodynamics. That history begins with early 18th-century caloric theories of heat, 19th-century analyses of steam engines, the kinetic theory of gases, the statistical approach to mechanics, atomic theories of matter, the concept of entropy, early 20th-century concepts of  formation and, finally, current applications to black holes (as well as Maxwell and his famous demon). The course considers theoretical descriptions of the phenomena and the technologies derived from them. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 2254 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 2254",
            "course_name": "W",
            "description": "HI-UY 2254W\n\n   FROM HEAT ENGINES TO BLACK HOLES\n\nWhat is the nature of heat? How does it relate to atoms, black holes, information and a demon in a box full of gas molecules? This course answers these questions by developing the history of thermodynamics. That history begins with early 18th-century caloric theories of heat, 19th-century analyses of steam engines, the kinetic theory of gases, the statistical approach to mechanics, atomic theories of matter, the concept of entropy, early 20th-century concepts of  formation and, finally, current applications to black holes (as well as Maxwell and his famous demon). The course considers theoreti...\n\n      more description for HI-UY 2254W »\n\n      \n\n\n\nWhat is the nature of heat? How does it relate to atoms, black holes, information and a demon in a box full of gas molecules? This course answers these questions by developing the history of thermodynamics. That history begins with early 18th-century caloric theories of heat, 19th-century analyses of steam engines, the kinetic theory of gases, the statistical approach to mechanics, atomic theories of matter, the concept of entropy, early 20th-century concepts of  formation and, finally, current applications to black holes (as well as Maxwell and his famous demon). The course considers theoretical descriptions of the phenomena and the technologies derived from them. | Prerequisites:  Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 2254W «",
            "offering": false
        },
        {
            "course_id": "HI-UY 2214",
            "course_name": "| HI-UY 2260 INTRO TO HISTORY OF SCIENCE",
            "description": "HI-UY 2214 | HI-UY 2260 INTRO TO HISTORY OF SCIENCE",
            "offering": false
        },
        {
            "course_id": "HI-UY 2264",
            "course_name": "",
            "description": "HI-UY 2264\n\n   The Ship\n\nShips, the largest human-made moving objects, have played a pivotal role in trade and warfare throughout history. This course covers the history, development and technology of ships from ancient times to the present. The course discusses aspects of the atmosphere and seas as they relate to ship design and use. Technological advances in hull design, materials, sails and power also will be discussed. The use of ships in trade, human transportation, warfare, fishing, piracy and global exploration are covered, along with the satellite industries of shipbuilding and port support. The course also lo...\n\n      more description for HI-UY 2264 »\n\n      \n\n\n\nShips, the largest human-made moving objects, have played a pivotal role in trade and warfare throughout history. This course covers the history, development and technology of ships from ancient times to the present. The course discusses aspects of the atmosphere and seas as they relate to ship design and use. Technological advances in hull design, materials, sails and power also will be discussed. The use of ships in trade, human transportation, warfare, fishing, piracy and global exploration are covered, along with the satellite industries of shipbuilding and port support. The course also looks at the manning of ships, the social and military organization, ¬the life of mariners, the development of navigation and its technologies in an historical context, and submarine evolution and technologies. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 2264 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 2314",
            "course_name": "UNITED STATES HISTORY TO 1865",
            "description": "HI-UY 2314 UNITED STATES HISTORY TO 1865",
            "offering": false
        },
        {
            "course_id": "HI-UY 2224",
            "course_name": "| HI-UY 2324 SCIENCE AND INDUSTRY IN THE MODERN WORLD",
            "description": "HI-UY 2224 | HI-UY 2324 SCIENCE AND INDUSTRY IN THE MODERN WORLD",
            "offering": false
        },
        {
            "course_id": "HI-UY 2353",
            "classes": [
                {}
            ],
            "course_name": "HISTORY OF NYC TRANSIT SYSTEM",
            "description": "HI-UY 2353 HISTORY OF NYC TRANSIT SYSTEM",
            "offering": true
        },
        {
            "course_id": "HI-UY 2364",
            "course_name": "",
            "description": "HI-UY 2364\n\n   HISTORY OF AVIATION & AVIATION TECHNOLOGY\n\nIn little more than 100 years, aviation has passed from a ground-hugging flight of less than a minute to high-altitude, supersonic flights that cross continents and oceans. This course surveys the history of aviation and the technological innovations that led to this crucial modern technology. This course also discusses the physics of flight, how increased understanding of aerodynamic principles led to successive aircraft improvements, and the development of new materials and control systems. Although military research drove many technological innovations, this course focuses on the economics ...\n\n      more description for HI-UY 2364 »\n\n      \n\n\n\nIn little more than 100 years, aviation has passed from a ground-hugging flight of less than a minute to high-altitude, supersonic flights that cross continents and oceans. This course surveys the history of aviation and the technological innovations that led to this crucial modern technology. This course also discusses the physics of flight, how increased understanding of aerodynamic principles led to successive aircraft improvements, and the development of new materials and control systems. Although military research drove many technological innovations, this course focuses on the economics and development of commercial aviation, which has changed the world. The course also looks at ultramodern trends in aircraft design and control, including unmanned cruise missiles and aircraft, and new commercial-aircraft designs and production techniques. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 2364 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 2414",
            "course_name": "EUROPE FROM 750 - 1700 AD",
            "description": "HI-UY 2414 EUROPE FROM 750 - 1700 AD",
            "offering": false
        },
        {
            "course_id": "HI-UY 2424",
            "course_name": "20TH CENTURY EASTERN EUROPE",
            "description": "HI-UY 2424 20TH CENTURY EASTERN EUROPE",
            "offering": false
        },
        {
            "course_id": "HI-UY 2434",
            "course_name": "",
            "description": "HI-UY 2434\n\n   History of New York City Transit System\n\nThis course traces the technological history of public transportation in New York City and investigates its role in the development of the city, its economy and its social fabric. From the early days of horse-drawn public carriages to the modern subway system, the role of the public transit in the historical development patterns of New York City is treated. The course covers trolley systems, the age of the elevated railways and the subway system. Political, social and economic issues involved in the development of these critical infrastructures are discussed. Students develop independent proje...\n\n      more description for HI-UY 2434 »\n\n      \n\n\n\nThis course traces the technological history of public transportation in New York City and investigates its role in the development of the city, its economy and its social fabric. From the early days of horse-drawn public carriages to the modern subway system, the role of the public transit in the historical development patterns of New York City is treated. The course covers trolley systems, the age of the elevated railways and the subway system. Political, social and economic issues involved in the development of these critical infrastructures are discussed. Students develop independent project reports on aspects of the NYC public transit system, or on public-transit systems in other major world cities. | Prerequisites: Junior Status or permission of instructor\n\n      less description for HI-UY 2434 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 2514",
            "course_name": "Introduction to New York City History",
            "description": "HI-UY 2514 Introduction to New York City History \nThis course looks at the history and development of the City of New York, from Verazzano’s exploration to the present. Major themes include the evolution of the city’s political economy, political and economic influences on land and space use, and ethnic and class conflict in the urban environment. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.",
            "offering": false
        },
        {
            "course_id": "HI-UY 2514",
            "course_name": "W INTRODUCTION TO NEW YORK CITY HISTORY",
            "description": "HI-UY 2514W INTRODUCTION TO NEW YORK CITY HISTORY \nThe history and development of the city of New York from the exploration by Verrazano to the present taught by writing intensive method.  Major themes include the evolution of the city's political economy, political and economic influence on the use of land and space, and ethnic and class conflict in the urban environment.  | Prerequisites: Completion of first year writing requirements",
            "offering": false
        },
        {
            "course_id": "HI-UY 2624",
            "course_name": "| HI-UY 3125 GROWTH OF THE US CONSTITUTION: AMERICAN CIVIL LIBERTIES",
            "description": "HI-UY 2624 | HI-UY 3125 GROWTH OF THE US CONSTITUTION: AMERICAN CIVIL LIBERTIES",
            "offering": false
        },
        {
            "course_id": "HI-UY 2714",
            "course_name": "MODERN ASIA",
            "description": "HI-UY 2714 MODERN ASIA",
            "offering": false
        },
        {
            "course_id": "HI-UY 2724",
            "course_name": "URBAN ENVIRONMENTAL HISTORY",
            "description": "HI-UY 2724 URBAN ENVIRONMENTAL HISTORY \nThis course will examine the development of cities, primarily in North America, the evolution of the technologies used for that development, and their effect on the natural environment of cities and their regions, and the effects of the modernization and electrification of rural America on cities.  Students will use a broad toolkit of historical methods and modes, including environmental history, social history, world history, and history of technology. | Prerequisites: Completion of first year writing requirements.",
            "offering": false
        },
        {
            "course_id": "HI-UY 3032",
            "course_name": "URBAN INFRA. IN ANTQTY & TODAY",
            "description": "HI-UY 3032 URBAN INFRA. IN ANTQTY & TODAY",
            "offering": false
        },
        {
            "course_id": "HI-UY 3034",
            "classes": [
                {}
            ],
            "course_name": "History of New York's Urban Infrastructure",
            "description": "HI-UY 3034 History of New York's Urban Infrastructure \nThis survey of New York City’s infrastructure concentrates on water, sanitation and public health, electrical and communications systems, the development of housing and real estate, the security infrastructure and plans for the future. The course explores how the city’s political economy has shaped its physical environment and how technological innovations have made the city modern\nand postmodern. | Prerequisites: Completion of first year writing requirements.  Co-requisites: None. Notes: Satisfies a HuSS elective.",
            "offering": true
        },
        {
            "course_id": "HI-UY 3034",
            "course_name": "W",
            "description": "HI-UY 3034W\n\n   History of New York's Urban Infrastructure\n\nThis survey of New York City’s infrastructure concentrates on water, sanitation and public health, electrical and communications systems, the development of housing and real estate, the security infrastructure and plans for the future. The course explores how the city’s political economy has shaped its physical environment and how technological innovations have made the city modern\nand postmodern. | Prerequisites: Completion of first year writing requirements.  Co-requisites: None. Notes: Satisfies a HuSS elective.\nand postmodern. | Prerequisites: Completion of first year writing requirements....\n\n      more description for HI-UY 3034W »\n\n      \n\n\n\nThis survey of New York City’s infrastructure concentrates on water, sanitation and public health, electrical and communications systems, the development of housing and real estate, the security infrastructure and plans for the future. The course explores how the city’s political economy has shaped its physical environment and how technological innovations have made the city modern\nand postmodern. | Prerequisites: Completion of first year writing requirements.  Co-requisites: None. Notes: Satisfies a HuSS elective.\nand postmodern. | Prerequisites: Completion of first year writing requirements.  Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 3034W «",
            "offering": false
        },
        {
            "course_id": "HI-UY 3064",
            "course_name": "GLOBAL HOUSING",
            "description": "HI-UY 3064 GLOBAL HOUSING",
            "offering": false
        },
        {
            "course_id": "HI-UY 3103",
            "course_name": "MODERN ASIA",
            "description": "HI-UY 3103 MODERN ASIA \nThis course explores the major Asian civilizations since the mid-17th century, concentrating on their social, political, economic, religious and cultural histories. The course emphasizes principal Asian civilizations of China, India and Japan and also looks at Vietnam, Afghanistan and Iran. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.",
            "offering": false
        },
        {
            "course_id": "HI-UY 3110",
            "course_name": "NATIONS AND NATIONALISM",
            "description": "HI-UY 3110 NATIONS AND NATIONALISM",
            "offering": false
        },
        {
            "course_id": "HI-UY 3120",
            "course_name": "| HI-UY 3714 AMERICAN FOREIGN RELATIONS & INTERNATIONAL HISTORY",
            "description": "HI-UY 3120 | HI-UY 3714 AMERICAN FOREIGN RELATIONS & INTERNATIONAL HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 2624",
            "course_name": "| HI-UY 3125 GROWTH OF THE US CONSTITUTION: AMERICAN CIVIL LIBERTIES",
            "description": "HI-UY 2624 | HI-UY 3125 GROWTH OF THE US CONSTITUTION: AMERICAN CIVIL LIBERTIES",
            "offering": false
        },
        {
            "course_id": "HI-UY 3160",
            "course_name": "| HI-UY 3214 EARLY MODERN SCIENCE",
            "description": "HI-UY 3160 | HI-UY 3214 EARLY MODERN SCIENCE",
            "offering": false
        },
        {
            "course_id": "HI-UY 3165",
            "course_name": "SCIENCE AND INDUSTRY IN THE MODERN WORLD",
            "description": "HI-UY 3165 SCIENCE AND INDUSTRY IN THE MODERN WORLD",
            "offering": false
        },
        {
            "course_id": "HI-UY 3160",
            "course_name": "| HI-UY 3214 EARLY MODERN SCIENCE",
            "description": "HI-UY 3160 | HI-UY 3214 EARLY MODERN SCIENCE",
            "offering": false
        },
        {
            "course_id": "HI-UY 3224",
            "course_name": "SCIENCE & ETHICS IN THE 20TH CENTURY",
            "description": "HI-UY 3224 SCIENCE & ETHICS IN THE 20TH CENTURY",
            "offering": false
        },
        {
            "course_id": "HI-UY 3234",
            "course_name": "BIOLOGY AND SOCIETY",
            "description": "HI-UY 3234 BIOLOGY AND SOCIETY",
            "offering": false
        },
        {
            "course_id": "HI-UY 3244",
            "course_name": "",
            "description": "HI-UY 3244\n\n   THE HISTORY OF LIGHT\n\nWhat is the nature of light? How does it relate to magnets, electric circuits, TVs, radioactivity and the fundamental forces of nature?  More importantly, what really happens to your burrito when you microwave it? This course answers these and similar questions by following the historical development of three apparently distinct and unrelated phenomena—electricity, magnetism and light. Topics range from descriptions of these phenomena by the Greeks to Maxwell’s 19th-century unification of them into a single phenomenon to Einstein’s theory of special relativity to their incorporation into the S...\n\n      more description for HI-UY 3244 »\n\n      \n\n\n\nWhat is the nature of light? How does it relate to magnets, electric circuits, TVs, radioactivity and the fundamental forces of nature?  More importantly, what really happens to your burrito when you microwave it? This course answers these and similar questions by following the historical development of three apparently distinct and unrelated phenomena—electricity, magnetism and light. Topics range from descriptions of these phenomena by the Greeks to Maxwell’s 19th-century unification of them into a single phenomenon to Einstein’s theory of special relativity to their incorporation into the Standard Model of contemporary physics. The course considers theoretical descriptions of the phenomena and technologies derived from them. | Prerequisites: Completion of first year writing requirements. Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 3244 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 3244",
            "course_name": "W",
            "description": "HI-UY 3244W\n\n   THE HISTORY OF LIGHT\n\nWhat is the nature of light? How does it relate to magnets, electric circuits, TVs, radioactivity, and the fundamental forces of nature?  More importantly, what really happens to your burrito when you microwave it?  This course answers these and similar questions by following the historical development of three apparently distinct and unrelated phenomena - electricity, magnetism, and light - from their descriptions by the Greeks, to their unification under a single phenomena by Maxwell in the 19th century, and beyond to Einstein's theory of special relativity, and their incorporation into the ...\n\n      more description for HI-UY 3244W »\n\n      \n\n\n\nWhat is the nature of light? How does it relate to magnets, electric circuits, TVs, radioactivity, and the fundamental forces of nature?  More importantly, what really happens to your burrito when you microwave it?  This course answers these and similar questions by following the historical development of three apparently distinct and unrelated phenomena - electricity, magnetism, and light - from their descriptions by the Greeks, to their unification under a single phenomena by Maxwell in the 19th century, and beyond to Einstein's theory of special relativity, and their incorporation into the Standard Model of contemporary physics.  The path taken considers both the theoretical descriptions of the phenomena and the technologies derived from them.  | Prerequisites: Completion of first year writing requirements. Satisfies an HUSS Elective.\n\n      less description for HI-UY 3244W «",
            "offering": false
        },
        {
            "course_id": "HI-UY 3254",
            "course_name": "History of Mass Media",
            "description": "HI-UY 3254 History of Mass Media \nThis course will explore the history of mass media-broadsides, newspapers, cinema, radio, TV, and the internet from the advent of cheap print in the early modern period to the turn of the twenty-first century.  Themes will include the history of mass media technology, the mass dissemination of news and its effects on popular culture, and gender relations, sensationalism, the role of the media in the development of advertising and consumer culture.",
            "offering": false
        },
        {
            "course_id": "HI-UY 3254",
            "course_name": "W HISTORY OF MASS MEDIA",
            "description": "HI-UY 3254W HISTORY OF MASS MEDIA \nThis mass-media history course examines broadsides, newspapers, cinema, radio, TV and the Internet, from the advent of cheap print in the early modern period to the turn of the 21st century. Themes include the history of mass-media technology, the mass dissemination of news and its effects on popular culture and gender relations, sensationalism, and the role of the media in developing advertising and consumer culture. Credits: 3. Notes: Satisfies  a HuSS elective. | Prerequisites: Completion of first year writing requirements.",
            "offering": false
        },
        {
            "course_id": "HI-UY 3304",
            "course_name": "",
            "description": "HI-UY 3304\n\n   SCIENCE & TECHNOLOGY AS A STRATEGIC RESOURCE IN WORLD WAR II\n\nThis course examines the role of technology and science during World War II.  Among the technologies that are considered are some that were inherited from World War I and much improved (e.g., tanks, airplanes, aircraft carriers, and submarines).  Others were completely new and required considerable scientific input to be developed (e.g., radar, code breaking by the use of computers, jet engines, ballistic missiles, antibiotics, and the atomic bomb). | Prerequisite: Completion of first year writing requirements and One 2000 level elective from the STS Cluster.  Notes:  Satisfies an HuSS Electiv...\n\n      more description for HI-UY 3304 »\n\n      \n\n\n\nThis course examines the role of technology and science during World War II.  Among the technologies that are considered are some that were inherited from World War I and much improved (e.g., tanks, airplanes, aircraft carriers, and submarines).  Others were completely new and required considerable scientific input to be developed (e.g., radar, code breaking by the use of computers, jet engines, ballistic missiles, antibiotics, and the atomic bomb). | Prerequisite: Completion of first year writing requirements and One 2000 level elective from the STS Cluster.  Notes:  Satisfies an HuSS Elective.\n\n      less description for HI-UY 3304 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 3404",
            "course_name": "SPECIAL TOPICS IN HISTORY",
            "description": "HI-UY 3404 SPECIAL TOPICS IN HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 3414",
            "course_name": "NATIONS AND NATIONALISM",
            "description": "HI-UY 3414 NATIONS AND NATIONALISM",
            "offering": false
        },
        {
            "course_id": "HI-UY 3434",
            "course_name": "HISTORY OF INTELLECTUAL PROPERTY IN AMERICA",
            "description": "HI-UY 3434 HISTORY OF INTELLECTUAL PROPERTY IN AMERICA \nThis course, a history of successive regimes of patent, trade secret, copyright and trademark law from the early modern period to the present, introduces undergraduates to basic intellectual property concepts, language, the political and distributive implications of intellectual property regimes, and the possibility\nor even inevitability of alternative regimes.  | Prerequisites: Completion of first year writing requirements. Co-requisites: None.  Notes: Satisfies a HuSS elective.",
            "offering": false
        },
        {
            "course_id": "HI-UY 3604",
            "course_name": "INDEPENDENT STUDY IN HISTORY",
            "description": "HI-UY 3604 INDEPENDENT STUDY IN HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 3120",
            "course_name": "| HI-UY 3714 AMERICAN FOREIGN RELATIONS & INTERNATIONAL HISTORY",
            "description": "HI-UY 3120 | HI-UY 3714 AMERICAN FOREIGN RELATIONS & INTERNATIONAL HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 4111",
            "course_name": "SPECIAL TOPICS IN HISTORY",
            "description": "HI-UY 4111 SPECIAL TOPICS IN HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 4112",
            "course_name": "SPECIAL TOPICS IN HISTORY",
            "description": "HI-UY 4112 SPECIAL TOPICS IN HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 4114",
            "course_name": "SPECIAL TOPICS IN HISTORY",
            "description": "HI-UY 4114 SPECIAL TOPICS IN HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 4164",
            "course_name": "POLITICS AND FILM",
            "description": "HI-UY 4164 POLITICS AND FILM",
            "offering": false
        },
        {
            "course_id": "HI-UY 4333",
            "course_name": "",
            "description": "HI-UY 4333\n\n   SEM IN URBAN INFRASTRUCTURE HISTORY\n\nThis seminar investigates the urban and environmental history of New York City’s infrastructure, including water, sewage, transportation, housing and office construction.  The course investigates these systems in the context of the environmental, political and economic concerns that shape the city’s\ninfrastructure. The course looks at the transnational circulation of ideas about designing and constructing urban systems.  Questions include: How and why are infrastructure systems built? Why are they built the way they are? How do the technologies used affect the environment? Are the systems sus...\n\n      more description for HI-UY 4333 »\n\n      \n\n\n\nThis seminar investigates the urban and environmental history of New York City’s infrastructure, including water, sewage, transportation, housing and office construction.  The course investigates these systems in the context of the environmental, political and economic concerns that shape the city’s\ninfrastructure. The course looks at the transnational circulation of ideas about designing and constructing urban systems.  Questions include: How and why are infrastructure systems built? Why are they built the way they are? How do the technologies used affect the environment? Are the systems sustainable and interoperable? How do ideas about infrastructural needs, design and financing\ncirculate transnationally? | Prerequisites: HI 2313 or instructor’s permission.  Co-requisites: None. Notes: Satisfies a HuSS elective.\n\n      less description for HI-UY 4333 «",
            "offering": false
        },
        {
            "course_id": "HI-UY 4334",
            "course_name": "W",
            "description": "HI-UY 4334W\n\n   SEMINAR IN URBAN INFRASTRUCTURE HISTORY\n\nThis seminar investigates the urban and environmental history of New York City’s infrastructure, including water, sewage, transportation, housing and office construction.  The course investigates these systems in the context of the environmental, political and economic concerns that shape the city’s\ninfrastructure. The course looks at the transnational circulation of ideas about designing and constructing urban systems.  Questions include: How and why are infrastructure systems built? Why are they built the way they are? How do the technologies used affect the environment? Are the systems sust...\n\n      more description for HI-UY 4334W »\n\n      \n\n\n\nThis seminar investigates the urban and environmental history of New York City’s infrastructure, including water, sewage, transportation, housing and office construction.  The course investigates these systems in the context of the environmental, political and economic concerns that shape the city’s\ninfrastructure. The course looks at the transnational circulation of ideas about designing and constructing urban systems.  Questions include: How and why are infrastructure systems built? Why are they built the way they are? How do the technologies used affect the environment? Are the systems sustainable and interoperable? How do ideas about infrastructural needs, design and financing circulate transnationally? | Prerequisites: HI-UY 3034W\n\n      less description for HI-UY 4334W «",
            "offering": false
        },
        {
            "course_id": "HI-UY 4514",
            "course_name": "SPECIAL TOPICS IN HISTORY",
            "description": "HI-UY 4514 SPECIAL TOPICS IN HISTORY",
            "offering": false
        },
        {
            "course_id": "HI-UY 4724",
            "course_name": "SEM  INTERNATIONAL HISTORY SINCE 1945",
            "description": "HI-UY 4724 SEM  INTERNATIONAL HISTORY SINCE 1945",
            "offering": false
        }
    ]
}