{
    "major_id": "HSED-GE",
    "file": "./2015-2016/History_of_Education_(HSED-GE).html",
    "courses": [
        {
            "course_id": "HSED-GE 2009",
            "course_name": "History of American Educ",
            "description": "HSED-GE 2009 History of American Educ \nThis course will examine the major themes, developments, and dilemnas of educational history in the United States. How have historians defined and explored American education? What are the major achievements of the field? The weaknesses? And how might it improve? Topics will include the rise of public and parochial school systems; the endless drive for 'school reform', and the myriad ways that race, religion, and ethnicity have influenced it.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2067",
            "course_name": "History of Higher Educ",
            "description": "HSED-GE 2067 History of Higher Educ \nDiscussions of selected topics in the social and intellectual history of higher education in America since 1750.  Integration of educational policies and functions, with attention to limitations of educational responsibility, development of institutional structures, changing modes for gaining and imparting knowledge, and the social prerogatives and initiatives variously assigned to an educated class.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2070",
            "course_name": "Public Problems: Intro Ed & Soc Pol",
            "description": "HSED-GE 2070 Public Problems: Intro Ed & Soc Pol \nDiscussion of current problems in educational and social policy. Topics will include family and social welfare policy, schooling, higher education, employment and culture. A broad overview of the fundamental issues involved in framing public problems and practices.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2071",
            "course_name": "Ed & The City:School & Pop Cult",
            "description": "HSED-GE 2071 Ed & The City:School & Pop Cult \nExamination of the beginning of rapid urban growth in the nineteenth century and its effect on the educational agencies of the city. Focus is on the process by which new institutions developed in response to changing demographic and cultural conditions of urban life.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2079",
            "course_name": "The Rise and Fall of Progressivism",
            "description": "HSED-GE 2079 The Rise and Fall of Progressivism \nFocuses on two generations of progressive Schulman. This discussion is set in a historical analysis that begins in the 1880s. Among the individuals specifically discussed are John Dewey, George S. Counts, E. L. Thorndike, and Merle Curti.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2089",
            "course_name": "Philosophy of Scientific Inquiry",
            "description": "HSED-GE 2089 Philosophy of Scientific Inquiry",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2173",
            "course_name": "History of American Ed & Soc:Ed & The Cultr Wars",
            "description": "HSED-GE 2173 History of American Ed & Soc:Ed & The Cultr Wars \nExamination of the 'culture wars' in American public education over the past century, focusing on battles over religion, race and ethnicity.  Looks at how and why the school curriculum became an arena of cultural conflict. Emphasis on historical scholarship and analysis to clasrify present-day disputes and dilemnas.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2174",
            "course_name": "Hist of American Educ Society Race & Ethnicity",
            "description": "HSED-GE 2174 Hist of American Educ Society Race & Ethnicity \nConsiders various agencies and institutions by which American culture is transmitted from one generation to the next; problems dealing with settlement houses and immigration, progressive education, the great depression, mass culture and movies, and contemporary youth  culture are studied.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2175",
            "course_name": "What Are Schools for? Historical Perspectives",
            "description": "HSED-GE 2175 What Are Schools for? Historical Perspectives \nPast and present theories about the functions of the school in the United States.  Includes analyses of radical, liberal, and conservative theories.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2176",
            "course_name": "What'S Worth Knowing? Historical Perspectives",
            "description": "HSED-GE 2176 What'S Worth Knowing? Historical Perspectives \nStudies of the theories of Adler, Hirsch, Dewey, Rogers, and others.  The aim of the course is to help students clarify and test their own ideas about what's worth knowing through critical encounters with the ideas of some of the leading educational theorists in the history of education.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2177",
            "course_name": "What Are Teachers for? Historical Perspective",
            "description": "HSED-GE 2177 What Are Teachers for? Historical Perspective \nAnalyze the significant books and themes relating to the history of teachers as a group and a history of teaching as a profession in American society.  Topics for discussion include: the emergence of teaching as a 'women's' profession in the mid-nineteenth century, teachers' associations and unions, the relationship between teachers and education reform, and teacher education.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2235",
            "course_name": "20th Cent Educ Thought",
            "description": "HSED-GE 2235 20th Cent Educ Thought \nHistorical analyses and comparisons of some leading educational theorists of the 20th century.  Emphasis on their conceptions of the role of the teacher in the educational process.  Includes Montessori, Dewey, Piaget, Skinner, Neill, and Rogers.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2240",
            "course_name": "Read Hist West Thought",
            "description": "HSED-GE 2240 Read Hist West Thought \nReading, discussion, and critical analysis of selected works in Western thought.  Includes works by Plato, Nietzsche, Locke, Rousseau, Mill, Freud, Marx.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3635",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Zimmerman, Jonathan",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "3636",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Fraser, James",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4672",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Wechsler, Harold",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "HSED-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "HSED-GE 2400",
            "course_name": "Fndtns of Ed: Hist of Ed",
            "description": "HSED-GE 2400 Fndtns of Ed: Hist of Ed \nA critical examination of several histories of American education.  Compares historical analyses of the changes in curriculum, structure, and functions of American education in relation to the changing social and political contexts.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 2902",
            "course_name": "Intellectual Roots of American Education",
            "description": "HSED-GE 2902 Intellectual Roots of American Education \nThis course explores the intellectual roots of American education in the work of the American pragmatists (primarily John Dewey, William James, and C. S. Pierce) and Transcendentalists (Emerson, Whitman, and Thoreau).",
            "offering": false
        },
        {
            "course_id": "HSED-GE 3006",
            "course_name": "Doct Sem:Hist of Ed I",
            "description": "HSED-GE 3006 Doct Sem:Hist of Ed I \nAn intensive study of the available sources pertaining to a specific problem, institution, individual, or movement in the history of education. For doctoral and other advanced candidates.",
            "offering": false
        },
        {
            "course_id": "HSED-GE 3007",
            "course_name": "Doct Sem:Hist of Ed II",
            "description": "HSED-GE 3007 Doct Sem:Hist of Ed II \nAn intensive study of the available sources pertaining to a specific problem, institution, individual, or movement in the history of education. For doctoral and other advanced candidates.",
            "offering": false
        }
    ]
}