{
    "major_id": "HIST-SHU",
    "file": "./2015-2016/History_(HIST-SHU).html",
    "courses": [
        {
            "course_id": "HIST-SHU 120",
            "course_name": "",
            "description": "HIST-SHU  120\n\n   The Mongol Conquest in World History\n\nThe Mongol conquest was a major turning point in world history. Not only did it remake the map of much of Eurasia and the Middle East, but it transformed the economic foundations of pre-existing societies, their political systems and cultural traditions. At the same time, the world (as it was then known) became more interconnected, and commercial networks were developed.  Beginning with an examination of the reasons behind the rise of the Mongols, and proceeding to an analysis of their conquest, the course will focus on several thematic issues, such as the Mongol political culture, their milit...\n\n      more description for HIST-SHU  120 »\n\n      \n\n\n\nThe Mongol conquest was a major turning point in world history. Not only did it remake the map of much of Eurasia and the Middle East, but it transformed the economic foundations of pre-existing societies, their political systems and cultural traditions. At the same time, the world (as it was then known) became more interconnected, and commercial networks were developed.  Beginning with an examination of the reasons behind the rise of the Mongols, and proceeding to an analysis of their conquest, the course will focus on several thematic issues, such as the Mongol political culture, their military system, their territorial expansion, and their government and administration in all the constitutive parts of their empire (China, Central, Asia, Iran, and Russia). Moreover, special attention will be paid to relations between the Mongols and Europe, and to the development of commercial routes.  Original sources in translation, in particular diplomatic documents, chronicles and reports will be included in the readings. The course will be complemented by visual materials to illustrate how the Mongols have been represented in movies and popular culture.\nCOURSE REQUIREMENTS\nStudents will be asked to prepare a class presentation on a theme of their choice. The Mid-Term and Final exams will consist of a choice of short essays based on the class materials and readings. The final grade will consist of: Class presentation (20%);  Mid-Term exam (30%); Final Exam (50%).\n\n      less description for HIST-SHU  120 «",
            "offering": false
        },
        {
            "course_id": "HIST-SHU 125",
            "course_name": "",
            "description": "HIST-SHU  125\n\n   China's Last Empire:Understanding Qing History, 1636-1911\n\nThe Qing empire was the second major empire of China ruled by foreigners (first by the Mongols, second by the Manchus). Thinking of the Qing state not merely as a Chinese dynasty but as an empire provides us with an approach to examine a wider range of connections and imaginations. We will ask how the Manchu institutions and the role of frontiers gave the last empire its particular shape and identity. We will study the Qing empire in its relation to the world, the students will gain a sense of how Qing China and global processes have interacted and shaped each other. The course proceeds and de...\n\n      more description for HIST-SHU  125 »\n\n      \n\n\n\nThe Qing empire was the second major empire of China ruled by foreigners (first by the Mongols, second by the Manchus). Thinking of the Qing state not merely as a Chinese dynasty but as an empire provides us with an approach to examine a wider range of connections and imaginations. We will ask how the Manchu institutions and the role of frontiers gave the last empire its particular shape and identity. We will study the Qing empire in its relation to the world, the students will gain a sense of how Qing China and global processes have interacted and shaped each other. The course proceeds and develops as a mix of thematically and chronologically organized topics. The topics that we will explore include the Manchu conquest and the formation of the Manchu state, the Manchu way of life and \"sinicization,\" prosperity in the High Qing and its problems, opium wars and treaty ports, disorder and dissent in the late Qing, the fall of the Qing empire and the 1911 revolution, the legacies of the Qing empire. In surveying this history from the formation of the Manchu empire to the creation of the Chinese republic in 1912, this course aims to provide an understanding of the changes, contingencies, and continuities in the making of modern China. The material we cover will range beyond that of scholarly works, to include Chinese and Manchu primary materials in English translation, visual materials, and film screenings--all of which will constitute sources of information as well as topics for analysis. (satisfies Core Curriculum: Social Science Perspectives on China)\n\n      less description for HIST-SHU  125 «",
            "offering": false
        },
        {
            "course_id": "HIST-SHU 126",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20116",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "World History: Part I",
            "description": "HIST-SHU  126 World History: Part I",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 153",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20716",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Jiang, Jin",
                    "time": "Wed 5.30 PM - 8.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HIST-SHU  153\n\n   History of Modern China Since 1840\n\nThis course covers the history of China focusing on the past two centuries and especially the 20thcentury, when China underwent several major revolutions.  We will follow chronologically the development of China starting with the foundation and consolidation of its last major dynasty, the Qing in 1644, moving through the collapse of the dynastic system and the rise of the first Republic of China in 1912, continuing through the Nationalist Revolution of 1927, and ending with discussions of the formation and development of the People’s Republic of China since 1949.  Large themes that run through...\n\n      more description for HIST-SHU  153 »\n\n      \n\n\n\nThis course covers the history of China focusing on the past two centuries and especially the 20thcentury, when China underwent several major revolutions.  We will follow chronologically the development of China starting with the foundation and consolidation of its last major dynasty, the Qing in 1644, moving through the collapse of the dynastic system and the rise of the first Republic of China in 1912, continuing through the Nationalist Revolution of 1927, and ending with discussions of the formation and development of the People’s Republic of China since 1949.  Large themes that run through the course include the impact of Western colonialism on China, the role of internal rebellions and wars in giving rise to new political and social formations, the impact of Japanese aggression on China’s state and society, the Nationalist and Communist Revolutions, and the endurance of the centralized Chinese state.  Two excursions to historic sites in Shanghai will reinforce students’ knowledge and understanding of the subject matter while also highlighting the important role of Shanghai in modern Chinese history.\n\n      less description for HIST-SHU  153 «",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 201",
            "course_name": "The Theory and Practice of History",
            "description": "HIST-SHU  201 The Theory and Practice of History \nWhat is history? This course offers an introduction to theories and practices of history drawn from different parts of the world. It considers the utility of such different historical sources as written documents, excavated artifacts, oral histories, and visual culture and how to balance contradictory accounts of the same event. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "HIST-SHU 203",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20117",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Maritime History",
            "description": "HIST-SHU  203 Maritime History",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 225",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19363",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HIST-SHU  225\n\n   The Global Space Age\n\nOver the course of the twentieth century the infinite void that surrounds planet Earth has stimulated the human imagination as never before. For several decades, anticipation of human spaceflight was intimately bound with futuristic visions of technoscientific progress, while space exploration became key to societal self-images. This course charts the rise and fall of the Age of Space from a global perspective. Individual sessions will be devoted to the ‘rocket fad’ of the Weimar Republic, Nazi ‘wonder weapons’, the so-called Sputnik shock and the American moon landings, as well as providing a...\n\n      more description for HIST-SHU  225 »\n\n      \n\n\n\nOver the course of the twentieth century the infinite void that surrounds planet Earth has stimulated the human imagination as never before. For several decades, anticipation of human spaceflight was intimately bound with futuristic visions of technoscientific progress, while space exploration became key to societal self-images. This course charts the rise and fall of the Age of Space from a global perspective. Individual sessions will be devoted to the ‘rocket fad’ of the Weimar Republic, Nazi ‘wonder weapons’, the so-called Sputnik shock and the American moon landings, as well as providing an introduction to the historical origins of techno-nationalism, from the Cold War to today’s Space Race in Asia.\n\n      less description for HIST-SHU  225 «",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 232",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19364",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HIST-SHU  232\n\n   Moments of Europe\n\nThis course will provide a broad introduction to the history of Europe since the French Revolution. Organized around eight exemplary ‘moments of Europe’ spanning two centuries, it will familiarize students with some of the principal themes and methods involved in the writing of Modern European History. Structured chronologically, individual sessions will be devoted to the revolutions of the early nineteenth century, processes of nationbuilding, fin-de-siècle culture, the causes, experiences and effects of the First and Second World Wars, the transeuropean protest movements of the 1960s and 197...\n\n      more description for HIST-SHU  232 »\n\n      \n\n\n\nThis course will provide a broad introduction to the history of Europe since the French Revolution. Organized around eight exemplary ‘moments of Europe’ spanning two centuries, it will familiarize students with some of the principal themes and methods involved in the writing of Modern European History. Structured chronologically, individual sessions will be devoted to the revolutions of the early nineteenth century, processes of nationbuilding, fin-de-siècle culture, the causes, experiences and effects of the First and Second World Wars, the transeuropean protest movements of the 1960s and 1970s, in addition to the crucial question of whether a distinctive European identity has developed over time. Materials used include political treatises, fiction, images and film.\n\n      less description for HIST-SHU  232 «",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 240",
            "course_name": "",
            "description": "HIST-SHU  240\n\n   The Soviet Empire, 1917-1991\n\nThis course explores the history of the Soviet Union from its birth as a utopian experiment in October 1917 to its final collapse in December 1991. Through the extensive use of original documents, literary and artistic works, and artifacts of popular culture, the course examines the major political, cultural, and social events that contributed to the rise and fall of the Soviet Empire. While emphasis will be given to the fundamental issue of the nature and evolution of Soviet political culture, the course will also explore essential social, scientific, and artistic transformations that helped ...\n\n      more description for HIST-SHU  240 »\n\n      \n\n\n\nThis course explores the history of the Soviet Union from its birth as a utopian experiment in October 1917 to its final collapse in December 1991. Through the extensive use of original documents, literary and artistic works, and artifacts of popular culture, the course examines the major political, cultural, and social events that contributed to the rise and fall of the Soviet Empire. While emphasis will be given to the fundamental issue of the nature and evolution of Soviet political culture, the course will also explore essential social, scientific, and artistic transformations that helped to shape the domestic Soviet experience and its international repercussions.\n\n      less description for HIST-SHU  240 «",
            "offering": false
        },
        {
            "course_id": "HIST-SHU 302",
            "course_name": "",
            "description": "HIST-SHU  302\n\n   History of Water\n\nWhile global citizens have long been concerned about conserving and rationing our use of fossil fuels, the same cannot be said for an even more precious resource – water.  Only in the last few years have government agencies, NGOs, and the market begun to tackle the problem of dwindling water resources.  The current statistics and projections are dire.  If we do not come up with new technologies to conserve water and use it more efficiently, more people will be without clean water or enough food.  The United Nations estimates that by 2030 as many as 4 billion people will not have access to enou...\n\n      more description for HIST-SHU  302 »\n\n      \n\n\n\nWhile global citizens have long been concerned about conserving and rationing our use of fossil fuels, the same cannot be said for an even more precious resource – water.  Only in the last few years have government agencies, NGOs, and the market begun to tackle the problem of dwindling water resources.  The current statistics and projections are dire.  If we do not come up with new technologies to conserve water and use it more efficiently, more people will be without clean water or enough food.  The United Nations estimates that by 2030 as many as 4 billion people will not have access to enough water for their basic needs. \n \nDuring the course of this semester we will read about both contemporary issues that affect us as well as look at the historical context in which these problems developed.  We will use case studies as a method for discussing these issues.  Case Studies will include: the United States, in particular the American West and New York City; Early Modern Venice and Egypt, and modern day African and China.   Reading loads will be moderate to heavy, but engaging.  You can plan on reading about 100 pages a week divided between the two classes. A portion of your grade will be based on class discussion. Each student will be asked to also write 4 shorter (2-3) papers based on the readings throughout the term. Each student will also write a small research/topics paper (10-12 pages) on the topic of their choice. You will be asked to look at a current problem with water scarcity or contamination and find its historical precedents.\n\n      less description for HIST-SHU  302 «",
            "offering": false
        },
        {
            "course_id": "HIST-SHU 303",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19366",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HIST-SHU  303\n\n   Histories and Politics of Noise\n\nIn this seminar, students will consider the idea that “noise” has a history, and that its history dates long before the industrial revolution’s ratcheting up of noise levels due to heavy machinery and the reproduction and amplification of sound through electronic technologies.  Some noises pierce our ears and disrupt both our hearing and our thinking. In contrast, background noises may be loud, persistent, and even harmful to our ears, but they suffuse our everyday lives so fully that we can ignore them. Despite our daily subjective encounters with noise, can noise have a political meaning as ...\n\n      more description for HIST-SHU  303 »\n\n      \n\n\n\nIn this seminar, students will consider the idea that “noise” has a history, and that its history dates long before the industrial revolution’s ratcheting up of noise levels due to heavy machinery and the reproduction and amplification of sound through electronic technologies.  Some noises pierce our ears and disrupt both our hearing and our thinking. In contrast, background noises may be loud, persistent, and even harmful to our ears, but they suffuse our everyday lives so fully that we can ignore them. Despite our daily subjective encounters with noise, can noise have a political meaning as well, one that transcends our individual experiences with din and discord, cacophony and clamor? This course explores noise’s relationship to history and politics. By spending the semester reading, talking, and writing about noise, we will seek to comprehend it rather than contain it.\n\n      less description for HIST-SHU  303 «",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 312",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19356",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Chen, Jian",
                    "time": "Mon,Thu 1.15 PM - 2.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HIST-SHU  312\n\n   China Encounters the World\n\nThis is a lecture course on China’s encounters with the world in the late 19th and 20th centuries. The course analyzes the age-old Chinese “Central Kingdom” self-image and how the image was overturned during modern times in face of Western and Japanese challenges; it explores the Chinese “victim mentality” and its impact on China’s modern international experience; it examines China’s foreign policy issues in the context of its political, economic, social and cultural developments in broader terms; it also pays special attention to the role of “human agencies” in the shaping of historical proce...\n\n      more description for HIST-SHU  312 »\n\n      \n\n\n\nThis is a lecture course on China’s encounters with the world in the late 19th and 20th centuries. The course analyzes the age-old Chinese “Central Kingdom” self-image and how the image was overturned during modern times in face of Western and Japanese challenges; it explores the Chinese “victim mentality” and its impact on China’s modern international experience; it examines China’s foreign policy issues in the context of its political, economic, social and cultural developments in broader terms; it also pays special attention to the role of “human agencies” in the shaping of historical processes.\n\n      less description for HIST-SHU  312 «",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 325",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19357",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Chen, Jian",
                    "time": "Wed 3.00 PM - 5.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HIST-SHU  325\n\n   The New Cold War History\n\nThis is a reading and research seminar with an emphasis on the “new “Cold War history—a scholarly phenomenon emerging in the 1990s, along with the end of the global Cold War and the new opportunities to conduct multiarchival and mutli-source research for scholars of international history. Students in this class will be exposed to various new interpretations, new methods of research, and new ways of thinking associated with the new Cold War history studies. Readings in this class will be focused on the scholarship that has appeared since the early and mid-1990s. Students are required to write s...\n\n      more description for HIST-SHU  325 »\n\n      \n\n\n\nThis is a reading and research seminar with an emphasis on the “new “Cold War history—a scholarly phenomenon emerging in the 1990s, along with the end of the global Cold War and the new opportunities to conduct multiarchival and mutli-source research for scholars of international history. Students in this class will be exposed to various new interpretations, new methods of research, and new ways of thinking associated with the new Cold War history studies. Readings in this class will be focused on the scholarship that has appeared since the early and mid-1990s. Students are required to write several books reviews and a comprehensive review essay, as well as to present and critique the comprehensive review essay in class.  The ultimate purpose of the course is to help students take the Cold War as a useful reference to pursue a better understanding of the challenges facing the human race in the 21st century.\n\n      less description for HIST-SHU  325 «",
            "offering": true
        },
        {
            "course_id": "HIST-SHU 341",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19365",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HIST-SHU  341\n\n   European Religion from the Reformation to the Enlightenment\n\nEuropean Christendom exploded in the sixteenth century, creating a fragmented and fractious religious landscape that still marks Europe (and Christianity worldwide) to this day.  In this undergraduate lecture course, students will examine the significant changes European Christendom experienced between the Protestant and Catholic Reformations through the Enlightenment, and will explore the impact of new religious dogmas, beliefs, practices, and institutions upon the broader order of European politics, society, and culture.  The readings, which consist of both primary and secondary sources, wil...\n\n      more description for HIST-SHU  341 »\n\n      \n\n\n\nEuropean Christendom exploded in the sixteenth century, creating a fragmented and fractious religious landscape that still marks Europe (and Christianity worldwide) to this day.  In this undergraduate lecture course, students will examine the significant changes European Christendom experienced between the Protestant and Catholic Reformations through the Enlightenment, and will explore the impact of new religious dogmas, beliefs, practices, and institutions upon the broader order of European politics, society, and culture.  The readings, which consist of both primary and secondary sources, will demonstrate that the religious changes in this period shaped not only the thinking of theologians and clergymen, but also affected the everyday lives of people throughout Europe.  Furthermore, the course will examine how various denominations of European Christianity participated in Europe’s commercial, colonial, and imperial projects in the Americas, Africa, and Asia.  Students will thus also consider the interactions, both within and beyond Europe, between European Christianity and other world religions.\n\n      less description for HIST-SHU  341 «",
            "offering": true
        }
    ]
}