{
    "major_id": "JOUR-AD",
    "file": "./2015-2016/Journalism_(JOUR-AD).html",
    "courses": [
        {
            "course_id": "JOUR-AD 110",
            "course_name": "Foundations of Journalism",
            "description": "JOUR-AD  110 Foundations of Journalism \nStudents explore the significance of news, the role of the journalist from Thucydides to the present, and the realities journalists now face in a rapidly changing media environment.",
            "offering": false
        },
        {
            "course_id": "JOUR-AD 114",
            "course_name": "J",
            "description": "JOUR-AD  114J\n\n   Food in the Global Kitchen\n\nAbu Dhabi contains many worlds, from five-star hotel restaurants to South Asian migrant workers eating on the job. This course uses food to explore the daily life of a global city in the Middle East. The course combines intensive reading and writing assignments with reporting and field trips. With Abu Dhabi as their beat, students explore the role of markets; traditional bedouin cuisine and\nthe rituals of eating it; the hidden lives of food producers and growers; the cuisine of exile; the business of food; edible geography; and other topics drawing on anthropology, economics, culture, politics...\n\n      more description for JOUR-AD  114J »\n\n      \n\n\n\nAbu Dhabi contains many worlds, from five-star hotel restaurants to South Asian migrant workers eating on the job. This course uses food to explore the daily life of a global city in the Middle East. The course combines intensive reading and writing assignments with reporting and field trips. With Abu Dhabi as their beat, students explore the role of markets; traditional bedouin cuisine and\nthe rituals of eating it; the hidden lives of food producers and growers; the cuisine of exile; the business of food; edible geography; and other topics drawing on anthropology, economics, culture, politics, and urban studies. Students participate in hands-on experiences like visits to local markets and restaurants. Each student are expected to find, report, and write a feature\narticle about a food-related location in Abu Dhabi. Readings range from medieval Arabic culinary manuals and classics of cultural anthropology\nto contemporary food reporting and literature, with an emphasis on the Middle East.\n\n      less description for JOUR-AD  114J «",
            "offering": false
        },
        {
            "course_id": "JOUR-AD 210",
            "course_name": "Journalistic Inquiry",
            "description": "JOUR-AD  210 Journalistic Inquiry \nThis first-level reporting, research, and writing course emphasizes in-depth research and interviewing technique as it introduces a variety of journalistic forms, including the reported essay, the newspaper pyramid style, magazine and newspaper feature style, broadcast news-writing style, and writing for the Web. This course provides a strong foundation in basic journalistic forms, issues, and responsibilities.",
            "offering": false
        },
        {
            "course_id": "JOUR-AD 211",
            "course_name": "Topics in Reporting",
            "description": "JOUR-AD  211 Topics in Reporting \nThis course covers a variety of reporting topics handled in feature style (arts and letters; travel reporting, etc.).",
            "offering": false
        },
        {
            "course_id": "JOUR-AD 212",
            "course_name": "Journalism and Society",
            "description": "JOUR-AD  212 Journalism and Society \nThis course examines the role of journalists and journalism itself as they function in the wider culture.",
            "offering": false
        },
        {
            "course_id": "JOUR-AD 213",
            "course_name": "Media Criticism",
            "description": "JOUR-AD  213 Media Criticism \nThis course analyzes the forces—cultural, social, economic, ideological, and aesthetic—that shape the media and their messages.",
            "offering": false
        }
    ]
}