{
    "major_id": "LAW-AD",
    "file": "./2015-2016/Law_(LAW-AD).html",
    "courses": [
        {
            "course_id": "LAW-AD 114",
            "course_name": "J",
            "description": "LAW-AD  114J\n\n   Punishment in Politics, Law and Society\n\nThis seminar investigates the state’s power to punish. We read foundational works from philosophy, sociology, political science, and law to explore why states punish, how they punish, and whom they punish. We focus on the modern American approach to punishment, including its use of mass incarceration and the death penalty. We analyze U.S. Supreme Court cases in light of the fundamental purposes of punishment, and compare penal practices around the world. Though subject to change, activities outside the classroom may include attending arraignment court, observing a sentencing hearing, and visit...\n\n      more description for LAW-AD  114J »\n\n      \n\n\n\nThis seminar investigates the state’s power to punish. We read foundational works from philosophy, sociology, political science, and law to explore why states punish, how they punish, and whom they punish. We focus on the modern American approach to punishment, including its use of mass incarceration and the death penalty. We analyze U.S. Supreme Court cases in light of the fundamental purposes of punishment, and compare penal practices around the world. Though subject to change, activities outside the classroom may include attending arraignment court, observing a sentencing hearing, and visiting a correctional facility.\n\n      less description for LAW-AD  114J «",
            "offering": false
        },
        {
            "course_id": "LAW-AD 210",
            "course_name": "Civil Rights",
            "description": "LAW-AD  210 Civil Rights \nInterpretation of the Bill of Rights, the Civil War amendments, and other rights in the U.S. Constitution through the reading of Supreme Court opinions. Topics include freedom of speech and press; free exercise of religion and separation of church and state; the right of privacy; rights of the criminally accused; equal protection of the law against race, gender, and other discrimination; and the rights of franchise and citizenship. Cases are read and discussed closely for their legal and philosophical content.",
            "offering": false
        },
        {
            "course_id": "LAW-AD 211",
            "course_name": "Gender in Law",
            "description": "LAW-AD  211 Gender in Law \nExamines the relationship between gender politics, legal theory, and social policy. Studies the role that the legal arena and certain historical conditions have\nplayed in creating, revising, and protecting particular gender identities and not others and examines the political effects of those legal constructions.",
            "offering": false
        },
        {
            "course_id": "LAW-AD 212",
            "course_name": "J",
            "description": "LAW-AD  212J\n\n   International Law\n\n“Inter-national” law, which the English philosopher Jeremy Bentham defined as the rules governing sovereign nations, is today more like a curriculum than a single course.  Its subject matter is no longer limited to the “foreign relations” of nations.  International law continues to deal with how states deal with one another.  It includes, as it has for centuries, rules on when it is legal for states to go to war against each other as well as how war is conducted, for example.  But international law today includes some rules about how a government is expected to behave toward its own citizens a...\n\n      more description for LAW-AD  212J »\n\n      \n\n\n\n“Inter-national” law, which the English philosopher Jeremy Bentham defined as the rules governing sovereign nations, is today more like a curriculum than a single course.  Its subject matter is no longer limited to the “foreign relations” of nations.  International law continues to deal with how states deal with one another.  It includes, as it has for centuries, rules on when it is legal for states to go to war against each other as well as how war is conducted, for example.  But international law today includes some rules about how a government is expected to behave toward its own citizens as well as towards foreign investors who establish businesses within its territory.  It also includes rules that govern non-state actors, such as international organizations like the United Nations, and others that are used by non-governmental organizations (NGOs) that are devoted to particular causes, such as Amnesty International.  Contemporary international law is found not only in the rules that states make with respect to one another (as under treaties).  It is also found in some pronouncements made or some actions taken by international organizations and international courts, like the International Court of Justice or the International Criminal Court (both located in The Hague, the Netherlands).\n\n      less description for LAW-AD  212J «",
            "offering": false
        },
        {
            "course_id": "LAW-AD 213",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13035",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "SOC_SCI 004"
                }
            ],
            "course_name": "",
            "description": "LAW-AD  213\n\n   Climate Change Law and Policy\n\nClimate change will be a foremost theme that will influence financial activities, and policy and legal framework for years to come. In a noticeably short time span, climate change has become a global challenge calling for collective action. Climate change law is emerging as a new legal discipline. Students in this course will explore how climate change law relates to other areas of law and how climate change has elicited rulemaking process at the international, regional, national and local levels. The course will encourage students to identify the climate change policy issues in state and inte...\n\n      more description for LAW-AD  213 »\n\n      \n\n\n\nClimate change will be a foremost theme that will influence financial activities, and policy and legal framework for years to come. In a noticeably short time span, climate change has become a global challenge calling for collective action. Climate change law is emerging as a new legal discipline. Students in this course will explore how climate change law relates to other areas of law and how climate change has elicited rulemaking process at the international, regional, national and local levels. The course will encourage students to identify the climate change policy issues in state and international laws. Students will also study how international law and international relations influence current national laws and policies. The class will be invited to study the negotiation process, implementation and current status of the United Nations Framework Convention on Climate Change (UNFCCC), the Kyoto Protocol, the Copenhagen Accord, the Cancun and Durban Agreements. The class will then proceed to evaluate the various legal tools that are available at national and international level to address climate change, including cap-and-trade, carbon taxation, command-and-control regulation, litigation, securities disclosures, and voluntary actions. The class will also examine energy and climate change nexus and the roles of energy efficiency, renewable energy sources and carbon capture and sequestration. The course will pay special attention to the role of developing countries in the emerging international climate change regime and negotiation strategies of G77+China in Copenhagen, Cancun, Durban, Doha, Warsaw, and upcoming UNFCCC conference in Peru in December 2014.\n\n      less description for LAW-AD  213 «",
            "offering": true
        },
        {
            "course_id": "LAW-AD 214",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13036",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "SOC_SCI 004"
                }
            ],
            "course_name": "",
            "description": "LAW-AD  214\n\n   Comparative Legal Systems: United States and United Arab Emirates\n\nThe growing trend of globalization in nearly every field of human endeavor, demands legal experts to get awareness of legal traditions and systems operating beyond their borders. This course will invite students to explore the legal systems of other than their own native legal system. Primarily this course will focus on essential characteristics of the three major legal systems: Civil, Common, and Islamic and Sharia. The class will also examine the diverse legal systems, inspired by various political, social, and religious doctrines, successfully used by billions of people in various parts of ...\n\n      more description for LAW-AD  214 »\n\n      \n\n\n\nThe growing trend of globalization in nearly every field of human endeavor, demands legal experts to get awareness of legal traditions and systems operating beyond their borders. This course will invite students to explore the legal systems of other than their own native legal system. Primarily this course will focus on essential characteristics of the three major legal systems: Civil, Common, and Islamic and Sharia. The class will also examine the diverse legal systems, inspired by various political, social, and religious doctrines, successfully used by billions of people in various parts of the world. This course will pay special attention to law traditions explicitly functioning in United States of America, and United Arab Emirates. This class will offer a historical and cultural background related to the development of legal structures and substantive rules in both territories. Students will study existing judicial systems, and essential rules dealing with legal education and practice in U.S. and Emirates.\n\n      less description for LAW-AD  214 «",
            "offering": true
        },
        {
            "course_id": "LAW-AD 215",
            "course_name": "",
            "description": "LAW-AD  215\n\n   Reading Law\n\nTaught by means of the Socratic case method, the course aims to provide an expansive introduction to the history, concepts, methodology and practice of law in international perspective, with an emphasis on common law and specifically U.S. legal practice. The changing nature and media of contemporary globalized lawyering, and web-based access to what were traditionally arcane written sources of law, also renders a multi-media approach to the syllabus desirable. Reported cases will be mixed with film, television, and web-based depictions of legal norms. The course will examine the history, philo...\n\n      more description for LAW-AD  215 »\n\n      \n\n\n\nTaught by means of the Socratic case method, the course aims to provide an expansive introduction to the history, concepts, methodology and practice of law in international perspective, with an emphasis on common law and specifically U.S. legal practice. The changing nature and media of contemporary globalized lawyering, and web-based access to what were traditionally arcane written sources of law, also renders a multi-media approach to the syllabus desirable. Reported cases will be mixed with film, television, and web-based depictions of legal norms. The course will examine the history, philosophy, method and disciplines of civil and common law. The course will provide students with a critical understanding of legal concepts, an introduction to the divisions of legal doctrine and an understanding of the most pressing issues facing the profession and governments today.\n\n      less description for LAW-AD  215 «",
            "offering": false
        }
    ]
}