{
    "major_id": "LIBAR-UE",
    "file": "./2015-2016/Liberal_Arts_Core_(LIBAR-UE).html",
    "courses": [
        {
            "course_id": "LIBAR-UE 101",
            "course_name": "Basis Statistics I",
            "description": "LIBAR-UE  101 Basis Statistics I \nReview of the essential mathematics for statistics. Collection & tabulation of data; the properties of frequency distributions; histograms & frequency polygons; measures of central tendency, dispersion & correlation; tests of hypothesis using the normal curve, the T distribution, the F distribution, & the chi-square distribution.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 171",
            "course_name": "Theatre as Art Form",
            "description": "LIBAR-UE  171 Theatre as Art Form \nThis course introduces non-majors to theatre as a live and performing art through a variety of experiences including attendance at live performances, readings of play scripts, and theoretical texts, and the creation of original plays. Through lectures, discussions, and written assignments, students will explore the roles of the playwright, actor, director, and designer in the production process, as well as examines the role of the audience in the live performance.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 331",
            "course_name": "Introduction to Human Physiology",
            "description": "LIBAR-UE  331 Introduction to Human Physiology \nIntroduction to Human Physiology is a one-semester course for students with an interest in health care. Little exposure to biology is assumed for this course.  This course is heavily concerned with the basic concepts of structural and functional organization of the human body, the terminology involved in the areas of physiology and anatomy, and the understanding of the different anatomo-physiological systems.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 341",
            "course_name": "Science of Language",
            "description": "LIBAR-UE  341 Science of Language \nThis course provides and overview of the scientific study of the human language faculty, focusing on the cognitive & neural processing mechanisms that underlie linguistic knowledge & use. We describe contemporary approaches to delineating levels of language structure & review various scientific methodologies used to study language. Topics include language knowledge & use as well as language change & variation.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 501",
            "course_name": "Learning and The Meaning or Life",
            "description": "LIBAR-UE  501 Learning and The Meaning or Life \nWhat is the most important thing to which I should be devoting my life? This course explores the existential concerns animating questions like this, ones that inspire our lifelong, liberal learning. It focuses on classic works in Western philosophy, literature, and film and examines them as texts of education. Class meetings will be devoted to a mix of lecture and discussion.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 551",
            "course_name": "Culture Wars in America",
            "description": "LIBAR-UE  551 Culture Wars in America \nThis course will examine the origins, development, and meanings of so-called cultural conflict in the United States. Topics will include abortion, gay rights, bilingualism, and the teaching of evolution in public schools.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 552",
            "course_name": "",
            "description": "LIBAR-UE  552\n\n   Educ and American Dream Historical Perspectives\n\nThe course will examine historical perspectives on the relationship between public schooling and the promotion of democratic ideals. Students will explore some of the central goals and purposes of American public education over the past two centuries, and the historiographical debates about those goals and purposes. In the second half of the course, students will the relationship between schooling and civic education, and between schooling and specific communities, in order to ask whether the goals of schooling might promote or contradict the goals of particular groups who seek to benefit from...\n\n      more description for LIBAR-UE  552 »\n\n      \n\n\n\nThe course will examine historical perspectives on the relationship between public schooling and the promotion of democratic ideals. Students will explore some of the central goals and purposes of American public education over the past two centuries, and the historiographical debates about those goals and purposes. In the second half of the course, students will the relationship between schooling and civic education, and between schooling and specific communities, in order to ask whether the goals of schooling might promote or contradict the goals of particular groups who seek to benefit from public education, and ways in which education does not promote democratic ideals.\n\n      less description for LIBAR-UE  552 «",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 591",
            "course_name": "Introduction to Media Studies",
            "description": "LIBAR-UE  591 Introduction to Media Studies \nIntroduces students to the study of contemporary forms of mediated forms of communication. The course surveys the main topics in the field and introduces students to a variety of analytical perspectives. Issues include: the economics of media production; the impact of media on individual attitutdes, values and behaviors; the role of media professionals; the impact of new media technologies.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 593",
            "course_name": "Introduction to Human Communication & Culture",
            "description": "LIBAR-UE  593 Introduction to Human Communication & Culture \nThis course surveys major research perspectives & theories on culture & human communication. The course will introduce major approaches to the study of social interaction, language, semiotics and cultural processes.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 631",
            "course_name": "Survey Developmental Psychology: Introduction",
            "description": "LIBAR-UE  631 Survey Developmental Psychology: Introduction \nConsideration of the nature of psychological development from conception throughout life span.  Theories of development are related to research findings, and implications are drawn for application to practical issues.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 632",
            "course_name": "Intro to Personality Theories",
            "description": "LIBAR-UE  632 Intro to Personality Theories \nConsideration of the major theories of personality.  The work of various theorists is discussed as it relates to personality development through the life span.",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 941",
            "course_name": "",
            "description": "LIBAR-UE  941\n\n   Art:Practice and Ideas\n\n'Art: Practice and Ideas' examines key developments in the visual arts from modernity to the present. Focusing on the ways in which representations both create and reflect the values of a society, the course introduces students to the full range of expressive possibilities within the visual arts, covering painting and sculpture, as well as photography, film, video, conceptual art, and computer media. Topics to be covered include classical, modern, and postmodern relationships to politics, vision, the mind, the body, psychology, gender, difference, and technological innovation. Students will se...\n\n      more description for LIBAR-UE  941 »\n\n      \n\n\n\n'Art: Practice and Ideas' examines key developments in the visual arts from modernity to the present. Focusing on the ways in which representations both create and reflect the values of a society, the course introduces students to the full range of expressive possibilities within the visual arts, covering painting and sculpture, as well as photography, film, video, conceptual art, and computer media. Topics to be covered include classical, modern, and postmodern relationships to politics, vision, the mind, the body, psychology, gender, difference, and technological innovation. Students will see and understand how artists have integrated perceptions of their historical moment, as well as physical and social space, into creative practices that have, in turn, had a significant impact on the culture of the time.\n\n      less description for LIBAR-UE  941 «",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 942",
            "course_name": "",
            "description": "LIBAR-UE  942\n\n   Art of Now\n\nThis course examines the current developments in contemporary art over the past decade – the art of ‘now’ – from the viewpoint of an artist’s practice & working ideas, looking at current global art production in aesthetic, economic, & social contexts. The major movements in painting, photography, sculpture, installation & performance are examined. Readings will be drawn from first hand interviews & point-of-view accounts, reviews, & critique; a major emphasis on interviews & online studio visits will accompany the texts.  Guest artist lectures & off-site museum & gallery viewings will compleme...\n\n      more description for LIBAR-UE  942 »\n\n      \n\n\n\nThis course examines the current developments in contemporary art over the past decade – the art of ‘now’ – from the viewpoint of an artist’s practice & working ideas, looking at current global art production in aesthetic, economic, & social contexts. The major movements in painting, photography, sculpture, installation & performance are examined. Readings will be drawn from first hand interviews & point-of-view accounts, reviews, & critique; a major emphasis on interviews & online studio visits will accompany the texts.  Guest artist lectures & off-site museum & gallery viewings will complement the weekly visual presentations & theory conversations.\n\n      less description for LIBAR-UE  942 «",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 943",
            "course_name": "",
            "description": "LIBAR-UE  943\n\n   The Internet and Contemporary Art\n\nThe Post-Internet mentality - where the Internet is a way of creating & thinking, more than a device - is the basis for this class on contemporary digital art, 1970 to the present.  This course looks at current Internet art; video, digital, virtual & mixed technology, & collaborative online art practices.  Students will learn how artists are integrating digital technology in the production, display, & public encounter of their artwork. Lectures using images of art & assigned readings will focus on online & digital realities, the internet as an art medium, contemporary time prosumers, digerati,...\n\n      more description for LIBAR-UE  943 »\n\n      \n\n\n\nThe Post-Internet mentality - where the Internet is a way of creating & thinking, more than a device - is the basis for this class on contemporary digital art, 1970 to the present.  This course looks at current Internet art; video, digital, virtual & mixed technology, & collaborative online art practices.  Students will learn how artists are integrating digital technology in the production, display, & public encounter of their artwork. Lectures using images of art & assigned readings will focus on online & digital realities, the internet as an art medium, contemporary time prosumers, digerati, online social networks, screen mentalities, spectatorship, & new visual formations. Visiting artists & critics will engage virtually & in person so students will be in direct contact with those creating the current landscape of internet art.\n\n      less description for LIBAR-UE  943 «",
            "offering": false
        },
        {
            "course_id": "LIBAR-UE 1532",
            "course_name": "",
            "description": "LIBAR-UE 1532\n\n   Terrorism, Extremism, & Education\n\nWhat is the relationship between extremism & education? This course examines instances & theories of national, ideological, ethnic, religious, & political extremism & their relationship to education. Course participants will analyze how state authorities, rebel movements, extremist associations, & ethnic & religious organizations mobilize youth populations, shape public narratives, & use, manipulate, or abuse ideologies that lay claim to collective identities during the development & transformation of extremist movements. The course pays particular attention to the ways that educational system...\n\n      more description for LIBAR-UE 1532 »\n\n      \n\n\n\nWhat is the relationship between extremism & education? This course examines instances & theories of national, ideological, ethnic, religious, & political extremism & their relationship to education. Course participants will analyze how state authorities, rebel movements, extremist associations, & ethnic & religious organizations mobilize youth populations, shape public narratives, & use, manipulate, or abuse ideologies that lay claim to collective identities during the development & transformation of extremist movements. The course pays particular attention to the ways that educational systems have worked to foment & prevent extremism in comparative & cross-national contexts.\n\n      less description for LIBAR-UE 1532 «",
            "offering": false
        }
    ]
}