{
    "major_id": "LITCW-AD",
    "file": "./2015-2016/Literature_&_Creative_Writing_(LITCW-AD).html",
    "courses": [
        {
            "course_id": "LITCW-AD 100",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12797",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 003",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Williams, Deborah"
                }
            ],
            "course_name": "Literary Interpretation",
            "description": "LITCW-AD  100 Literary Interpretation \nThis course introduces students to the demands and pleasures of university-level investigation of literature. Students develop the tools necessary for advanced criticism, including close-reading skills, knowledge of generic conventions, mastery of critical terminology, and introduction to a variety of modes of analysis, from the formal to the historical. The course emphasizes the writing and revision strategies necessary to produce sophisticated literary analysis.",
            "offering": true
        },
        {
            "course_id": "LITCW-AD 101",
            "course_name": "Major Texts in Critical Theory",
            "description": "LITCW-AD  101 Major Texts in Critical Theory \nMajor texts in critical theory from Plato to Derrida are considered in relation to literary practice. The first half of the course focuses on four major types of critical theory: mimetic, ethical, expressive, and formalist. The second half turns to 20th-century critical schools, such as Russian and American formalism, archetypal criticism, structuralism, psychoanalytic criticism, feminism, reader-response theory, deconstruction, and historicism.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 103",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12930",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 001",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Waterman, Bryan; Pomerantz, Maurice"
                }
            ],
            "course_name": "",
            "description": "LITCW-AD  103\n\n   Foundations of Literature I: Epic and Drama\n\nThis course introduces students to two major genres of literature—epic and drama—and to fundamental terms and critical methods employed by literary scholars. Topics to be investigated include: the relationship between text and context, close vs. distant reading, the nature of authorship; genre; the interplay of local, national, regional, and world modes of categorization; translation; book history; and the relationship between literature and other forms of art. Each unit of the course is constructed around an anchoring text or texts that will be contextualized both historically and generically...\n\n      more description for LITCW-AD  103 »\n\n      \n\n\n\nThis course introduces students to two major genres of literature—epic and drama—and to fundamental terms and critical methods employed by literary scholars. Topics to be investigated include: the relationship between text and context, close vs. distant reading, the nature of authorship; genre; the interplay of local, national, regional, and world modes of categorization; translation; book history; and the relationship between literature and other forms of art. Each unit of the course is constructed around an anchoring text or texts that will be contextualized both historically and generically through a wide range of primary and secondary readings.\n\n      less description for LITCW-AD  103 «",
            "offering": true
        },
        {
            "course_id": "LITCW-AD 104",
            "course_name": "",
            "description": "LITCW-AD  104\n\n   Foundations of Literature II: Lyric Poetry and the Novel\n\nThis course introduces students to two major genres of literature—lyric poetry and the novel —and to fundamental terms and critical methods employed by literary scholars. Topics to be investigated include: the relationship between text and context; close vs. distant reading; the nature of authorship, genre, the interplay of local, national, regional, and world modes of categorization; translation, book history, and the relationship between literature and other forms of art. Each unit of the course is constructed around an anchoring text or texts that will be contextualized both historically an...\n\n      more description for LITCW-AD  104 »\n\n      \n\n\n\nThis course introduces students to two major genres of literature—lyric poetry and the novel —and to fundamental terms and critical methods employed by literary scholars. Topics to be investigated include: the relationship between text and context; close vs. distant reading; the nature of authorship, genre, the interplay of local, national, regional, and world modes of categorization; translation, book history, and the relationship between literature and other forms of art. Each unit of the course is constructed around an anchoring text or texts that will be contextualized both historically and generically through a wide range of primary and secondary readings.\n\n      less description for LITCW-AD  104 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 105",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12969",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 001",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Williams, Katherine"
                }
            ],
            "course_name": "",
            "description": "LITCW-AD  105\n\n   Problems and Methods of Literary Studies\n\nThis course develops students’ understanding of the central questions and problems that drive literary studies. Drawing upon a long history of theoretical approaches, the course considers such questions as: What is literature? What is a text? What does a literary critic or scholar do? What does it mean to read literature in translation? How does language shape meaning? How do we construct meaning from a text—and why does that meaning matter? And, crucially: What is at stake in why we ask and how we answer these questions? This class will engage these questions by reading widely, from primary t...\n\n      more description for LITCW-AD  105 »\n\n      \n\n\n\nThis course develops students’ understanding of the central questions and problems that drive literary studies. Drawing upon a long history of theoretical approaches, the course considers such questions as: What is literature? What is a text? What does a literary critic or scholar do? What does it mean to read literature in translation? How does language shape meaning? How do we construct meaning from a text—and why does that meaning matter? And, crucially: What is at stake in why we ask and how we answer these questions? This class will engage these questions by reading widely, from primary theoretical and critical texts to examples from print and digital material, and by exploring particular practices of literary scholarship—from archival research to work in digital humanities—that offer necessary skills for effective critical practice.\n\n      less description for LITCW-AD  105 «",
            "offering": true
        },
        {
            "course_id": "LITCW-AD 106",
            "course_name": "",
            "description": "LITCW-AD  106\n\n   Humanism\n\nHumanism—which in some regions coincides with Renaissance—was a cultural movement initiated in Italy in the 14th century, spreading all over Europe until it reached its end in the 17th century. Its programmatic energy derived from the desire to remember something that seemed to have been obliterated and forgotten in the course of the Middle Ages, i.e. pagan antiquity. Basing their European—national and transnational—identities on something much older than Christianity, scholars (poets, painters, architects, composers, and philosophers) revived and developed scientifically the Greek and Roman l...\n\n      more description for LITCW-AD  106 »\n\n      \n\n\n\nHumanism—which in some regions coincides with Renaissance—was a cultural movement initiated in Italy in the 14th century, spreading all over Europe until it reached its end in the 17th century. Its programmatic energy derived from the desire to remember something that seemed to have been obliterated and forgotten in the course of the Middle Ages, i.e. pagan antiquity. Basing their European—national and transnational—identities on something much older than Christianity, scholars (poets, painters, architects, composers, and philosophers) revived and developed scientifically the Greek and Roman legacy and laid the founding stones for Enlightenment and Modernity.\n\n      less description for LITCW-AD  106 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 107",
            "course_name": "X The Postcolonial Turn",
            "description": "LITCW-AD  107X The Postcolonial Turn \nIn postcolonial literature, representation and revolution intersect, as writers re-invent literary forms and seek to reconceive colonialism, nationalism, and modernity. We compare British, Caribbean, Latin American, South Asian, and\nAfrican texts, including travelogues, whose maps envision fantasies of the other; adaptations and translations of novels, in which mimicry and magical realism reveal how “the Empire writes back”; and memoirs and short stories, whose\nfragmentary and experimental forms express how memories of violence, displacement, and exile shape individuals today.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 108",
            "course_name": "Global Traffic: Fictions & Films of Place and Space",
            "description": "LITCW-AD  108 Global Traffic: Fictions & Films of Place and Space \nGlobalization, the acceleration of transportation and information technologies, transforms the experience of distance, producing perceptions of proximity and inter-connectedness across nations. It foregrounds movement and simultaneity, blurring boundaries between “real” and “virtual” worlds. Through texts emphasizing home, homelessness, migration, diaspora, transnationalism, tourism, the course examines how literature, film, games, graphic novels, and new media guide readers in this new landscape by charting new concepts of space and place, community, and global citizenship.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12823",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 001",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Savio, James"
                }
            ],
            "course_name": "Introduction to Creative Writing",
            "description": "LITCW-AD  110 Introduction to Creative Writing \nThis workshop introduces the basic elements of poetry, fiction, and personal narrative with in-class writing, take-home reading and writing assignments, and substantive discussions of craft. The course is structured as a workshop, which means that students receive feedback from their instructor and their fellow writers in a roundtable setting, and they should be prepared to offer their classmates responses to their work.",
            "offering": true
        },
        {
            "course_id": "LITCW-AD 111",
            "course_name": "Classical Literature and Its Global Reception",
            "description": "LITCW-AD  111 Classical Literature and Its Global Reception \nAn introduction to three genres of literature from the ancient Greco-Roman world—drama, epic, and lyric poetry—together with an investigation of their continuing impact on the modern world.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 113",
            "course_name": "European Literary Traditions",
            "description": "LITCW-AD  113 European Literary Traditions \nA comparative approach to the formation and development of traditions in post-Enlightenment Europe (including Great Britain and Russia), with a particular emphasis on fiction and poetry as embodiments of modernity.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 114",
            "course_name": "Global Women Writing",
            "description": "LITCW-AD  114 Global Women Writing \nSelected readings in poetry and fiction provide the focus for an exploration of representations of gender as they intersect class, race, nation, and sexuality. Readings are drawn from one or more regional traditions: Britain and northern Europe; the Mediterranean World; Africa and the African diaspora; Russia; the Middle East; South Asia; the Far East; and the Americas.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 115",
            "course_name": "History and Theory of the Novel",
            "description": "LITCW-AD  115 History and Theory of the Novel \nAn introduction to the history of the novel in a comparative context, with special emphasis on contemporary critical theory (including circulation studies, deconstruction, new historicism, and psychoanalysis). Theoretical readings include works by Bakhtin, Barthes, Lukacs, McKeon, Moretti, and Watt, among others.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 116",
            "course_name": "History of Drama and Theater",
            "description": "LITCW-AD  116 History of Drama and Theater \nExamines selected plays central to the development of world drama, with critical emphasis on a cultural, historical, and theatrical analysis of these works. Texts are drawn from the major periods of Greek and Roman drama; Japanese\nclassical theater; medieval drama; theater of the English, Italian, and Spanish Renaissance; French neoclassical drama; English Restoration and 18th-century comedy; and Russian dramatic traditions. Styles to be considered include\nromanticism, naturalism, realism, antirealism, and postcolonial theater.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 118",
            "course_name": "",
            "description": "LITCW-AD  118\n\n   Literary Translation\n\nThis course explores the craft of and the market for literary translation. Why do some translators aim for familiarity and others for estrangement? What is gained and lost in a text’s cultural relocation? Translation, and translation projects such as Abu Dhabi’s Kalima, play a pivotal role in shaping intercultural exchange and globalizing literary markets and canons. The course involves conversations with translators and authors in Abu Dhabi and abroad. Case studies include The Epic of Gilgamesh, the quatrains of Khayyam, sonnets of Shakespeare and Camões, and modern and contemporary works by ...\n\n      more description for LITCW-AD  118 »\n\n      \n\n\n\nThis course explores the craft of and the market for literary translation. Why do some translators aim for familiarity and others for estrangement? What is gained and lost in a text’s cultural relocation? Translation, and translation projects such as Abu Dhabi’s Kalima, play a pivotal role in shaping intercultural exchange and globalizing literary markets and canons. The course involves conversations with translators and authors in Abu Dhabi and abroad. Case studies include The Epic of Gilgamesh, the quatrains of Khayyam, sonnets of Shakespeare and Camões, and modern and contemporary works by Borges, Pessoa, Saramago, Kundera, Ondaatje, and Paz Soldan.\n\n      less description for LITCW-AD  118 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 119",
            "course_name": "Literatures of the Americas",
            "description": "LITCW-AD  119 Literatures of the Americas \nA hemispheric approach that sets the literary traditions of the United States, Canada, Mexico, and Latin America in comparative context.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 120",
            "course_name": "Magic Realism",
            "description": "LITCW-AD  120 Magic Realism \nHow do global cultural forms emerge? This course charts Magic Realism, a staple of global art, film, and fiction at the start of the new millennium. It traces how this malleable form has served different historical moments, cultural contexts, and political ideologies, and asks why Magic Realism has been privileged as a global form. Materials include art, art criticism, film, and fiction from Europe, the Americas, and the Middle East.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 121",
            "course_name": "",
            "description": "LITCW-AD  121\n\n   Travel, Geography, and Imagination in Arabic and Islamicate Literatures\n\nThis course considers travel and geography as a theme in pre-modern Arabic and Islamicate literary cultures from the 7th century to the 19th century. During the semester, students will read from a wide variety of literary genres including love poetry, popular epics, travelers’ accounts, geographical works and sufi mystical treatises from many different regions of the Muslim world, ranging from West Africa to South East Asia. Exploring the movement of people, goods, and ideas within works of literature and tracing the formation,  circulation and transformation of Islamicate literary genres, the...\n\n      more description for LITCW-AD  121 »\n\n      \n\n\n\nThis course considers travel and geography as a theme in pre-modern Arabic and Islamicate literary cultures from the 7th century to the 19th century. During the semester, students will read from a wide variety of literary genres including love poetry, popular epics, travelers’ accounts, geographical works and sufi mystical treatises from many different regions of the Muslim world, ranging from West Africa to South East Asia. Exploring the movement of people, goods, and ideas within works of literature and tracing the formation,  circulation and transformation of Islamicate literary genres, the course focuses on the ways that literary works mediate between local, translocal, and global identities.\n\n      less description for LITCW-AD  121 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 122",
            "course_name": "Comparative Poetic Traditions",
            "description": "LITCW-AD  122 Comparative Poetic Traditions \nAn introduction to the development of ancient and modern epic, lyric, and other poetic forms in comparative cultural contexts.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 123",
            "course_name": "Regional Literatures and Cultures",
            "description": "LITCW-AD  123 Regional Literatures and Cultures \nTransnational approaches to the cultures produced in one or more of the following regional configurations: Britain and northern Europe; the Mediterranean world; Africa; the Middle East; South Asia; the Far East; and the Americas.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 124",
            "course_name": "",
            "description": "LITCW-AD  124\n\n   The U.S. Novel after 1940 as a Global Form\n\nTo what extent do nationalist traditions of the novel break down in the period after the Second War? This course examines the ways in which the U.S. novel has been marked by two conflicting trajectories: first, the emergence of powerful novels by writers who belong to historically marginalized traditions; second, a growing sense that the novel has become a residual form, no longer dominant among the various forms of narrative that U.S. culture makes available. The course explores the ways in which the novel dramatizes the multicultural, transnational, and cosmopolitan experiences that mark the...\n\n      more description for LITCW-AD  124 »\n\n      \n\n\n\nTo what extent do nationalist traditions of the novel break down in the period after the Second War? This course examines the ways in which the U.S. novel has been marked by two conflicting trajectories: first, the emergence of powerful novels by writers who belong to historically marginalized traditions; second, a growing sense that the novel has become a residual form, no longer dominant among the various forms of narrative that U.S. culture makes available. The course explores the ways in which the novel dramatizes the multicultural, transnational, and cosmopolitan experiences that mark the 21st century, with an emphasis on the ways in which U.S. writers have sought to engage global traditions, past and present.\n\n      less description for LITCW-AD  124 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 126",
            "course_name": "J",
            "description": "LITCW-AD  126J\n\n   Tales of Love and Death\n\nThis course explores foundational myths and fairy tales, from the Babylonian Epic of Gilgamesh to contemporary re-visionings of the Iliad and the Arabian Nights. Long before print and the coming of the book, every society told stories to tackle deep questions: about the human place in the world, the origins of natural phenomena, the meaning of love and war, the mystery of death. This form of literature has been called the work of “reasoned imagination” (Borges). Readings from classic works (Ovid, Apuleius, as well as the above) help inspire original writing projects and tales that draw on the ...\n\n      more description for LITCW-AD  126J »\n\n      \n\n\n\nThis course explores foundational myths and fairy tales, from the Babylonian Epic of Gilgamesh to contemporary re-visionings of the Iliad and the Arabian Nights. Long before print and the coming of the book, every society told stories to tackle deep questions: about the human place in the world, the origins of natural phenomena, the meaning of love and war, the mystery of death. This form of literature has been called the work of “reasoned imagination” (Borges). Readings from classic works (Ovid, Apuleius, as well as the above) help inspire original writing projects and tales that draw on the participants’ own cultures.\n\n      less description for LITCW-AD  126J «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 127",
            "course_name": "",
            "description": "LITCW-AD  127\n\n   Classic American Literature\n\nThis course focuses on works that have been considered classics of American Literature. It examines the various factors that lead a work to be canonized and the politics of inclusion and exclusion that underlie the cultural mythology of “America.” Topics to be considered include: colonial and creole identities; the relationship between writing and empire; encounters between Native Americans, Europeans, and Africans in the “New World”; the nature of the “American Renaissance”; the meaning of American individualism; the mythology of American exceptionalism; the dialectic of freedom and slavery i...\n\n      more description for LITCW-AD  127 »\n\n      \n\n\n\nThis course focuses on works that have been considered classics of American Literature. It examines the various factors that lead a work to be canonized and the politics of inclusion and exclusion that underlie the cultural mythology of “America.” Topics to be considered include: colonial and creole identities; the relationship between writing and empire; encounters between Native Americans, Europeans, and Africans in the “New World”; the nature of the “American Renaissance”; the meaning of American individualism; the mythology of American exceptionalism; the dialectic of freedom and slavery in American rhetoric; and the American obsession with race. Authors: Columbus, Cabeza de Vaca, Bradford, Winthrop, Rowlandson, Bradstreet, Edwards, Franklin, Jefferson, Brown, Foster, Douglass, Emerson, Thoreau, Whitman, Stowe, Hawthorne, and Melville.\n\n      less description for LITCW-AD  127 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 128",
            "course_name": "",
            "description": "LITCW-AD  128\n\n   Advanced Creative Writing: Nonfiction Essay\n\nThis advanced nonfiction writing course explores the creative possibilities of both the persuasive and familiar essay forms. With the Art of Memory as the organizing principle, our material will include works by Virginia Woolf, E.M. Forster, Joseph Conrad, John Fowles, John Berger, Margaret Atwood and Andre Aciman as well as films directed by Krzysztof Kieslowski and Pedro Almodovar. The course combines discussion seminars and writing workshops with one-on-one conferences with the professor. Students work on honing their own narrative voices and aim to produce honors level work by the end of t...\n\n      more description for LITCW-AD  128 »\n\n      \n\n\n\nThis advanced nonfiction writing course explores the creative possibilities of both the persuasive and familiar essay forms. With the Art of Memory as the organizing principle, our material will include works by Virginia Woolf, E.M. Forster, Joseph Conrad, John Fowles, John Berger, Margaret Atwood and Andre Aciman as well as films directed by Krzysztof Kieslowski and Pedro Almodovar. The course combines discussion seminars and writing workshops with one-on-one conferences with the professor. Students work on honing their own narrative voices and aim to produce honors level work by the end of the semester.\n\n      less description for LITCW-AD  128 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 129",
            "course_name": "World Literature",
            "description": "LITCW-AD  129 World Literature \nWhy do some texts—and not others—travel well enough to be read and taught with interest outside of their cultures of origin? Why this beautiful piece of writing, and not that one? Who are the arbiters of international taste? What is lost and gained in translation? The course addresses fundamental practices of interpreting world literature such as how to read across time, across cultures, and in translation.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 130",
            "course_name": "J",
            "description": "LITCW-AD  130J\n\n   Fiction Writing: Craft Workshop\n\nWhere would we be without stories? Better question: Where can we go, and what can we do, as creative writers? Our course begins with the nuts and bolts — learning the tools, acquiring the skills, understanding the architecture of story telling. Then, together, we build. We’ll also play, debate, and experiment: discovering the line between news articles and fiction; creating characters using social media conventions; writing more vividly by unlocking our senses; declaring our manifestos; understanding publishing; examining censorship; and looking over the edge into the abyss with growing confid...\n\n      more description for LITCW-AD  130J »\n\n      \n\n\n\nWhere would we be without stories? Better question: Where can we go, and what can we do, as creative writers? Our course begins with the nuts and bolts — learning the tools, acquiring the skills, understanding the architecture of story telling. Then, together, we build. We’ll also play, debate, and experiment: discovering the line between news articles and fiction; creating characters using social media conventions; writing more vividly by unlocking our senses; declaring our manifestos; understanding publishing; examining censorship; and looking over the edge into the abyss with growing confidence. For writing should never be solitary: we’ll learn from the works of published writers; more importantly, we’ll learn from each other—not just how to write but why we write. And we’ll stride forward with the fictionist’s creativity, the journalist’s rigor, and the critic’s understanding. Fiction, and you, will never be the same.\n\n      less description for LITCW-AD  130J «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 131",
            "course_name": "J",
            "description": "LITCW-AD  131J\n\n   Performative Literature: Acting Epics, Romances, Ballads and Stories\n\nThis course presents narrative literature as a set of springboards to performance, rather than as a series of books simply to be read privately. In this strongly performance-oriented course, students approach literature as works that were acted out, sung, and narrated from memory, as part of a storytelling tradition. Students are invited to draw on their dramatic and musical skills and interests, and on their language abilities. For their final project, students collaborate in staging and performing a substantial piece of traditional narrative. Works discussed and performed include epics, roma...\n\n      more description for LITCW-AD  131J »\n\n      \n\n\n\nThis course presents narrative literature as a set of springboards to performance, rather than as a series of books simply to be read privately. In this strongly performance-oriented course, students approach literature as works that were acted out, sung, and narrated from memory, as part of a storytelling tradition. Students are invited to draw on their dramatic and musical skills and interests, and on their language abilities. For their final project, students collaborate in staging and performing a substantial piece of traditional narrative. Works discussed and performed include epics, romances, ballads, and short tales of various kinds, drawn from world literature. In J-term 2015, students will perform from the medieval French Arthurian romance Yvain or the Knight with the Lion by Chretien de Troyes and from the Spanish epic The Song of the Cid. Short works (in a Course Packet) will be taken from the following—and will thus represent a wide range of kinds of narrative and modes of performance: ballads from Spain and India; tales from Latin (The Scholar’s Guide), medieval French (various types of tales), Turkish (The Book of Dede Korkut), Hebrew (Tahkemoni), Arabic (Kalila and Dimna, 1001 Nights), and Urdu (Amir Hamza). Students will be invited to perform in the original languages wherever possible, and an attempt will be made to include works from the students’ own traditions.\n\n      less description for LITCW-AD  131J «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 133",
            "course_name": "J",
            "description": "LITCW-AD  133J\n\n   Tales that Travel: Storytelling and Storytellers in Eurasia, 10th-16th centuries\n\nLong before modern media sent stories around the world at lightning speed, good tales traveled. This course explores the travel of tales and considers the ways in which a common culture of story and storytelling can be found throughout pre-modern Europe, Middle East, South and East Asia. Drawing on stories and scholarship from many different traditions, it examines the role of storytelling in human culture, discusses the performance and circulation of stories, and reflects on examples of the types of tales that traveled--including tales of origin, of wisdom (and folly), of trickery (and truthf...\n\n      more description for LITCW-AD  133J »\n\n      \n\n\n\nLong before modern media sent stories around the world at lightning speed, good tales traveled. This course explores the travel of tales and considers the ways in which a common culture of story and storytelling can be found throughout pre-modern Europe, Middle East, South and East Asia. Drawing on stories and scholarship from many different traditions, it examines the role of storytelling in human culture, discusses the performance and circulation of stories, and reflects on examples of the types of tales that traveled--including tales of origin, of wisdom (and folly), of trickery (and truthfulness), of success (and failure), of youth and age, of love and the battle of the sexes—and many others.\n\n      less description for LITCW-AD  133J «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 134",
            "course_name": "",
            "description": "LITCW-AD  134\n\n   Literatures of Arab America\n\nThe Arab presence in the Americas is a mix of history and legend, fact and fantasy. Twelfth-century geographer al-Idrisi reports that eight Arabs sailed west from Lisbon to discover what lay beyond the “Sea of Darkness” (the Atlantic ocean), and arrived somewhere in South America. Columbus reportedly had a copy of al-Idrisi’s book with him when he embarked on his first voyage in 1492, and he took with him Louis de Torre, a converted Moor, to act as an Arabic interpreter once the expedition reached India. Some of the earliest slave narratives were written in Arabic by literate Muslim captives f...\n\n      more description for LITCW-AD  134 »\n\n      \n\n\n\nThe Arab presence in the Americas is a mix of history and legend, fact and fantasy. Twelfth-century geographer al-Idrisi reports that eight Arabs sailed west from Lisbon to discover what lay beyond the “Sea of Darkness” (the Atlantic ocean), and arrived somewhere in South America. Columbus reportedly had a copy of al-Idrisi’s book with him when he embarked on his first voyage in 1492, and he took with him Louis de Torre, a converted Moor, to act as an Arabic interpreter once the expedition reached India. Some of the earliest slave narratives were written in Arabic by literate Muslim captives from West Africa. However, large-scale Arab immigration to the Americas did not begin until the nineteenth century, and since then those immigrants and their descendants have participated in a substantial, though little known, literature in Arabic, English, French, Portuguese, and Spanish. We will examine this tradition within the emergent paradigms of inter-American and hemispheric studies and discuss recent scholarship on the globalization of U.S. American studies and its interface with Latin American and Arabic studies. We will then read a selection of literary works by and about Arab immigrants and their descendants throughout the Americas.\n\n      less description for LITCW-AD  134 «",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 135",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17902",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 001",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Patell, Cyrus"
                }
            ],
            "course_name": "",
            "description": "LITCW-AD  135\n\n   Global Shakespeare\n\nTo what extent can “Shakespeare” serve as the focal point for a cultural heritage that belongs to the entire globe? This course offers a comparative, interdisciplinary approach to the plays of William Shakespeare, considering him both as an exemplar of Western literature and also as a world author whose influence can be felt throughout many cultures.  We will approach the study of Shakespeare through three different sets of questions: 1) In what ways was Shakespeare a “global” author in his own day, adopting a “worldly” approach that transcends his English context? 2) How does the history of t...\n\n      more description for LITCW-AD  135 »\n\n      \n\n\n\nTo what extent can “Shakespeare” serve as the focal point for a cultural heritage that belongs to the entire globe? This course offers a comparative, interdisciplinary approach to the plays of William Shakespeare, considering him both as an exemplar of Western literature and also as a world author whose influence can be felt throughout many cultures.  We will approach the study of Shakespeare through three different sets of questions: 1) In what ways was Shakespeare a “global” author in his own day, adopting a “worldly” approach that transcends his English context? 2) How does the history of the publication, performance, and criticism of his plays transform “Shakespeare” into a global cultural commodity? 3) What is the cultural legacy of Shakespeare’s work throughout a variety of global media forms, including plays, films, novels, operas, and works of visual art? We will read a range of Shakespeare’s plays –The Comedy of Errors, Romeo and Juliet, A Midsummer Night’s Dream, 1 Henry IV, Hamlet, Othello, King Lear, and The Tempest – as well as adaptations and reimaginings by Aimé Césaire, Duke Ellington, Grigori Kozintsev, Akira Kurosawa, Toni Morrison, Tayib Salih, Jeremy Sams, and Julie Taymor, as well as a variety of secondary materials.\n\n      less description for LITCW-AD  135 «",
            "offering": true
        },
        {
            "course_id": "LITCW-AD 136",
            "course_name": "Modern Epic: Tolstoy, Joyce, and García Márquez",
            "description": "LITCW-AD  136 Modern Epic: Tolstoy, Joyce, and García Márquez \nThis course will examine three “encyclopedic” texts (War and Peace, Ulysses, One Hundred Years of Solitude) that rehearse and interrogate inherited paradigms of cultural identity, purpose, and destiny. Through sustained attention to formal and ideological tenets of these specific texts, we will also seek to interrogate some of the salient procedures of realism, modernism, and postcolonialism.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 137",
            "course_name": "Feature Writing",
            "description": "LITCW-AD  137 Feature Writing \nThis course aims to develop your skills in feature writing for print and online magazines and trade journals. Emphasis will be placed on all stages of development, from a feature's conception and research to its drafting, revision, and publication. We will pay particular attention to research and reporting techniques as well as to the demands of writing compelling pieces of varied lengths, from short-form to longer features. Our objective is to prepare you to pitch and publish material written for this course, whether in NYUAD student publications or other venues.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 138",
            "course_name": "Travel Writing",
            "description": "LITCW-AD  138 Travel Writing \nThis course exposes you to a range of writing about personal travel and offers you the chance to craft travel narratives of your own of various lengths and formats. We will focus on such questions as style, method, medium, genre, funding, and strategies or outlets for online and print publication, as well as ethical issues that may arise when writing about countries or cultures not your own. The course will include a trip that will allow you to put principles we've discussed to immediate use.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 298",
            "course_name": "Directed Study",
            "description": "LITCW-AD  298 Directed Study \nClosely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 320",
            "course_name": "Advanced Creative Writing: Workshop in Fiction",
            "description": "LITCW-AD  320 Advanced Creative Writing: Workshop in Fiction \nAn advanced fiction workshop that offers students the opportunity to hone their writing through peer critique and in-depth craft discussions. Extensive outside reading deepens students’ understanding of fiction and broadens their knowledge of the evolution of literary forms and techniques.",
            "offering": false
        },
        {
            "course_id": "LITCW-AD 321",
            "course_name": "",
            "description": "LITCW-AD  321\n\n   Advanced Creative Writing: Workshop in Poetry\n\nThis course focuses on writing poetry by experimenting with a variety of poetic forms and writing prompts, including 20th-century and contemporary poetry and statements and essays written by poets. Students will write poetry as well as learn terms for critical analysis. Some of the threads of inquiry and inspiration that will run through the workshop include: What is poetry? What does it do? What is the state of poetry now? What does it mean to write and read poems in English if it is not your home or only language? In addition to workshopping peers’ poetry, participants will learn about the c...\n\n      more description for LITCW-AD  321 »\n\n      \n\n\n\nThis course focuses on writing poetry by experimenting with a variety of poetic forms and writing prompts, including 20th-century and contemporary poetry and statements and essays written by poets. Students will write poetry as well as learn terms for critical analysis. Some of the threads of inquiry and inspiration that will run through the workshop include: What is poetry? What does it do? What is the state of poetry now? What does it mean to write and read poems in English if it is not your home or only language? In addition to workshopping peers’ poetry, participants will learn about the chapbook tradition, make their own small books of between 15 and 25 pages, and organize readings to experiment with various performance-based approaches to poetry.\n\n      less description for LITCW-AD  321 «",
            "offering": false
        }
    ]
}