{
    "major_id": "MASY1-GC",
    "file": "./2015-2016/Management_&_Systems_MA-GC_(MASY1-GC).html",
    "courses": [
        {
            "course_id": "MASY1-GC 1000",
            "course_name": "Info Systems Auditing",
            "description": "MASY1-GC 1000 Info Systems Auditing",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1001",
            "course_name": "Quantitative Methods",
            "description": "MASY1-GC 1001 Quantitative Methods",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1002",
            "course_name": "Economic Analysis",
            "description": "MASY1-GC 1002 Economic Analysis",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1003",
            "course_name": "Organizational Behavior",
            "description": "MASY1-GC 1003 Organizational Behavior",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1004",
            "course_name": "Financial Management",
            "description": "MASY1-GC 1004 Financial Management",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1005",
            "course_name": "Marketing",
            "description": "MASY1-GC 1005 Marketing",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1006",
            "course_name": "Information Technology",
            "description": "MASY1-GC 1006 Information Technology \nThis course introduces the role of information technology in supporting organizational decision making and strategic planning. Topics include: the role of information within organizations; overview of modern hardware and software platforms; systems development architectures: process, data and network; owner and user roles in systems analysis and design; and technology impacts on corporate competitiveness, structure and control.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1010",
            "course_name": "Data & Security Systems",
            "description": "MASY1-GC 1010 Data & Security Systems",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1020",
            "course_name": "Systems Auditng Software",
            "description": "MASY1-GC 1020 Systems Auditng Software",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1030",
            "course_name": "Aud Computerized Systems",
            "description": "MASY1-GC 1030 Aud Computerized Systems",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1100",
            "course_name": "Object-Oriented Analysis",
            "description": "MASY1-GC 1100 Object-Oriented Analysis",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1110",
            "course_name": "Database Management",
            "description": "MASY1-GC 1110 Database Management \nThis course provides a working knowledge of the logical structure and physical implementation of database management systems. Topics include: data structure concepts; the application of data models and data normalization; input and output design considerations; data administration; and client/server and distributed database systems.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1150",
            "course_name": "Network Administration",
            "description": "MASY1-GC 1150 Network Administration",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1180",
            "course_name": "Electronic Commerce",
            "description": "MASY1-GC 1180 Electronic Commerce \nThis course examines the impact of emerging information technologies on how business will be conducted in the wired world of the Internet. Topics include: E-Commerce business models; hardware and software components of commerce-enabled Web sites; copyright, authentication and security issues; online payment strategies and technologies; and impacts of evolving market-spaces on the traditional marketplace.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2524",
                    "section": "100",
                    "period": "09/05/2015 - 10/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3127",
                    "section": "101",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3215",
                    "section": "201",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 1200\n\n   Managing in a Global Economy\n\nThe internationalization or globalization of the U.S. economy has occurred in the private and public sectors, in input and output markets, and in business firms and households. This course examines three facets of a modern economy; markets, government, and international trade, and explores the connections among them. Modern economies, markets and governments are not contained within national boundaries but spill over from one nation to another. Specialization and markets arise on a global scale, leading to international trade in goods and services. One of the roles of government is to develop ...\n\n      more description for MASY1-GC 1200 »\n\n      \n\n\n\nThe internationalization or globalization of the U.S. economy has occurred in the private and public sectors, in input and output markets, and in business firms and households. This course examines three facets of a modern economy; markets, government, and international trade, and explores the connections among them. Modern economies, markets and governments are not contained within national boundaries but spill over from one nation to another. Specialization and markets arise on a global scale, leading to international trade in goods and services. One of the roles of government is to develop policies to deal with trade between countries. Upon completion, the student will understand how a market-based economy operates in today's global environment.\n\n      less description for MASY1-GC 1200 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 1210",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3112",
                    "section": "100",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2526",
                    "section": "101",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3222",
                    "section": "102",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3021",
                    "section": "200",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Quantitative Models for Decision-Makers",
            "description": "MASY1-GC 1210 Quantitative Models for Decision-Makers \nIn today's business environment, corporate executives and leading professionals must continuously analyze strategic business situations and at times feel limited in their ability to choose appropriate courses of action. In these situations, the executive is expected to utilize sound critical decision making in order to initiate action and move the organization to creative problem solving. This course provides the student with the tools and techniques required to manage processes efficiently and make decisions effectively.",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 1220",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3135",
                    "section": "100",
                    "period": "09/02/2015 - 10/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2527",
                    "section": "101",
                    "period": "10/24/2015 - 12/12/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2528",
                    "section": "200",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Financial Management",
            "description": "MASY1-GC 1220 Financial Management \nThis course covers current financial and managerial accounting methods and their function within the information system of decision making. Topics include accounting theory and concepts; financial statement analysis; and analysis for evaluation and decision-making. Attention will also be paid to capital investment analysis, financial models, and the legal ramifications of technological advances in the finance industry (Internet trading, digital signatures, etc.).",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 1230",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2530",
                    "section": "100",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2529",
                    "section": "200",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 1230\n\n   Strategic Marketing\n\nThis course provides a thorough understanding of the strategic marketing process, from analyzing customer needs, to developing a product/service, integrated communications, taking it to market, fulfillment, and successfully managing customer relationships, including the integration of all channels, from sales to public relations to customer service in order to maximize customer lifetime value.  Topics include: the marketing mix and the holistic marketing concept, marketing research and forecasting, environmental analysis, market segmentation, customer relationship management, brand equity, man...\n\n      more description for MASY1-GC 1230 »\n\n      \n\n\n\nThis course provides a thorough understanding of the strategic marketing process, from analyzing customer needs, to developing a product/service, integrated communications, taking it to market, fulfillment, and successfully managing customer relationships, including the integration of all channels, from sales to public relations to customer service in order to maximize customer lifetime value.  Topics include: the marketing mix and the holistic marketing concept, marketing research and forecasting, environmental analysis, market segmentation, customer relationship management, brand equity, managing marketing programs, such as sales force management, integrated marketing communications (ranging from image and public relations through mass and target marketing, and direct response), online marketing, and return on marketing investments. Through a combination of lectures, presentations, case studies, and multimedia dealing with real-world examples, students will be expected to explore and analyze marketing strategies that are integrated across the organization and its customer touch points, the communications mix across distribution channels, and the customer lifecycle.  Upon successful completion of this course, students will have learned how to optimize the core processes of the value chain, how to analyze the competitive environment, how to develop and execute an integrated marketing communications mix, and how to formulate and implement marketing strategies for acquiring and retaining 'valuable' customers.\n\n      less description for MASY1-GC 1230 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 1240",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3128",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2531",
                    "section": "101",
                    "period": "10/24/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2760",
                    "section": "200",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 1240\n\n   Information Technology & Data Analytics\n\nThe organization is examined as a system, and the roles of information and computers are explored to facilitate the specification, development, implementation and maintenance of information technology for supporting organization decision-making and strategic planning in today's information age. Topics include: the role of information within organizations; overview of modern hardware and software platforms; systems development architectures; planning, developing and managing IT systems; introduction to databases and data warehouses; decision support and artificial intelligence; owner and user r...\n\n      more description for MASY1-GC 1240 »\n\n      \n\n\n\nThe organization is examined as a system, and the roles of information and computers are explored to facilitate the specification, development, implementation and maintenance of information technology for supporting organization decision-making and strategic planning in today's information age. Topics include: the role of information within organizations; overview of modern hardware and software platforms; systems development architectures; planning, developing and managing IT systems; introduction to databases and data warehouses; decision support and artificial intelligence; owner and user roles in systems development life cycles; technology impacts on corporate competitiveness, structure and control; networks and client/server issues. In response to today?s societal concerns, the course addresses protecting people and information as well as computer crime and forensics. Substantial use of real-world projects, case studies and hands-on assignments are employed.  Upon completion of the course students are expected to have gained an appreciation of the important contribution information technology makes to the success of organizations and how it helps the Chief Information Officer (CIO) and the firm achieve a competitive advantage. More specifically, they will have learned: the strategic role of IT in organizations, typical contributions IT makes to the organization, major issues in IT management, and recent advances and current trends in IT.\n\n      less description for MASY1-GC 1240 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 1245",
            "course_name": "Project Management in the Information Age I",
            "description": "MASY1-GC 1245 Project Management in the Information Age I \nThis course explores the methodologies, technologies, and techniques for managing projects in an information technology environment. In addition to case studies and project management tools, students participate in a simulation that runs concurrently throughout the course. Upon completion, students will be able to define a business problem, plan the delivery of a solution for that problem and manage the quality completion of those deliverables.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1250",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2761",
                    "section": "100",
                    "period": "09/05/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3111",
                    "section": "101",
                    "period": "09/05/2015 - 12/02/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2532",
                    "section": "200",
                    "period": "09/02/2015 - 12/02/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Project Management in The Information Age",
            "description": "MASY1-GC 1250 Project Management in The Information Age \nThis course is taught in two semester sessions.  This first session explores the methodologies, technologies, and techniques for managing projects in an information technology environment. In addition to case studies and project management tools, students participate in a simulation that runs concurrently throughout the course. Upon completion, students will be able to define a business problem, plan the delivery of a solution for that problem and manage the quality completion of those deliverables.",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 1255",
            "course_name": "Project Management in the Information Age II",
            "description": "MASY1-GC 1255 Project Management in the Information Age II \nThis is the introduces topics including the role of the Project Manager, the role of the PMO office and advanced topics in enterprise project management including Agile Project Management and managing complex change. This course also introduces topics to help prepare students who desire to pursue the PMI certification.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1260",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3109",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3110",
                    "section": "101",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3018",
                    "section": "200",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2533",
                    "section": "201",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 1260\n\n   Research Process & Methodology\n\nThis course affords students the opportunity to thoroughly explore a specific business topic as it relates to their area of study and/or professional field.  Research is a complex undertaking with formal processes, methodologies and design.  A successful manager needs not only to be able to research opportunities and/or problems as they present themselves, but also evaluate research produced by others.  To do so, s/he must be fully cognizant of acceptable research techniques, data collection, research design, internal and external validity and statistical methods for hypothesis testing. This c...\n\n      more description for MASY1-GC 1260 »\n\n      \n\n\n\nThis course affords students the opportunity to thoroughly explore a specific business topic as it relates to their area of study and/or professional field.  Research is a complex undertaking with formal processes, methodologies and design.  A successful manager needs not only to be able to research opportunities and/or problems as they present themselves, but also evaluate research produced by others.  To do so, s/he must be fully cognizant of acceptable research techniques, data collection, research design, internal and external validity and statistical methods for hypothesis testing. This course equips the student with the required research skills that are necessary to successfully conceptualize a research topic with original ideas and subsequently develop a proposal for researching that topic. Upon completion of the course, students are expected to have learned: how to conduct a literature survey, the hallmarks of scientific research, the hypothetico-deductive method, how to develop a theoretical framework, data collection methods, analysis and interpretation, and how to evaluate a research report.  Students will also be introduced to methods for correctly citing references and quoting other works without plagiarizing, infringing upon copyright or violating the rules governing proprietary information. Upon successful completion of this course, students will have completed a research proposal containing all the required, formal elements.\n\n      less description for MASY1-GC 1260 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 1300",
            "course_name": "Foundations of Human Resource Management",
            "description": "MASY1-GC 1300 Foundations of Human Resource Management",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1900",
            "course_name": "",
            "description": "MASY1-GC 1900\n\n   Research Project\n\nThe student will be introduced to the research methodology, standards, techniques and writing requirements for producing a quality Masters Thesis. The student then develops a proposal for researching a topic in a field of interest in the technology industry and upon approval works with a qualified faculty member to research and write up the topic. The finished thesis must demonstrate the student's ability to conduct comprehensive research and articulate original ideas and thought processes that make a contribution to the existing body of knowledge. Students MUST consult with their Advisor prio...\n\n      more description for MASY1-GC 1900 »\n\n      \n\n\n\nThe student will be introduced to the research methodology, standards, techniques and writing requirements for producing a quality Masters Thesis. The student then develops a proposal for researching a topic in a field of interest in the technology industry and upon approval works with a qualified faculty member to research and write up the topic. The finished thesis must demonstrate the student's ability to conduct comprehensive research and articulate original ideas and thought processes that make a contribution to the existing body of knowledge. Students MUST consult with their Advisor prior to registering for the Research Project. taken during the second year.\n\n      less description for MASY1-GC 1900 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 1901",
            "course_name": "",
            "description": "MASY1-GC 1901\n\n   Research Project Part II Thesis Write-Up\n\nThe student registers for the Thesis Seminar in which he/she is introduced to the research methodology, standards, techniques and writing requirements for producing a quality Masters Thesis.  The student then develops a proposal for researching a topic in a field of interest in the technology industry.  Upon completion of the seminar and approval of the proposal the student works with a qualified faculty member to research and write up the topic.  The finished thesis must demonstrate the student?s ability to conduct comprehensive research and articulate original ideas and thought processes tha...\n\n      more description for MASY1-GC 1901 »\n\n      \n\n\n\nThe student registers for the Thesis Seminar in which he/she is introduced to the research methodology, standards, techniques and writing requirements for producing a quality Masters Thesis.  The student then develops a proposal for researching a topic in a field of interest in the technology industry.  Upon completion of the seminar and approval of the proposal the student works with a qualified faculty member to research and write up the topic.  The finished thesis must demonstrate the student?s ability to conduct comprehensive research and articulate original ideas and thought processes that make a contribution to the existing body of knowledge. All final papers must be of an academic and research standard that is consistent with the requirements of current journals and publications.  In order to successfully complete the project, your advisor, one other reader from either academe or industry, and the department must approve your thesis.\nStudents may only commence the Research Project during their second year of study and they MUST have Advisor approval prior to registering for the thesis seminar.\nNote: Students may register for Y52.1900 and Y52.1901 either consecutively or simultaneously.\n\n      less description for MASY1-GC 1901 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3000",
            "course_name": "Cont Planning & Disaster Recovery",
            "description": "MASY1-GC 3000 Cont Planning & Disaster Recovery",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3010",
            "course_name": "",
            "description": "MASY1-GC 3010\n\n   Management of Telecommunications\n\nThe course provides an Internet centered analysis of contemporary computer communications. The goal of the course is to offer insights into the nature and scope of technical solutions underlying the Internet, paying attention to the practical constraints that influence such solutions. What is stressed is the need to understand the principles of a successful technical system, to an extent that explains why the key artifacts were built in a certain way. This explanation exemplifies the reasoning to be employed when novel communication problems are faced in order to enable students to evaluate va...\n\n      more description for MASY1-GC 3010 »\n\n      \n\n\n\nThe course provides an Internet centered analysis of contemporary computer communications. The goal of the course is to offer insights into the nature and scope of technical solutions underlying the Internet, paying attention to the practical constraints that influence such solutions. What is stressed is the need to understand the principles of a successful technical system, to an extent that explains why the key artifacts were built in a certain way. This explanation exemplifies the reasoning to be employed when novel communication problems are faced in order to enable students to evaluate various other communication settings and to anticipate trends that govern them. Topics include: fundamental concepts of data communications; communications standards including codes, protocols and network architecture; network hardware including bridges, routers and gateways; network topologies; operation of LANs, WANs, MANs; Wireless networking; sizing, monitoring and reporting; vendor solutions; and networked computer environments.  Upon the completion of the course, the student is expected to understand media used in network communications, be familiar with networking standards, protocols, and access methods; identify the primary network architectures and their major characteristics; describe techniques and tools used for internetworking, intranetworking, and interoperability; recognize computer networks as the contemporary communication setting; and understand the structure of the public Internet, as a generic datagram routing network. Use the knowledge and skills acquired to address managerial decisions related to communication technologies.\n\n      less description for MASY1-GC 3010 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3015",
            "course_name": "Information Architecture",
            "description": "MASY1-GC 3015 Information Architecture \nInformation Architecture (or IA) is a relatively new and evolving discipline of establishing navigation, functionality, information hierarchies and organization for large-scale websites. There is an ever-growing demand for more IA experts in web production. In layman's terms, IA solves websites. They provide the fundamentals of the site; yet also play a unique strategic role in how information is presented to the user. They are the user's champion yet must work diplomatically with both client and team",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3020",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2534",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3020\n\n   Enterprise Risk: Assessment & Mitigation\n\nThis course provides the student with an understanding of the importance of being able to recognize business risks and skills needed to manage them. Specific topics include the high level game plan to identify and mitigate risks, policy and guidelines, roles and responsibilities, ownership and accountability, technology risks, monitoring, reporting and resolution. Focus will be on technology risk and controls within the context of the COSO Internal Control Integrated framework and the COSO Enterprise Risk Management framework.  Upon successful completion of the course, the student will be expe...\n\n      more description for MASY1-GC 3020 »\n\n      \n\n\n\nThis course provides the student with an understanding of the importance of being able to recognize business risks and skills needed to manage them. Specific topics include the high level game plan to identify and mitigate risks, policy and guidelines, roles and responsibilities, ownership and accountability, technology risks, monitoring, reporting and resolution. Focus will be on technology risk and controls within the context of the COSO Internal Control Integrated framework and the COSO Enterprise Risk Management framework.  Upon successful completion of the course, the student will be expected to be able to conduct a risk assessment from the objective setting process through the event identification process to the actual risk, understand the different types of risks that challenge businesses today, relate to steps taken by organizations to balance risks and rewards, gain an understanding of types of controls that can be used to mitigate these risks,  be cognizant of current thinking on best practices in enterprise risk management, learn when it may be appropriate to accept risk and how to manage that acceptance, realize the importance of awareness, monitoring and reporting, and produce high level reports of business risk.\n\n      less description for MASY1-GC 3020 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3025",
            "course_name": "Internet Business Models and Strategies",
            "description": "MASY1-GC 3025 Internet Business Models and Strategies \nThe decline of mass media and the rise of the Internet have dramatically affected the ways businesses are built and achieve success. Today, tens of thousands of firms have a presence on the Internet and reach nearly 100 million users. This number will only grow. This course explores the role of internet technology in the context of corporate strategy.'",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3120",
            "course_name": "Intensive in American Business",
            "description": "MASY1-GC 3120 Intensive in American Business",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3130",
            "course_name": "Systems Auditing",
            "description": "MASY1-GC 3130 Systems Auditing",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3140",
            "course_name": "Information Security",
            "description": "MASY1-GC 3140 Information Security",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3150",
            "course_name": "Knowledge Management",
            "description": "MASY1-GC 3150 Knowledge Management",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3171",
            "course_name": "Legal Issues - Ecommerce",
            "description": "MASY1-GC 3171 Legal Issues - Ecommerce",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3172",
            "course_name": "E-Business Structures",
            "description": "MASY1-GC 3172 E-Business Structures",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3200",
            "course_name": "Database Management",
            "description": "MASY1-GC 3200 Database Management \nThis course provides a working knowledge of the logical structure and physical implementation of database management systems. Topics include: data structure concepts; the application of data models and data normalization; input and output design considerations; data administration; and client/server and distributed database systems.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3205",
            "course_name": "Network Administration",
            "description": "MASY1-GC 3205 Network Administration \nThis course provides an in-depth study of data communications and local area systems. Topics include: fundamental concepts of data communications; communications standards including codes, protocols and network architecture; bridges, routers and gateways; network topologies; operation of LANs, WANs, MANs and RAS; wireless technologies; and networked computer environments.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3210",
            "course_name": "",
            "description": "MASY1-GC 3210\n\n   Systems Development & Analysis\n\nThis course investigates the concepts and techniques used in the analysis and design of business information systems.  Topics include assessing business requirements; interviewing /testing techniques; determining the feasibility of software products; and estimating system costs.  Students analyze data flow diagrams, data models, file design, interface design, and software design.  Upon completion of this course, students will understand the key system development lifecycle approaches to system analysis and design, and how to select, plan, analyze, design, implement, and maintain modern applica...\n\n      more description for MASY1-GC 3210 »\n\n      \n\n\n\nThis course investigates the concepts and techniques used in the analysis and design of business information systems.  Topics include assessing business requirements; interviewing /testing techniques; determining the feasibility of software products; and estimating system costs.  Students analyze data flow diagrams, data models, file design, interface design, and software design.  Upon completion of this course, students will understand the key system development lifecycle approaches to system analysis and design, and how to select, plan, analyze, design, implement, and maintain modern application systems. Through collaborative learning approaches, lectures, peer-learning activities, and real-world projects, students receive a dynamic experience in developing business systems analysis documents, as well as in analyzing and designing systems.\n\n      less description for MASY1-GC 3210 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3215",
            "course_name": "",
            "description": "MASY1-GC 3215\n\n   Auditing\n\nAchieving adequate control over all the information resources of an organization is a paramount concern in the last decade of the twentieth century. As organizations have become dependent on information systems, ensuring the appropriate level of control over these systems has become more important and, in many cases, critical. Therefore, the ability to achieve adequate control over the information resources of an organization should be a top management priority. This course focuses on the standards and techniques employed in audit and control within an organization. It has been designed not on...\n\n      more description for MASY1-GC 3215 »\n\n      \n\n\n\nAchieving adequate control over all the information resources of an organization is a paramount concern in the last decade of the twentieth century. As organizations have become dependent on information systems, ensuring the appropriate level of control over these systems has become more important and, in many cases, critical. Therefore, the ability to achieve adequate control over the information resources of an organization should be a top management priority. This course focuses on the standards and techniques employed in audit and control within an organization. It has been designed not only for Audit and Systems Professionals but also for any professional who needs to meet these types of challenges.  Students and the instructor will collaborate through lectures, case studies, use of current software packages to study, analyze, and discuss the fundamental concepts of internal, operational, value-based, investigative, technology, and systems auditing. Topics will include: nature and audit of computer-related controls; general and application controls; control and audit of end-user, networked and client/server systems; and evaluating overall system efficiency and effectiveness, compliance, audit extraction software, SAS70, and CoBIT.  Upon successful completion of this course, students will have learned how to: Recognize and understand how to insure that the use and control of information technology resources are consistent with the organization's overall strategies; gain specific comprehension of basic and more advanced auditing concepts; learn how to identify and recommend key systems areas for improved controls; conduct Information System Audits in conjunction with standards set forth by the Institute of Internal Auditors.\n\n      less description for MASY1-GC 3215 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3220",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3017",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3160",
                    "section": "200",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3220\n\n   Information Security Management\n\nThis course provides the student with an opportunity to understand the importance of data and information in today's digital world and the steps required to properly protect it. Specific topics include strategy and policy, awareness, data classification, ownership and accountability, monitoring and reporting. Focus will be on network components that comprise the environment, where the data is input, processed, stored and travels through the Intranet, Extranet, and/or Internet. Upon completion of the course, the student will be expected to be able to understand the value of data in today's digi...\n\n      more description for MASY1-GC 3220 »\n\n      \n\n\n\nThis course provides the student with an opportunity to understand the importance of data and information in today's digital world and the steps required to properly protect it. Specific topics include strategy and policy, awareness, data classification, ownership and accountability, monitoring and reporting. Focus will be on network components that comprise the environment, where the data is input, processed, stored and travels through the Intranet, Extranet, and/or Internet. Upon completion of the course, the student will be expected to be able to understand the value of data in today's digital world, relate to steps taken by Government, Corporations and the Private Sector to protect this valuable asset, gain an understanding of components that comprise the network and how each provide protection, become familiar with preventative and detective tools, i.e. ACL, virus protection, cryptography, intrusion detection, audit logs, perl scripts, logical and physical controls, etc., and realize the importance of awareness, risk assessment and acceptance.\n\n      less description for MASY1-GC 3220 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3225",
            "course_name": "Adv Tpcs in Sys Mgmt: Auto Mgmt & The Semantic",
            "description": "MASY1-GC 3225 Adv Tpcs in Sys Mgmt: Auto Mgmt & The Semantic \nContainer course offered periodically that will provide the student with the opportunity to explore current issues affecting the manager in the areas of systems analysis and design, database management and design, and data and network security.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3245",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2790",
                    "section": "200",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3245\n\n   Application,Architecture Design, & Development\n\nThis course examines the concepts and principles of designing and developing applications systems in the context of the Internet and the web. The protocols and languages supporting web applications development are explored along with the techniques underlying the design and development of efficient and well-designed applications systems for today?s Internet environment. Topics covered include: Internet protocols, software components, markup languages, future technology directions. Upon completion of this course the student will have acquired an understanding of the skills, and software tools t...\n\n      more description for MASY1-GC 3245 »\n\n      \n\n\n\nThis course examines the concepts and principles of designing and developing applications systems in the context of the Internet and the web. The protocols and languages supporting web applications development are explored along with the techniques underlying the design and development of efficient and well-designed applications systems for today?s Internet environment. Topics covered include: Internet protocols, software components, markup languages, future technology directions. Upon completion of this course the student will have acquired an understanding of the skills, and software tools that are required to build advanced web-based applications systems and the requisite tools and techniques that render such systems efficient, scalable and supportable in a real-world environment.\n\n      less description for MASY1-GC 3245 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3250",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2954",
                    "section": "100",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3250\n\n   Enterprise Application Integration\n\nThis course addresses some of the major technology issues facing enterprises today, namely how to manage the integration of disparate data and applications that are resident on diverse platforms, owned by different business units, and residing in widely separated locations. Topics covered include: the elements of information management, providing applications and business process access to structured and unstructured data; structured and unstructured data integration tools, extract-transform-load, replication, data federation; operational and dimensional data; well-managed information; levels ...\n\n      more description for MASY1-GC 3250 »\n\n      \n\n\n\nThis course addresses some of the major technology issues facing enterprises today, namely how to manage the integration of disparate data and applications that are resident on diverse platforms, owned by different business units, and residing in widely separated locations. Topics covered include: the elements of information management, providing applications and business process access to structured and unstructured data; structured and unstructured data integration tools, extract-transform-load, replication, data federation; operational and dimensional data; well-managed information; levels of service; metrics and controls; service oriented architecture; propagating data and executing business processes across the enterprise network. Upon completion of this course, students will understand the concepts of enterprise information management; describe the strategies, tools and techniques to accomplish EIM; explain the concepts of enterprise application integration and how service oriented architectures can be applied to accomplishing EAI goals.\n\n      less description for MASY1-GC 3250 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3255",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2791",
                    "section": "100",
                    "period": "10/24/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3255\n\n   Business Analysis in the Enterprise\n\nThis course investigates the concepts and techniques used in business analysis throughout the development of business information systems. Topics include building a business case, eliciting, documenting, validating and managing business requirements; developing functional requirements; interviewing /testing techniques; software quality assurance; and project planning and control. Students create and analyze business requirements, estimate project work, develop a business case, and analyze data flow diagrams and models. Upon completion of this course, students will understand the key system dev...\n\n      more description for MASY1-GC 3255 »\n\n      \n\n\n\nThis course investigates the concepts and techniques used in business analysis throughout the development of business information systems. Topics include building a business case, eliciting, documenting, validating and managing business requirements; developing functional requirements; interviewing /testing techniques; software quality assurance; and project planning and control. Students create and analyze business requirements, estimate project work, develop a business case, and analyze data flow diagrams and models. Upon completion of this course, students will understand the key system development lifecycle approaches to business analysis and how to prioritize, select, plan, analyze, test, implement, and maintain modern application systems. Through collaborative learning approaches, lectures, peer-learning activities, and real-world projects, students receive a dynamic experience in understanding and performing business systems analysis in the enterprise.\n\n      less description for MASY1-GC 3255 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3300",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2936",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2535",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3300\n\n   Leadership\n\nToday's managers must act as leaders who build collaborative enterprises to enable organizations to respond quickly and efficiently to new market opportunities, new competitors, acquisitions, shifting market demographics, new technology and government regulations. Effective leaders must understand modern leadership and management strategies, capabilities and techniques and how to select the leadership style that is most effective for the organization's business objectives.  Course topics will include the following:  exploring the various theories of leadership and team development; identifying...\n\n      more description for MASY1-GC 3300 »\n\n      \n\n\n\nToday's managers must act as leaders who build collaborative enterprises to enable organizations to respond quickly and efficiently to new market opportunities, new competitors, acquisitions, shifting market demographics, new technology and government regulations. Effective leaders must understand modern leadership and management strategies, capabilities and techniques and how to select the leadership style that is most effective for the organization's business objectives.  Course topics will include the following:  exploring the various theories of leadership and team development; identifying an effective leadership style to match an organization's culture; separating leadership skills from management skills; optimizing leadership effectiveness; utilizing leadership capabilities to achieve mission critical enterprise objectives; building individual leadership capabilities; developing the leadership pipeline and institutionalizing leadership into the organization?s succession plan.  In this course, lectures, discussions, case studies, and student projects are used to explore effective leadership and team relationships.  Upon successful conclusion of the course, the student will have completed a leadership development plan for their respective organizations and will project the financial impact of such plan on both the organization's income statement and balance sheet.\n\n      less description for MASY1-GC 3300 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3305",
            "course_name": "",
            "description": "MASY1-GC 3305\n\n   Knowledge Management\n\nKnowledge is about relationships and dialog, not just access to information. The course aims to provide the student with the opportunity to explore current issues affecting the manager of knowledge workers in the information age. It involves a topical review of the theory and practice of KM in relation to the current social, organizational, and industrial environments. Topics will focus on current key issues in KM with the examination of various areas including: Communities of Practice, Advanced Taxonomies, Social/Knowledge Network Analysis, Balanced Scorecard, and Knowledge and Power in the c...\n\n      more description for MASY1-GC 3305 »\n\n      \n\n\n\nKnowledge is about relationships and dialog, not just access to information. The course aims to provide the student with the opportunity to explore current issues affecting the manager of knowledge workers in the information age. It involves a topical review of the theory and practice of KM in relation to the current social, organizational, and industrial environments. Topics will focus on current key issues in KM with the examination of various areas including: Communities of Practice, Advanced Taxonomies, Social/Knowledge Network Analysis, Balanced Scorecard, and Knowledge and Power in the context of the nature and origins of organizational knowledge, organizational learning, organizational memory, organizational capabilities and competences and knowledge work. Taking a learning-centric rather than information-centric approach, this course emphasizes the continuous acquisition and application of knowledge, and aims to build students' understanding of the impact of issues in resolving problems and taking advantage of opportunities relating to the exploration of organizational knowledge assets. There will be an emphasis in the course on collaboration rather than competition generating an experiential study of knowledge management in which the class will create knowledge in the form of papers on knowledge management, develop an evaluation system, evaluate the knowledge created, publish the information to a website, and evaluate their knowledge management. The aim is to create a community of practice and to maximize the experience of cooperation, knowledge creation, and trust in the learning environment, and to see how much can be achieved in a very intense, short amount of time because of this collaborative experience. The instructor will act as a facilitator of the creative experience rather than trying to push a personal learning agenda.   Upon successful completion of the course the student will have learned: how to define KM, learning organizations, intellectual capital and related terminologies in clear terms and understand the role of knowledge management in organizations; the best practices in corporate information search & taxonomy issues; the possibilities and limitations of collaborative software tools to support Communities of Practice; how to integrate knowledge into the enterprise; how to measure the effectiveness of KM initiatives; how to make tacit knowledge transfers easier and more effective (mentoring, capturing essential knowledge prior to retirement).\n\n      less description for MASY1-GC 3305 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3310",
            "course_name": "",
            "description": "MASY1-GC 3310\n\n   Strategic Management of Technological Innovation\n\nThis course is designed to enable the potential manager to deal with the demands of strategic planning in a technology-driven organization.  It addresses such concerns as minimizing the R&D cycle, assuring smooth transition from design to production, innovation streams, and technology and business strategy.  To study this process, the course utilizes research and tools from the fields of economics, strategy, and organizational theory. While based in research, the course is oriented towards the practical management of technology. It is heavily case-oriented and involves student participation so...\n\n      more description for MASY1-GC 3310 »\n\n      \n\n\n\nThis course is designed to enable the potential manager to deal with the demands of strategic planning in a technology-driven organization.  It addresses such concerns as minimizing the R&D cycle, assuring smooth transition from design to production, innovation streams, and technology and business strategy.  To study this process, the course utilizes research and tools from the fields of economics, strategy, and organizational theory. While based in research, the course is oriented towards the practical management of technology. It is heavily case-oriented and involves student participation so that students can focus on real world decisions such as allocation of resources, managing of complex activities, and management of teams at various levels within the organization.  Topics include: strategic maneuvering, the technology-product relationship; technology cycles and discontinuities; managing discontinuous innovation; implementing new designs; linking strategy and innovation; and building organizations? capacity to innovate.  Upon completion of the course, students will understand the role technological innovation plays in the competitive dynamics of industries; understand the basic information needed to formulate technology strategies; identify and explain the various forms of collaboration and the tradeoffs associated with each of them; acquire the basic tools necessary to analyze a company's positioning and strategies; provide an understanding of the metrics used to evaluate new product effectiveness and innovation performance.\n\n      less description for MASY1-GC 3310 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3315",
            "course_name": "Management of Emerging Technologies",
            "description": "MASY1-GC 3315 Management of Emerging Technologies \nThis course gives an in depth understanding of the issues of managing in a technological environment. Issues covered include organizational structures, human resource issues, organization cultures, and implementation strategies. The course covers the management issues related to managing various functions including research and development, marketing, operations, and management. The course uses readings, cases, discussion boards, and chat sessions. Students are required to prepare case write-ups, and write one project in which they design a start-up technology organization.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3320",
            "course_name": "Advanced Topics in Knowledge Management",
            "description": "MASY1-GC 3320 Advanced Topics in Knowledge Management \nContainer course offered periodically that will provide the student with the opportunity to explore current issues affecting the manager of knowledge workers in the information age.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3325",
            "course_name": "",
            "description": "MASY1-GC 3325\n\n   Business Strategy & Ethics\n\nStrategy is the heart and soul of any business.  The essence of business strategy is to understand your organization?s uniqueness and order-winning criteria. This course will focus on how classic strategy paradigms such as differentiation; brand creation; core competency expertise; speed to market; value migration and leadership in the areas of cost reduction, technology and innovation are linked to a sustained competitive advantage.  In addition, the course will examine how changes in the competitive landscape such as globalization, the rapid diffusion of technology, excess capacity, shifting...\n\n      more description for MASY1-GC 3325 »\n\n      \n\n\n\nStrategy is the heart and soul of any business.  The essence of business strategy is to understand your organization?s uniqueness and order-winning criteria. This course will focus on how classic strategy paradigms such as differentiation; brand creation; core competency expertise; speed to market; value migration and leadership in the areas of cost reduction, technology and innovation are linked to a sustained competitive advantage.  In addition, the course will examine how changes in the competitive landscape such as globalization, the rapid diffusion of technology, excess capacity, shifting marketplace demographics, increasing cost transparencies, the erosion of pricing power and the commoditization and unbundling of products/services; are creating both problems and unique opportunities.  Particular emphasis will be placed on the ethical dilemmas that confront managers due to advances in technology, greater access to information, and more collaborative ventures that break down traditional proprietary boundaries. Given the recent wave of ethical lapses in business, students will be sensitized to the ethical considerations in any given decision-making scenario. Utilizing lectures, assigned readings, small group projects, case studies and simulations, the students will become proficient at business strategy analysis, creation and implementation within an ethical framework.  A final class project will involve the creation of an Individualized Business Strategy Analysis and Action Plan, which applies the techniques learned during the course to any business selected by the student.  Upon successful completion of the course, students will be expected to understand classic and innovative strategy paradigms and how to formulate and implement them under ethical guidelines. Students should also gain knowledge of competitive landscapes and the critical alignment between business strategy and human resources strategy.\n\n      less description for MASY1-GC 3325 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3330",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2536",
                    "section": "100",
                    "period": "10/24/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3330\n\n   Managing Complex Change Initiatives\n\nChange is everywhere, constant and increasing in frequency, magnitude and complexity.  Leaders, managers, and workplace professionals are expected to manage change on three levels: individually, in teamwork, and organizationally. Complacency is considered a barrier to progress and resiliency is becoming a core competency.  Workplace professionals are expected to be collaboratively responsive in an expeditious manner. The focus of this course will be to manage change, and recognize how individuals, teams, and organizations so do.  Presentations, interactive dialogues, assigned readings, video, ...\n\n      more description for MASY1-GC 3330 »\n\n      \n\n\n\nChange is everywhere, constant and increasing in frequency, magnitude and complexity.  Leaders, managers, and workplace professionals are expected to manage change on three levels: individually, in teamwork, and organizationally. Complacency is considered a barrier to progress and resiliency is becoming a core competency.  Workplace professionals are expected to be collaboratively responsive in an expeditious manner. The focus of this course will be to manage change, and recognize how individuals, teams, and organizations so do.  Presentations, interactive dialogues, assigned readings, video, case studies, and student projects will be used to explore structural, process, technological, and human change dynamics.  Students will look at examples of small to large companies that have implemented change strategy and actions ? some successfully, others not. This is a highly interactive course that moves from awareness, knowledge acquisition and progress, to synthesis and application of behavioral practices. Topics include (but are not limited to) dimensions of change, organizational development/change models and theories, success factors, readiness and assessment tools for self, individual, and organizational audit, culture, actions and behaviors that model best practices, using metrics to benchmark progress, complacency conflicts, competencies, successfully leveraging change and developing initiatives to foster positive attitudes among workplace professionals toward change management.  Best practices theories such as Kotter?s 8 Step Model, Bridges Three Zones for Transition and Renewal, Abrahamson?s Creative Recombination approach, and Conner?s Resiliency Reflections will all be included. Alternative theories and practices will also be introduced.  Upon successful completion of the course, the student will be expected to have mastered the essentials of, and perspectives on, defining change, transitional change, transformational change, and various aspects of building proactive and positive teams and coalitions for sponsorship (as well as such teams? impact on complex change activities and other organizational activities).\n\n      less description for MASY1-GC 3330 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3335",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2537",
                    "section": "200",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3335\n\n   Strategic Communications\n\nA vital function of any professional is to be able to communicate accurately and effectively.  This course will focus on interdisciplinary activities including strategic communications planning, crisis avoidance and crisis communications planning, and an overview of Integrated Communications.  Students will learn how to approach one of the most difficult tasks facing corporate communicators today: how to pull together all the internal and external communications initiatives, from press releases to advertising, that impact various constituencies in terms of their awareness, attitudes and behavi...\n\n      more description for MASY1-GC 3335 »\n\n      \n\n\n\nA vital function of any professional is to be able to communicate accurately and effectively.  This course will focus on interdisciplinary activities including strategic communications planning, crisis avoidance and crisis communications planning, and an overview of Integrated Communications.  Students will learn how to approach one of the most difficult tasks facing corporate communicators today: how to pull together all the internal and external communications initiatives, from press releases to advertising, that impact various constituencies in terms of their awareness, attitudes and behavior.  Governance and disclosure principles are overviewed.  This is a highly practical course that begins with an evaluation of student-submitted writing samples and a benchmark oral presentation. Students will learn and practice proven techniques for writing e-mails, memoranda and policy documents. In addition, they will learn, practice and integrate the key components of making powerful and persuasive oral presentations.  Key topics for oral presentations include body energy (stance, posture, eye contact and gestures), vocal energy (voice volume, pace and voice inflection) and content (message text and use of visual aides such as graphs, charts and slides).   Key topics for written communications include developing your personal tone and style, planning and organizing your written message, identifying and clarifying the strategic message, creating sentences that are clear and readable, and reviewing and editing your writing. Upon successful completion of this course, students should be able to focus on the key strategic message; manage work and business relationships using the written word; write in clear language; and make the writing process faster and more comfortable.  In addition, students will be able to design, create and deliver oral presentations to a small group and manage the ensuing question and answer session.\n\n      less description for MASY1-GC 3335 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3400",
            "course_name": "I-Commerce",
            "description": "MASY1-GC 3400 I-Commerce \nThis course introduces the role of information technology in supporting organization decision-making and strategic planning for conducting business in a click and mortar world. Topics include: electronic commerce; hardware and software components of commerce-enabled Web sites; the impact of the internet on corporate strategies; online payment strategies; and the integration of traditional business fundamentals with the realities of today's virtual economy.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3405",
            "course_name": "",
            "description": "MASY1-GC 3405\n\n   Customer Centric Mgmt Strategies\n\nThis course is intended for individual with a basic background in marketing: database direct and other disciplines of traditional offline - online marketing. A basic knowledge of the Internet and how it interfaces with other marketing channels would be useful to grasping the practical approaches that will be presented in this course. The course covers topics such as why marketing organizations require a CRM strategy, how to develop a CRM strategy, an assessment of CRM today, CRM technologies, and integration into existing business models. Students will work with interactive sessions and projec...\n\n      more description for MASY1-GC 3405 »\n\n      \n\n\n\nThis course is intended for individual with a basic background in marketing: database direct and other disciplines of traditional offline - online marketing. A basic knowledge of the Internet and how it interfaces with other marketing channels would be useful to grasping the practical approaches that will be presented in this course. The course covers topics such as why marketing organizations require a CRM strategy, how to develop a CRM strategy, an assessment of CRM today, CRM technologies, and integration into existing business models. Students will work with interactive sessions and projects (forming project teams if possible) and will complete the course with knowledge and skills applicable to their professional experience.\n\n      less description for MASY1-GC 3405 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3410",
            "course_name": "E-Business Structures",
            "description": "MASY1-GC 3410 E-Business Structures \nThis course provides the student with the opportunity to learn the technical concepts and architectural structure of electronic business. The course will focus on business networks and internetworking; internet application protocols and concepts; electronic data interchange, advanced internet tools for electronic commerce, techniques and trouble shooting of distributing information goods, security, payment schemes, and database considerations.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3420",
            "course_name": "Adv Tpcs in Ebusiness: Tec & The Co-Creation of",
            "description": "MASY1-GC 3420 Adv Tpcs in Ebusiness: Tec & The Co-Creation of",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3500",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2538",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3500\n\n   Database Design & Management\n\nThis is an introductory course for database management systems and applications. It discusses concepts, methodologies, and techniques important for database analysis, design, implementation, and management. The course focuses on the logical, conceptual and physical implementation of relational database management systems so that students can assimilate a basic knowledge of database design as it relates to business rules.  Upon completion of this course, students will understand the relational database model; explain the considerations and choices available for achieving data integrity; the rol...\n\n      more description for MASY1-GC 3500 »\n\n      \n\n\n\nThis is an introductory course for database management systems and applications. It discusses concepts, methodologies, and techniques important for database analysis, design, implementation, and management. The course focuses on the logical, conceptual and physical implementation of relational database management systems so that students can assimilate a basic knowledge of database design as it relates to business rules.  Upon completion of this course, students will understand the relational database model; explain the considerations and choices available for achieving data integrity; the role of normalization in providing efficiencies and data integrity; the tools and techniques for transforming business requirements into viable, efficient, and reliable databases aligned with business requirements. The course utilizes a combination of lectures, hands-on computer exercises, examples from Oracle and other leading databases, and real-world database projects to accomplish the learning process. Topics include: data structure concepts; the application of data models and data normalization; data integrity, referential integrity, input and output design considerations; SQL database data definition and data manipulation languages; data administration; client/server, Internet and distributed database systems.\n\n      less description for MASY1-GC 3500 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3505",
            "course_name": "",
            "description": "MASY1-GC 3505\n\n   Data Process and Structure\n\nThis course examines database models from a managerial perspective with an in-depth focus on business data requirements, operational rules, procedures, and logical structure.  Using a case study method and real-world exercises, students research and present real world scenarios and develop automated business process solutions through evaluation and discussion.  Upon successful completion of this course the student will have gained a comprehensive knowledge and understanding of data process and structures, database design and database management. Topics covered include: relational algebra and c...\n\n      more description for MASY1-GC 3505 »\n\n      \n\n\n\nThis course examines database models from a managerial perspective with an in-depth focus on business data requirements, operational rules, procedures, and logical structure.  Using a case study method and real-world exercises, students research and present real world scenarios and develop automated business process solutions through evaluation and discussion.  Upon successful completion of this course the student will have gained a comprehensive knowledge and understanding of data process and structures, database design and database management. Topics covered include: relational algebra and calculus, SQL queries, and business rules; database applications and Internet applications; indexing, disks and files; query evaluation; external sorting, evaluating relational operators; the query optimizer; transactional management and concurrency control; recovery.\n\n      less description for MASY1-GC 3505 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3510",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "17729",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3510\n\n   Data Mining and Data Warehousing\n\nIn the competitive information age, data mining and data warehousing are increasingly essential in business decision-making. Although outsourcing is available and in-house personnel may not be very proficient, many organizations are already implementing and will continue to implement data mining and data warehousing technologies internally because of information security concerns and the administrative convenience of in-sourcing. This course teaches students concepts, methods and skills for mining data warehouses for the best competitive business strategy. It also develops analytical thinking ...\n\n      more description for MASY1-GC 3510 »\n\n      \n\n\n\nIn the competitive information age, data mining and data warehousing are increasingly essential in business decision-making. Although outsourcing is available and in-house personnel may not be very proficient, many organizations are already implementing and will continue to implement data mining and data warehousing technologies internally because of information security concerns and the administrative convenience of in-sourcing. This course teaches students concepts, methods and skills for mining data warehouses for the best competitive business strategy. It also develops analytical thinking to identify the strategy. The course utilizes lectures, readings, problems and case studies, and a data warehouse project. Upon the completion of this course, students will be able to apply and use various methods and techniques for mining the warehouse and using the resultant information for business decision-making.\n\n      less description for MASY1-GC 3510 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3515",
            "course_name": "Application Servers",
            "description": "MASY1-GC 3515 Application Servers \nThe Database Application Server resides in the middle tier of an information system, and is an area of IT that is currently in high demand. Application Servers handle the processes in an application environment and improve system performance by reducing network traffic and increasing speed.  Upon the completion of this course, students will be familiar with functions and techniques of the data application server, and be comfortable with working in an application server environment.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3520",
            "course_name": "",
            "description": "MASY1-GC 3520\n\n   Database Applications\n\nThis course introduces a variety of databases and database technologies and introduces the theory, techniques, and technologies that facilitate utilizing these technologies to enable complex data-drive applications. It covers the basic concepts and skill sets of Sybase, SQL server, DB2, and Oracle, and compares and contrasts the facilities, options, and syntaxes available in each platform. A hands-on, computer lab approach is used in conjunction with lectures and real-world examples to provide the student with a thorough understanding of the similarities and differences of relational database ...\n\n      more description for MASY1-GC 3520 »\n\n      \n\n\n\nThis course introduces a variety of databases and database technologies and introduces the theory, techniques, and technologies that facilitate utilizing these technologies to enable complex data-drive applications. It covers the basic concepts and skill sets of Sybase, SQL server, DB2, and Oracle, and compares and contrasts the facilities, options, and syntaxes available in each platform. A hands-on, computer lab approach is used in conjunction with lectures and real-world examples to provide the student with a thorough understanding of the similarities and differences of relational database options. Upon completion of this course, students will be able to understand the differences between several leading relational database management systems and evaluate their respective advantages and disadvantages.  This will enable them to make the appropriate business decisions when considering choices among multiple database and database technology options in order to satisfy real-word business and technology considerations.\n\n      less description for MASY1-GC 3520 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3525",
            "course_name": "",
            "description": "MASY1-GC 3525\n\n   Advanced Database Applications\n\nThis intensive, lab-based course focuses on database language. It covers hands-on development in SQL and PL/SQL, as well as Java and XML. The course covers the important features of Oracle, an Internet-oriented, object-relational database. It introduces new Oracle features, and covers PL/SQL program tracing and tuning. SQL*Plus, Oracle?s character-based interface, is introduced and used. Students will learn to create and maintain databases; store, retrieve, and manipulate data; write stored procedures, functions and triggers; create PL/SQL procedures, functions and packages utilizing PL/SQL li...\n\n      more description for MASY1-GC 3525 »\n\n      \n\n\n\nThis intensive, lab-based course focuses on database language. It covers hands-on development in SQL and PL/SQL, as well as Java and XML. The course covers the important features of Oracle, an Internet-oriented, object-relational database. It introduces new Oracle features, and covers PL/SQL program tracing and tuning. SQL*Plus, Oracle?s character-based interface, is introduced and used. Students will learn to create and maintain databases; store, retrieve, and manipulate data; write stored procedures, functions and triggers; create PL/SQL procedures, functions and packages utilizing PL/SQL libraries; manipulate XML contents; write and call Java programs from and within the database; and publish HTML pages using PL/SQL This course is for application developers and system integrators with knowledge of basic relational concepts. The course is heavily lab-based, with approximately 50% allocated to hands-on exercises. Students practice to design, develop, and implement a relational Oracle database and use the database for transaction processing, report generation, and queries. A term assignment is implemented step-wise as part of regular assignments. Upon completion of this course students should be adept at writing SQL and PL/SQL codes for diverse applications in the relational database environment.\n\n      less description for MASY1-GC 3525 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3530",
            "course_name": "",
            "description": "MASY1-GC 3530\n\n   Object-Oriented Systems Design\n\nThis course addresses the concepts, skills, methodologies, techniques, tools and perspectives essential for system analysts and designers to successfully develop information systems in the object-oriented context.  The course presents the concepts of the object-oriented approach, and describes a systems development lifecycle framework that is applicable to the analysis and design of object-oriented application systems. An in-depth treatment of analysis and design are covered, followed by systems implementation and operation. Upon completion of this course, students are expected to be capable o...\n\n      more description for MASY1-GC 3530 »\n\n      \n\n\n\nThis course addresses the concepts, skills, methodologies, techniques, tools and perspectives essential for system analysts and designers to successfully develop information systems in the object-oriented context.  The course presents the concepts of the object-oriented approach, and describes a systems development lifecycle framework that is applicable to the analysis and design of object-oriented application systems. An in-depth treatment of analysis and design are covered, followed by systems implementation and operation. Upon completion of this course, students are expected to be capable of analyzing IT system structures, modeling information processes, and designing / redesigning IT systems using object-oriented tools. The course utilizes a combination of lectures, hands-on computer lab exercises, group activities, and real-world projects to accomplish the learning process. Topics include: The object-oriented systems development environment; managing the object-oriented IT project; determining and structuring user requirements through use cases, conceptual data modeling,  and object relational modeling; design strategies; and physical design.\n\n      less description for MASY1-GC 3530 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3535",
            "course_name": "Management of The Enterprise",
            "description": "MASY1-GC 3535 Management of The Enterprise \nThis course is a high-level managerial course.  Integrating information, technology and people to manage an enterprise is the predominant challenge facing many businesses. This course takes existing managerial concepts, tools and basic skills and, using industry case studies, develops them into totally integrated techniques ready to answer the demands facing organizations in the new millennium.  Upon completion of this course, students are expected to have a strong command of the salient topics in enterprise resource management, knowledge management and customer relationship management.",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3540",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2792",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3540\n\n   Database Technologies for Web Applications\n\nThis course examines the database and related applications technologies that have come to be critical in the enablement of web-based applications for e-commerce in its many variations. This lab-based course provides an in-depth study of using database technologies in the context of the Internet, including Oracle, and open source variations such as MySQL; the role of related scripting languages such as PHP. Also covered are the theory and practice involved in dynamic, database driven web-sites that are controlled using CSS and other web-enabling artifacts. Upon completion of this course, the st...\n\n      more description for MASY1-GC 3540 »\n\n      \n\n\n\nThis course examines the database and related applications technologies that have come to be critical in the enablement of web-based applications for e-commerce in its many variations. This lab-based course provides an in-depth study of using database technologies in the context of the Internet, including Oracle, and open source variations such as MySQL; the role of related scripting languages such as PHP. Also covered are the theory and practice involved in dynamic, database driven web-sites that are controlled using CSS and other web-enabling artifacts. Upon completion of this course, the student will understand the features of page scripting languages; understand the database options available for the web-based applications; explain how these can be combined with each other and with additional web-based tools to create effective web-based applications.\n\n      less description for MASY1-GC 3540 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3600",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17728",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3600\n\n   Operational & Financial Risk Analysis\n\nIn today?s ever-changing and risk-oriented work, insurance plays a very vital role in protecting against unforeseen problems.  To most people, insurance is a matter of writing a check once a month and hopefully never having to file a claim.  But the inner workings of the insurance industry are quite complex given our current economic environment.  Gone are the days of simply investing in bonds and matching durations.  Today?s environment requires a far more complex Asset Liability Management ('ALM') structure to help quantify and manage risk.  This course is is intended to provide an introduct...\n\n      more description for MASY1-GC 3600 »\n\n      \n\n\n\nIn today?s ever-changing and risk-oriented work, insurance plays a very vital role in protecting against unforeseen problems.  To most people, insurance is a matter of writing a check once a month and hopefully never having to file a claim.  But the inner workings of the insurance industry are quite complex given our current economic environment.  Gone are the days of simply investing in bonds and matching durations.  Today?s environment requires a far more complex Asset Liability Management ('ALM') structure to help quantify and manage risk.  This course is is intended to provide an introduction into what risk management means in the insurance industry.  At the end of the course, students will be expected to have learned the fundamental financial tools and techniques necessary to be an effective risk manager in the insurance industry.  Topics include (but are not limited to) accounting/finance theories and concepts; time value of money, financial product knowledge, risk management terms and techniques, operational risk management, ALM, and actuarial sciences. Students will learn fundamental financial concepts through real world group assignments, problem solving and term projects. The student who successfully completes this course will have the ability to: understand the fundamental concepts of financial products including both cash products and their respective derivatives, asset liability management, and actuarial sciences as well as fully understand the operational, legal and regulatory issues that affect the insurance industry.\n\n      less description for MASY1-GC 3600 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3605",
            "course_name": "",
            "description": "MASY1-GC 3605\n\n   Financial Services & Trading Institutions\n\nGiven the events of the last several years, risk management has been moved from the back rooms to the forefront of the business world.  Every year companies are spending more to understand and better manage their risk.  This course will look at risk management from both the sell-side investment bank perspective as well as the buy-side hedge fund asset manager view.  It is intended to provide an introduction into what risk management means in each of these types of institution.  At the end of the course, students will be expected to have learned the fundamental financial tools and techniques ne...\n\n      more description for MASY1-GC 3605 »\n\n      \n\n\n\nGiven the events of the last several years, risk management has been moved from the back rooms to the forefront of the business world.  Every year companies are spending more to understand and better manage their risk.  This course will look at risk management from both the sell-side investment bank perspective as well as the buy-side hedge fund asset manager view.  It is intended to provide an introduction into what risk management means in each of these types of institution.  At the end of the course, students will be expected to have learned the fundamental financial tools and techniques necessary to be an effective risk manager.  Topics include (but are not limited to) accounting/finance theories and concepts; time value of money, financial product knowledge, risk management terms and techniques, and operational risk management. Students will learn fundamental financial concepts through real world group assignments, problem solving and term projects.  The student who successfully completes this course will have the ability to understand: the fundamental concepts of financial products including both cash products and their respective derivatives, the methodologies for pricing and valuation, the fundamental risk management strategies at both a micro and macro level, the fundamental risk measurement (P&L attribution, Value at Risk (VaR), and the operational risk issues that effect financial and trading institutions.\n\n      less description for MASY1-GC 3605 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3610",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2539",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3610\n\n   Enterprise Ethics & Sustainability\n\nThis course will provide an overview of the broad range of Ethical Risks inherent with the explosive growth of the global economy. The core focus of the class is in defining, discussing, and addressing the unique regulatory, cultural, and personal ethical dilemmas confronted by managers in the world economy of the twenty first century.   Many nuances and realities of formal (regulatory), global (cultural), and personal ethical risks will be presented for discussion and debate.  Case study examples will be addressed, including but not limited to, Lockheed, MCI, the Cuban Embargo, the South Afri...\n\n      more description for MASY1-GC 3610 »\n\n      \n\n\n\nThis course will provide an overview of the broad range of Ethical Risks inherent with the explosive growth of the global economy. The core focus of the class is in defining, discussing, and addressing the unique regulatory, cultural, and personal ethical dilemmas confronted by managers in the world economy of the twenty first century.   Many nuances and realities of formal (regulatory), global (cultural), and personal ethical risks will be presented for discussion and debate.  Case study examples will be addressed, including but not limited to, Lockheed, MCI, the Cuban Embargo, the South African and Israeli trade embargoes, and the Iraq oil for food embargoes. Postulation of example risks will be offered as stimulation for the student?s individual development of avoidance and/or resolution methodologies.  Formal and informal student classroom interaction will be crucial to stimulating the sharing of actual day to day business related ethical dilemmas. Classroom discussions will provide the baselines for identifying potential ethical conflicts that can be faced by managers as they manage cross-border, cross cultural and multi-ethnic organizations.   Development of possible resolutions will be proposed, dissected, evaluated and debated, within the parameters of both experienced and theoretical, ethically conflicting business situations.  Upon successful completion of this course, students will have gained a broad understanding of the existence of Ethical Risks, (regulatory, global and personal), in business, the skills with which to evaluate the impact of conflicting ethics on the geopolitical landscape, and a solid foundation for recognizing the need for both personal awareness of, and adjustment to, ethical risks in a global economy.\n\n      less description for MASY1-GC 3610 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3615",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2540",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 3615\n\n   Crisis Management & Business Continuity\n\nWith the introduction of a National Standard for crisis management and emergency preparedness, and incentives to promote its adoption, organizations will immediately require training and other resources to develop new emergency programs where there are none, to evaluate and revise existing programs, and to maintain programs on an ongoing basis. This course focuses on the business decisions and management processes necessary to anticipate, plan for, manage, communicate about, and recover from crises affecting corporations and other complex organizations.  It will also cover the key component st...\n\n      more description for MASY1-GC 3615 »\n\n      \n\n\n\nWith the introduction of a National Standard for crisis management and emergency preparedness, and incentives to promote its adoption, organizations will immediately require training and other resources to develop new emergency programs where there are none, to evaluate and revise existing programs, and to maintain programs on an ongoing basis. This course focuses on the business decisions and management processes necessary to anticipate, plan for, manage, communicate about, and recover from crises affecting corporations and other complex organizations.  It will also cover the key component steps for the development of a corporate Business Continuity Plan as a vital part of the day to day operations of enterprises.   Additionally, it will examine the way companies in distress and the constituencies who matter to those companies predictably behave when things go wrong.  Underlying the tangible structural components of the course, there will be a continued emphasis on the fact that crisis management is an ongoing process, rather than a one time review of the individual corporations? operational requirements. Topics covered will include: The Crisis Environment Awareness and Training; Exercising & Maintaining Programs; Implementation Strategies & Issues; Emergency Preparedness & Response; Hazard Mitigation; Crisis Communications; Direction, Control & Coordination; Operations & Procedures; Logistics & Facilities; Recovery and continuity planning; Psychology paradigms in pre, during and post-crisis phases; Crisis Leadership; Integration of Multiple Disciplines, Functions and Organizational Constituencies; Performance Assessment; Current & Evolving Strategies and Insights in Crisis Management.  Through a combination of lectures, discussions, case studies, role-play, and a final project that consists of a crisis management plan to protect a company undergoing a crisis, students will be able to identify and implement the various plan development methodologies available today and be ready to develop and manage systems to establish protocols, processes, and structures to prevent damage and business interruption, and to restore operations in the event of a natural disaster.  Upon successful completion of the course, students will have learned how to recognize and appreciate the dynamics of crisis management including the processes involved in identifying areas of highest business interruption risk, the methodologies for calculating minimum recovery times for both systems and basic operations how to identify and address the key components necessary for the development and implementation of a viable crisis management program including a Business Continuity plan. They will have familiarity with the existence of numerous plan development software tools and they will have reviewed examples of existing plans.\n\n      less description for MASY1-GC 3615 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 3900",
            "course_name": "Independent Study",
            "description": "MASY1-GC 3900 Independent Study",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 3910",
            "course_name": "Internship",
            "description": "MASY1-GC 3910 Internship",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 4000",
            "classes": [
                {
                    "format": "Distance Learning Hybrid",
                    "class_id": "2542",
                    "section": "200",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Distance Learning Hybrid",
                    "class_id": "2937",
                    "section": "201",
                    "period": "09/09/2015 - 12/02/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 4000\n\n   Research Project: Thesis\n\nUpon approval of a proposal the student works with a qualified faculty member to research and write up a thesis on a topic in his/her selected concentration area.  The finished thesis must demonstrate the student's ability to conduct comprehensive research and articulate original ideas and thought processes that make a practical contribution to the existing body of knowledge in the fields of management and systems. All final papers must be of an academic and research standard that is consistent with the requirements of current journals and publications.  In order to successfully complete the p...\n\n      more description for MASY1-GC 4000 »\n\n      \n\n\n\nUpon approval of a proposal the student works with a qualified faculty member to research and write up a thesis on a topic in his/her selected concentration area.  The finished thesis must demonstrate the student's ability to conduct comprehensive research and articulate original ideas and thought processes that make a practical contribution to the existing body of knowledge in the fields of management and systems. All final papers must be of an academic and research standard that is consistent with the requirements of current journals and publications.  In order to successfully complete the project, the student's supervisor, one other reader from either academe or industry, and the department must approve the thesis.\n\n      less description for MASY1-GC 4000 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 4005",
            "course_name": "Research Project: Thesis Extension",
            "description": "MASY1-GC 4005 Research Project: Thesis Extension",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 4100",
            "classes": [
                {
                    "format": "Distance Learning Hybrid",
                    "class_id": "2544",
                    "section": "300",
                    "period": "09/08/2015 - 12/08/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Applied Project",
            "description": "MASY1-GC 4100 Applied Project \nWhere academically warranted and subject to departmental approval, the student will undertake and deliver a real-world project for active practitioners in the field. Under the direction of a faculty supervisor, the student will select and explore a topic to be developed.  The student will then be required to generate a practical application of his/her findings that demonstrates professional level mastery of the subject matter involved.  The project will be reviewed by the faculty supervisor and one other expert in the field.",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 4105",
            "course_name": "Applied Project: Extension",
            "description": "MASY1-GC 4105 Applied Project: Extension",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 4200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17727",
                    "section": "100",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3148",
                    "section": "200",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MASY1-GC 4200\n\n   Innovation & Entrepreneurship\n\nCourse description: Every business starts with an idea. Often the development of the idea brings improvement or change to existing processes or products. Sometimes the result is so radically different it creates something new that did not exist.  Innovation has been at the heart of human development from the very beginning when fire was harnessed and the wheel was conceived. Innovative thinking has helped people evolve from self-reliant survivors to participants in the global community.  An entrepreneur plans a new business based on an idea, manages it, and assumes the risks of growing it, wit...\n\n      more description for MASY1-GC 4200 »\n\n      \n\n\n\nCourse description: Every business starts with an idea. Often the development of the idea brings improvement or change to existing processes or products. Sometimes the result is so radically different it creates something new that did not exist.  Innovation has been at the heart of human development from the very beginning when fire was harnessed and the wheel was conceived. Innovative thinking has helped people evolve from self-reliant survivors to participants in the global community.  An entrepreneur plans a new business based on an idea, manages it, and assumes the risks of growing it, with the intention of earning a profit.  The entrepreneur needs to plan for every business function including, but not limited to: planning processes, staffing, raising funds, marketing, and assuring good financial practices and reporting. This course teaches students how to develop a structured business plan using entrepreneurial best-practices to integrate their innovative concept and capitalize on their opportunity.\n\n      less description for MASY1-GC 4200 «",
            "offering": true
        },
        {
            "course_id": "MASY1-GC 4500",
            "course_name": "",
            "description": "MASY1-GC 4500\n\n   Information & Interface Design\n\nUnlike print, material published electronically is dynamic and includes links that pull new information on to the screen. These hyperlinks add new dimension to publishing, that of controlling the experience of users as they navigate through the site. This course covers the theory and application of techniques used in online publishing, specifically those used on the Web, with an emphasis on site architecture, usability, and interface design.  The result - a Website, CD-ROM, or software application ? that meets the needs of end users. Learn to ensure that sites deliver maximum value to the visi...\n\n      more description for MASY1-GC 4500 »\n\n      \n\n\n\nUnlike print, material published electronically is dynamic and includes links that pull new information on to the screen. These hyperlinks add new dimension to publishing, that of controlling the experience of users as they navigate through the site. This course covers the theory and application of techniques used in online publishing, specifically those used on the Web, with an emphasis on site architecture, usability, and interface design.  The result - a Website, CD-ROM, or software application ? that meets the needs of end users. Learn to ensure that sites deliver maximum value to the visitor by offering a deceptively simple yet consistently rewarding experience. Prerequisite: This is not a lab course, although some familiarity with creating website is helpful.\n\n      less description for MASY1-GC 4500 «",
            "offering": false
        },
        {
            "course_id": "MASY1-GC 5000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19434",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015",
                    "location": "Yalt, Engin",
                    "time": "Tue,Thu 6.30 PM - 9.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Special Topics:Managing Big Data",
            "description": "MASY1-GC 5000 Special Topics:Managing Big Data \nThis seminar will enhance curriculum by identification, analysis and application of special topics pertinent to the Management and Systems degree. The specific titles and content of each seminar will change to reflect emerging areas of interest, which can only be determined at the time of offering.  The course may be used to satisfy the elective degree requirement.  Applicability to specific concentrations will be noted in the course schedule and is at the department’s discretion.",
            "offering": true
        }
    ]
}