{
    "major_id": "MCC-GE",
    "file": "./2015-2016/Media,_Culture_&_Communication_(MCC-GE).html",
    "courses": [
        {
            "course_id": "MCC-GE 2001",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3640",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 741",
                    "time": "Wed 11.00 AM - 1.10 PM",
                    "open": true,
                    "professor": "Scherzinger, Martin"
                },
                {
                    "format": "Seminar",
                    "class_id": "3641",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 741",
                    "time": "Wed 2.00 PM - 4.10 PM",
                    "open": true,
                    "professor": "Scherzinger, Martin"
                },
                {
                    "format": "Seminar",
                    "class_id": "3642",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 741",
                    "time": "Mon 4.55 PM - 7.05 PM",
                    "open": true,
                    "professor": "Robles, Erica"
                }
            ],
            "course_name": "Media, Culture and Communication Core",
            "description": "MCC-GE 2001 Media, Culture and Communication Core \nExamines theoretical approaches that are central to the study of media, culture, and communication. provides students with a historical and critical framework for understanding the literature and research traditions within the field of media studies with an emphasis on media and communication as institutional actors, technological artifacts, systems of representation and meaningful cultural objects.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2005",
            "course_name": "The Psychic Life of Media",
            "description": "MCC-GE 2005 The Psychic Life of Media",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2010",
            "course_name": "",
            "description": "MCC-GE 2010\n\n   Censorship in American Culture\n\nThis course examines censorship in American culture, from the late 19th century to the present and surveys areas where debates about censorship have been urgently contested, from discussion about birth control, to literature, film, theater, art galleries and history museums, to public sidewalks, lecture halls, to the internet. students will explore the historical contexts in which important cultural and legal struggles over censorship took place, and how this history effects contemporary debates about the arts, sexuality, national security, technology, privacy, and government involvement in th...\n\n      more description for MCC-GE 2010 »\n\n      \n\n\n\nThis course examines censorship in American culture, from the late 19th century to the present and surveys areas where debates about censorship have been urgently contested, from discussion about birth control, to literature, film, theater, art galleries and history museums, to public sidewalks, lecture halls, to the internet. students will explore the historical contexts in which important cultural and legal struggles over censorship took place, and how this history effects contemporary debates about the arts, sexuality, national security, technology, privacy, and government involvement in the marketplace of ideas and images.\n\n      less description for MCC-GE 2010 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2024",
            "course_name": "Amateur Media",
            "description": "MCC-GE 2024 Amateur Media \nThis course will track the various manifestations of media amateurism over time & medium, while also exploring theoretical concerns & cultural discourses that surround their work & social construction, especially in relation to notions of professionalism, community, networks, artistic practice, collectivism, & marginalization.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2025",
            "course_name": "Race and Media",
            "description": "MCC-GE 2025 Race and Media \nThis course focuses on the ways that media have shaped public discourse about race and racism both within and beyond the confines of the United States. The course considers a variety of media - television sitcoms and drama, television and print news, film, popular music, the internet and others - for the purpose of investigating how media have and continue to variably influence the public's 'racial agenda,' and the general content, tone and tenor of racial conversation in the public sphere.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2027",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17539",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 741",
                    "time": "Mon 11.00 AM - 1.10 PM",
                    "open": true,
                    "professor": "Mirzoeff, Nicholas"
                }
            ],
            "course_name": "",
            "description": "MCC-GE 2027\n\n   Media and the Enviroment\n\nThis course investigates the ways human & natural environments have been shaped by media representations & technologies, extending from newspapers, photography, & popular literature, to film, television, & video games. Integrating eco-cinema, eco-criticism, environmental communication, & environmental studies, the course explores how environments are represented in visual media through different historical & social contexts, beginning with the rise of landscape photography, scientific representations of nature, & “fictional” wildlife films, to environmental media works in the 1960s to the role...\n\n      more description for MCC-GE 2027 »\n\n      \n\n\n\nThis course investigates the ways human & natural environments have been shaped by media representations & technologies, extending from newspapers, photography, & popular literature, to film, television, & video games. Integrating eco-cinema, eco-criticism, environmental communication, & environmental studies, the course explores how environments are represented in visual media through different historical & social contexts, beginning with the rise of landscape photography, scientific representations of nature, & “fictional” wildlife films, to environmental media works in the 1960s to the role of contemporary interactive & “recycling” based aesthetics.\n\n      less description for MCC-GE 2027 «",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2030",
            "course_name": "Architecture as Media:",
            "description": "MCC-GE 2030 Architecture as Media: \nThis class reads architecture and the built environment through the lenses of media, communication, and culture. Through analyses of a range of spaces - from Gothic cathedrals to suburban shopping malls to homes, factories, skyscrapers and digital cities - students will acquire a vocabulary  for relating representations and practices, symbols and structures, and for identifying the ideological and aesthetic positions that produce settings for everyday life.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2100",
            "course_name": "Sem in Media Criticism",
            "description": "MCC-GE 2100 Sem in Media Criticism \nAnalysis of the media environment from a variety of critical perspectives. Emphasis on writing as well as reading media criticism.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2105",
            "course_name": "Advanced Issues in Nonverbal Communication",
            "description": "MCC-GE 2105 Advanced Issues in Nonverbal Communication \nThe goal of this course is to provide a theoretical framework for the study of nonverbal communication in its various forms, i.e., how humans use time, space, body movement, touch, vocal cues, facial expression, and objects to communicate.  Students read the works of pioneers in the field and selected current research in nonverbal communication in order to gain an understanding of the literature and uncover areas for future research.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2112",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3643",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GODD B04",
                    "time": "Mon 4.55 PM - 7.05 PM",
                    "open": true,
                    "professor": "Feldman, Allen"
                }
            ],
            "course_name": "",
            "description": "MCC-GE 2112\n\n   Politics of The Gaze: Sensory Formations Mod\n\nThe meditation and technological development of vision and its dominance over the human sensorium is integral to the emergence of the modern, including experiences of urbanism, consumer desire, gender/sexual identities, race and ethnicity, trans-cultural image systems, aesthetic production, and the making of power and political truth claims. This seminar will focus on introducing participants to the core theories and analytic methods of visual culture, and the socio-political history of the human sensorium in a variety of disciplines, including ethnography, social history, urban studies, cinem...\n\n      more description for MCC-GE 2112 »\n\n      \n\n\n\nThe meditation and technological development of vision and its dominance over the human sensorium is integral to the emergence of the modern, including experiences of urbanism, consumer desire, gender/sexual identities, race and ethnicity, trans-cultural image systems, aesthetic production, and the making of power and political truth claims. This seminar will focus on introducing participants to the core theories and analytic methods of visual culture, and the socio-political history of the human sensorium in a variety of disciplines, including ethnography, social history, urban studies, cinema studies, social geography, material culture studies, and media studies.\n\n      less description for MCC-GE 2112 «",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2120",
            "course_name": "Media Policy/Regulation",
            "description": "MCC-GE 2120 Media Policy/Regulation \nThis course provides an introduction to key debates of media policy and regulation, from telecommunications policy and news and entertainment media to Internet policy, framing them in relation to democratic theory and ethical concerns. The course traces the history of media policy through the development of radio, television, Internet and telecommunications policy, and digital media, with examinations of how media policy gets created and shaped in and outside Washington, D.C., media activism, and the central role played by these policies in structuring the kinds of media that we consume.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2125",
            "course_name": "Evolution of Technology",
            "description": "MCC-GE 2125 Evolution of Technology \nTraces the development of technology from historical, current, and future-oriented perspectives.  Attention given to intended and unintended consequences of technological events.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2129",
            "course_name": "New Media Rsch Studio",
            "description": "MCC-GE 2129 New Media Rsch Studio",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2130",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17525",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 2.00 PM - 4.10 PM",
                    "open": true,
                    "professor": "CIWW 412"
                }
            ],
            "course_name": "Topics in Digital Media",
            "description": "MCC-GE 2130 Topics in Digital Media \nDesigned for current theoretical research in digital media. It is expected that course themes will vary to reflect debates in the field. Topics may include the following: computers and pedagogy: on-line communities; on-line publishing; the cultural history of software; video games studies.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2131",
            "course_name": "Topics in Digital Media: Games Studies",
            "description": "MCC-GE 2131 Topics in Digital Media: Games Studies \nA critical approach to the medium of the video game. Examination of the concept of 'play' using methods from literary criticism, cultural anthropology, post structuralism, and cinema studies. Discussion of approaches to the philosophy of action, ludology, and theories of mechanic and gamic visuality. Themes will include simulation, social realism, and war games. The seminar will include screenings and require game play.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2132",
            "course_name": "",
            "description": "MCC-GE 2132\n\n   Visions and Revisions of Cyberspace\n\nFor the first time in history, computer-mediated culture has become mainstream for a majority of individuals in technologically developed societies. From e-mail to texting, from online gaming to online banking, from You Tube to Hulu, from DoS attacks to Second Life sit-ins, nearly every traditional aspect of our lives has found a new expression in its digital proxy. In order to understand the cultural, social, political and economic consequences of this development, we must look to the origins of today's cyberculture, in the futuristic visions  (both dystonian and utopian) that shaped the deve...\n\n      more description for MCC-GE 2132 »\n\n      \n\n\n\nFor the first time in history, computer-mediated culture has become mainstream for a majority of individuals in technologically developed societies. From e-mail to texting, from online gaming to online banking, from You Tube to Hulu, from DoS attacks to Second Life sit-ins, nearly every traditional aspect of our lives has found a new expression in its digital proxy. In order to understand the cultural, social, political and economic consequences of this development, we must look to the origins of today's cyberculture, in the futuristic visions  (both dystonian and utopian) that shaped the development of today's networked technologies. We will trace the genealogy of these visions, as they developed in tandem with the growing digital communications infrastructure over the past three quarters of a century, and evolved into new forms that even the most forward-thinking of visionaries could not have predicted. Ultimately, one can argue the the Internet has both exceeded and fallen short of the hype that surrounded its birth and development, and by comparing the myth to the reality, we may better understand what aspects of the human condition are likely to persist regardless of technological development.\n\n      less description for MCC-GE 2132 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2133",
            "course_name": "Topics in Digital Media:  Digital Media & Materiality",
            "description": "MCC-GE 2133 Topics in Digital Media:  Digital Media & Materiality \nThis seminar will introduce students to the range of recent materialist research, while at the same time maintaining a skepticism about claims of the “newness” of this approach & the coherence or unity of the “material turn” in social theory. While including materialist media theory, the course will also focus on the elemental aspects of digital media – from codes & circuits to power generation & storage – in order to assess the usefulness of materialist & infrastructural analytics for understanding contemporary media systems.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2134",
            "course_name": "Media Archaeology",
            "description": "MCC-GE 2134 Media Archaeology \nExplores theoretical, methodological, and archival strategies for research on early or obsolete media artifacts. This seminar functions as an ongoing research studio while discussing central texts in the field of media archaeology.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2135",
            "course_name": "Media,Memory and History",
            "description": "MCC-GE 2135 Media,Memory and History \nThis course examines the relationship of visual media to historical narratives and cultural memory. It looks at photography, film, television, and forms of new media in relation to theories of historiography and cultural memory.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2136",
            "course_name": "War and Media Theory",
            "description": "MCC-GE 2136 War and Media Theory \nThis seminar explores the practices of war as modes of material political communication in which media is militarized and violence is mediatized. This seminar will examine how modern warfare has generated new visual cultures, new media networks and the sensorium of modernity.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2137",
            "course_name": "Visual Cult/Politics of Memory: Global Perspective",
            "description": "MCC-GE 2137 Visual Cult/Politics of Memory: Global Perspective \nThis course compares the debates & contestations over architecture’s relationship to memory, trauma, nationalism, & memorialization that have taken place in Argentina, over the memory of its “dirty war” from 1976-1983, and in the United States over the last three decades.  It situates this comparative perspective within the scholarship of architecture & design, memory studies, & visual culture.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2138",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4760",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 101A",
                    "time": "Wed 11.00 AM - 1.10 PM",
                    "open": true,
                    "professor": "Chakravartty, Pauline U"
                }
            ],
            "course_name": "Politics of Digital Media",
            "description": "MCC-GE 2138 Politics of Digital Media \nThis seminar examines various political themes and issues such as the politics of regulation and network architecture, the politics of piracy and hacking and the politics of grassroots activism. Students will interrogate a range of higher political theories about democracy, liberalism and neoliberalism as they concern the intersection of technology and politics. Specific topics may include: domain name registration, ICAAN, filtering, tactical media, and open source software.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2139",
            "course_name": "Video Game Theory",
            "description": "MCC-GE 2139 Video Game Theory",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2140",
            "course_name": "Studies in Organizational Communication",
            "description": "MCC-GE 2140 Studies in Organizational Communication \nThis course examines organization communication and the influences that create and define organizational climate. Topics include: diagnosing organizational cultures; the effects of gender, culture and race on organizational communication; communication and leadership; and organizational conflict.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2143",
            "course_name": "The Cultural Analysis of Design",
            "description": "MCC-GE 2143 The Cultural Analysis of Design",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2144",
            "course_name": "",
            "description": "MCC-GE 2144\n\n   Digital Humanities\n\nThe class will introduce students to the key concepts & concerns animating the growing field of the Digital Humanities (DH). The course will give an overview of the questions that have historically driven DH research, the critical debates that have oriented the field, & the new technologies that digital humanists have adopted. The class will not only teach students about new digital techniques for analysis, but will ask them to think deeply about what it means to engage in humanistic inquiry in a networked environment & reflect on the relationship between digital tools & culture, gender, race,...\n\n      more description for MCC-GE 2144 »\n\n      \n\n\n\nThe class will introduce students to the key concepts & concerns animating the growing field of the Digital Humanities (DH). The course will give an overview of the questions that have historically driven DH research, the critical debates that have oriented the field, & the new technologies that digital humanists have adopted. The class will not only teach students about new digital techniques for analysis, but will ask them to think deeply about what it means to engage in humanistic inquiry in a networked environment & reflect on the relationship between digital tools & culture, gender, race, & power.\n\n      less description for MCC-GE 2144 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2145",
            "course_name": "Methods in Interpreting Popular Culture",
            "description": "MCC-GE 2145 Methods in Interpreting Popular Culture \nPopular culture as both a producer and reflector of cultural meaning and a means of communication. Introduction to the fundamental theories and methods for understanding the construction of meaning in film, television, music, advertising and practices of everyday life, tracing the study of popular culture through film theory and mass media analysis to cultural studies.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2146",
            "course_name": "The Sitcom",
            "description": "MCC-GE 2146 The Sitcom \nThe course examines the history and cultural politics of the situation comedy, one of television's most enduring genres. Screenings, readings, from a wide-range of academic fields explore this complex relationship between the sitcom and American culture, especially in terms  of debates regarding class, gender, race, sexuality, the family and work.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2147",
            "course_name": "Reality and Documentary TV",
            "description": "MCC-GE 2147 Reality and Documentary TV \nThis course will survey the historical development & shifting definitions of documentary & reality television. We will explore the ways in which television has understood & utilized non-fiction formats at particular historical moments; trace the formations & deployment of realist aesthetics; explore the ethical obligations/problematics of these forms & their practitioners; examine the implications & meanings of documentary/reality hybrids; & consider the reception of & cultural meanings derived from particular documentary & reality texts & subgenres",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2148",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4114",
                    "section": "001",
                    "period": "09/02/2015 - 10/29/2015",
                    "location": "SILV 406",
                    "time": "Thu 6.00 PM - 9.15 PM",
                    "open": true,
                    "professor": "Poltrack, David"
                }
            ],
            "course_name": "The Television Business",
            "description": "MCC-GE 2148 The Television Business",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2149",
            "course_name": "Cultural History of TV",
            "description": "MCC-GE 2149 Cultural History of TV \nThis course will survey the cultural and industrial history of American television. Students will come to understand how technological innovation, regulatory bodies, advertisers, network heads, creative producers, audiences have interacted with economic, social, and political forces to shape television over time. In this class we will also discuss the methodological practices and concerns involved in the writing of media histories and specifically the history of broadcasting.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2150",
            "course_name": "The Origins of Modern Media",
            "description": "MCC-GE 2150 The Origins of Modern Media \nExamination of the sociopolitical, technological, aesthetic, and institutional development of media from 1880-1950. Emphasis is placed on telegraphy, telephony, sound-recording, and amplification devices, radio (both point-to-point and broadcast) and film. Students are introduced to a variety of historiographical techniques and are encouraged to reflect upon the relationship between origins of the mass media and current technological institutional, sociopolitical and aesthetic dynamics of media.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2153",
            "course_name": "Media Activism",
            "description": "MCC-GE 2153 Media Activism",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2155",
            "course_name": "Activist Art & Creative Activism",
            "description": "MCC-GE 2155 Activist Art & Creative Activism \nThe course will focus on the tactical, strategic, & organizational uses of artistic aesthetic taken up by the activist for the purpose of social change. The course will rely on both a survey of the existing theory & scholarship on “artistic activism,” as well as close analyses of contemporary practices on a local, national & global scale. Special attention will be paid to issues of creativity & efficacy, addressing questions concerning the value of this hybrid practice as both an aesthetic & political activity.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2157",
            "course_name": "Comm Revolution and Culture:America",
            "description": "MCC-GE 2157 Comm Revolution and Culture:America \nAn examination of the nature of the communications revolution in the 20th century and its impact on American cultural life and institutions. First semester focuses on the political economy of media from a critical perspective; second semester focuses on current developments in the communications industry and their impact on the U.S. and global culture, from an industry perspective.  Either half may be taken independently.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2165",
            "course_name": "Transnational Comm and Media Cultures",
            "description": "MCC-GE 2165 Transnational Comm and Media Cultures \nThe course examines the emergence of transnational communities in global cities and the role of media and media forms in (re)defining national belonging, identity, and global culture.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2166",
            "course_name": "",
            "description": "MCC-GE 2166\n\n   The Global City and Media Ethnography\n\nThis courses focuses on the theories and methods of media/sensory ethnography, visual culture, performance studies, through the linked topics of transcultural and trans-local processes, diaspora identities, the post colonial and human rights. The curriculum is aimed at graduate students from diverse disciplines who want to explore creative media practice as a research methodology. Through social historical and trans-cultural ethnographic perspectives practice-led pedagogy promotes a self-reflexive contextual and critical understanding of the use of media for the conduct and dissemination of re...\n\n      more description for MCC-GE 2166 »\n\n      \n\n\n\nThis courses focuses on the theories and methods of media/sensory ethnography, visual culture, performance studies, through the linked topics of transcultural and trans-local processes, diaspora identities, the post colonial and human rights. The curriculum is aimed at graduate students from diverse disciplines who want to explore creative media practice as a research methodology. Through social historical and trans-cultural ethnographic perspectives practice-led pedagogy promotes a self-reflexive contextual and critical understanding of the use of media for the conduct and dissemination of research and the creation of social knowledge through participatory cultural production.\n\n      less description for MCC-GE 2166 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2167",
            "course_name": "",
            "description": "MCC-GE 2167\n\n   Transnational Media Flows\n\nAnalyzes the global flow of media products, in particular the circulation of television and film in transnational contexts, at the intersection of political economy (economic, business, and institutional frameworks) with cultural economy (the cultural meanings of these television and film products). Focuses on case studies of the supranational regional players in some of the most important geo-linguistic world markets, where the tensions between global/transnational media flows and local interests are most evident, engaging with theoretical positions ranging from critiques of the homogenizing ...\n\n      more description for MCC-GE 2167 »\n\n      \n\n\n\nAnalyzes the global flow of media products, in particular the circulation of television and film in transnational contexts, at the intersection of political economy (economic, business, and institutional frameworks) with cultural economy (the cultural meanings of these television and film products). Focuses on case studies of the supranational regional players in some of the most important geo-linguistic world markets, where the tensions between global/transnational media flows and local interests are most evident, engaging with theoretical positions ranging from critiques of the homogenizing effects of globalization to those that affirm the changing power relations of counter-flows based on audience preferences.\n\n      less description for MCC-GE 2167 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2169",
            "course_name": "Globalization,Memory and Visual Culture",
            "description": "MCC-GE 2169 Globalization,Memory and Visual Culture \nThis course examines the intersections of global visual culture and cultural memory, with a particular focus on the tensions that arise between the largely national tendencies of cultural memory and the global circulation of cultural meaning. It has a comparative focus with an emphasis on the differences and distinctions of visual culture and cultural memory in the U.S. and other nations.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2170",
            "course_name": "Commun and Persuasion:",
            "description": "MCC-GE 2170 Commun and Persuasion: \nViewing and analysis of the cinematic and persuasive techniques used in classic propaganda films (features and documentaries) to shape viewers' construction of reality.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2171",
            "course_name": "",
            "description": "MCC-GE 2171\n\n   Screening History:  American History in Hollywood\n\nThis course explores how popular Hollywood films construct versions of the historical past, & can be utilized as historical documents themselves. The films reach mass audiences, they entertain, they mythologize, they produce compelling narratives about the past, they simplify complex problems, & they have been influential in creating audiences’ historical understanding.  Hollywood films are significant & complex cultural texts, & this course will study them as artifacts of a powerful communications entertainment industry whose visions of the past & arguments regarding social, political, econom...\n\n      more description for MCC-GE 2171 »\n\n      \n\n\n\nThis course explores how popular Hollywood films construct versions of the historical past, & can be utilized as historical documents themselves. The films reach mass audiences, they entertain, they mythologize, they produce compelling narratives about the past, they simplify complex problems, & they have been influential in creating audiences’ historical understanding.  Hollywood films are significant & complex cultural texts, & this course will study them as artifacts of a powerful communications entertainment industry whose visions of the past & arguments regarding social, political, economic order throughout the 20th century & into the 21st centuries warrants our close examination.\n\n      less description for MCC-GE 2171 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2173",
            "course_name": "Research for Comm Professionals",
            "description": "MCC-GE 2173 Research for Comm Professionals \nIntroduces the types and methods of research conducted, assessed, and applied by professionals in the communication industries. Students learn to design, conduct, report, and evaluate program and audience research via such methods as focus groups, surveys, and content analysis, and to use appropriate online sources of demographic information.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2174",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "4115",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL146",
                    "time": "Tue 6.30 PM - 8.40 PM",
                    "open": true,
                    "professor": "Gary, Brett"
                },
                {
                    "format": "Workshop",
                    "class_id": "17536",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC15",
                    "time": "Mon 2.00 PM - 4.10 PM",
                    "open": true,
                    "professor": "Miller, Mark"
                }
            ],
            "course_name": "Professional Writing and Research Application",
            "description": "MCC-GE 2174 Professional Writing and Research Application",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2175",
            "course_name": "Political Communication",
            "description": "MCC-GE 2175 Political Communication \nCommunicative aspects of American government, including the preparation of candidates, the electoral process, political advertising and public relations. The use of strategic communication to influence political agendas, the formation of public policy, and the process of political debate.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2182",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3644",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 204",
                    "time": "Wed 4.55 PM - 7.05 PM",
                    "open": true,
                    "professor": "Borisoff, Deborah"
                }
            ],
            "course_name": "Communication Processes: Gender,Race/Cultural Id",
            "description": "MCC-GE 2182 Communication Processes: Gender,Race/Cultural Id \nCourse examines past and current studies on language, communication theories, speech perception, and other aspects of verbal and nonverbal behavior. Students relate these studies to how gender, race, culture and sexual orientation are developed and reflected in society in both personal and professional relationships.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2184",
            "course_name": "Comparative Media Systems",
            "description": "MCC-GE 2184 Comparative Media Systems \nExamines, explains, and evaluates similarities and differences in the institutional organization, practice, and discursive content and form of news media around the globe. Drawing on theories from the sociology of news, case studies examine media systems which vary in their relations to political, economic, and cultural power.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2185",
            "course_name": "Ciritcal Issues in Conflict Resolution",
            "description": "MCC-GE 2185 Ciritcal Issues in Conflict Resolution \nStudents examine transformations in the communication processes that influence conflict management as manifested in diverse contexts. Issues will be explored from the perspectives of gender, culture, and ethnicity.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2190",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17538",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 741",
                    "time": "Thu 2.00 PM - 4.10 PM",
                    "open": true,
                    "professor": "Moran, Terence"
                }
            ],
            "course_name": "Lang of Communication:",
            "description": "MCC-GE 2190 Lang of Communication: \nThe historical development of various non electronic media--language, painting, writing and print and their consequences for consciousness, information processing, and sociopolitical structures.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2191",
            "course_name": "Print Media & Modernity",
            "description": "MCC-GE 2191 Print Media & Modernity \nThis seminar explores the evolution of print technology and culture since Gutenberg's first experiments with movable type. Although the emphasis is on the history of the book, we also examine newspapers, identity papers, paper money, and other printed matter.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2200",
            "course_name": "Media Events & Spectacle",
            "description": "MCC-GE 2200 Media Events & Spectacle \nThis course examines the role played by media events and spectacle in the shaping of belief, attitudes, and actions, with particular attention paid to the concept of the masses and its changed meaning over time. The course examines concepts of mass culture, the decentralization of cultural forms, and the rise of convergence culture. It explores the history of the media event and the theories that have shaped it, and the role of spectacle in society from the Renaissance to modern society to the age of digital media.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2201",
            "course_name": "Mediating The Bio-Political Body",
            "description": "MCC-GE 2201 Mediating The Bio-Political Body \nThis seminar treats the body as a bio-political medium and media as mimetic, cyborgian and visualized forms of flexible embodiment. We will explore the political encoding of bodies as a crucial, yet under-analyzed, mode of modern political communication encompassing the racialized, colonized, gendered, medicalized, technologicalized, disabled and terrorized body.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2202",
            "course_name": "",
            "description": "MCC-GE 2202\n\n   Public Sphere Formation\n\nThis course examines concepts of the public sphere and its formation in relation to modernity, visual culture, media formation, and modern subjectivity. We will begin with two distinct but related arguments about the public-private opposition, namely Habermas's influential formulation drawing on Kant, and Hannah Arendt's formulation that draws on ancient Greek philosophy. In this course we will consider the problems attending any attempt to construct a theoretical genealogy for the terms public and private, and examine as well specific cultural-political mobilizations and techno-institutional ...\n\n      more description for MCC-GE 2202 »\n\n      \n\n\n\nThis course examines concepts of the public sphere and its formation in relation to modernity, visual culture, media formation, and modern subjectivity. We will begin with two distinct but related arguments about the public-private opposition, namely Habermas's influential formulation drawing on Kant, and Hannah Arendt's formulation that draws on ancient Greek philosophy. In this course we will consider the problems attending any attempt to construct a theoretical genealogy for the terms public and private, and examine as well specific cultural-political mobilizations and techno-institutional elaborations of these terms, and some of the implications arising from these definitions. mobilizations and instantiations.\n\n      less description for MCC-GE 2202 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2206",
            "course_name": "",
            "description": "MCC-GE 2206\n\n   Dis/Ability Studies:\n\nIntroduction to the concepts used in the new interdisciplinary field of disability studies. This seminar will be a joint exploration of the necessarily connected experience and representation of dis/ability, embodiment and  the 'normal' in modern western culture. It centers on questions of dis/ability in the three fields at three critical interfaces, namely the formation of Western rationality in the seventeenth century; the generalization and medicalization of the concept of 'normal' in the nineteenth century; and the emergence of dis/ability as a new form of identity in the past forty years....\n\n      more description for MCC-GE 2206 »\n\n      \n\n\n\nIntroduction to the concepts used in the new interdisciplinary field of disability studies. This seminar will be a joint exploration of the necessarily connected experience and representation of dis/ability, embodiment and  the 'normal' in modern western culture. It centers on questions of dis/ability in the three fields at three critical interfaces, namely the formation of Western rationality in the seventeenth century; the generalization and medicalization of the concept of 'normal' in the nineteenth century; and the emergence of dis/ability as a new form of identity in the past forty years.\n\n      less description for MCC-GE 2206 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2210",
            "course_name": "Globalization & Gender",
            "description": "MCC-GE 2210 Globalization & Gender \nThis course examines how definitions and practices of gender and sexuality are reproduced in the context of globalization and transnational flows. Engaging key texts in feminist/global cultural studies, discussions will address issues of citizenship, global labors flows, migration, and media representations.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2211",
            "course_name": "Decolonization/Aftermath",
            "description": "MCC-GE 2211 Decolonization/Aftermath \nThe course considers decolonization as a set of historical events and as a communicational concept. In addition to historical and theoretical literature, this course draws on literature, cinema, and other media sources to explore the significance of decolonization in the 20th century and beyond.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2215",
            "course_name": "History of Consumer Culture",
            "description": "MCC-GE 2215 History of Consumer Culture \nThis course examines the rise of consumer culture, the critical responses it has historically produced by intellectuals and the ways in which recent scholarship theorized the actual experiences of people who participate in, pursue, and consume the many produces of a consumer culture. The course is an intellectual and cultural history of consumer culture as a central dimension of American life in the industrial and postindustrial eras.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2220",
            "course_name": "Communication and The Cultural Industries",
            "description": "MCC-GE 2220 Communication and The Cultural Industries \nAn examination of the ways the entertainment industries exercise their communicative power. Provides a wide-ranging overview of theoretical and empirical research on the industrial manufacture of popular culture, focusing on sociologies of production and on the ongoing processes of digitization and globalization.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2225",
            "course_name": "World Communication: Principles,Politics/Law",
            "description": "MCC-GE 2225 World Communication: Principles,Politics/Law \nExamines the legal, regulatory, and political mechanisms, both national and supranational, that affect the flow of media, information, and culturral products across borders and the interplay between these mechanisms and the conduct of global communication.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2229",
            "course_name": "",
            "description": "MCC-GE 2229\n\n   Contemporary Theory and Research/Globalization\n\nThis course seeks to cover the landscape in contemporary theorizing and research on cultural globalization. It is organized broadly around three partially competing/partially complementary theories of globalization - homogenization, enduring cultural differences, and hybridization. We will attempt to bring each of these theories to life with case studies of the production, distribution, and reception of cultural forms and experiences from across the globe. We will also review research methods, including cross-national comparative research design, ethnography, in-depth interviews, content analy...\n\n      more description for MCC-GE 2229 »\n\n      \n\n\n\nThis course seeks to cover the landscape in contemporary theorizing and research on cultural globalization. It is organized broadly around three partially competing/partially complementary theories of globalization - homogenization, enduring cultural differences, and hybridization. We will attempt to bring each of these theories to life with case studies of the production, distribution, and reception of cultural forms and experiences from across the globe. We will also review research methods, including cross-national comparative research design, ethnography, in-depth interviews, content analysis, and historical/archival research methods, focusing in particular on the methods used in course readings.\n\n      less description for MCC-GE 2229 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2230",
            "course_name": "Practicum I:Speech Communication",
            "description": "MCC-GE 2230 Practicum I:Speech Communication \nEach student undertakes an original, practical experience, by advisement.  This may involve a specific aspect of the teaching of curricular or extracurricular speech activities; development of curriculum materials, establishing teacher/learner criteria, application of research findings, etc.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2232",
            "course_name": "Language and Culture",
            "description": "MCC-GE 2232 Language and Culture \nReadings and research on the ways in which language is implicated in different cultures and constructions of time, space, c=consciousness, self, truth, knowledge, and gender.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2235",
            "classes": [
                {},
                {}
            ],
            "course_name": "Internship:Communication Studies",
            "description": "MCC-GE 2235 Internship:Communication Studies \nThe internship program promotes the integration of academic theory with practical experience. Internships expand student understandings of the dynamics of the ever-changing field of communication.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2251",
            "course_name": "Comm Environments: Macroanalysis",
            "description": "MCC-GE 2251 Comm Environments: Macroanalysis \nInquiries into 'the business behind the box': the economic and decision-making structure of broadcast television.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2265",
            "course_name": "Comm and Persuasion: Sociological Propaganda",
            "description": "MCC-GE 2265 Comm and Persuasion: Sociological Propaganda \nA series of analyses of the history, theories, techniques, and results of propaganda in society with special focus on the relationship between interaction (sociological) propaganda and communication in our increasingly technological society; case studies drawn from public relations, commercial advertising, social movements, and the mass media.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2270",
            "course_name": "Communication/Political Propaganda",
            "description": "MCC-GE 2270 Communication/Political Propaganda \nA series of analyses of the history, theories, techniques, and results of propaganda in society with special focus on the relationship between agitation (political) propaganda and communication in our increasingly technological society; case studies drawn from national and international sources.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2275",
            "course_name": "Middle East Media and Cultural Politics",
            "description": "MCC-GE 2275 Middle East Media and Cultural Politics \nExamines developments of culture, politics, and media in contemporary Middle East through an historical and cultural lens. Course is organized by theoretical theme and geographic location and addresses culture as a site of struggle; the impact of globatlization on Arab mass media; the connections between civil society, demoracy and Islam; and gender, national and diasporic identities.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2280",
            "course_name": "Internet2:Explorations in Performance and Comm",
            "description": "MCC-GE 2280 Internet2:Explorations in Performance and Comm \nThis class explores Internet2 technology as a new platform for performance and communication. It pays particular attention to experimental uses of Internet2 for practices in theatre, music, dance, and the visual arts, and other genres of performance and to ways that Internet2 might be used to facilitate connection and interaction across space and time.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2282",
            "course_name": "Information Law/Policy",
            "description": "MCC-GE 2282 Information Law/Policy \nExamines the emergence of a specific body of laws and public policies that influence the production, distribution and use of information technologies, with a focus on issues of privacy, online speech, intellectual property, the creative commons, computer crime, and governance in general.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2284",
            "course_name": "Religion and Media",
            "description": "MCC-GE 2284 Religion and Media \nThis course will examine some key writings on the topic of religion. The changing modes of religion's mediation will be addressed by examining key historical controversies over the place of religion, including the growth of practices of religious and political action that are apparently fueled and partly enacted via technological media.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2285",
            "course_name": "Integrating Media Educ in School,Comm and Work",
            "description": "MCC-GE 2285 Integrating Media Educ in School,Comm and Work \nHands-on video production, media literacy program design, readings, and reflection on approaches and strategies educators can use to incorporate media education into their schools and community-based organizations.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2286",
            "course_name": "Young People and Media Cultures",
            "description": "MCC-GE 2286 Young People and Media Cultures \nThe role of popular media in the experiences, thinking, and values of young people. Students engage in research and practice-oriented assignments to consider issues of media education.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2287",
            "course_name": "Global Youth Media",
            "description": "MCC-GE 2287 Global Youth Media",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2290",
            "course_name": "Interpersonal Comm",
            "description": "MCC-GE 2290 Interpersonal Comm \nThe application of various systems of communication analysis to specific behavioral situations.  Through case-study method, students apply communication theories and models to practical, everyday situations.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2295",
            "course_name": "Values Embodied in Info and Communications Techn",
            "description": "MCC-GE 2295 Values Embodied in Info and Communications Techn \nStudies social, political and ethical values embodied in computer and information systems, and new media. Students examine work in the philosophy and social study of technology to understand the rich and sometimes troubling relationship between values and technical design. Course will ask: Is technology neutral? Who should make key decisions? What is the role of scientists and engineers? The course examines specific cases, such as, the Internet, search engines, web-cookies, and data mining from philosophical, empirical, and technical perspectives.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3647",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Gorgani, Shima; Blough, Rebecca",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "MCC-GE 2300 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2304",
            "course_name": "Global Media and International Law",
            "description": "MCC-GE 2304 Global Media and International Law",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2305",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4377",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 504",
                    "time": "Tue 4.55 PM - 7.05 PM",
                    "open": true,
                    "professor": "Verhulst, Stefaan"
                }
            ],
            "course_name": "",
            "description": "MCC-GE 2305\n\n   Internet Governance: Mapping Internet Governance Principles, Policies and Practices\n\nThe Internet has become an essential platform & engine for economic development, social justice & the protection of human rights. At the same time, the issue of global Internet governance raises challenging questions, including: where the control of the Internet should reside, what guiding principles should be used & who should take part in the policy making process?  Students will explore prominent narratives & issues, such as the concept of architectural openness & the promotion of Internet Freedom. Through weekly discussions & the tracking of developmental shifts, this course\nseeks to provi...\n\n      more description for MCC-GE 2305 »\n\n      \n\n\n\nThe Internet has become an essential platform & engine for economic development, social justice & the protection of human rights. At the same time, the issue of global Internet governance raises challenging questions, including: where the control of the Internet should reside, what guiding principles should be used & who should take part in the policy making process?  Students will explore prominent narratives & issues, such as the concept of architectural openness & the promotion of Internet Freedom. Through weekly discussions & the tracking of developmental shifts, this course\nseeks to provide insight into the possible future of the medium.\n\n      less description for MCC-GE 2305 «",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2308",
            "course_name": "The Racial Web",
            "description": "MCC-GE 2308 The Racial Web \nStudents will examine the sources, content, & flow of racial & radicalized discourse on the web, as well as a broader variety of issues related to race & digital media. Central themes of racial formation & critical race theory, coupled with foundational concepts from graph theory & social network analysis will guide explorations into the multifaceted ways in which racial disadvantage , exclusion, segregation & disparate treatment get produced & reproduced in cyberspace.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2310",
            "course_name": "Sound Studies",
            "description": "MCC-GE 2310 Sound Studies",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2344",
            "course_name": "Social Life of Paper",
            "description": "MCC-GE 2344 Social Life of Paper \nWhat is the cultural work performed by or with the technology of paper? How can history of paper supplement and enrich recent histories of printing technology and printed artifacts  like 'the book'? What would it mean to imagine a paperless future? Organized around discussions of readings in common, this course considers the history, production, circulation and use of paper in the social production of knowledge, the shared imagination of value, and the mutual relations of consumers and commodities.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2351",
            "course_name": "",
            "description": "MCC-GE 2351\n\n   Global Food Cultures: Hong Kong\n\nAn interdisciplinary and intercultural examination of human communication through food. The course explores the social, economic, political, and cultural ramifications of the technology, production, acquisition, preservation, packaging, distribution, promotion, representation, selling, presentation, and consumption of food, as well as the disposal of food-related wastes. Students will have a unique opportunity to explore various local, regional and transnational, and food rituals in Hong Kong as the manifestation of changing social norms, economic realities, and cultural beliefs in an increasi...\n\n      more description for MCC-GE 2351 »\n\n      \n\n\n\nAn interdisciplinary and intercultural examination of human communication through food. The course explores the social, economic, political, and cultural ramifications of the technology, production, acquisition, preservation, packaging, distribution, promotion, representation, selling, presentation, and consumption of food, as well as the disposal of food-related wastes. Students will have a unique opportunity to explore various local, regional and transnational, and food rituals in Hong Kong as the manifestation of changing social norms, economic realities, and cultural beliefs in an increasingly global and multi-cultural city.\n\n      less description for MCC-GE 2351 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2352",
            "course_name": "Global Food Cultures:  Puerto Rico",
            "description": "MCC-GE 2352 Global Food Cultures:  Puerto Rico \nhis courses is an interdisciplinary & intercultural examination of human communication through food in Puerto Rico. Explores the social, economic, political, & cultural ramifications of food production & consumption. Students will have a unique opportunity to explore various local, regional & transnational, & food rituals.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2380",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4751",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 361",
                    "time": "Wed 2.00 PM - 4.10 PM",
                    "open": true,
                    "professor": "Appadurai, Arjun"
                }
            ],
            "course_name": "Topics in Globalization",
            "description": "MCC-GE 2380 Topics in Globalization \nThis umbrella course is designed to examine specific topics within the field of globalization, one of the core areas of focus in the MCC MA program. It incorporates historical theoretical frameworks and situates contemporary readings in relation to genealogies of the field. Specific themes may include global consumer culture; international development; gender and globalization; visuality and globalization; and global cultures of finance.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 2381",
            "course_name": "",
            "description": "MCC-GE 2381\n\n   Topics in Globalization: Global Consumer Culture\n\nConsumer culture by its nature is intensely local and inevitably global. Its locality is tied up with the intimacy of food, clothing, and shelter, and the elasticity of the relationship between bodies and things, between needs and desires, yet its meanings and messages are globally circulated and produced. This course explores critical approaches to the globalization of consumer culture by examining how bodies and things shape each other through long histories (colonial, postcolonial, global) of production, distribution, and fashion. Students will study the social world of global consumers as ...\n\n      more description for MCC-GE 2381 »\n\n      \n\n\n\nConsumer culture by its nature is intensely local and inevitably global. Its locality is tied up with the intimacy of food, clothing, and shelter, and the elasticity of the relationship between bodies and things, between needs and desires, yet its meanings and messages are globally circulated and produced. This course explores critical approaches to the globalization of consumer culture by examining how bodies and things shape each other through long histories (colonial, postcolonial, global) of production, distribution, and fashion. Students will study the social world of global consumers as an analytic entry point into the complex networks of cultural practice which mediate the perennial tension between habituation and novelty.\n\n      less description for MCC-GE 2381 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2382",
            "course_name": "Topics in Global:Comm and Intl Development",
            "description": "MCC-GE 2382 Topics in Global:Comm and Intl Development",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2383",
            "course_name": "Topics Global: Censorship/Social Movements and Alternative Media",
            "description": "MCC-GE 2383 Topics Global: Censorship/Social Movements and Alternative Media \nThe course will explore concepts of  media censorship, cultural & political anxieties & instability, & social movement media, primarily in the United States & France. It will center on understanding how cultural hegemony is attained, but how established norms are  subverted & challenged, particularly along political & cultural fronts.  Examples will be drawn from the contemporary United States, France & other countries, including global social justice movements. A variety of media formats will be reviewed, from film & print media, to social media, to protest & occupation.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2384",
            "course_name": "Topics Global: Cultural Globalization in France",
            "description": "MCC-GE 2384 Topics Global: Cultural Globalization in France \nCourse provides students with a critical understanding of how international flows of information & entertainment products – from news & information to movies, television & lifestyle brands -- play a role in shaping & reshaping global economic, political, military, & cultural realities. We will examine a range of forms of mediated production & consumption understood broadly in relation to political, economic, & cultural power, & situate these forms in relation to contemporary theorizing about global cultural convergence, divergence, & hybridity.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2400",
            "course_name": "Topics in Visual Culture",
            "description": "MCC-GE 2400 Topics in Visual Culture \nThis umbrella course is designed to examine specific topics within the field of visual culture, one of the core areas of focus in the MCC MA program. Incorporates historical, theoretical frameworks and situates contemporary readings in relation to genealogies of the field. Specific themes may include globalization and memory; visual culture and eco-criticism; the visual culture of science and technology; visual culture, diaspora, and post colonialism; the politics of visual display; the history of screen; global flows and visual culture; and visuality and modernity.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2401",
            "course_name": "Comparative Media, Cult & Globalism:",
            "description": "MCC-GE 2401 Comparative Media, Cult & Globalism:",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2401",
            "course_name": "Topics in Visual Culture Visuality and Modernity",
            "description": "MCC-GE 2401 Topics in Visual Culture Visuality and Modernity \nExamines the interrelationship of the modernity and realms of visuality, examing in particular the dominant role of visual culture in the emergence of modern society. Focuses on the establishment of modern media, ways of looking, and modern subjectivities in the nineteenth century. Examines the ways in which modern life emerged as a mode of visuality.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2403",
            "course_name": "Topics in Visuality and Globalization",
            "description": "MCC-GE 2403 Topics in Visuality and Globalization \nSpecial Topics in Visual Culture and Cultural Studies: Visuality and Globalization",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2404",
            "course_name": "Topics in Modernity and Climate Change",
            "description": "MCC-GE 2404 Topics in Modernity and Climate Change \nThis seminar uses the framework of visual culture to consider the ways in which modernity and climate change have been mutually constitutive as global phenomena. We ask whether climate can be considered a medium in its own right as the interface between humans and the biosphere, taking the sea as a particular example. This course situates climate change in relation to visual culture and cultural studies, examining the implications of the global and visual history of climate in relation to the current debate on the politics of climate change.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2405",
            "course_name": "Topics/Visual Culture: Communism/Cold War",
            "description": "MCC-GE 2405 Topics/Visual Culture: Communism/Cold War",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2406",
            "course_name": "Special Tpcs in Visual Culture/CulturalStudies: Semiotics of Media, Arts/Performance",
            "description": "MCC-GE 2406 Special Tpcs in Visual Culture/CulturalStudies: Semiotics of Media, Arts/Performance \nThis course will explore semiotics & performance theory by comparing the modes of performance used in media (including television, film, radio, advertising, theater, music & visual art) with social performance in general. Readings will draw from classic & contemporary work in semiotics, performance theory & linguistic anthropology, analyzing media & art forms from around the world. Students will engage with the theoretical concepts & analytical models encountered in class by applying them to a media form, performance or piece of art of their own choosing.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2420",
            "course_name": "Visual Culture Methods",
            "description": "MCC-GE 2420 Visual Culture Methods \nThis course is an introduction to the history and theory of vision and visuality, with a particular focus on research methods in the study of visual culture. The course focuses on the research methods and approaches specific to the field of visual culture and related fields of study, its scholarly literature, its theoretical genealogy, and the stakes in interdisciplinary research.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2422",
            "course_name": "Research in Visual Culture",
            "description": "MCC-GE 2422 Research in Visual Culture \nTheory & methodology of visual culture will be explored in preparation for completion of the thesis-final project. Students are required to define the subject of their thesis/final project research clearly, share copies of their work in-progress & participate in discussion & critiques.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2450",
            "course_name": "Video Game Theory",
            "description": "MCC-GE 2450 Video Game Theory",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2451",
            "course_name": "Business & Economics of Video Game Industry",
            "description": "MCC-GE 2451 Business & Economics of Video Game Industry \nIn this class, we explore the basic components of the current video game industry. Every week, we discuss its current events, will hear from people currently working in the industry, examine case studies, & discuss overall business landscapes. Central to each class is the notion that practical business considerations & the design-driven creative process do not have to be in opposition. True creative independence hinges on the well-informed & critical understanding of the building blocks that make up the economic context in which games industry professionals operate.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2836",
            "course_name": "Culture and Media in Urban China",
            "description": "MCC-GE 2836 Culture and Media in Urban China",
            "offering": false
        },
        {
            "course_id": "MCC-GE 2900",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3661",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC15",
                    "time": "Mon 4.55 PM - 7.05 PM",
                    "open": true,
                    "professor": "Hegde, Radha"
                }
            ],
            "course_name": "Thesis in Media,Culture and Communication",
            "description": "MCC-GE 2900 Thesis in Media,Culture and Communication \nThe thesis project synthesized general knowledge in the field of media, culture and communication as well as demonstrates a high level of competency in the candidate's chosen area of study in accordance with institutional and state regulations.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 3010",
            "course_name": "Special Topics in Critical Theory",
            "description": "MCC-GE 3010 Special Topics in Critical Theory \nThis umbrella course examines select topics in critical, cultural, social, and political theory, with special attention to problems of interpretation in the humanities and related social sciences in both historical and theoretical contexts.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3011",
            "course_name": "Special topics in Critical Theory: Suspicion and Interpretation",
            "description": "MCC-GE 3011 Special topics in Critical Theory: Suspicion and Interpretation",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3012",
            "course_name": "Fetishism",
            "description": "MCC-GE 3012 Fetishism",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3013",
            "course_name": "Special topics in Critical Theory: Marx",
            "description": "MCC-GE 3013 Special topics in Critical Theory: Marx",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3030",
            "course_name": "Special Topics in Media History",
            "description": "MCC-GE 3030 Special Topics in Media History",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3031",
            "course_name": "Documents, Documentary, Data, Database",
            "description": "MCC-GE 3031 Documents, Documentary, Data, Database",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3100",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3637",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 712",
                    "time": "Wed 11.00 AM - 1.50 PM",
                    "open": true,
                    "professor": "Kafka, Benjamin"
                }
            ],
            "course_name": "Doctoral Core Sem I",
            "description": "MCC-GE 3100 Doctoral Core Sem I \nAdvanced reading and discussion of the foundational literature, principles, and paradigms associated with the study of media, culture, and communication.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 3101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17543",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 712",
                    "time": "Tue 2.00 PM - 4.50 PM",
                    "open": true,
                    "professor": "Sturken, Marita"
                }
            ],
            "course_name": "Intro to Communication Research",
            "description": "MCC-GE 3101 Intro to Communication Research \nThe formulation of doctoral research problems in culture and communication.  Planning of relevant methodology; criticism of work in progress.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 3110",
            "course_name": "Special Tops in Cultural and Visual Studies",
            "description": "MCC-GE 3110 Special Tops in Cultural and Visual Studies \nThis course examines specific topics within the fields of cultural studies and visual culture, with the aim of delving into particular theoretical concerns within these overlapping and interrelated fields of study. It is the aim of Special Topics courses to incorporate historical theoretical frameworks and to examine important recent scholarship on these issues.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3111",
            "course_name": "",
            "description": "MCC-GE 3111\n\n   Theories of Visual Consumption/Consumerism\n\nFocus is on a genealogy of theories of consumption and consumerism, including visual consumption and reception, cultural consumption, and consumerism more broadly. The aim of this particular course is to chart the history of how consumerism has been theorized since the nineteenth century, and to make clear the connections between the literature on consumerism/consumption  and the literature on visual consumption and the relationship of modernity and visuality. The course will thus trace an arc from the literature on nineteenth century practices of visual consumption and the rise of consumer so...\n\n      more description for MCC-GE 3111 »\n\n      \n\n\n\nFocus is on a genealogy of theories of consumption and consumerism, including visual consumption and reception, cultural consumption, and consumerism more broadly. The aim of this particular course is to chart the history of how consumerism has been theorized since the nineteenth century, and to make clear the connections between the literature on consumerism/consumption  and the literature on visual consumption and the relationship of modernity and visuality. The course will thus trace an arc from the literature on nineteenth century practices of visual consumption and the rise of consumer society to contemporary debates about the relationship of consumerism to philanthropy, neoliberalism and global capitalism, and theories of cultural resistance in the context of new media practices.\n\n      less description for MCC-GE 3111 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3112",
            "course_name": "Special Topics in Cultural & Visual Studies",
            "description": "MCC-GE 3112 Special Topics in Cultural & Visual Studies",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3113",
            "course_name": "Special Topics in Cultural and Visual Studies: Deleuze's Aesthetics",
            "description": "MCC-GE 3113 Special Topics in Cultural and Visual Studies: Deleuze's Aesthetics \nIn this doctoral seminar we will perform a close reading of Deleuze's late work on aesthetics, focusing on his relevance to cultural & visual studies by way of painting, cinema, photography, the diagram, & the Baroque. Additional themes will include minor literature, machines, & the distinction between the digital & the analogue. Additional readings will be drawn from Elizabeth Grosz, as well as three of Deleuze's peers & interlocutors (&, at times, fierce critics) in France, Michel Henry, Alain Badiou, & François Laruelle.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3130",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4636",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 712",
                    "time": "Mon 2.00 PM - 4.50 PM",
                    "open": true,
                    "professor": "Appadurai, Arjun"
                }
            ],
            "course_name": "Special Topics Global and Transcultural Communication",
            "description": "MCC-GE 3130 Special Topics Global and Transcultural Communication \nAn umbrella course that examines global dynamics in culture and media in a broad international and historical context. Special attention is paid to the social, economic, and political theories that inform our understanding of the phenomena and experience of globalization, and its relationship to media and cultural production, distribution and consumption. Specific courses focus on transnational identity formation, political economy of global media, and regional clusters such as the Middle East, Asia, South America, etc.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 3131",
            "course_name": "Special Topics Global and Transcultural Communication:Transcultural Media",
            "description": "MCC-GE 3131 Special Topics Global and Transcultural Communication:Transcultural Media",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3132",
            "course_name": "Special  Topics Global and Transcultural Communication: Mapping Transnational",
            "description": "MCC-GE 3132 Special  Topics Global and Transcultural Communication: Mapping Transnational \nThis course examines theoretical & methodological challenges in producing cartographies of the global that pay attention to transnational flows, assemblages, circuits & disjunctures across multiple political & social processes. Paying special attention to ethnographic challenges, we will conduct close readings of select global ethnographies of media & communication in order to discuss & decenter the politics of transnational linkages organized around issues of modernity, mobility & locality.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3150",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4753",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 11.00 AM - 1.50 PM",
                    "open": true,
                    "professor": "SILV 414"
                }
            ],
            "course_name": "Special Topics in Technology Studies",
            "description": "MCC-GE 3150 Special Topics in Technology Studies \nThis umbrella course is designed for doctoral students on themes related to the social, cultural, historical, and political economic meanings and effects of communication technologies. Specific themes may include: digital media, social networking, intellectual property and issues of privacy, robotics and artificial intelligence, computer hacking, genetics and biocomputing, the business of new technology.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 3151",
            "course_name": "Sp Tpcs in Tech Studies: Heidegger and Deleuze",
            "description": "MCC-GE 3151 Sp Tpcs in Tech Studies: Heidegger and Deleuze \nIn this doctoral seminar we will perform close readings of Heidegger and Deleuze, focusing on their analysis of technology, tools, objects, machines, art. dwellings, and media.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3152",
            "course_name": "",
            "description": "MCC-GE 3152\n\n   Audio Vision\n\nThis seminar examines audiovisual phenomena, placing the various senses of sound and image in opera, music theater, video (& gaming), and especially cinema in historical and theoretical contexts. The course examines a history of relationships between the senses of sight and cultural conditions for the shifting modalities of visual and sonic experience, the course attempts to interrogate the ideological stakes of this dichotomy.  The course will examine the history of a lopsided dichotomy of the senses  in writers ranging from Plato and Boethius via Kant and Schopenhauer to Deleuze, Derrida, an...\n\n      more description for MCC-GE 3152 »\n\n      \n\n\n\nThis seminar examines audiovisual phenomena, placing the various senses of sound and image in opera, music theater, video (& gaming), and especially cinema in historical and theoretical contexts. The course examines a history of relationships between the senses of sight and cultural conditions for the shifting modalities of visual and sonic experience, the course attempts to interrogate the ideological stakes of this dichotomy.  The course will examine the history of a lopsided dichotomy of the senses  in writers ranging from Plato and Boethius via Kant and Schopenhauer to Deleuze, Derrida, and Chion.\n\n      less description for MCC-GE 3152 «",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3153",
            "course_name": "Spec Tpcs Tchn Studies: Politics of Code",
            "description": "MCC-GE 3153 Spec Tpcs Tchn Studies: Politics of Code",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3154",
            "course_name": "Special Topics in Technology Studies:  Science and Technology Studies (STS)",
            "description": "MCC-GE 3154 Special Topics in Technology Studies:  Science and Technology Studies (STS) \nThis course provides a graduate-level introduction to the field of Science & Technology Studies (STS). We will survey the ways scholars in STS—whose research methods range from historical epistemology to medical anthropology to the sociology of science—have understood the natural world, technical systems, human perception, & the social order to be co-produced. Following Bruno Latour, throughout the course we will investigate “matters of fact” as always “matters of concern.”",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3200",
            "course_name": "Doctoral Core Sem II",
            "description": "MCC-GE 3200 Doctoral Core Sem II \nAdvanced reading and discussion of the foundational literature, principles, and paradigms associated with the study of media, culture, and communication.",
            "offering": false
        },
        {
            "course_id": "MCC-GE 3201",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3638",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST 712",
                    "time": "Wed 2.00 PM - 4.50 PM",
                    "open": true,
                    "professor": "McIlwain, Charlton"
                }
            ],
            "course_name": "Dissertation Proposal",
            "description": "MCC-GE 3201 Dissertation Proposal \nThe formulation of doctoral research problems in culture and communication. Planning of relevant methodology; criticism of work in progress.",
            "offering": true
        },
        {
            "course_id": "MCC-GE 3400",
            "classes": [
                {
                    "format": "Colloquium",
                    "class_id": "3639",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Doctoral Rsch Colloquium",
            "description": "MCC-GE 3400 Doctoral Rsch Colloquium \nPeriodic meeting of doctoral students and faculty to discuss current research and professional development.",
            "offering": true
        }
    ]
}