{
    "major_id": "MSPM1-GC",
    "file": "./2015-2016/MS_in_Project_Management_(MSPM1-GC).html",
    "courses": [
        {
            "course_id": "MSPM1-GC 1000",
            "course_name": "",
            "description": "MSPM1-GC 1000\n\n   Principles of Project Management\n\nThis course will provide a framework for understanding and applying the philosophy, methodologies, principles, practices, and knowledge of structured project management. It will focus on the application of this framework to initiate, plan, execute, and manage chartered projects, to address business problems and opportunities that an organization will face. Students will gain both a theoretical as well as practical foundation on which to manage a project. In addition to lectures, facilitated discussions, in-class exercises, and case studies, students will also participate in a simulation projec...\n\n      more description for MSPM1-GC 1000 »\n\n      \n\n\n\nThis course will provide a framework for understanding and applying the philosophy, methodologies, principles, practices, and knowledge of structured project management. It will focus on the application of this framework to initiate, plan, execute, and manage chartered projects, to address business problems and opportunities that an organization will face. Students will gain both a theoretical as well as practical foundation on which to manage a project. In addition to lectures, facilitated discussions, in-class exercises, and case studies, students will also participate in a simulation project that will run concurrently throughout the course. Upon completion of this course, a student will be able to define a business problem, plan the delivery of a solution, execute that plan, and manage the completion of its deliverables. The content and subject matter are aligned with the current edition of the Project Management Institute’s (PMI) A Guide to the Project Management Body of Knowledge (PMBOK).\n\n      less description for MSPM1-GC 1000 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 1005",
            "course_name": "",
            "description": "MSPM1-GC 1005\n\n   Leading Global Organizations\n\nToday's managers must act as leaders who build collaborative enterprises to enable organizations to respond quickly and efficiently to new global market opportunities, new competitors, acquisitions, shifting market demographics, new technology and government regulations. Course topics will include: exploring the theories of leadership and team development; identifying an effective leadership style to match an organization's culture; differentiating leadership and management skills; optimizing leadership effectiveness; utilizing leadership capabilities to achieve mission critical enterprise obj...\n\n      more description for MSPM1-GC 1005 »\n\n      \n\n\n\nToday's managers must act as leaders who build collaborative enterprises to enable organizations to respond quickly and efficiently to new global market opportunities, new competitors, acquisitions, shifting market demographics, new technology and government regulations. Course topics will include: exploring the theories of leadership and team development; identifying an effective leadership style to match an organization's culture; differentiating leadership and management skills; optimizing leadership effectiveness; utilizing leadership capabilities to achieve mission critical enterprise objectives; building individual leadership capabilities; developing managers seeking enhanced global expertise; developing the leadership pipeline; and, institutionalizing leadership into the organization’s succession plan. Lectures, discussions, case studies, and projects are used to explore effective leadership and team relationships from a global prospective. Upon successful conclusion of the course, the student will have completed a leadership development plan for their respective organizations and will project the financial impact on both the organization's income statement and balance sheet.\n\n      less description for MSPM1-GC 1005 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 1010",
            "course_name": "",
            "description": "MSPM1-GC 1010\n\n   Transforming Organizations\n\nChange is everywhere, constant and increasing in frequency, magnitude and complexity. Leaders, managers, and workplace professionals are expected to manage change on three levels: individually, as part of a team, and organizationally. Workplace professionals are expected to be collaboratively responsive in an expeditious manner. This is a highly interactive course that moves from awareness, knowledge acquisition and progress, to synthesis and application of behavioral practices. Course topics will include: dimensions of change; organizational development/change models and theories; success fac...\n\n      more description for MSPM1-GC 1010 »\n\n      \n\n\n\nChange is everywhere, constant and increasing in frequency, magnitude and complexity. Leaders, managers, and workplace professionals are expected to manage change on three levels: individually, as part of a team, and organizationally. Workplace professionals are expected to be collaboratively responsive in an expeditious manner. This is a highly interactive course that moves from awareness, knowledge acquisition and progress, to synthesis and application of behavioral practices. Course topics will include: dimensions of change; organizational development/change models and theories; success factors; readiness and assessment tools; organizational culture; actions and behaviors that model best practices; and, successfully leveraging change and developing initiatives to foster positive attitudes among workplace professionals toward change management. Upon successful completion of the course, the student will be expected to have mastered the basic fundamentals of, and perspectives on, defining change, transitional change, transformational change, and various aspects of building proactive and positive teams and coalitions for achieving change.\n\n      less description for MSPM1-GC 1010 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 1015",
            "course_name": "",
            "description": "MSPM1-GC 1015\n\n   Organizational Ethics\n\nIt seems that not a day goes by without news of a new organizational scandal. This course is designed to raise the student’s awareness and interest in the importance of creating and maintaining a solid Ethical Framework within all types of Organizations. Every organization, in every sector, is in scope, whether it be: Corporate, Government, Education, or Non-profit. The core focus of the class is in defining, discussing, and addressing the unique regulatory, cultural, and personal ethical dilemmas confronted by managers in today’s global economy. Many nuances and realities of formal (regulator...\n\n      more description for MSPM1-GC 1015 »\n\n      \n\n\n\nIt seems that not a day goes by without news of a new organizational scandal. This course is designed to raise the student’s awareness and interest in the importance of creating and maintaining a solid Ethical Framework within all types of Organizations. Every organization, in every sector, is in scope, whether it be: Corporate, Government, Education, or Non-profit. The core focus of the class is in defining, discussing, and addressing the unique regulatory, cultural, and personal ethical dilemmas confronted by managers in today’s global economy. Many nuances and realities of formal (regulatory), global (cultural), and personal ethical risks will be presented for discussion and debate. Contemporary case studies will be used to present and address ethical issues.\n\n      less description for MSPM1-GC 1015 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 1020",
            "course_name": "",
            "description": "MSPM1-GC 1020\n\n   Intercultural Business Communication\n\nThe process of economic globalization means that we cannot function in isolation but must interact with the rest of the world for survival. The global nature of many widely diverse modern problems and issues, such as the environment, international business and commerce, patents and licenses, transportation, communications, poverty, health care, international terrorism, and the governance of the Internet, call for cooperation between nations and peoples. Practitioners in corporate, academic, non-profit, and governmental organizations increasingly rely on effective intercultural communication in...\n\n      more description for MSPM1-GC 1020 »\n\n      \n\n\n\nThe process of economic globalization means that we cannot function in isolation but must interact with the rest of the world for survival. The global nature of many widely diverse modern problems and issues, such as the environment, international business and commerce, patents and licenses, transportation, communications, poverty, health care, international terrorism, and the governance of the Internet, call for cooperation between nations and peoples. Practitioners in corporate, academic, non-profit, and governmental organizations increasingly rely on effective intercultural communication in their work on a daily basis. As a result, mastering intercultural communication is no longer an option, but a necessity. Upon successful completion of this course, students will have expanded their range of verbal and nonverbal communications skills and will have become more competent in communicating with others of diverse cultural backgrounds.\n\n      less description for MSPM1-GC 1020 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 1025",
            "course_name": "",
            "description": "MSPM1-GC 1025\n\n   Management of Information Systems\n\nThis course will explore the fundamentals of the technologies, relationships, systems, processes and possibilities created by this critical managerial competency. The organization is examined as a complex system of interconnected business processes. The role of IT to enable the organization to operate, collaborate and make decisions to meet strategic and tactical objectives is explored. Recent advances, issues and trends in information systems management will be discussed. Topics include: The sociotechnical view of systems, IT and software development; the importance and challenges of knowledg...\n\n      more description for MSPM1-GC 1025 »\n\n      \n\n\n\nThis course will explore the fundamentals of the technologies, relationships, systems, processes and possibilities created by this critical managerial competency. The organization is examined as a complex system of interconnected business processes. The role of IT to enable the organization to operate, collaborate and make decisions to meet strategic and tactical objectives is explored. Recent advances, issues and trends in information systems management will be discussed. Topics include: The sociotechnical view of systems, IT and software development; the importance and challenges of knowledge management within organizations; developing and managing information systems; data analytics; the roles of the Internet and secure communications technologies, etc. Substantial use of real-world projects, case studies and hands-on assignments are employed. Upon completion of this course students will have an appreciation of the important contribution IT makes to the success of organizations and how it helps management to make decisions, manage risk, and achieve strategic objectives.\n\n      less description for MSPM1-GC 1025 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 2000",
            "course_name": "",
            "description": "MSPM1-GC 2000\n\n   Applying Project Management Principle in it\n\nThe importance of computer software to the modern business world is undeniable. Organizations across all industries and geographies are dependent on data processing, electronic communication, and on the deployment of systems and software that drives these capabilities. The management of information systems and technology projects is faced with the demand for increased efficiencies, with results expected more quickly, at lower cost, and with higher quality. This course is focused on providing a balanced view of methods, tools, and techniques for managing systems centric projects across the life...\n\n      more description for MSPM1-GC 2000 »\n\n      \n\n\n\nThe importance of computer software to the modern business world is undeniable. Organizations across all industries and geographies are dependent on data processing, electronic communication, and on the deployment of systems and software that drives these capabilities. The management of information systems and technology projects is faced with the demand for increased efficiencies, with results expected more quickly, at lower cost, and with higher quality. This course is focused on providing a balanced view of methods, tools, and techniques for managing systems centric projects across the life cycle continuum from highly predictive life cycles to highly adaptive life cycles. It will blend an understanding of the framework and models for delivering a systems project with the management style required. The content and subject matter are aligned with the current edition of the Project Management Institute’s (PMI) A Guide to the Project Management Body of Knowledge (PMBOK).\n\n      less description for MSPM1-GC 2000 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 2010",
            "course_name": "",
            "description": "MSPM1-GC 2010\n\n   Project information and Communication Management\n\nThis course will focus on the importance of a sound communications management plan to all team members’, sponsors, and stakeholders, as a key component to a successful project. The distribution of project information is critical to ensure all crucial project data such as risks, budget, quality, and schedule are communicated in a timely fashion, throughout all phases of the project lifecycle. The coordination of communications to inform and provide status of project developments, which could affect the outcome of a project or service, will have a direct impact on whether the project meets the c...\n\n      more description for MSPM1-GC 2010 »\n\n      \n\n\n\nThis course will focus on the importance of a sound communications management plan to all team members’, sponsors, and stakeholders, as a key component to a successful project. The distribution of project information is critical to ensure all crucial project data such as risks, budget, quality, and schedule are communicated in a timely fashion, throughout all phases of the project lifecycle. The coordination of communications to inform and provide status of project developments, which could affect the outcome of a project or service, will have a direct impact on whether the project meets the customer expectations. At course completion, students will be able to identify stakeholders, communicate problems effectively, identify and apply conflict resolution techniques, and communicate project objectives. The content and subject matter are aligned with the current edition of the Project Management Institute’s (PMI) A Guide to the Project Management Body of Knowledge (PMBOK).\n\n      less description for MSPM1-GC 2010 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 2020",
            "course_name": "",
            "description": "MSPM1-GC 2020\n\n   Project Risk Analysis and Quality Assurance\n\nThis course will focus on the importance of a proactive approach to the management of project risk and the planning for quality. All projects are characterized by uniqueness, complexity, change, assumptions, constraints, dependencies, and people. Each of these factors introduces a significant risk to every project. Identifying, ranking, and monitoring risks in the project management environment are essential for managing issues that may adversely impact the success of a project. A corollary to project risk is project quality and the need to satisfy the quality standards set forth by a project ...\n\n      more description for MSPM1-GC 2020 »\n\n      \n\n\n\nThis course will focus on the importance of a proactive approach to the management of project risk and the planning for quality. All projects are characterized by uniqueness, complexity, change, assumptions, constraints, dependencies, and people. Each of these factors introduces a significant risk to every project. Identifying, ranking, and monitoring risks in the project management environment are essential for managing issues that may adversely impact the success of a project. A corollary to project risk is project quality and the need to satisfy the quality standards set forth by a project owner. This discussion will cover the activities that determine quality objectives, policies, and responsibilities. At the course completion, students will recognize how they integrate to increase the potential for a successful project. The content and subject matter are aligned with the current edition of the Project Management Institute’s (PMI) A Guide to the Project Management Body of Knowledge (PMBOK).\n\n      less description for MSPM1-GC 2020 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 2030",
            "course_name": "",
            "description": "MSPM1-GC 2030\n\n   Project Management Operations\n\nThis course will focus on the importance of the budgeting, scheduling, contracting, procurement, and negotiating practices in the planning, execution, and control of a project. There are a variety of resources, human and nonhuman, each with its own unique technologies, skills, and traits, which require close coordination. The management of these resources including team, time, capital, and vendors, leads to an inherent characteristic of projects, conflict. There are conflicts among resources as to their concept, techniques, timing, quantity, and use. Competing constraints in the execution of a...\n\n      more description for MSPM1-GC 2030 »\n\n      \n\n\n\nThis course will focus on the importance of the budgeting, scheduling, contracting, procurement, and negotiating practices in the planning, execution, and control of a project. There are a variety of resources, human and nonhuman, each with its own unique technologies, skills, and traits, which require close coordination. The management of these resources including team, time, capital, and vendors, leads to an inherent characteristic of projects, conflict. There are conflicts among resources as to their concept, techniques, timing, quantity, and use. Competing constraints in the execution of a project will have an effect on its scope, time, cost, and quality. At the course completion, students will be able to distinguish the pre-established practices and methodologies that are essential for the success of a project. The content and subject matter are aligned with the current edition of the Project Management Institute’s (PMI) A Guide to the Project Management Body of Knowledge (PMBOK).\n\n      less description for MSPM1-GC 2030 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 2040",
            "course_name": "",
            "description": "MSPM1-GC 2040\n\n   Agile Project Management\n\n\"Agile project management is a project delivery methodology that consists of a series of practices to help manage projects more effectively in the face of rapidly changing conditions. The core principles of Agile project management are productivity, adaptability and collaboration. Agile projects live in dynamic settings, characterized by the speed and uncertainty of the surrounding conditions.\n\nRequirements are constantly changing throughout the project in response to environmental factors that include competition, technology, shifts in customer needs, regulatory requirements, and economic c...\n\n      more description for MSPM1-GC 2040 »\n\n      \n\n\n\n\"Agile project management is a project delivery methodology that consists of a series of practices to help manage projects more effectively in the face of rapidly changing conditions. The core principles of Agile project management are productivity, adaptability and collaboration. Agile projects live in dynamic settings, characterized by the speed and uncertainty of the surrounding conditions.\n\nRequirements are constantly changing throughout the project in response to environmental factors that include competition, technology, shifts in customer needs, regulatory requirements, and economic conditions. This process allows the project scope to change rapidly and frequently, by placing emphasis on stakeholder involvement and communications. Upon successful completion of this course, students will have mastered Agile project management theory and processes. The content and subject matter are aligned with the current edition of the Project Management Institute’s (PMI) A Guide to the Project Management Body of Knowledge (PMBOK).\"\n\n      less description for MSPM1-GC 2040 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 3000",
            "course_name": "",
            "description": "MSPM1-GC 3000\n\n   Special Topics in Project Management\n\nThis seminar will enhance the curriculum through the identification, analysis and application of special topics pertinent to this degree. Special topics courses will be developed to address emerging issues or industry-specific demand. Sample topics include Applying Project Management Principles in Health Care, Project Management in the Financial Services Industry, Project Management for Innovation, Project Management in Research and Development, PRINCE2, etc. The specific titles and content of each seminar, along with the course syllabus, will change to reflect the emerging topic areas of inte...\n\n      more description for MSPM1-GC 3000 »\n\n      \n\n\n\nThis seminar will enhance the curriculum through the identification, analysis and application of special topics pertinent to this degree. Special topics courses will be developed to address emerging issues or industry-specific demand. Sample topics include Applying Project Management Principles in Health Care, Project Management in the Financial Services Industry, Project Management for Innovation, Project Management in Research and Development, PRINCE2, etc. The specific titles and content of each seminar, along with the course syllabus, will change to reflect the emerging topic areas of interest which can only be determined at the time of offering.\n\n      less description for MSPM1-GC 3000 «",
            "offering": false
        },
        {
            "course_id": "MSPM1-GC 4000",
            "course_name": "",
            "description": "MSPM1-GC 4000\n\n   Enterprise Project Management\n\nEnterprise Project Management (EPM) organizes an enterprise's resources in a direct relationship to its mission, strategy, goals, and objectives. It provides a comprehensive overview of the enterprise's collective efforts to integrate the project planning and decision-support processes, to achieve a level of control, transparency, and accomplishment vital to the organization’s success. Upon successful completion of this capstone course, students will have created a framework to manage, monitor, and assess the status of all projects in an enterprise, through a set of uniform EPM processes, prin...\n\n      more description for MSPM1-GC 4000 »\n\n      \n\n\n\nEnterprise Project Management (EPM) organizes an enterprise's resources in a direct relationship to its mission, strategy, goals, and objectives. It provides a comprehensive overview of the enterprise's collective efforts to integrate the project planning and decision-support processes, to achieve a level of control, transparency, and accomplishment vital to the organization’s success. Upon successful completion of this capstone course, students will have created a framework to manage, monitor, and assess the status of all projects in an enterprise, through a set of uniform EPM processes, principles, and methodologies. This extends to a holistic view of managing existing and future projects as a portfolio, aligned to the enterprise’s business needs, and requires students to demonstrate a comprehension of all prior courses undertaken in the program. The content and subject matter are aligned with the current edition of the Project Management Institute’s (PMI) A Guide to the Project Management Body of Knowledge (PMBOK).\n\n      less description for MSPM1-GC 4000 «",
            "offering": false
        }
    ]
}