{
    "major_id": "HRCM1-GC",
    "file": "./2015-2016/MS_in_Human_Resources_(HRCM1-GC).html",
    "courses": [
        {
            "course_id": "HRCM1-GC 1200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2518",
                    "section": "100",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3129",
                    "section": "101",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2924",
                    "section": "102",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3130",
                    "section": "200",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1200\n\n   Managing in a Global Economy\n\nGlobalization has redefined the landscape for managing across borders driving both change and competition. The transnational, a new corporate form, emerged to meet these challenges. From scaling efficiencies globally and creating organizational flexibility to developing worldwide learning capabilities, the transnational must continually evolve to remain competitive. The pace of change and its attendant complexity place significant demands on the international firms ability to grow and execute. Technology, deregulation and economic threats augment this already challenging business environment f...\n\n      more description for HRCM1-GC 1200 »\n\n      \n\n\n\nGlobalization has redefined the landscape for managing across borders driving both change and competition. The transnational, a new corporate form, emerged to meet these challenges. From scaling efficiencies globally and creating organizational flexibility to developing worldwide learning capabilities, the transnational must continually evolve to remain competitive. The pace of change and its attendant complexity place significant demands on the international firms ability to grow and execute. Technology, deregulation and economic threats augment this already challenging business environment for the transnational firm. This course will explore the characteristics of the transnational, its development, its operations and its strategic execution on the global landscape. At the end of this course students will be able to identify, analyze and resolve the issues inherent in managing across borders.\n\n      less description for HRCM1-GC 1200 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1210",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2925",
                    "section": "100",
                    "period": "09/14/2015 - 12/07/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3093",
                    "section": "200",
                    "period": "09/12/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1210\n\n   Quantitative Methods and Metrics for Decision Making\n\nIn today’s business environment, corporate executives and leading professionals must continuously analyze strategic business situations and at times feel limited in their ability to choose appropriate courses of action. In these situations, the executive is expected to utilize sound critical decision making in order to initiate action and move the organization forward, using creative problem solving. The purpose of this course is to provide students with a sound conceptual understanding of the role that Management Science plays in the decision making process. The course will be taught in an ap...\n\n      more description for HRCM1-GC 1210 »\n\n      \n\n\n\nIn today’s business environment, corporate executives and leading professionals must continuously analyze strategic business situations and at times feel limited in their ability to choose appropriate courses of action. In these situations, the executive is expected to utilize sound critical decision making in order to initiate action and move the organization forward, using creative problem solving. The purpose of this course is to provide students with a sound conceptual understanding of the role that Management Science plays in the decision making process. The course will be taught in an applied fashion and whenever possible the \"problem scenario approach\" will be used. Particular attention will be given to problems, opportunities and decisions facing a manager in today’s business world. More specifically, we will discuss and extensively analyze the topics of descriptive and inferential statistics and decision-making. The course will primarily consist of lectures, outside readings, problems, and case studies designed to provide the student with the tools and techniques required to manage processes efficiently and make decisions effectively. At the completion of this course, the student is expected to have gained a working knowledge and understanding of the mathematical models used in Management, how they are constructed and used in practice, and the important contributions they have made to the success of managerial decision-making.\n\n      less description for HRCM1-GC 1210 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1220",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2519",
                    "section": "100",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2926",
                    "section": "200",
                    "period": "09/02/2015 - 12/02/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1220\n\n   Financial Management\n\nThis course introduces the student to the strategic financial and accounting methodologies required to aid the non-financial manager in decision-making. In addition to examining the relationship between finance and the other strategic functions in the organization, particular emphasis will be placed on the impact that finance has on shaping technology-related decisions. At the end of the course, students will be expected to have learned the fundamental financial tools and techniques necessary to be an effective strategic manager. The goal is for students to understand a company's decision-maki...\n\n      more description for HRCM1-GC 1220 »\n\n      \n\n\n\nThis course introduces the student to the strategic financial and accounting methodologies required to aid the non-financial manager in decision-making. In addition to examining the relationship between finance and the other strategic functions in the organization, particular emphasis will be placed on the impact that finance has on shaping technology-related decisions. At the end of the course, students will be expected to have learned the fundamental financial tools and techniques necessary to be an effective strategic manager. The goal is for students to understand a company's decision-making opportunities and processes, and apply these techniques to real-life financial decisions. Topics include (but are not limited to) accounting/finance theories and concepts; financial statement analysis; budgeting, forecasting and variance analysis; capital budgeting and project analysis; cash flow analysis; and time value of money. Students will learn fundamental financial concepts through real-world group assignments, problem solving and term projects. The student who successfully completes this course will have the ability to: understand basic fundamental concepts and principles of finance/accounting and how they are used to create financial reports; analyze financial statements and recognize their importance; use discounted cash flow analysis to analyze competing projects; use modeling techniques for budgeting, forecasting and benchmarking analysis and applications.\n\n      less description for HRCM1-GC 1220 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1240",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2934",
                    "section": "100",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2781",
                    "section": "101",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3225",
                    "section": "102",
                    "period": "09/05/2015 - 10/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3106",
                    "section": "200",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1240\n\n   Information Technology\n\nThe organization is examined as a system, and the roles of information and computers are explored to facilitate the specification, development, implementation and maintenance of information technology for supporting organization decision-making and strategic planning in today's information age. Topics include: the role of information within organizations; overview of modern hardware and software platforms; systems development architectures; planning, developing and managing IT systems; introduction to databases and data warehouses; decision support and artificial intelligence; owner and user r...\n\n      more description for HRCM1-GC 1240 »\n\n      \n\n\n\nThe organization is examined as a system, and the roles of information and computers are explored to facilitate the specification, development, implementation and maintenance of information technology for supporting organization decision-making and strategic planning in today's information age. Topics include: the role of information within organizations; overview of modern hardware and software platforms; systems development architectures; planning, developing and managing IT systems; introduction to databases and data warehouses; decision support and artificial intelligence; owner and user roles in systems development life cycles; technology impacts on corporate competitiveness, structure and control; networks and client/server issues. In response to today?s societal concerns, the course addresses protecting people and information as well as computer crime and forensics. Substantial use of real-world projects, case studies and hands-on assignments are employed.  Upon completion of the course students are expected to have gained an appreciation of the important contribution information technology makes to the success of organizations and how it helps the Chief Information Officer (CIO) and the firm achieve a competitive advantage. More specifically, they will have learned: the strategic role of IT in organizations, typical contributions IT makes to the organization, major issues in IT management, and recent advances and current trends in IT.\n\n      less description for HRCM1-GC 1240 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1300",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2520",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3131",
                    "section": "101",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3132",
                    "section": "102",
                    "period": "09/05/2015 - 10/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3108",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1300\n\n   Foundations of Human Resource Management\n\nThis course focuses on the core competencies, as identified by the leading HR associations, that are essential for current or future managers and staff specialists who wish to increase their effectiveness working directly with human resources in all types of organizations. This course has been designed to equip the student with the basic skill-set and framework required for the more specialized and advanced concentration courses in the curriculum.  Through the use of readings, lectures, group presentations and real-world case studies, students will gain a basic understanding and appreciation o...\n\n      more description for HRCM1-GC 1300 »\n\n      \n\n\n\nThis course focuses on the core competencies, as identified by the leading HR associations, that are essential for current or future managers and staff specialists who wish to increase their effectiveness working directly with human resources in all types of organizations. This course has been designed to equip the student with the basic skill-set and framework required for the more specialized and advanced concentration courses in the curriculum.  Through the use of readings, lectures, group presentations and real-world case studies, students will gain a basic understanding and appreciation of concepts and issues relating to equal employment opportunities, different forms of employment discrimination and harassment, discipline and/or termination of difficult employees, recruitment, selection, and retention practices, managing at-will employees, evaluating performance, employee development, compensation regulations designed to assure economic security and standards in the work environment, and an introduction to labor relations. Upon completion of this course, students will have become more adept at identifying key HR challenges; contributing to HR planning and analysis; understanding employment law and labor relations; developing recruitment; selection and retention programs; formulating compensation and benefits plans; and promoting a safe, secure, harmonious, and productive work environment. Additionally, they will have developed an awareness of the problems associated with diverse work populations, as well as the ethical and legal environment affecting human resource decisions.\n\n      less description for HRCM1-GC 1300 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1310",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2521",
                    "section": "100",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2927",
                    "section": "101",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2782",
                    "section": "200",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1310\n\n   Organizational Behavior\n\nThis course will help students understand the basic components of organizations.  These components include: culture, structure, motivational influences, group processes, change management initiatives, workplace interactions, and communications within organizations.  Students will explore, through written case studies, reading of classic organizational texts, faculty lectures, and video, the basic elements of organizational life.  At the successful completion of this course, students will be able to integrate the various theoretical perspectives of leadership and motivation into a coherent unde...\n\n      more description for HRCM1-GC 1310 »\n\n      \n\n\n\nThis course will help students understand the basic components of organizations.  These components include: culture, structure, motivational influences, group processes, change management initiatives, workplace interactions, and communications within organizations.  Students will explore, through written case studies, reading of classic organizational texts, faculty lectures, and video, the basic elements of organizational life.  At the successful completion of this course, students will be able to integrate the various theoretical perspectives of leadership and motivation into a coherent understanding of organizational life.  In addition, students will be able to understand how the disciplines of psychology (individual and group), sociology, cultural anthropology, human resource management, and social systems theory impact organizations.\n\n      less description for HRCM1-GC 1310 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1320",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2522",
                    "section": "100",
                    "period": "09/05/2015 - 10/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17715",
                    "section": "101",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2928",
                    "section": "200",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1320\n\n   Business Strategy & Ethics\n\nStrategy is the heart and soul of any business.  The essence of business strategy is to understand your organization?s uniqueness and order-winning criteria. This course will focus on how classic strategy paradigms such as differentiation; brand creation; core competency expertise; speed to market; value migration and leadership in the areas of cost reduction, technology and innovation are linked to a sustained competitive advantage.  In addition, the course will examine how changes in the competitive landscape such as globalization, the rapid diffusion of technology, excess capacity, shifting...\n\n      more description for HRCM1-GC 1320 »\n\n      \n\n\n\nStrategy is the heart and soul of any business.  The essence of business strategy is to understand your organization?s uniqueness and order-winning criteria. This course will focus on how classic strategy paradigms such as differentiation; brand creation; core competency expertise; speed to market; value migration and leadership in the areas of cost reduction, technology and innovation are linked to a sustained competitive advantage.  In addition, the course will examine how changes in the competitive landscape such as globalization, the rapid diffusion of technology, excess capacity, shifting marketplace demographics, increasing cost transparencies, the erosion of pricing power and the commoditization and unbundling of products/services; are creating both problems and unique opportunities.  Particular emphasis will be placed on the ethical dilemmas that confront managers due to advances in technology, greater access to information, and more collaborative ventures that break down traditional proprietary boundaries. Given the recent wave of ethical lapses in business, students will be sensitized to the ethical considerations in any given decision-making scenario. Utilizing lectures, assigned readings, small group projects, case studies and simulations, the students will become proficient at business strategy analysis, creation and implementation within an ethical framework.  A final class project will involve the creation of an Individualized Business Strategy Analysis and Action Plan, which applies the techniques learned during the course to any business selected by the student.  Upon successful completion of the course, students will be expected to understand classic and innovative strategy paradigms and how to formulate and implement them under ethical guidelines. Students should also gain knowledge of competitive landscapes and the critical alignment between business strategy and human resources strategy.\n\n      less description for HRCM1-GC 1320 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1330",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3114",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3113",
                    "section": "101",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3133",
                    "section": "102",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3115",
                    "section": "103",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3134",
                    "section": "104",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3248",
                    "section": "200",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 1330\n\n   Business Writing and Presentations\n\nEffective communication is at the core of any professional’s ability to influence organizational decision-making. It is particularly vital for HR professionals because miscommunication can result in serious legal ramifications. This course prepares HR professionals to articulate their thoughts clearly, concisely, and accurately to management, employees, and other stakeholders.  Topics include: targeting your intended audience, identifying and clarifying your message, writing strong subject lines and headers, organizing your written communications, creating sentences that are readable, and edit...\n\n      more description for HRCM1-GC 1330 »\n\n      \n\n\n\nEffective communication is at the core of any professional’s ability to influence organizational decision-making. It is particularly vital for HR professionals because miscommunication can result in serious legal ramifications. This course prepares HR professionals to articulate their thoughts clearly, concisely, and accurately to management, employees, and other stakeholders.  Topics include: targeting your intended audience, identifying and clarifying your message, writing strong subject lines and headers, organizing your written communications, creating sentences that are readable, and editing your writing. Students will apply similar principles to creating powerful oral presentations and will learn to deliver those presentations with confidence. Upon successful completion of this course, you will be able to write more polished communications that get your message across succinctly and in an appropriate tone. You will also be able to design and deliver oral presentations and facilitate question and answer sessions in front of audiences of any size.\n\n      less description for HRCM1-GC 1330 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 1900",
            "course_name": "",
            "description": "HRCM1-GC 1900\n\n   Research Process & Methodology\n\nThis course affords the student the opportunity to thoroughly explore a specific area of human resources as it relates to business.  Research is a complex undertaking with formal processes, methodologies and design.  A successful manager needs not only to be able to research opportunities and/or problems as they present themselves, but also evaluate research produced by others.  To do so, s/he must be fully cognizant of acceptable research techniques, data collection, research design, internal and external validity and statistical methods for hypothesis testing. This course equips the student ...\n\n      more description for HRCM1-GC 1900 »\n\n      \n\n\n\nThis course affords the student the opportunity to thoroughly explore a specific area of human resources as it relates to business.  Research is a complex undertaking with formal processes, methodologies and design.  A successful manager needs not only to be able to research opportunities and/or problems as they present themselves, but also evaluate research produced by others.  To do so, s/he must be fully cognizant of acceptable research techniques, data collection, research design, internal and external validity and statistical methods for hypothesis testing. This course equips the student with the required research skills that are necessary to successfully conceptualize a research topic with original ideas and subsequently develop a proposal for researching that topic. Upon completion of the course, students are expected to have learned: how to conduct a literature survey, the hallmarks of scientific research, the hypothetico-deductive method, how to develop a theoretical framework, data collection methods, analysis and interpretation, and how to evaluate a research report.  Students will also be introduced to methods for correctly citing references and quoting other works without plagiarizing, infringing upon copyright or violating the rules governing proprietary information. Upon successful completion of this course, students will have completed a research proposal containing all the required, formal elements.\n\n      less description for HRCM1-GC 1900 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 1901",
            "course_name": "",
            "description": "HRCM1-GC 1901\n\n   Research Project: Thesis\n\nUpon approval of a proposal the student works with a qualified faculty member to research and write up a thesis on a topic in his/her selected concentration area.  The finished thesis must demonstrate the student?s ability to conduct comprehensive research and articulate original ideas and thought processes that make a practical contribution to the existing body of knowledge in the field of human resources. All final papers must be of an academic and research standard that is consistent with the requirements of current journals and publications.  In order to successfully complete the project, ...\n\n      more description for HRCM1-GC 1901 »\n\n      \n\n\n\nUpon approval of a proposal the student works with a qualified faculty member to research and write up a thesis on a topic in his/her selected concentration area.  The finished thesis must demonstrate the student?s ability to conduct comprehensive research and articulate original ideas and thought processes that make a practical contribution to the existing body of knowledge in the field of human resources. All final papers must be of an academic and research standard that is consistent with the requirements of current journals and publications.  In order to successfully complete the project, the student?s advisor, one other reader from either academe or industry, and the department must approve the thesis.\n\n      less description for HRCM1-GC 1901 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 2015",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2929",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3116",
                    "section": "200",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2015\n\n   Managing Inclusion & Cultural Diversity\n\nToday's workplace is increasingly global and representative of many cultures, belief systems, and values that often come into conflict.  Knowledge workers who build inclusive and collaborative relationships across organizations enable themselves, their teams, and their organizations to respond quickly and efficiently to new market opportunities, new competitors, acquisitions, shifting market demographics, new technology, and changes in employment regulations. Successful professionals need to understand how their own behaviors and beliefs, intentionally or otherwise, impact others.  Whether an ...\n\n      more description for HRCM1-GC 2015 »\n\n      \n\n\n\nToday's workplace is increasingly global and representative of many cultures, belief systems, and values that often come into conflict.  Knowledge workers who build inclusive and collaborative relationships across organizations enable themselves, their teams, and their organizations to respond quickly and efficiently to new market opportunities, new competitors, acquisitions, shifting market demographics, new technology, and changes in employment regulations. Successful professionals need to understand how their own behaviors and beliefs, intentionally or otherwise, impact others.  Whether an organization is primarily domestic or international, the potential for internal conflict increases with the expansion of differences within.  In this course, presentations, interactive discussions and dialogues, assigned readings, video, case studies, and student projects are used to explore dimensions of diversity, inclusive approaches, cross cultural models and theories, assessment tools for self, individual, and organizational audits, actions and behaviors that model best practices, and the integration of the knowledge and skills facilitated by diversity to proactively improve cross-cultural relationships. Students will be encouraged to actively apply these concepts to their own past, present, and prospective professional circumstances. Upon successfully completing this course students will have mastered the basic fundamentals of, and perspectives on, diversity and inclusion, various aspects of building trustworthy teams, as well as their impact on inclusive activities and other organizational activities. Students will also be able to integrate their understanding of cultural diversity and its relationship to other core workplace challenges.\n\n      less description for HRCM1-GC 2015 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2025",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3151",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2025\n\n   Human Resource Metrics\n\nThe average organization invests more than 52% of total revenue on Human Resources related expenses and yet little effort is expended to understand what impact such substantial investments have on driving business strategies, goals and objectives.  In order to evaluate the performance of the Human Resources function, Human Resources Development programs and Organizational Effectiveness, key questions need to be answered to create measurements that are relevant and meaningful to one?s business partners.  While metrics are not goals themselves, they can be powerful tools to drive accountability,...\n\n      more description for HRCM1-GC 2025 »\n\n      \n\n\n\nThe average organization invests more than 52% of total revenue on Human Resources related expenses and yet little effort is expended to understand what impact such substantial investments have on driving business strategies, goals and objectives.  In order to evaluate the performance of the Human Resources function, Human Resources Development programs and Organizational Effectiveness, key questions need to be answered to create measurements that are relevant and meaningful to one?s business partners.  While metrics are not goals themselves, they can be powerful tools to drive accountability, analyze return on investment and demonstrate the effectiveness of HR/HRD/OE services, programs and initiatives.  Many measurements already in place have limited usefulness, are not aligned with current business objectives or obscure the vital information necessary to make critical business decisions.  Through the use of lectures, assigned readings, small group assignments, case studies and business simulations, students will develop overall competency in designing, constructing, analyzing and interpreting the metrics necessary to position Human Resources as a vital and strategic business function.  A final project will require each student to create an Individual HR Dashboard of metrics closely aligned to the strategic business objectives of any selected business.  Upon successful completion of the course, it is expected that students will have developed expertise in the following specific competencies:  aligning HR metrics with strategic corporate objectives to drive business results; creating recruiting metrics to reduce costs and improve candidate pools; quantifying employee productivity and customer satisfaction through metrics; integrating compensation and performance metrics to maximize pay for performance effectiveness; forging a strong link between learning outcomes and business results by incorporating accountability metrics into each learning initiative; developing a metrics-driven learning scorecard to measure the speed and effectiveness of organizational learning; utilizing leadership metrics to build a leadership pipeline that advances succession planning; and finally, creating talent management metrics to leverage the impact of high potentials on critical business imperatives.\n\n      less description for HRCM1-GC 2025 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17718",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3117",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2200\n\n   International Human Resource Management\n\nOrganizations in every industry and sector increasingly recognize the opportunities that result from a `boundary-less? (transnational) perspective. This course will provide students with the opportunity to identify the implications of linking the global marketplace with human capital strategies while searching for world-class solutions. Major topics will include: outsourcing/off-shoring, the role of a core competency approach to organizational development, staff planning, talent training and development in the global learning organization, expatriate issues for employees and their families, cu...\n\n      more description for HRCM1-GC 2200 »\n\n      \n\n\n\nOrganizations in every industry and sector increasingly recognize the opportunities that result from a `boundary-less? (transnational) perspective. This course will provide students with the opportunity to identify the implications of linking the global marketplace with human capital strategies while searching for world-class solutions. Major topics will include: outsourcing/off-shoring, the role of a core competency approach to organizational development, staff planning, talent training and development in the global learning organization, expatriate issues for employees and their families, cultural diversity, international implications of total compensation/benefits strategies; ethics; and governance. Highly interactive sessions will prepare students to face global human capital challenges in their organizations from a strategic perspective (combined with a sensitivity for the uniqueness of their own environments), allowing them to creatively resolve each and every global issue from the broad spectrum of HR functionalities as they arise at their workplaces.\n\n      less description for HRCM1-GC 2200 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2210",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2784",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2935",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2210\n\n   Dispute Resolution & Conflict Management\n\nThis course is designed to develop skills for students to deal with managing and resolving workplace conflict.  Emphasis will be placed on alternate dispute resolution methodologies, including mediation, and negotiation strategies. Extensive use of case studies as they relate to conflict resolution between peers, subordinates and superiors will be made.  Classes will include role-playing and experimenting with exercises that cause conflict. A special project will include the design and implementation of an ADR program for an organization.  Students successfully completing this course will have...\n\n      more description for HRCM1-GC 2210 »\n\n      \n\n\n\nThis course is designed to develop skills for students to deal with managing and resolving workplace conflict.  Emphasis will be placed on alternate dispute resolution methodologies, including mediation, and negotiation strategies. Extensive use of case studies as they relate to conflict resolution between peers, subordinates and superiors will be made.  Classes will include role-playing and experimenting with exercises that cause conflict. A special project will include the design and implementation of an ADR program for an organization.  Students successfully completing this course will have developed a strong foundation, upon which they can build, for resolving employee-relations issues.\n\n      less description for HRCM1-GC 2210 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2220",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2783",
                    "section": "200",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2220\n\n   Compensation & Benefits: Strategy & Plan Design\n\nTo maximize organizational performance, managers need to address key components in the successful retention and motivation of all staff. One primary requisite is the tooling and retooling of a total reward program to ensure alignment with business objectives, drive individual/team/business unit performance and successfully compete with outside forces in the ongoing war for talent. This course will provide students with both the underlying concepts (that include state-of-the-art thinking) along with the latest practices so that they will quickly comprehend the myriad of factors that need to be ...\n\n      more description for HRCM1-GC 2220 »\n\n      \n\n\n\nTo maximize organizational performance, managers need to address key components in the successful retention and motivation of all staff. One primary requisite is the tooling and retooling of a total reward program to ensure alignment with business objectives, drive individual/team/business unit performance and successfully compete with outside forces in the ongoing war for talent. This course will provide students with both the underlying concepts (that include state-of-the-art thinking) along with the latest practices so that they will quickly comprehend the myriad of factors that need to be addressed to ensure an effective total compensation program. In a highly interactive classroom setting, students will quickly grasp each of the five major compensation/benefits elements (both their individual significance and how they interact with each other) to determine what is required to ensure a coordinated program at an affordable cost. Students completing this course will have a practical, comprehensive understanding of the complexities of reward systems, along with an in-depth appreciation of the key ingredients necessary to ensure their successful execution in any workplace setting.\n\n      less description for HRCM1-GC 2220 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2230",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2930",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2931",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2230\n\n   Adv Employee Recruitmnt, Selection, & Retention\n\nIn today?s economy, it is essential that HR professionals do a careful job of recruiting, selecting, developing and retaining talent. Beginning with an overview of the strategic needs of an organization, students explore topics that include, but are not limited to: thinking strategically about staffing issues, selection issues, developing internal talent, succession planning, integrating staffing activities with diversity and equal employment opportunity initiatives, employment tests, and successful employment interviewing. Lectures, assigned readings, case studies and student projects are use...\n\n      more description for HRCM1-GC 2230 »\n\n      \n\n\n\nIn today?s economy, it is essential that HR professionals do a careful job of recruiting, selecting, developing and retaining talent. Beginning with an overview of the strategic needs of an organization, students explore topics that include, but are not limited to: thinking strategically about staffing issues, selection issues, developing internal talent, succession planning, integrating staffing activities with diversity and equal employment opportunity initiatives, employment tests, and successful employment interviewing. Lectures, assigned readings, case studies and student projects are used to explore effective staffing and retention initiatives. Upon successful completion of the course, students will be able to demonstrate the ability to provide financial models for turnover and recruitment costs; the ability to use behavioral interviewing as a best practice; and the ability to formulate, develop and implement retention strategies with management\n\n      less description for HRCM1-GC 2230 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2240",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3159",
                    "section": "100",
                    "period": "10/24/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2748",
                    "section": "200",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2240\n\n   Advanced Labor Relations & Employment Law\n\nThis course will allow students to specialize in the areas of law governing labor relations and employee rights in the workplace.  Special topics will include: collective bargaining; union organizing; de-certification of the union; laws against discrimination; disability law; privacy; and employment litigation. Other subjects will include handling EEOC complaints, and working with legal counsel on the resolution of those complaints.   Emphasis in this course will be placed on intensive coursework, external research, class presentations and case studies.  Guest lecturers on specific legal topic...\n\n      more description for HRCM1-GC 2240 »\n\n      \n\n\n\nThis course will allow students to specialize in the areas of law governing labor relations and employee rights in the workplace.  Special topics will include: collective bargaining; union organizing; de-certification of the union; laws against discrimination; disability law; privacy; and employment litigation. Other subjects will include handling EEOC complaints, and working with legal counsel on the resolution of those complaints.   Emphasis in this course will be placed on intensive coursework, external research, class presentations and case studies.  Guest lecturers on specific legal topics will be used.  This course will inculcate students with the advanced understanding and knowledge necessary to minimize legal exposure by advising an organization on a variety of legal issues.\n\n      less description for HRCM1-GC 2240 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2300",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3224",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2300\n\n   Leadership & Team Building\n\nToday's managers must act as leaders who build collaborative enterprises to enable organizations to respond quickly and efficiently to new market opportunities, new competitors, acquisitions, shifting market demographics, new technology and changes in government regulations. Effective professionals must understand modern leadership and management strategies, and the best ways for working together with others.  A key leadership activity is implementing actions that match their organization's people behaviors to the organization's strategy. New strategies might require incremental changes, or su...\n\n      more description for HRCM1-GC 2300 »\n\n      \n\n\n\nToday's managers must act as leaders who build collaborative enterprises to enable organizations to respond quickly and efficiently to new market opportunities, new competitors, acquisitions, shifting market demographics, new technology and changes in government regulations. Effective professionals must understand modern leadership and management strategies, and the best ways for working together with others.  A key leadership activity is implementing actions that match their organization's people behaviors to the organization's strategy. New strategies might require incremental changes, or sudden metamorphoses into completely new entities, to meet market challenges and/or opportunities. Leaders, working with and through highly trained teams, must guide organizations through these changes. A necessary corollary leadership activity is energizing teams to carry out the transformation processes throughout the organization.  In this course, lectures, discussions, assigned readings, case studies, and student projects are used to explore effective leadership, leader-team relations, and successful implementation of organizational transformation.  At its conclusion the student will have mastered the basic fundamentals of, and perspectives on, leadership; various aspects of the relationship between leaders and teams, and their impact on transformational and other organizational activities; application of these concepts to the student's own past, present, and prospective professional circumstances.\n\n      less description for HRCM1-GC 2300 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2310",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2932",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2310\n\n   Managing Complex Change\n\nChange is everywhere, constant and increasing in frequency, magnitude and complexity.  Leaders, managers, and workplace professionals are expected to manage change on three levels: individually, in teamwork, and organizationally. Complacency is considered a barrier to progress and resiliency is becoming a core competency.  Workplace professionals are expected to be collaboratively responsive in an expeditious manner. The focus of this course will be to manage change, and recognize how individuals, teams, and organizations so do.  Presentations, interactive dialogues, assigned readings, video, ...\n\n      more description for HRCM1-GC 2310 »\n\n      \n\n\n\nChange is everywhere, constant and increasing in frequency, magnitude and complexity.  Leaders, managers, and workplace professionals are expected to manage change on three levels: individually, in teamwork, and organizationally. Complacency is considered a barrier to progress and resiliency is becoming a core competency.  Workplace professionals are expected to be collaboratively responsive in an expeditious manner. The focus of this course will be to manage change, and recognize how individuals, teams, and organizations so do.  Presentations, interactive dialogues, assigned readings, video, case studies, and student projects will be used to explore structural, process, technological, and human change dynamics.  Students will look at examples of small to large companies that have implemented change strategy and actions ? some successfully, others not. This is a highly interactive course that moves from awareness, knowledge acquisition and progress, to synthesis and application of behavioral practices. Topics include (but are not limited to) dimensions of change, organizational development/change models and theories, success factors, readiness and assessment tools for self, individual, and organizational audit, culture, actions and behaviors that model best practices, using metrics to benchmark progress, complacency conflicts, competencies, successfully leveraging change and developing initiatives to foster positive attitudes among workplace professionals toward change management.  Best practices theories such as Kotter?s 8 Step Model, Bridges Three Zones for Transition and Renewal, Abrahamson?s Creative Recombination approach, and Conner?s Resiliency Reflections will all be included. Alternative theories and practices will also be introduced.  Upon successful completion of the course, the student will be expected to have mastered the basic fundamentals of, and perspectives on, defining change, transitional change, transformational change, and various aspects of building proactive and positive teams and coalitions for sponsorship (as well as such teams? impact on complex change activities and other organizational activities).\n\n      less description for HRCM1-GC 2310 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2320",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17721",
                    "section": "200",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2320\n\n   Organizational Theory & Practice\n\nThis course is designed to help students understand the basic concepts of organizational theory by studying the impact of the social sciences upon organizational life.  By closely examining the processes and interactions within organizations and the theoretical bases upon which they are predicated, students will be able to better understand the problems facing today?s complex organizations.  An extensive cadre of case studies and presentations will be used to conduct an in-depth exploration of topics such as individual and group motivation, the learning organization, and leadership stress. Upo...\n\n      more description for HRCM1-GC 2320 »\n\n      \n\n\n\nThis course is designed to help students understand the basic concepts of organizational theory by studying the impact of the social sciences upon organizational life.  By closely examining the processes and interactions within organizations and the theoretical bases upon which they are predicated, students will be able to better understand the problems facing today?s complex organizations.  An extensive cadre of case studies and presentations will be used to conduct an in-depth exploration of topics such as individual and group motivation, the learning organization, and leadership stress. Upon successful completion of the course, students will be expected to have developed an appreciation of the importance of the culture and context of organizations, gained insight into the impact of individual behavior upon the functioning of organizations, and analyzed the various components of group processes upon issues such as power, conflict and organizational politics.\n\n      less description for HRCM1-GC 2320 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2330",
            "course_name": "",
            "description": "HRCM1-GC 2330\n\n   Organizatnl Assessment & Analysis\n\nA well-performed organizational assessment provides leaders with vital information for improving their organization's operating effectiveness.  It also sets the stage for better alignment of a critical resource - the people in the organization - with the organization's current and future strategic directions.  Students can expect that this practical, application-oriented course will give them an overview of the primary principles, processes, and practices used to discover an organization's key attributes and opportunities.  Students will master the material through use of cases and assignments...\n\n      more description for HRCM1-GC 2330 »\n\n      \n\n\n\nA well-performed organizational assessment provides leaders with vital information for improving their organization's operating effectiveness.  It also sets the stage for better alignment of a critical resource - the people in the organization - with the organization's current and future strategic directions.  Students can expect that this practical, application-oriented course will give them an overview of the primary principles, processes, and practices used to discover an organization's key attributes and opportunities.  Students will master the material through use of cases and assignments based in the real world, with an emphasis on immediately applying their learning to real-life situations.  Specific topics include (but are not limited to):  assessment and analysis planning; typical areas of inquiry and data gathering methods (such as interviews, focus groups, surveys, among others); quantitative and qualitative data analysis; various data reporting formats; and different ways to present results.  Critical considerations for each stage of an assessment will be discussed, such as sponsorship; stakeholder analysis; and the benefits and drawbacks of using internal employees versus external consultants.  Upon successful completion of this course, students are expected to have mastered the assessment and analysis material in a manner that will allow them to immediately applying their learning to real-life situations.  They will also be expected to have acquired the requisite knowledge to help them distinguish between the different kinds of sample interventions that might follow their analysis.\n\n      less description for HRCM1-GC 2330 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 2340",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2933",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2340\n\n   Applications in Organization Development\n\nWhen leaders have an accurate idea of their organization?s strengths, weaknesses, opportunities and needs, they are better equipped to develop its capabilities in the directions they desire.  This course is designed to introduce students to the various organizational interventions available to leaders and others who are responsible for improving an organization?s ability to achieve results.  Topics include (but are not limited to):  prior and future trends in OD; an overview of popular, effective OD tools and techniques; assessing and choosing the right intervention for a particular situation;...\n\n      more description for HRCM1-GC 2340 »\n\n      \n\n\n\nWhen leaders have an accurate idea of their organization?s strengths, weaknesses, opportunities and needs, they are better equipped to develop its capabilities in the directions they desire.  This course is designed to introduce students to the various organizational interventions available to leaders and others who are responsible for improving an organization?s ability to achieve results.  Topics include (but are not limited to):  prior and future trends in OD; an overview of popular, effective OD tools and techniques; assessing and choosing the right intervention for a particular situation; managing the intervention; overcoming common implementation issues; and evaluation of an intervention?s impact.  Critical considerations for each stage of an intervention will be discussed, such as sponsorship; stakeholder analysis; and the benefits and drawbacks of using internal employees versus external consultants.  The focus of all interventions will be on achieving actual results that ensure greater organizational alignment.  Upon successful completion of this course students are expected to have acquired knowledge and skills to help them assure increased alignment between the organization?s people and strategy and achieve more powerful overall results for their target organizations.\n\n      less description for HRCM1-GC 2340 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2350",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3153",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2350\n\n   The Future of Human Resource Management:  Innovation\n\nThe HR field often focuses on “best practices,” but “best practices” can only advance your organization to the point of “best already in use.” Is that really enough to provide a competitive advantage?  This course will focus on fundamental innovation in human resource management, and in general management as well, in response to the rapidly changing external environment. The course will focus on new ideas, processes, and programs, as opposed to looking for new ways to deliver the same old ideas. This course will encourage innovative ways of thinking about business challenges. To develop innova...\n\n      more description for HRCM1-GC 2350 »\n\n      \n\n\n\nThe HR field often focuses on “best practices,” but “best practices” can only advance your organization to the point of “best already in use.” Is that really enough to provide a competitive advantage?  This course will focus on fundamental innovation in human resource management, and in general management as well, in response to the rapidly changing external environment. The course will focus on new ideas, processes, and programs, as opposed to looking for new ways to deliver the same old ideas. This course will encourage innovative ways of thinking about business challenges. To develop innovations in human resource management, students will need to expand the way they think. This course will certainly not provide all of the answers, but it is critically important to think about the future and to begin to anticipate the questions.  The objective of the course is for students to develop a strong spirit of innovation.\n\n      less description for HRCM1-GC 2350 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2400",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17720",
                    "section": "200",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2400\n\n   Foundations of Coaching & Coaching Theory\n\nCoaching is a new field that draws on many related domains including behavioral science, solutions-focused therapy, philosophy, systems thinking, and the study of change.  It is important to be familiar with these topics (as they inform the field of coaching) as well as understand the scientific basis behind any coaching frameworks.  Through a combination of presentations (student and teacher), discussion groups, guest lecturers, and extensive readings and written assignments, students will gain a broad understanding of the wide range of fields that coaching draws upon, enabling them to see th...\n\n      more description for HRCM1-GC 2400 »\n\n      \n\n\n\nCoaching is a new field that draws on many related domains including behavioral science, solutions-focused therapy, philosophy, systems thinking, and the study of change.  It is important to be familiar with these topics (as they inform the field of coaching) as well as understand the scientific basis behind any coaching frameworks.  Through a combination of presentations (student and teacher), discussion groups, guest lecturers, and extensive readings and written assignments, students will gain a broad understanding of the wide range of fields that coaching draws upon, enabling them to see the links between theory and practice when coaching others.  They will also be able to utilize the material generated from academic studies in various domains to validate their work within organizations and with external clients.  Topics include the study of systems, change, principles of adult learning theory, cognitive behavioral therapy, and neuro-linguistics.  Students will also explore the thinking emerging from recent non-clinical, solutions-focused approaches within the field of psychology.  Upon successful completion of this course, students will be expected to have gained a solid understanding of the definitions of and theory behind coaching, a working knowledge of the scientific basis for coaching, and familiarity with the wide range of coaching models used in the field.  Students will also have been prepared for coaching skills development in an applied setting.\n\n      less description for HRCM1-GC 2400 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2410",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3122",
                    "section": "100",
                    "period": "10/24/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2410\n\n   Coaching Skills & Techniques\n\nCoaching is more of a spoken language than a set of theories, thus it is important that students develop high-level delivery skills for all types of coaching, ensuring that they are able to structure coaching conversations well and work within the theories and frameworks established in the previous module.  Using a combination of presentations, challenging live exercises, coaching assignments, guest lecturers, readings and live assessment of skills, students will therefore be prepared for coaching other people in many situations, by applying a range of coaching tools and processes.   Topics in...\n\n      more description for HRCM1-GC 2410 »\n\n      \n\n\n\nCoaching is more of a spoken language than a set of theories, thus it is important that students develop high-level delivery skills for all types of coaching, ensuring that they are able to structure coaching conversations well and work within the theories and frameworks established in the previous module.  Using a combination of presentations, challenging live exercises, coaching assignments, guest lecturers, readings and live assessment of skills, students will therefore be prepared for coaching other people in many situations, by applying a range of coaching tools and processes.   Topics include contracting, establishing trust and intimacy, developing goals, strategies and action plans, managing coaching conversations, managing progress during an engagement, creating awareness, and ethics.  Upon successful completion of this course, students will be expected to have: developed the ability to apply the theories learned in the Foundations course to real-world coaching situations, gained an appreciation of the various techniques used to engage people in a coaching dialogue, learned how to establish a coaching interaction, understood how to use coaching to deepen an individual?s self-awareness in order to promote action and accountability.\n\n      less description for HRCM1-GC 2410 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2420",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3136",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2420\n\n   Managerial & Executive Coaching\n\nCoaching is a learning tool that can be utilized to drive almost any learning and development function in an organization, from induction and general skills training, to transition, succession planning and leadership development.  This course provides students with the frameworks and systems for all ways in which coaching can be applied, including looking at a broad range of models and approaches in the field today.  Through a combination of presentations (teacher, student and guest), case studies, research, and written assignments, students will develop an understanding of global trends and b...\n\n      more description for HRCM1-GC 2420 »\n\n      \n\n\n\nCoaching is a learning tool that can be utilized to drive almost any learning and development function in an organization, from induction and general skills training, to transition, succession planning and leadership development.  This course provides students with the frameworks and systems for all ways in which coaching can be applied, including looking at a broad range of models and approaches in the field today.  Through a combination of presentations (teacher, student and guest), case studies, research, and written assignments, students will develop an understanding of global trends and best-practices in the use of coaching in the workplace.  Topics include: life-coaching; internal coaching programs; induction coaching; transition coaching; learning and development initiatives; manager as coach; and developing coaching with respect to cultural considerations.  Upon successful completion of this course, students will be expected to be able to design a wide range of coaching programs ready for delivery to an organization, either as an internal or external HR/OD professional or consultant.\n\n      less description for HRCM1-GC 2420 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2430",
            "course_name": "",
            "description": "HRCM1-GC 2430\n\n   Small Business Coaching\n\nThis course is designed for individuals who are interested in establishing and growing a small business as a professional coach. This course will cover how to build, maintain and sustain a thriving coaching practice. Students will be presented with and develop ideas, strategies and techniques focusing on best practices for small business development. It will focus on how to build and maintain their own coaching business by exploring the following: business models, income streams, financing strategies, accounts payables, cash flow, investing in your business, developing new billable services an...\n\n      more description for HRCM1-GC 2430 »\n\n      \n\n\n\nThis course is designed for individuals who are interested in establishing and growing a small business as a professional coach. This course will cover how to build, maintain and sustain a thriving coaching practice. Students will be presented with and develop ideas, strategies and techniques focusing on best practices for small business development. It will focus on how to build and maintain their own coaching business by exploring the following: business models, income streams, financing strategies, accounts payables, cash flow, investing in your business, developing new billable services and products, pricing and marketing/sales strategies and techniques, and social media presence.  Students will also learn how to coach entrepreneurs and small business owners who are looking to start or expand their own practices but are having challenges, facing obstacles or wanting to achieve extraordinary results.\n\n      less description for HRCM1-GC 2430 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 2440",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17722",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2440\n\n   Prin & Prac in Online Course Prod & Delivery\n\nThis course has been designed to prepare faculty, trainers, and other instructors who wish to develop and teach online courses. In addition to an introduction to the basic principles and theories of online course creation and delivery, different theories of pedagogy and androgogy and their application in online courses will be explored.  Students also learn techniques for identifying the appropriate use of technology and strategies for adapting onsite teaching tactics to online environments.  They are also encouraged to research the various resources and publications available in the fields of...\n\n      more description for HRCM1-GC 2440 »\n\n      \n\n\n\nThis course has been designed to prepare faculty, trainers, and other instructors who wish to develop and teach online courses. In addition to an introduction to the basic principles and theories of online course creation and delivery, different theories of pedagogy and androgogy and their application in online courses will be explored.  Students also learn techniques for identifying the appropriate use of technology and strategies for adapting onsite teaching tactics to online environments.  They are also encouraged to research the various resources and publications available in the fields of educational technology and distance learning. Topics include, but are not limited to, the three main design paradigms (the ADDIE model, the Dick and Carey Model, and the Kemp model); the application of learning theory to online instruction; online course content development; and strategies for effective online curriculum planning and delivery.  Students will have the opportunity to reinforce their skills by being assigned responsibility for the design and delivery of an instructional unit.  Proficiency in the use of email and Web browsers is required. Upon successful completion of this course, students are expected to have learned; how to define the characteristics and needs of adult distance learners; effective ways to meet these needs through online instruction; and the differences between online courses with respect to class participation, interaction, course materials, and instruction involvement.\n\n      less description for HRCM1-GC 2440 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2500",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17723",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Measuring the Impact of Talent Management",
            "description": "HRCM1-GC 2500 Measuring the Impact of Talent Management \nIf talent management is a source of sustainable competitive advantage, strategic talent measurement is essential to that process, providing critical decision support to management based on metrics that show how, where and how much of a return the organization gets from talent investments. Because this course adopts the broader definition of “talent,” it examines measurement processes at both the leadership and general workforce levels. Practical measurement issues, typical stakeholder concerns, and translating results into compelling information.",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2505",
            "course_name": "",
            "description": "HRCM1-GC 2505\n\n   Multicultural Business Communication\n\nThe process of economic globalization means that we cannot function in isolation but must interact with the rest of the world for survival.   The global nature of many widely diverse modern problems and issues, such as the environment, international business and commerce, patents and licenses, transportation, communications, poverty, health care,  international terrorism, and the governance of the Internet,  call for cooperation between nations and peoples.  Practitioners in corporate, academic, non-profit, and governmental organizations increasingly rely on effective intercultural communicati...\n\n      more description for HRCM1-GC 2505 »\n\n      \n\n\n\nThe process of economic globalization means that we cannot function in isolation but must interact with the rest of the world for survival.   The global nature of many widely diverse modern problems and issues, such as the environment, international business and commerce, patents and licenses, transportation, communications, poverty, health care,  international terrorism, and the governance of the Internet,  call for cooperation between nations and peoples.  Practitioners in corporate, academic, non-profit, and governmental organizations increasingly rely on effective intercultural communication in their work on a daily basis.  As a result, mastering intercultural communication is no longer an option, but a necessity. Upon successful completion of this course, students will have expanded their range of verbal and nonverbal communications skills and will have become more competent in communicating with others of diverse cultural backgrounds.\n\n      less description for HRCM1-GC 2505 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 2510",
            "course_name": "",
            "description": "HRCM1-GC 2510\n\n   Succession Management\n\nSuccession management involves anticipating the strategic leadership needs of the corporation, from the C-Suite to pivotal emerging leadership positions, and identifying and developing a pipeline of high potential leaders to fill those needs. Succession planning is conducted from the perspective of the organization’s interests as opposed to the career development goals of an individual employee. As any organization evolves and changes, there is a continuous need to translate the organization’s strategic direction to a talent value proposition and move people into new positions and experiences ...\n\n      more description for HRCM1-GC 2510 »\n\n      \n\n\n\nSuccession management involves anticipating the strategic leadership needs of the corporation, from the C-Suite to pivotal emerging leadership positions, and identifying and developing a pipeline of high potential leaders to fill those needs. Succession planning is conducted from the perspective of the organization’s interests as opposed to the career development goals of an individual employee. As any organization evolves and changes, there is a continuous need to translate the organization’s strategic direction to a talent value proposition and move people into new positions and experiences that are aligned with this value proposition. Succession planning enables the organization to identify the right candidates for strategically significant positions and to help them successfully transition into these roles.\n\n      less description for HRCM1-GC 2510 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 2515",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17724",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2515\n\n   Talent Assessment:  Approaches and Tools\n\nWhen organizations invest in talent management and assessment, they are really investing in identifying, measuring and developing those strengths that will allow their workforce and their leaders to execute the business strategy successfully. Talent management and assessment is more than administering assessment instruments and acting on the results. The organization must first be able to translate its strategic goals into organizational capabilities that drive goal attainment. Second, it must be able to translate organizational capabilities into leadership and workforce strengths that will bu...\n\n      more description for HRCM1-GC 2515 »\n\n      \n\n\n\nWhen organizations invest in talent management and assessment, they are really investing in identifying, measuring and developing those strengths that will allow their workforce and their leaders to execute the business strategy successfully. Talent management and assessment is more than administering assessment instruments and acting on the results. The organization must first be able to translate its strategic goals into organizational capabilities that drive goal attainment. Second, it must be able to translate organizational capabilities into leadership and workforce strengths that will build the required organizational capability. Only then can the organization’s HR group decide how to use assessment to select for, manage and develop the leadership and workforce strengths that matter. Finally, once an assessment strategy is built that is demonstrably aligned with the business strategy, then different assessment tools and practices can be evaluated against it, and investments into talent assessment can be managed as a strategic portfolio.\n\n      less description for HRCM1-GC 2515 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2520",
            "course_name": "",
            "description": "HRCM1-GC 2520\n\n   Global Selection\n\nAs an organization grows from domestic to international to transnational, its ability to attract and hire the best talent becomes increasingly challenging. While few organizations currently hire on a truly global basis, many companies are moving closer to this goal.  Their ultimate success depends on their ability to identify competencies required across global markets, develop tests and assessments that are valid across cultures, and compare employee skills, abilities, and competencies across business units and regions. This course will address concepts, best practices, and global trends in p...\n\n      more description for HRCM1-GC 2520 »\n\n      \n\n\n\nAs an organization grows from domestic to international to transnational, its ability to attract and hire the best talent becomes increasingly challenging. While few organizations currently hire on a truly global basis, many companies are moving closer to this goal.  Their ultimate success depends on their ability to identify competencies required across global markets, develop tests and assessments that are valid across cultures, and compare employee skills, abilities, and competencies across business units and regions. This course will address concepts, best practices, and global trends in personnel recruitment and selection.\n\n      less description for HRCM1-GC 2520 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 2525",
            "course_name": "Aligning Talent Management to Strategy",
            "description": "HRCM1-GC 2525 Aligning Talent Management to Strategy",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 2530",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17725",
                    "section": "100",
                    "period": "09/03/2015 - 10/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 2530\n\n   GTM:  Leading a Strategic Initiative\n\nGlobal Talent Management (GTM) is a major investment in the current and future human capital of an organization. To be successful and sustainable as an organizational initiative, it requires leadership and must be reflective of overarching strategy. In addition, as an organizational initiative, it is subject to the influences of the organization’s culture that can serve to help or hinder its success. While human resources professionals are experts in how to execute GTM, they also must understand the implications of implementing such an initiative within the context of an organization. Their ab...\n\n      more description for HRCM1-GC 2530 »\n\n      \n\n\n\nGlobal Talent Management (GTM) is a major investment in the current and future human capital of an organization. To be successful and sustainable as an organizational initiative, it requires leadership and must be reflective of overarching strategy. In addition, as an organizational initiative, it is subject to the influences of the organization’s culture that can serve to help or hinder its success. While human resources professionals are experts in how to execute GTM, they also must understand the implications of implementing such an initiative within the context of an organization. Their ability to help leaders take ownership of GTM, view it strategically, and counteract the negative effects of organizational culture is a critical success factor. Through lectures, readings, case studies, group discussions, and group presentations, students will learn how to enable organizational leaders to incorporate GTM as a strategic initiative in ways that will maximize success and sustainability.\n\n      less description for HRCM1-GC 2530 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 2600",
            "course_name": "",
            "description": "HRCM1-GC 2600\n\n   Making Social Entrepreneurship Happen\n\nMaking Social Entrepreneurship Happen will help you understand the process of social entrepreneurial problem-solving, arm you with some of the practical, nitty-gritty skills required for a value-centered career and empower you, as a change agent, to make a difference starting right now\n\nLofty ideals are not enough.  Wanting to do good is one thing.  Actually doing good is another.  When we hold ourselves to lesser performance standards, it disrespects the impoverished, the disenfranchised and the people whom we seek to help and empower. \n\nMaking Social Entrepreneurship Happen is not about surv...\n\n      more description for HRCM1-GC 2600 »\n\n      \n\n\n\nMaking Social Entrepreneurship Happen will help you understand the process of social entrepreneurial problem-solving, arm you with some of the practical, nitty-gritty skills required for a value-centered career and empower you, as a change agent, to make a difference starting right now\n\nLofty ideals are not enough.  Wanting to do good is one thing.  Actually doing good is another.  When we hold ourselves to lesser performance standards, it disrespects the impoverished, the disenfranchised and the people whom we seek to help and empower. \n\nMaking Social Entrepreneurship Happen is not about surveying or analyzing theories of social action, social venture business models, particular social innovations or your dream solution to the world’s problems.  The curriculum is agnostic about competing methodologies and theories of social change.  The course is about how you advance your social change agenda, mission and career.\n\n      less description for HRCM1-GC 2600 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3000",
            "course_name": "Personal & Life Coaching",
            "description": "HRCM1-GC 3000 Personal & Life Coaching",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3020",
            "course_name": "Rapid Change & The Entrepreneurial Org",
            "description": "HRCM1-GC 3020 Rapid Change & The Entrepreneurial Org",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3021",
            "course_name": "",
            "description": "HRCM1-GC 3021\n\n   Resizing the Organization\n\nCompanies with the best chance of prospering are those that continue to modify their organizational structure on an ongoing basis to navigate the ever-changing dynamics of the competitive, technological, and environmental landscapes. This course is designed to offer a wealth of applicable industrial and organizational psychology theories, best business practices, and winning techniques to guide companies through the often difficult processes of mergers, acquisitions, downsizings, and other transitions. Topics will include: identifying organization needs and objectives; developing adaptive desi...\n\n      more description for HRCM1-GC 3021 »\n\n      \n\n\n\nCompanies with the best chance of prospering are those that continue to modify their organizational structure on an ongoing basis to navigate the ever-changing dynamics of the competitive, technological, and environmental landscapes. This course is designed to offer a wealth of applicable industrial and organizational psychology theories, best business practices, and winning techniques to guide companies through the often difficult processes of mergers, acquisitions, downsizings, and other transitions. Topics will include: identifying organization needs and objectives; developing adaptive design strategies and transition stages; managing resources allocation and employee re-grouping and layoff; designing workload reorganization, redistribution, and outsourcing; handling employee behavioral reactions with supportive actions; effective communication strategies; and, metrics for success. By course completion, students will be able to analyze, plan and implement organization resizing in the workplace to help organizations to maximize gains and reduce operating costs, while simultaneously boosting productivity.\n\n      less description for HRCM1-GC 3021 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3022",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3123",
                    "section": "100",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 3022\n\n   Mergers & Acquisitions\n\nMergers and acquisitions (M&A) are an increasingly popular way to expand into new markets and incorporate new technologies to strengthen and maintain an organization’s position in the marketplace. This course is designed for today’s managers to understand the strategic rationale, stages, and legislative framework of M&A. This course will emphasize the people-related activities and issues involved in the pre-deal, due diligence, integration planning and implementation stages of M&A. Upon successful completion of this course, students will have the skill sets of key business partners in an organ...\n\n      more description for HRCM1-GC 3022 »\n\n      \n\n\n\nMergers and acquisitions (M&A) are an increasingly popular way to expand into new markets and incorporate new technologies to strengthen and maintain an organization’s position in the marketplace. This course is designed for today’s managers to understand the strategic rationale, stages, and legislative framework of M&A. This course will emphasize the people-related activities and issues involved in the pre-deal, due diligence, integration planning and implementation stages of M&A. Upon successful completion of this course, students will have the skill sets of key business partners in an organization’s M&A activities and will be able to help organizations develop key strategy, manage soft due diligence activities, provide input into the process of change, advise top management on new organizational structure, create transition teams, oversee communications, manage learning and integration processes, and identify and develop new employee and organizational competencies.\n\n      less description for HRCM1-GC 3022 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 3100",
            "course_name": "Human Resource Issues in Industry",
            "description": "HRCM1-GC 3100 Human Resource Issues in Industry",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3105",
            "course_name": "Recruiting With Social Media",
            "description": "HRCM1-GC 3105 Recruiting With Social Media",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3200",
            "course_name": "Total Rewards Managment",
            "description": "HRCM1-GC 3200 Total Rewards Managment \nGraduate students will learn what is required to develop a rewards program that has the power to attract, retain and motivate employees ? total rewards. This foundation course is designed as a comprehensive overview of the total rewards model and its three components: compensation, benefits and the work experience. Emphasis is given to the concept of the total rewards design process. Finally, graduate students are introduced to the general skills needed by the HR professional to become an effective strategic business partner.",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3201",
            "course_name": "Strategic Benefits Planning",
            "description": "HRCM1-GC 3201 Strategic Benefits Planning \nThis course provides an examination of employee benefits program strategy in private-sector settings. Closely attuned to today's benefits issues and challenges, this course is an excellent preparation for achievement in this field. You'll gain a solid foundation in all strategic aspects of employee benefits, including both health and welfare benefits as well as retirement benefits. You'll explore case studies designed to model real-life situations encountered by HR professionals.  Graduate students will also explore a variety of benefits strategies.",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3202",
            "course_name": "",
            "description": "HRCM1-GC 3202\n\n   Compensation: Strategy & Practice\n\nThis advanced-level course explores the strategy and design of compensation in a global environment. Topics include the development of an effective compensation strategy that responds to organizational, cultural and environmental complexities. The design and administration of base pay and variable compensation is reviewed, as are best practices in global compensation. The goal of this course is to enable graduate students to effectively interact with internal or external tax, financial, legal and planning professionals and with members of the board of directors as they construct global compens...\n\n      more description for HRCM1-GC 3202 »\n\n      \n\n\n\nThis advanced-level course explores the strategy and design of compensation in a global environment. Topics include the development of an effective compensation strategy that responds to organizational, cultural and environmental complexities. The design and administration of base pay and variable compensation is reviewed, as are best practices in global compensation. The goal of this course is to enable graduate students to effectively interact with internal or external tax, financial, legal and planning professionals and with members of the board of directors as they construct global compensation plans.\n\n      less description for HRCM1-GC 3202 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3203",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17726",
                    "section": "200",
                    "period": "10/20/2015 - 12/01/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 3203\n\n   Executive Compensation\n\nThis advanced-level course concentrates on strategic issues affecting executive compensation and key technical aspects of the regulatory environment. It covers accounting, taxation, securities issues, performance measures, short-term incentives, long-term incentives and other aspects of executive compensation. The goal of this course is to enable participants to effectively interact with internal or external tax, financial, legal and planning professionals and with members of the board of directors. The course is primarily oriented toward the design and administration of executive compensation...\n\n      more description for HRCM1-GC 3203 »\n\n      \n\n\n\nThis advanced-level course concentrates on strategic issues affecting executive compensation and key technical aspects of the regulatory environment. It covers accounting, taxation, securities issues, performance measures, short-term incentives, long-term incentives and other aspects of executive compensation. The goal of this course is to enable participants to effectively interact with internal or external tax, financial, legal and planning professionals and with members of the board of directors. The course is primarily oriented toward the design and administration of executive compensation programs for publicly owned companies. Emphasis is given to the concept of the Executive Compensation design process.\n\n      less description for HRCM1-GC 3203 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 3204",
            "course_name": "Design & Management of Healthcare & Ins Plans",
            "description": "HRCM1-GC 3204 Design & Management of Healthcare & Ins Plans \nThis course provides an in-depth view of the decision and management of health and welfare benefits. It covers legal requirements, including recent legislative changes, as well as developing issues and trends. The course is designed specifically for compensation and benefits professionals who need a design oriented perspective of health and welfare plans. It also is appropriate for those preparing to assume responsibility for the management of these plans, as well as benefits practitioners whose specialized knowledge is in focused areas other than the management of health and welfare plans.",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3205",
            "course_name": "",
            "description": "HRCM1-GC 3205\n\n   Design & Management of Retirement Plans\n\nThis course presents an in-depth analysis of objectives, principles, practices, rules and regulations in retirement planning. It provides the foundation on which qualified retirement plans are designed, implemented and managed. This course also covers multi-employer, government, 403(b), or nonqualified retirement plans in depth. This course is designed specifically for compensation and benefits professionals seeking an overview of qualified retirement plans. It is also appropriate for those preparing to assume responsibility for the detailed administration and management of these plans, and fo...\n\n      more description for HRCM1-GC 3205 »\n\n      \n\n\n\nThis course presents an in-depth analysis of objectives, principles, practices, rules and regulations in retirement planning. It provides the foundation on which qualified retirement plans are designed, implemented and managed. This course also covers multi-employer, government, 403(b), or nonqualified retirement plans in depth. This course is designed specifically for compensation and benefits professionals seeking an overview of qualified retirement plans. It is also appropriate for those preparing to assume responsibility for the detailed administration and management of these plans, and for benefits practitioners whose specialized knowledge is in areas other than pension management.\n\n      less description for HRCM1-GC 3205 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3206",
            "course_name": "Variable Pay: Incentvs, Recognition, & Bonuses",
            "description": "HRCM1-GC 3206 Variable Pay: Incentvs, Recognition, & Bonuses \nGraduate students will learn what is required to develop a variable pay program that has the power to attract, retain and motivate employees.  This strategic course is designed as a comprehensive overview of the variable pay model and its three components: incentives, recognition and bonus compensation. Emphasis is given to the concept of the variable pay design process. Finally, graduate students develop the advanced compensation skills necessary to become an effective strategic business partner in the variable pay process.",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3207",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3119",
                    "section": "200",
                    "period": "09/02/2015 - 10/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 3207\n\n   Global Talent Management\n\nThis course will approach Global Talent Management as a fundamental business concept and will focus on key talent management processes and techniques as practiced today in business, non-profit, and governmental organizations. Through lectures, readings, case studies, group discussions, and presentations, students will learn how to analyze and assess the factors that optimize workforce performance and ensure return on talent management investments, develop a model for aligning talent and business strategy to ensure necessary talent resources are available for business success, and evaluate vari...\n\n      more description for HRCM1-GC 3207 »\n\n      \n\n\n\nThis course will approach Global Talent Management as a fundamental business concept and will focus on key talent management processes and techniques as practiced today in business, non-profit, and governmental organizations. Through lectures, readings, case studies, group discussions, and presentations, students will learn how to analyze and assess the factors that optimize workforce performance and ensure return on talent management investments, develop a model for aligning talent and business strategy to ensure necessary talent resources are available for business success, and evaluate various approaches for developing managers and leaders of knowledge-based organizations. Additional course topics will include:  reviewing, reinventing, and developing strategies for attracting, selecting, motivating, and retaining the best talent; engaging and utilizing superior performers; and, the tools and strategies that successful organizations use to leverage human capital investments more effectively than their competitors.\n\n      less description for HRCM1-GC 3207 «",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 3208",
            "course_name": "Impct of Effective Trng: Eval, Meas, & Behav Chng",
            "description": "HRCM1-GC 3208 Impct of Effective Trng: Eval, Meas, & Behav Chng",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3209",
            "course_name": "Negotiation Skills",
            "description": "HRCM1-GC 3209 Negotiation Skills",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3400",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2523",
                    "section": "100",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Banks, Ronald",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship",
            "description": "HRCM1-GC 3400 Internship",
            "offering": true
        },
        {
            "course_id": "HRCM1-GC 3401",
            "course_name": "",
            "description": "HRCM1-GC 3401\n\n   Career Coaching\n\nCareer coaching develops a plan for clients to take control of their work life. This course offers an overview of strategies, tolls and resources for navigating difficult career issues and dilemmas, from exploring different career paths to charting radical career change. This course is designed to provide the tools necessary for coaches to assist clients in clarifying career goals, identifying critical informational resources, explore career options, and achieve better work life balance. In addition, this course will provide the coach with the critical skills necessary to outline a strategic j...\n\n      more description for HRCM1-GC 3401 »\n\n      \n\n\n\nCareer coaching develops a plan for clients to take control of their work life. This course offers an overview of strategies, tolls and resources for navigating difficult career issues and dilemmas, from exploring different career paths to charting radical career change. This course is designed to provide the tools necessary for coaches to assist clients in clarifying career goals, identifying critical informational resources, explore career options, and achieve better work life balance. In addition, this course will provide the coach with the critical skills necessary to outline a strategic job search campaign, if the client so desires. Finally, the course will focus on allowing the coach to develop a workable career plan for clients which also takes into account unanticipated twists, barriers to career movement and the various types of resources available for additional career assistance. Instructional techniques include learning and practicing skills in ?real-time? coaching interactions. Participants develop a personal purpose statement and plan of action for self-development. Reinforce new skills and insights between practice sessions with self-coaching assignments.\n\n      less description for HRCM1-GC 3401 «",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 3900",
            "course_name": "Independent Study",
            "description": "HRCM1-GC 3900 Independent Study",
            "offering": false
        },
        {
            "course_id": "HRCM1-GC 4000",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2807",
                    "section": "100",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3120",
                    "section": "101",
                    "period": "10/24/2015 - 12/05/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3121",
                    "section": "200",
                    "period": "10/19/2015 - 11/30/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HRCM1-GC 4000\n\n   Spec Proj: Applied Human Resource Strategies\n\nThis requirement will consist of an intensive exploration of the applied aspect of human resource strategy.  In the real world, managers must make decisions without perfect information, under conditions of uncertainty, and under time constraints. Students will be assigned to teams each of which manages an organization that competes against one another in an HRM Simulation. This affords them the unique opportunity to make decisions, see how the decisions work out, and then try again. Thus, players get a 'hands on' experience with manipulation key human resources variables in a dynamic setting. ...\n\n      more description for HRCM1-GC 4000 »\n\n      \n\n\n\nThis requirement will consist of an intensive exploration of the applied aspect of human resource strategy.  In the real world, managers must make decisions without perfect information, under conditions of uncertainty, and under time constraints. Students will be assigned to teams each of which manages an organization that competes against one another in an HRM Simulation. This affords them the unique opportunity to make decisions, see how the decisions work out, and then try again. Thus, players get a 'hands on' experience with manipulation key human resources variables in a dynamic setting. The simulation can be programmed to simulate a profit or nonprofit organization that is in manufacturing or service. Teams are expected to establish objectives, plan their strategy, and then make the required decisions dictated by these plans. Typical decision variables involve wages, replacing employees, hiring, promoting from within, training cost for promotions, fringe benefits, budget for other activities, safety, employee participation programs, grievances, human resources information systems, performance appraisal programs, affirmative action program, production levels, overtime, employee morale, turnover, and absenteeism. It is anticipated that this course will be team-taught so that the student will learn to understand and appreciate the many different facets of the strategic role that HR occupies in an organization. In order to expose the students to diverse, real-life situations, industry experts representing the various HR functions in an organization will present actual problem scenarios for the students to analyze, solve and present their findings. Subsequent discussions will introduce the students to how these situations were actually resolved. Finally, students will be required to submit a detailed, written report on a case study analyzed over the course of the semester.\n\n      less description for HRCM1-GC 4000 «",
            "offering": true
        }
    ]
}