{
    "major_id": "MUSST-AD",
    "file": "./2015-2016/Museum_Studies_(MUSST-AD).html",
    "courses": [
        {
            "course_id": "MUSST-AD 102",
            "course_name": "J",
            "description": "MUSST-AD  102J\n\n   Anthropology of Indigenous Australia:  Art, Politics and Cultural Futures\n\nThis course offers an introduction to some of the current issues in the anthropology of Indigenous Australia, considering a range of Aboriginal forms of social being, ranging historically and geographically and giving significant focus to the changing relationships between Indigenous people and the settler nation of Australia.  We will explore a range of sites of representation and imagination – in the expressions of visual art, film, and the performativity of political activism – in studying how Aboriginal people have struggled to reproduce themselves and their traditions in their own terms. ...\n\n      more description for MUSST-AD  102J »\n\n      \n\n\n\nThis course offers an introduction to some of the current issues in the anthropology of Indigenous Australia, considering a range of Aboriginal forms of social being, ranging historically and geographically and giving significant focus to the changing relationships between Indigenous people and the settler nation of Australia.  We will explore a range of sites of representation and imagination – in the expressions of visual art, film, and the performativity of political activism – in studying how Aboriginal people have struggled to reproduce themselves and their traditions in their own terms.  While those in the dominant society thought at first that Aboriginal people and their culture would “die out” and later that they would or could be simply “assimilated,” we will trace a history of Indigenous people from urban and remote communities intervening on what W.E.H. Stanner called “the great Australian silence” and asserting their right to a cultural future.  This will include assessing the contentious history of debates over the very rights of representation of Aboriginal culture and realities. This course will make use of several museums in Sydney, and a few prominent Indigenous scholars and artists will present their work relevant to the theme.\n\n      less description for MUSST-AD  102J «",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12935",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "CAMP E050"
                }
            ],
            "course_name": "Introduction to Museum Studies",
            "description": "MUSST-AD  110 Introduction to Museum Studies \nIntroduction to the social, cultural, and political history of museums. This course focuses on the formation of the modern museum. Museums of art, natural history, science, technology, and anthropology are examined from a variety of\ndisciplinary approaches that explore the institution and its practices with respect to governance, colonialism, nationalism, class, gender, ethnicity, and community. Visits to the museums and cultural institutions in the region are an important part of this course.",
            "offering": true
        },
        {
            "course_id": "MUSST-AD 111",
            "course_name": "J The Meaning of Museums",
            "description": "MUSST-AD  111J The Meaning of Museums \nThis course traces the history of art museums from antiquity to the present with an emphasis on the factors and ideas that led to their creation. The main functions of today’s museum—acquisitions, exhibitions, education, presentation—are examined, as are the challenges posed by globalization. The class meets periodically in New York museums. An oral report and final paper are required.",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 112",
            "course_name": "J The Multiple Lives of the Work of Art",
            "description": "MUSST-AD  112J The Multiple Lives of the Work of Art \nThis course focuses on defining the main functions of museums and examining how they relate in practice to their stated mission. The purposes, processes, and ethics of such fundamental tasks as acquisitions, conservation, installations, exhibitions, and interpretation are examined in detail with particular attention to how the work of art is perceived in its many different guises\nand contexts. The role of museums in our age of globalization are also be discussed. Some classes may be taught on site and individual museum\nvisits by students may be required.",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 113",
            "course_name": "J",
            "description": "MUSST-AD  113J\n\n   Shared Cultural Heritage: Policies and Perspectives\n\nAn intensive trade and shipping network connected many countries around the Indian Ocean with the Far East and Europe. Famous is the Silk Road, but over the centuries many other regions were also connected through trade. These activities left behind various cultural traces—in buildings, landscapes, shipwrecks, traditions, and archives. These cultural footprints are now considered “shared cultural heritage.” Important junctions in the network are often also recognized as UNESCO World Heritage Sites for their universal\nand global value. In this course students study the basic theory of cultural ...\n\n      more description for MUSST-AD  113J »\n\n      \n\n\n\nAn intensive trade and shipping network connected many countries around the Indian Ocean with the Far East and Europe. Famous is the Silk Road, but over the centuries many other regions were also connected through trade. These activities left behind various cultural traces—in buildings, landscapes, shipwrecks, traditions, and archives. These cultural footprints are now considered “shared cultural heritage.” Important junctions in the network are often also recognized as UNESCO World Heritage Sites for their universal\nand global value. In this course students study the basic theory of cultural heritage and explore the various perspectives on heritage. Terminology like\nshared, mutual, global, and contested heritage are discussed. The acquired knowledge and insights will be applied in a research assignment at a\nWorld Heritage Site, Galle in Sri Lanka.\n\n      less description for MUSST-AD  113J «",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 114",
            "course_name": "J",
            "description": "MUSST-AD  114J\n\n   Museums, Communities, and Public Art\n\nWhile New York City is known for its world class museums and endless array of commercial galleries, the mainstream art world in Manhattan is only half the story. This course considers a range of art practices and their relation to the communities in which they are produced. The professor brings the class to the Queens Museum (which he directs) to look at how an art institution can be engaged in the social issues of a community, and leads site visits to other city institutions both international and local in their focus. We also visit urban spaces\ntransformed by art from Battery Park City to th...\n\n      more description for MUSST-AD  114J »\n\n      \n\n\n\nWhile New York City is known for its world class museums and endless array of commercial galleries, the mainstream art world in Manhattan is only half the story. This course considers a range of art practices and their relation to the communities in which they are produced. The professor brings the class to the Queens Museum (which he directs) to look at how an art institution can be engaged in the social issues of a community, and leads site visits to other city institutions both international and local in their focus. We also visit urban spaces\ntransformed by art from Battery Park City to the subway lines adorned by the city’s Arts for Transit Program. Fundamental questions addressed in the course include: How should a museum serve its audience? Should we use the same criteria to assess the success of an artwork in a gallery and on a subway platform? Which parts of New York’s art world are transferrable to other international cities, and which are not?\n\n      less description for MUSST-AD  114J «",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 115",
            "course_name": "Global Heritage Sites & Universal Collections",
            "description": "MUSST-AD  115 Global Heritage Sites & Universal Collections \nThe purpose of this course is to provide an introduction to the theory and current academic debates on the subject of ‘sharing’ cultural heritage from both a global and a local perspective. The course is centred around themes and case studies concerning the theoretical concepts of heritage as tangible sites, moveable collections and intangible practices. The course provides basic knowledge of the issues related to heritage management.",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 210",
            "course_name": "Museum Collections and Exhibitions",
            "description": "MUSST-AD  210 Museum Collections and Exhibitions \nAn introduction to the management, care, and display of collections, and to the process of organizing a temporary exhibition.",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 212",
            "course_name": "",
            "description": "MUSST-AD  212\n\n   Cabinets of Wonder\n\nThis course explores the relationship between the modern museum and sixteenth-century “cabinets of wonder,” which presented the viewer with\ncompartments and drawers containing amazing items from different eras and parts of the world. Students investigate the antecedents of these cabinets in mnemonic practices in ancient classical culture, shifting notions of wonder and curiosity in the Middle Ages, and the new models of learning and state governance in the Early Modern period that assigned these cabinets a “laboratory” function. Students explore how, in the period leading to our modern times, ...\n\n      more description for MUSST-AD  212 »\n\n      \n\n\n\nThis course explores the relationship between the modern museum and sixteenth-century “cabinets of wonder,” which presented the viewer with\ncompartments and drawers containing amazing items from different eras and parts of the world. Students investigate the antecedents of these cabinets in mnemonic practices in ancient classical culture, shifting notions of wonder and curiosity in the Middle Ages, and the new models of learning and state governance in the Early Modern period that assigned these cabinets a “laboratory” function. Students explore how, in the period leading to our modern times, new models of classification, taxonomy, and scientific discovery\nled to a continued process of recollection and re-collecting objects from the past.\n\n      less description for MUSST-AD  212 «",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 213",
            "course_name": "",
            "description": "MUSST-AD  213\n\n   International Issues in Cultural Policy\n\nThis course looks at government policies and private sector practices that have helped to shape how the arts and culture are understood and valued around the world. Students examine and compare major issues and concepts impacting\nthe production, distribution, and consumption of the arts and culture within and across borders, such as national sovereignty, heritage and cultural patrimony, historic preservation, cultural diplomacy, arts funding systems, and the role of the arts in the design, development, and revitalization of world cities from Bilbao, Spain to Los Angeles to the Arabian Gulf. Th...\n\n      more description for MUSST-AD  213 »\n\n      \n\n\n\nThis course looks at government policies and private sector practices that have helped to shape how the arts and culture are understood and valued around the world. Students examine and compare major issues and concepts impacting\nthe production, distribution, and consumption of the arts and culture within and across borders, such as national sovereignty, heritage and cultural patrimony, historic preservation, cultural diplomacy, arts funding systems, and the role of the arts in the design, development, and revitalization of world cities from Bilbao, Spain to Los Angeles to the Arabian Gulf. The course also explores the for-profit\nsector looking at such issues as artists’ rights, art markets, the creative industries, international trade law, and copyright in the digital age. Cultural site\nvisits and field trips are a regular part of the course.\n\n      less description for MUSST-AD  213 «",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 214",
            "course_name": "JX",
            "description": "MUSST-AD  214JX\n\n   Sharing Heritage of the Arabian Trade Routes\n\nIn the 17th century the Ya’rubi dynasty drove the Portuguese from Muscat and East Africa and reinstalled Omani dominance in the region. The Omanis built on the extensive Arabian trade network that for centuries connected Asia, Africa,\nand Europe. Long-distance trade left behind cultural traces in buildings, landscapes, shipwrecks, traditions, museum collections, and archives.\nThese cultural footprints are now often considered “shared cultural heritage”. Notably Zanzibar and Kilwa (Tanzania), where Omani once ruled, were\nnamed as UNESCO World Heritage sites for their universal and outstanding v...\n\n      more description for MUSST-AD  214JX »\n\n      \n\n\n\nIn the 17th century the Ya’rubi dynasty drove the Portuguese from Muscat and East Africa and reinstalled Omani dominance in the region. The Omanis built on the extensive Arabian trade network that for centuries connected Asia, Africa,\nand Europe. Long-distance trade left behind cultural traces in buildings, landscapes, shipwrecks, traditions, museum collections, and archives.\nThese cultural footprints are now often considered “shared cultural heritage”. Notably Zanzibar and Kilwa (Tanzania), where Omani once ruled, were\nnamed as UNESCO World Heritage sites for their universal and outstanding value. But what do these values mean and for whom? What makes historical\nremains heritage? What happens if “universal values” are not shared but contested? These fundamental questions steer us to understand the principles of heritage production and management. The Arabian trading routes provide an excellent context to explore the multi-layered and multivocal aspects of heritage. The course includes a field project in Zanzibar.\n\n      less description for MUSST-AD  214JX «",
            "offering": false
        },
        {
            "course_id": "MUSST-AD 215",
            "course_name": "J",
            "description": "MUSST-AD  215J\n\n   Museums in Global Context\n\nThis course surveys the history and representational role of museums, from its origins in cabinets of curiosity formed during the age of exploration to the global proliferation of museums today. Our goal is to provide a critical framework to understand how and why museums have evolved and function in a globalized world. We will consider how Enlightment collecting practices led to the development of the “universal museum” in an era of colonial expansion and examine how this dominant model has expanded – and been challenged – over the past century. Among the issues to be discussed are: the organ...\n\n      more description for MUSST-AD  215J »\n\n      \n\n\n\nThis course surveys the history and representational role of museums, from its origins in cabinets of curiosity formed during the age of exploration to the global proliferation of museums today. Our goal is to provide a critical framework to understand how and why museums have evolved and function in a globalized world. We will consider how Enlightment collecting practices led to the development of the “universal museum” in an era of colonial expansion and examine how this dominant model has expanded – and been challenged – over the past century. Among the issues to be discussed are: the organization and display of collections, the language and symbolism of museum architecture, the relationship of museums to their public(s), heritage and repatriation, cultural diversity and the politics of representation, and globalized collecting and exhibiting today. Classroom lectures will be supplemented by field trips drawing on the rich diversity of museums in the New York area.\n\n      less description for MUSST-AD  215J «",
            "offering": false
        }
    ]
}