{
    "major_id": "NCRD-UT",
    "file": "./2015-2016/Non-Credit_TSOA_Courses_(NCRD-UT).html",
    "courses": [
        {
            "course_id": "NCRD-UT 24",
            "course_name": "Acting and Camera",
            "description": "NCRD-UT   24 Acting and Camera",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 30",
            "course_name": "Playwriting I",
            "description": "NCRD-UT   30 Playwriting I \nA vigorous review of the basic principles taught in Craft I and II with strong emphasis on characterization, dialogue, and structure, including identification of the major dramatic incident and turning points. Classes will focus on both analysis of dramatic texts from contemporary playwrights and student scripts. Professor will give notes on all final projects. Meets twice weekly. Coursework includes reading and writing assignments. Students will not be admitted into Playwriting II without full completion of Playwriting I. A completed full-length play is the required final project.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 33",
            "course_name": "Fundamentals of Dramatic and Visual Writing",
            "description": "NCRD-UT   33 Fundamentals of Dramatic and Visual Writing",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 35",
            "course_name": "Screenwriting I",
            "description": "NCRD-UT   35 Screenwriting I",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 36",
            "course_name": "",
            "description": "NCRD-UT   36\n\n   Intermediate Screenwriting\n\nA continuation of the training presented in Fundamentals of Developing the Screenplay. Required work in the class includes extensive scene work. Guided by their screenwriting instructor, students will complete the screenplay begun in Fundamentals of Developing the Screenplay and then do a rewrite or they may begin, complete, and rewrite a new full-length screenplay. The focus in this class will be on story structure and development and the completion of a full-length screenplay. If you plan to do a new work, you must come to the first class with three ideas for full-length screenplays. Each id...\n\n      more description for NCRD-UT   36 »\n\n      \n\n\n\nA continuation of the training presented in Fundamentals of Developing the Screenplay. Required work in the class includes extensive scene work. Guided by their screenwriting instructor, students will complete the screenplay begun in Fundamentals of Developing the Screenplay and then do a rewrite or they may begin, complete, and rewrite a new full-length screenplay. The focus in this class will be on story structure and development and the completion of a full-length screenplay. If you plan to do a new work, you must come to the first class with three ideas for full-length screenplays. Each idea can be described in one or two paragraphs.\n\n      less description for NCRD-UT   36 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 43",
            "course_name": "",
            "description": "NCRD-UT   43\n\n   Sight and Sound Filmmaking\n\nEvery student will conceive, produce, direct and edit five short projects (3 silent and 2 with sound) with digital filmmaking technology. Working in crews of four, students will be exposed to a variety of specific assignments in visual storytelling that feature a broad spectrum of technical, aesthetic, craft and logistical problems to be solved. Collaborating with other students through rotating crew positions will be a central focus of all production work. Lectures, labs, critiques, technical seminars, screenings and written production books will be an important component of this class. All s...\n\n      more description for NCRD-UT   43 »\n\n      \n\n\n\nEvery student will conceive, produce, direct and edit five short projects (3 silent and 2 with sound) with digital filmmaking technology. Working in crews of four, students will be exposed to a variety of specific assignments in visual storytelling that feature a broad spectrum of technical, aesthetic, craft and logistical problems to be solved. Collaborating with other students through rotating crew positions will be a central focus of all production work. Lectures, labs, critiques, technical seminars, screenings and written production books will be an important component of this class. All student work is screened and discussed in class.  Students should not schedule any other course on the same days as Sight & Sound: Filmmaking.\n\n      less description for NCRD-UT   43 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 45",
            "course_name": "Dvd Design",
            "description": "NCRD-UT   45 Dvd Design",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 50",
            "course_name": "Digital Filmmaking",
            "description": "NCRD-UT   50 Digital Filmmaking",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 51",
            "course_name": "",
            "description": "NCRD-UT   51\n\n   Sight and Sound Studio\n\nThe course provides an in-depth exploration of the creative capabilities (technical, logistical, aesthetic) of producing narrative-based studio production work in a multiple camera television studio environment. Students will be trained in working with actors and learning how to connect script and performance to the production of four short studio based projects (each of increasing complexity). Students will have the opportunity to develop a single idea into a full-scale production that will be produced \"live\" in the studio at the end of the semester. The fundamental skills learned in this cla...\n\n      more description for NCRD-UT   51 »\n\n      \n\n\n\nThe course provides an in-depth exploration of the creative capabilities (technical, logistical, aesthetic) of producing narrative-based studio production work in a multiple camera television studio environment. Students will be trained in working with actors and learning how to connect script and performance to the production of four short studio based projects (each of increasing complexity). Students will have the opportunity to develop a single idea into a full-scale production that will be produced \"live\" in the studio at the end of the semester. The fundamental skills learned in this class (script, performance, lighting, camera, art direction, coverage) will serve as a foundation for all narrative-, experimental-, and documentary-based production work and will be applicable in classes.  Note: some casting and rehearsals will need to be undertaken outside of class.\n\n      less description for NCRD-UT   51 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 55",
            "course_name": "Scriptwriting I",
            "description": "NCRD-UT   55 Scriptwriting I",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 56",
            "course_name": "Scriptwriting II",
            "description": "NCRD-UT   56 Scriptwriting II",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 63",
            "course_name": "Film Marketing and Distribution",
            "description": "NCRD-UT   63 Film Marketing and Distribution",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 64",
            "course_name": "The Digital Revolution",
            "description": "NCRD-UT   64 The Digital Revolution",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 65",
            "course_name": "Producing The Short",
            "description": "NCRD-UT   65 Producing The Short",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 66",
            "course_name": "Film Marketing and Distribution",
            "description": "NCRD-UT   66 Film Marketing and Distribution",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 67",
            "course_name": "Producing for Television",
            "description": "NCRD-UT   67 Producing for Television",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 80",
            "course_name": "Sight and Sound: Documentary",
            "description": "NCRD-UT   80 Sight and Sound: Documentary \nThe course teaches students to look at their world and to develop the ability to create compelling and dramatic stories in which real people are the characters and real life is the plot. Through close study and analysis of feature length and short documentaries, as well as hands on directing, shooting, sound-recording and editing, students rigorously explore the possibilities and the power of non-fiction storytelling for video. The course is a dynamic combination of individual and group production work in which each student will be expected to complete five projects.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 105",
            "course_name": "Dialogue & Narrative Creation in Elect Games",
            "description": "NCRD-UT  105 Dialogue & Narrative Creation in Elect Games",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 107",
            "course_name": "Intro New York Theatre",
            "description": "NCRD-UT  107 Intro New York Theatre",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 121",
            "course_name": "",
            "description": "NCRD-UT  121\n\n   Neo Noir\n\n“Neo Noir” explores the multiple ways that films made beyond the classic period reference, appropriate, extend, pay homage to, and even define that amorphous category called “film noir”:  from nostalgia to escalation, from remakes to meta discourse retroactively constructing a “genre,” from (further) genre hybridization to the dispersion of disconnected noir elements (crime, paranoia, the femme fatale, subjective flashback, existentialism), from realist-expressionist black and white to blatant and stylized color, from censorship’s dark sexuality to hyperreal violence, from national to internat...\n\n      more description for NCRD-UT  121 »\n\n      \n\n\n\n“Neo Noir” explores the multiple ways that films made beyond the classic period reference, appropriate, extend, pay homage to, and even define that amorphous category called “film noir”:  from nostalgia to escalation, from remakes to meta discourse retroactively constructing a “genre,” from (further) genre hybridization to the dispersion of disconnected noir elements (crime, paranoia, the femme fatale, subjective flashback, existentialism), from realist-expressionist black and white to blatant and stylized color, from censorship’s dark sexuality to hyperreal violence, from national to international. A tentative list of films includes Body Heat, Taxi Driver, Blood Simple, Exotica, Coup de Torchon, High and Low, One False Move, The Grifters, Memento, Usual Suspects, The Last Seduction, Kill Bill, Chungking Express, Mulholland Drive, The Thin Blue Line, and Funny Games. Rather than attempting to rein in film noir, the course celebrates Neo Noir’s exponential extrapolations. Students are encouraged to pursue their cinephilic aptitude in outside screenings. Key literary texts will also be examined. Hence, although critical readings are crucial, a large component of the course assignments will include creative works.\n\n      less description for NCRD-UT  121 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 139",
            "course_name": "Artistic Development",
            "description": "NCRD-UT  139 Artistic Development",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 140",
            "course_name": "Fight Scene Study",
            "description": "NCRD-UT  140 Fight Scene Study",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 141",
            "course_name": "Stage Combat: The Basics",
            "description": "NCRD-UT  141 Stage Combat: The Basics",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 142",
            "course_name": "Alexander Technique for",
            "description": "NCRD-UT  142 Alexander Technique for",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 165",
            "course_name": "Dialogue and Narration for Electronic Games",
            "description": "NCRD-UT  165 Dialogue and Narration for Electronic Games",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 171",
            "course_name": "The Business of The Business",
            "description": "NCRD-UT  171 The Business of The Business",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 183",
            "course_name": "Vectorwork",
            "description": "NCRD-UT  183 Vectorwork",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 184",
            "course_name": "Autocad Summer Intensive",
            "description": "NCRD-UT  184 Autocad Summer Intensive",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 188",
            "course_name": "Sketchup",
            "description": "NCRD-UT  188 Sketchup",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 205",
            "course_name": "",
            "description": "NCRD-UT  205\n\n   Hitchcock & his Influence\n\nHitchcock is the most recognized and imitated film director in the history of movies. The course will seek to examine and explain Hitchcock's influence and seek to understand, through the case of Hitchcock, the very idea of cinematic influence. The class will begin by closely examining key works of Hitchcock (Rear Window, Vertigo, Psycho, and The Birds) in order to understand the elements that make up Hitchcock's universe, in particular, the complex role and function of suspense. We shall then examine the nature and scope of Hitchcock's influence upon American and European Cinema in the work o...\n\n      more description for NCRD-UT  205 »\n\n      \n\n\n\nHitchcock is the most recognized and imitated film director in the history of movies. The course will seek to examine and explain Hitchcock's influence and seek to understand, through the case of Hitchcock, the very idea of cinematic influence. The class will begin by closely examining key works of Hitchcock (Rear Window, Vertigo, Psycho, and The Birds) in order to understand the elements that make up Hitchcock's universe, in particular, the complex role and function of suspense. We shall then examine the nature and scope of Hitchcock's influence upon American and European Cinema in the work of directors such as Chabrol, Truffaut, Almodóvar, Argento, Verhoeven, Spielberg, Scorcese, Lynch, Antonioni, Fincher, and de Palma.\n\n      less description for NCRD-UT  205 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 230",
            "course_name": "Scorsese's New York",
            "description": "NCRD-UT  230 Scorsese's New York \nThis course will focus on the New York City films of Martin Scorsese.  We shall approach several of the films (e.g. Gangs of New York, The Age of Innocence) as filmic examples of historical fiction and most of the other films in terms of their socio-cultural representation of New York City phenomena (e.g. immigration, crime, Wall Street, the art and entertainment industries).  As well, we will be concerned with exploring Scorsese’s “narrative method” – his usages of film form and style – in relation to the above issues.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 560",
            "course_name": "",
            "description": "NCRD-UT  560\n\n   Fundamentals of Filmmaking\n\nThis practical workshop is designed to introduce students to the techniques and theory of developing and producing short film ideas that are shot on digital video and edited digitally on computer using Adobe Premiere Pro software. The course centers on learning elements of visual storytelling through a spectrum of aesthetic approaches. Working in crews of four, students learn directing, shooting, and editing skills as they each direct three short videos (three to five minutes in length).  \n \nThis course is specifically designed to fulfill the major requirements in production of students not ma...\n\n      more description for NCRD-UT  560 »\n\n      \n\n\n\nThis practical workshop is designed to introduce students to the techniques and theory of developing and producing short film ideas that are shot on digital video and edited digitally on computer using Adobe Premiere Pro software. The course centers on learning elements of visual storytelling through a spectrum of aesthetic approaches. Working in crews of four, students learn directing, shooting, and editing skills as they each direct three short videos (three to five minutes in length).  \n \nThis course is specifically designed to fulfill the major requirements in production of students not majoring in film and therefore, students who need to fulfill this requirement are given registration priority. Students should add themselves to the waitlist for this class\n\n      less description for NCRD-UT  560 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 562",
            "course_name": "",
            "description": "NCRD-UT  562\n\n   Media Moguls in the 20th Century\n\nThis course attempts to track the American entertainment industry from its plebian origins through its rise to becoming the predominant mass entertainment culture in the world. Students discover the origins of the production practices that are employed in the entertainment industry today by following the legendary characters, movie moguls, and media titans of the early 20th century and the companies they built. The emphasis is on the way the visionaries of the time impacted seemingly risk-averse systems to invigorate and sometimes completely revolutionize them. These innovative men and women i...\n\n      more description for NCRD-UT  562 »\n\n      \n\n\n\nThis course attempts to track the American entertainment industry from its plebian origins through its rise to becoming the predominant mass entertainment culture in the world. Students discover the origins of the production practices that are employed in the entertainment industry today by following the legendary characters, movie moguls, and media titans of the early 20th century and the companies they built. The emphasis is on the way the visionaries of the time impacted seemingly risk-averse systems to invigorate and sometimes completely revolutionize them. These innovative men and women include, but are not limited, to Louis B. Mayer, George Lucas, Maya Deren, Shirley Clark, Nam Jun Paik, Lucille Ball, Russell Simmons, Clive Davis, Julie Taymor, and Steve Jobs.\n\n      less description for NCRD-UT  562 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 568",
            "course_name": "",
            "description": "NCRD-UT  568\n\n   Understanding Story\n\nUnderstanding Story is a class composed of lectures, discussions, screenings, readings, critical and creative writing, group critiques and presentations.  The course is designed to expose the student to the fundamental principles of storytelling across a spectrum of mediums, including the written story, playwriting, film, poetry, dance, games, photography, fine art and music.  How do all these different art forms tell stories?  How can the student apply what is learned to their own creative work?  History and theory of story will be studied and used to inspire personal and creative work in ord...\n\n      more description for NCRD-UT  568 »\n\n      \n\n\n\nUnderstanding Story is a class composed of lectures, discussions, screenings, readings, critical and creative writing, group critiques and presentations.  The course is designed to expose the student to the fundamental principles of storytelling across a spectrum of mediums, including the written story, playwriting, film, poetry, dance, games, photography, fine art and music.  How do all these different art forms tell stories?  How can the student apply what is learned to their own creative work?  History and theory of story will be studied and used to inspire personal and creative work in order to better understand how story can most successfully be expressed in different mediums and reach its audience.\n\n      less description for NCRD-UT  568 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 680",
            "course_name": "",
            "description": "NCRD-UT  680\n\n   Digital Filmmaking: One Week Intensive\n\nThis one week filmmaking intensive is a class composed of lectures, discussions, screenings, and exercises designed to engage students in the fundamentals of digital filmmaking and visual storytelling. In this workshop students will work in small groups to write, produce, direct and edit an original short film. \nThe workshop will begin by focusing on viewing and discussing examples of visual storytelling, focusing on technique, intention and narrative structure. Participants will then workshop the practical and aesthetic elements of visual storytelling and relevant filmmaking techniques by usi...\n\n      more description for NCRD-UT  680 »\n\n      \n\n\n\nThis one week filmmaking intensive is a class composed of lectures, discussions, screenings, and exercises designed to engage students in the fundamentals of digital filmmaking and visual storytelling. In this workshop students will work in small groups to write, produce, direct and edit an original short film. \nThe workshop will begin by focusing on viewing and discussing examples of visual storytelling, focusing on technique, intention and narrative structure. Participants will then workshop the practical and aesthetic elements of visual storytelling and relevant filmmaking techniques by using digital video cameras and computer editing. The focus will be on idea development, applying narrative structure to organize ideas and choosing and supporting a meaningful theme by writing and directing with purpose. Starting with creative story idea development and thematic intent and then working through the practical steps of filmmaking, all course elements will be presented in a workshop format in order to develop or enhance the personal experience of the participants.\n\n      less description for NCRD-UT  680 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 791",
            "course_name": "Systems: Hacking Everyday Object",
            "description": "NCRD-UT  791 Systems: Hacking Everyday Object",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 804",
            "course_name": "",
            "description": "NCRD-UT  804\n\n   Modern Dance:  Mind Body Knowledge and Expression\n\nThis course is an introduction to the fundamental concepts of Modern Dance technique that focuses on the dynamic rapport between body-mind knowledge and expression. In movement, students will become more aware and organized in their bodies. They will explore certain aesthetic characteristics that help to define dance material as “Modern” or contemporary. Through structured improvisation and teamwork approaches students will learn to dance from the inside out, exercise choice with imagination and work together as an ensemble. Ultimately, students will gain an appreciation for the expressive cap...\n\n      more description for NCRD-UT  804 »\n\n      \n\n\n\nThis course is an introduction to the fundamental concepts of Modern Dance technique that focuses on the dynamic rapport between body-mind knowledge and expression. In movement, students will become more aware and organized in their bodies. They will explore certain aesthetic characteristics that help to define dance material as “Modern” or contemporary. Through structured improvisation and teamwork approaches students will learn to dance from the inside out, exercise choice with imagination and work together as an ensemble. Ultimately, students will gain an appreciation for the expressive capacity of the body, recognizing shared, unifying attributes and those that are unique and intrinsic to each individual. The thorough warm up places an emphasis on breath and proper placement for safe practices and well being. It includes floor work, stretching and strength exercises and patterns that incorporate elements of Bartenieff Fundamentals. Short dances / sequences will be learned to sharpen knowledge of the Modern Dance lexicon and increase facility for translation of weight, space, time and energy ideas.\n \nAll levels are welcome. No previous dance experience is required.\n\n      less description for NCRD-UT  804 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 806",
            "course_name": "",
            "description": "NCRD-UT  806\n\n   Ballet\n\nThis course is an introduction to the fundamentals of classical ballet technique. Looking into the evolution of ballet from the time of Louis XIV through the present, students will explore the different styles of training and performance presentation through the use of images, video, practice and discussions. Reading assignments will be provided to explain how social changes have affected the development of ballet technique and choreography.\n \nA thorough warm-up will be given in each class. The technical content will vary according to the skill level of the class and the individual dancer. Thr...\n\n      more description for NCRD-UT  806 »\n\n      \n\n\n\nThis course is an introduction to the fundamentals of classical ballet technique. Looking into the evolution of ballet from the time of Louis XIV through the present, students will explore the different styles of training and performance presentation through the use of images, video, practice and discussions. Reading assignments will be provided to explain how social changes have affected the development of ballet technique and choreography.\n \nA thorough warm-up will be given in each class. The technical content will vary according to the skill level of the class and the individual dancer. Through the instruction of proper alignment and dynamic imagery, students will learn how to dance safely and improve their technical skills effectively. All levels are welcome. No previous dance experience is required.\n \nThe course is designed to help students develop a clean and precise technical base for ballet dancing. Through practice and application, students will understand the unique structure of their own bodies and expand their awareness of self and others. They will discover new technical capabilities regarding flexibility, strength, coordination, balance and their comprehension of the ballet form in relation to music, space, time and energy. Eventually students will experience how the mind, body and breath come together to produce greater freedom in movement. Discussions will examine how this informs personal interactions in everyday life. Students are encouraged to study the different styles of ballet and ballet performers around the world.\nFor the final group project, students will choreograph a short ballet that incorporates ballet vocabulary, dance or pedestrian movements and an idea that’s related to today’s society.\n\n      less description for NCRD-UT  806 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 807",
            "course_name": "",
            "description": "NCRD-UT  807\n\n   Steps Rhythm Movement: Flamenco Dance\n\nThis class will embark on an historical dance journey exploring the dances that make up the hybrid form of Flamenco i.e., Banjara Gypsy Dance of Rajesthan (India), Zambra Dances of the Sephardic Jews and Moorish influences. \nThe course will be divided into 3 sections focusing on the contributing characteristics of the dance culminating with Flamenco Dance. Each class will begin with a historical introduction and demonstration of the indigenous forms and how the elements are integrated into Flamenco cultivating a sense of freedom and uniqueness. Periodic viewing of course related videos will be...\n\n      more description for NCRD-UT  807 »\n\n      \n\n\n\nThis class will embark on an historical dance journey exploring the dances that make up the hybrid form of Flamenco i.e., Banjara Gypsy Dance of Rajesthan (India), Zambra Dances of the Sephardic Jews and Moorish influences. \nThe course will be divided into 3 sections focusing on the contributing characteristics of the dance culminating with Flamenco Dance. Each class will begin with a historical introduction and demonstration of the indigenous forms and how the elements are integrated into Flamenco cultivating a sense of freedom and uniqueness. Periodic viewing of course related videos will be shown, i.e., “Latcho Drom, and “Gypsy Caravan - “When the Road Bends.” Students will be assigned weekly reading, research and practice projects relevant to up and coming course work. \nAll levels are welcome. Dance experience not required.\n\n      less description for NCRD-UT  807 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 808",
            "course_name": "",
            "description": "NCRD-UT  808\n\n   Steps Rhythm Movement: Hip Hop Dance\n\nThis is an introduction to the dances and rhythms from different styles that comprise Hip-Hop dance today. The first stage of the course will explore the wide array of styles that comprise and influence Hip-Hop movement. This course will not only introduce steps, but investigate root moves and historical context that shaped contemporary Hip-Hop today. \nDuring the course, students will also discuss the current and emerging trends of the genre. As an ever-evolving dance, this class will focus on budding dance styles, such as Flexing, Lite feet and Finger Tuts, comparing and contrasting those to ...\n\n      more description for NCRD-UT  808 »\n\n      \n\n\n\nThis is an introduction to the dances and rhythms from different styles that comprise Hip-Hop dance today. The first stage of the course will explore the wide array of styles that comprise and influence Hip-Hop movement. This course will not only introduce steps, but investigate root moves and historical context that shaped contemporary Hip-Hop today. \nDuring the course, students will also discuss the current and emerging trends of the genre. As an ever-evolving dance, this class will focus on budding dance styles, such as Flexing, Lite feet and Finger Tuts, comparing and contrasting those to case studies of past styles that emerged, (or re-emerged) to become heavily popularized such as Gliding, Krumping and Waacking. Additionally students will explore the globalized nature of Hip-Hop. To see the full evolution, students will see how other cultures have embraced and left their mark street styles, and how international dance battles and competitions have emerged, ultimately changing the landscape of Hip-Hop dance. Over the course of study students will begin to realize the complexity, the history and the varying opinions focused around Hip-Hop.\n\n      less description for NCRD-UT  808 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 826",
            "course_name": "",
            "description": "NCRD-UT  826\n\n   Politics of Portraiture\n\nThis course explores the pictorial articulation of individual human likeness and its fiction in the public forum. The art of portraiture has survived its own origins in myth making and archetype building. The human image, or icon, forever landmarks the voices, textures, physicality, spirituality, symbols, politics, aesthetic concerns and military contexts, religious rituals, government, calendar ceremonies, daily functions, heroic acts and social disorders of diverse cultures throughout recorded history. It is the history of creation, the story of romance, the mark of progress, the record of r...\n\n      more description for NCRD-UT  826 »\n\n      \n\n\n\nThis course explores the pictorial articulation of individual human likeness and its fiction in the public forum. The art of portraiture has survived its own origins in myth making and archetype building. The human image, or icon, forever landmarks the voices, textures, physicality, spirituality, symbols, politics, aesthetic concerns and military contexts, religious rituals, government, calendar ceremonies, daily functions, heroic acts and social disorders of diverse cultures throughout recorded history. It is the history of creation, the story of romance, the mark of progress, the record of royalty and the profile of democracy. It is the revolution of fine art and a catalyst of discipline. Imaging the individual in the public eye is the story of humankind. This course bridges the worlds of the oral and written mythologies which inhabit and empower us and the creative manifestation (conscious and unconscious) of these ancient archetypes into contemporary art, media and design. Students will critically rethink the implied and material presence of portraiture in everyday life. Students will gain practical knowledge and insight into the origins and potential power of the archetypes which permeate our collective unconscious.\n\n      less description for NCRD-UT  826 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1000",
            "course_name": "Writing for the Screen",
            "description": "NCRD-UT 1000 Writing for the Screen \nParticipants will examine the principles and processes of writing for the screen.  Topics include finding and developing story ideas, film language and script structure.  By the end of the course, students will have participated in in-depth film analysis and intensive screenwriting exercises and discussions.  At the end of the course, students are expected to complete a film treatment (prose description of your film) with a step outline for a feature film or T.V. episode you plan to write.  In addition, you must hand in the first scene (3-5 pages) of your script with dialogue.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1006",
            "course_name": "",
            "description": "NCRD-UT 1006\n\n   Producing Essentials\n\nToday’s major creative fields—film, television, music, theatre, dance, and new media—need quality producers. A producer with a firm knowledge of the craft, a discerning eye for material, fund-raising ability, a grasp of the law, cash flow, people, and ethics is rare. This course provides students with a framework for understanding the dynamics of producing—as an art form and a business profession—and for completing a creative product in the entertainment and media industries. Students are introduced to the basic concepts, terms, and principles that apply to the role of producer in the entertai...\n\n      more description for NCRD-UT 1006 »\n\n      \n\n\n\nToday’s major creative fields—film, television, music, theatre, dance, and new media—need quality producers. A producer with a firm knowledge of the craft, a discerning eye for material, fund-raising ability, a grasp of the law, cash flow, people, and ethics is rare. This course provides students with a framework for understanding the dynamics of producing—as an art form and a business profession—and for completing a creative product in the entertainment and media industries. Students are introduced to the basic concepts, terms, and principles that apply to the role of producer in the entertainment and media industries along with the specific job functions that are required to effectively and efficiently complete a production.\n\n      less description for NCRD-UT 1006 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1010",
            "course_name": "Writing for Film and Television",
            "description": "NCRD-UT 1010 Writing for Film and Television",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1028",
            "course_name": "",
            "description": "NCRD-UT 1028\n\n   Producing for TV\n\nThis course provides fundamental and practical instruction in the step-by-step realization of a television program. While productions will not be implemented through the class, students will individually serve as executive producers on projects of their own choosing, based on assignments by the instructor (based on student submissions which include news and cultural documentaries, performance and variety shows, and dramatic works). Student producers will engage in a detailed pre-production phase, which covers research, concept, format development, securing of rights and permissions, pitching t...\n\n      more description for NCRD-UT 1028 »\n\n      \n\n\n\nThis course provides fundamental and practical instruction in the step-by-step realization of a television program. While productions will not be implemented through the class, students will individually serve as executive producers on projects of their own choosing, based on assignments by the instructor (based on student submissions which include news and cultural documentaries, performance and variety shows, and dramatic works). Student producers will engage in a detailed pre-production phase, which covers research, concept, format development, securing of rights and permissions, pitching to networks and studios, contracts and agreements, formation of the production plan, budget development, assembling staff and crew, identifying on-air talent, determining locations, photo and film archive research, refining the shooting schedule and budget plan. Analysis of why some projects succeed and others fail, an overview.\n\n      less description for NCRD-UT 1028 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1040",
            "course_name": "",
            "description": "NCRD-UT 1040\n\n   Intermediate Narrative Production Workshop\n\nIntermediate Narrative Production Workshop is a practical course in which students (collaborating in crews of four) are exposed to a broad range of production techniques through production experience and class discussion. Each group produces four color sync-sound exercises during the semester that explore craft, aesthetic, production and storytelling issues. Students must shoot their projects in film using existing package of school equipment.  As a group member, each student will serve in rotation as director, producer, camera, sound, and AC/gaffer. \nImportant note: students should enter Int...\n\n      more description for NCRD-UT 1040 »\n\n      \n\n\n\nIntermediate Narrative Production Workshop is a practical course in which students (collaborating in crews of four) are exposed to a broad range of production techniques through production experience and class discussion. Each group produces four color sync-sound exercises during the semester that explore craft, aesthetic, production and storytelling issues. Students must shoot their projects in film using existing package of school equipment.  As a group member, each student will serve in rotation as director, producer, camera, sound, and AC/gaffer. \nImportant note: students should enter Intermediate Narrative Production Workshop with a short (i.e., 3-5 pages, but no more than 8) script. The production work in this course is strenuous. Students should be conscious of this when designing their semester schedules.\n\n      less description for NCRD-UT 1040 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1041",
            "course_name": "Documentary Workshop",
            "description": "NCRD-UT 1041 Documentary Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1042",
            "course_name": "Intro to Writing The 1/2 Comedy",
            "description": "NCRD-UT 1042 Intro to Writing The 1/2 Comedy",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1043",
            "course_name": "Beginning Film Production",
            "description": "NCRD-UT 1043 Beginning Film Production",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1044",
            "course_name": "Writing The Graphic Novel",
            "description": "NCRD-UT 1044 Writing The Graphic Novel",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1045",
            "course_name": "Screenwriting II",
            "description": "NCRD-UT 1045 Screenwriting II",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1046",
            "course_name": "Intermediate Experimental Workshop",
            "description": "NCRD-UT 1046 Intermediate Experimental Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1048",
            "course_name": "Writing for One-Hour TV",
            "description": "NCRD-UT 1048 Writing for One-Hour TV",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1050",
            "course_name": "",
            "description": "NCRD-UT 1050\n\n   Musical Theatre Writing Workshop\n\nOpen to graduate and undergraduate students.  This intensive, team- taught workshop encourages composers, lyricists, and bookwriters to find their own voices and learn to merge their unique artistic visions with those of other collaborative artists to create exciting new songs in a theatrical context. Class participants work in rotating teams to write and present songs and scenes, exploring song form, dramatic structure, and the process of conceiving longer works.  Theatre songwriting craft, issues of communication between artists of different disciplines, and storytelling through music and te...\n\n      more description for NCRD-UT 1050 »\n\n      \n\n\n\nOpen to graduate and undergraduate students.  This intensive, team- taught workshop encourages composers, lyricists, and bookwriters to find their own voices and learn to merge their unique artistic visions with those of other collaborative artists to create exciting new songs in a theatrical context. Class participants work in rotating teams to write and present songs and scenes, exploring song form, dramatic structure, and the process of conceiving longer works.  Theatre songwriting craft, issues of communication between artists of different disciplines, and storytelling through music and text are emphasized. Great musical theatre works of the 20th century are considered to support the students’ examination of their own creative process. Writers and composers from around the world who wish to explore musical theatre collaboration are encouraged to apply and immerse themselves in an exciting workshop experience in New York City . Poets, playwrights, and writers from other genres, and composers based in any musical tradition (pop, classical, country, hip-hop, rap, rock, jazz, etc.) are welcome to apply. Composers should either be able to write their work down so that it can be performed by others or be prepared to perform their own work.  All class participants are expected to collaborate on assigned projects outside of class time\n\n      less description for NCRD-UT 1050 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1051",
            "course_name": "Beginning Digital Video Production",
            "description": "NCRD-UT 1051 Beginning Digital Video Production",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1083",
            "course_name": "Intro to Special Effects Makeup",
            "description": "NCRD-UT 1083 Intro to Special Effects Makeup",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1084",
            "course_name": "Seminar in Script Analysis",
            "description": "NCRD-UT 1084 Seminar in Script Analysis \nThis class is designed to help the students analyze a film script. Plot and character development, character dialogue, foreground, background, and story will all be examined. Using feature films, we will highlight these script elements rather than the integrated experience of the script, performance, directing, and editing elements of the film. Assignments include two script analyses.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1085",
            "course_name": "",
            "description": "NCRD-UT 1085\n\n   Making New Musicals: A workshop for Performers\n\nThis intensive, team taught class prepares musical theatre actors for the unique experience of working on new musicals. From sight singing, character creation and script analysis to collaborating with writers, directors and music directors, students will have the full experience of working on a new musical using the 29 hour equity reading model.  The four week class will first focus on skill building and exploration of sections of new shows from the Graduate Musical Theatre Writing Program.   The course culminates in a complete 29 hour reading presented by student performers in collaboration w...\n\n      more description for NCRD-UT 1085 »\n\n      \n\n\n\nThis intensive, team taught class prepares musical theatre actors for the unique experience of working on new musicals. From sight singing, character creation and script analysis to collaborating with writers, directors and music directors, students will have the full experience of working on a new musical using the 29 hour equity reading model.  The four week class will first focus on skill building and exploration of sections of new shows from the Graduate Musical Theatre Writing Program.   The course culminates in a complete 29 hour reading presented by student performers in collaboration with a creative team to bring a new musical to life.\n\n      less description for NCRD-UT 1085 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1093",
            "course_name": "Marketing & Distribution for film",
            "description": "NCRD-UT 1093 Marketing & Distribution for film",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1095",
            "course_name": "Producing for Film",
            "description": "NCRD-UT 1095 Producing for Film \nAn examination of the creative, organizational, and managerial roles of the producer in narrative motion pictures. Topics include how a production company is formed, creating and obtaining properties, financing, budgeting, cost control, distribution. The course gives specific attention to the problems in these areas that will be faced by students as future professional directors, production managers, or writers. Each student is expected to breakdown, schedule, and budget a feature film (90 minutes or longer) of their choosing.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1101",
            "course_name": "Cinematography",
            "description": "NCRD-UT 1101 Cinematography",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1102",
            "course_name": "Writing for Television: Situation/Sketch Comedy",
            "description": "NCRD-UT 1102 Writing for Television: Situation/Sketch Comedy",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1104",
            "course_name": "3-D Computer Animation",
            "description": "NCRD-UT 1104 3-D Computer Animation",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1140",
            "course_name": "Intermediate Film Production Workshop",
            "description": "NCRD-UT 1140 Intermediate Film Production Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1165",
            "course_name": "Cinematographers Workshop",
            "description": "NCRD-UT 1165 Cinematographers Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1168",
            "course_name": "Cinematographer'S Workshop",
            "description": "NCRD-UT 1168 Cinematographer'S Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1206",
            "course_name": "Hist of Cinematography",
            "description": "NCRD-UT 1206 Hist of Cinematography",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1246",
            "course_name": "Intermediate Production: Short Commercial Form",
            "description": "NCRD-UT 1246 Intermediate Production: Short Commercial Form",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1295",
            "course_name": "Producing for Film & TV",
            "description": "NCRD-UT 1295 Producing for Film & TV",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1296",
            "course_name": "",
            "description": "NCRD-UT 1296\n\n   Production Management: Boards and Budgets\n\nAn introductory course to Professional Production Management that provides the student with the information and practice of managing the making of a feature film or long form television show. Film and television production has many more requirements than simply securing a camera, stock and actors, and the course will explore those management elements that a filmmaker needs to fulfill in order to shoot and complete. We will examine the structure of the crew and the collaborative responsibilities of crew members, the legal issues of permits, insurance, rights, clearances and permissions; Screen ...\n\n      more description for NCRD-UT 1296 »\n\n      \n\n\n\nAn introductory course to Professional Production Management that provides the student with the information and practice of managing the making of a feature film or long form television show. Film and television production has many more requirements than simply securing a camera, stock and actors, and the course will explore those management elements that a filmmaker needs to fulfill in order to shoot and complete. We will examine the structure of the crew and the collaborative responsibilities of crew members, the legal issues of permits, insurance, rights, clearances and permissions; Screen Actors Guild requirements, the management of the production including scheduling, budgeting, transportation, and the production?s responsibilities to cast and crew. We will pay particular attention to professional practice concerning the structure of the workday hours and turn around time and safety issues that are the responsibility of the producer, director, DP and shop steward. The course will explore techniques for on-set casting, location scouting, tech scouts, and read-thrus. Each student will be required to prepare a production book for his or her shoot by the end of class that will include a final marked script, script breakdown pages, shooting schedule, budget, cast, crew and location lists.  The script to work from will be provided by the instructor.\n\n      less description for NCRD-UT 1296 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1301",
            "course_name": "Entrepreneurship and The Entertainment Business",
            "description": "NCRD-UT 1301 Entrepreneurship and The Entertainment Business",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1600",
            "course_name": "Games 101",
            "description": "NCRD-UT 1600 Games 101",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1605",
            "course_name": "",
            "description": "NCRD-UT 1605\n\n   Intro to Game Design\n\nThis is an intensive, hands-on workshop addressing the complex challenges of game design. The premise of the class is that all games, digital and non-digital, share common fundamental principles, and that understanding these principles is an essential part of designing successful games. Learning how to create successful non-digital games provides a solid foundation for the development of digital games. Students will analyze existing digital and non-digital games, taking them apart to understand how they work as interactive systems. A number of non-digital games will be created in order to mast...\n\n      more description for NCRD-UT 1605 »\n\n      \n\n\n\nThis is an intensive, hands-on workshop addressing the complex challenges of game design. The premise of the class is that all games, digital and non-digital, share common fundamental principles, and that understanding these principles is an essential part of designing successful games. Learning how to create successful non-digital games provides a solid foundation for the development of digital games. Students will analyze existing digital and non-digital games, taking them apart to understand how they work as interactive systems. A number of non-digital games will be created in order to master the basic design principles that apply to all games regardless of format. This course is subject to a non-refundable department fee, please see the Notes section for more detail.\n\n      less description for NCRD-UT 1605 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1606",
            "course_name": "",
            "description": "NCRD-UT 1606\n\n   Thinking About Games\n\nThis class is an overview of the field of video games that approaches them from several theoretical and critical perspectives. No special theoretical background or prior training is needed to take the course, but to have had a broad practical experience with and basic knowledge of games is a distinct advantage. Also, an interest in theoretical and analytical issues will help. You are expected to actively participate in the lectures, which are dialogic in form, with ample room for discussion.\n\nThe course will prepare the student to:\n\n- Understand and discuss games from a theoretical perspective...\n\n      more description for NCRD-UT 1606 »\n\n      \n\n\n\nThis class is an overview of the field of video games that approaches them from several theoretical and critical perspectives. No special theoretical background or prior training is needed to take the course, but to have had a broad practical experience with and basic knowledge of games is a distinct advantage. Also, an interest in theoretical and analytical issues will help. You are expected to actively participate in the lectures, which are dialogic in form, with ample room for discussion.\n\nThe course will prepare the student to:\n\n- Understand and discuss games from a theoretical perspective - what are the components of a game?\n\n- Apply new theories and evaluate them critically.\n\n- Assess and discuss game concepts and the use of games in various contexts.\n\n- Analyze games, and understand and apply a range of analytical methods.\n\n      less description for NCRD-UT 1606 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1612",
            "course_name": "",
            "description": "NCRD-UT 1612\n\n   Game Development: Project Studio\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the clo...\n\n      more description for NCRD-UT 1612 »\n\n      \n\n\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the close supervision of instructors, students will collaborate on the creation of a playable game. As a creative constraint to help inspire them and guide their designs, the students will be given a theme to express in their game projects.\n\n      less description for NCRD-UT 1612 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1614",
            "course_name": "",
            "description": "NCRD-UT 1614\n\n   Code Lab\n\nProcessing is a great tool for learning the fundamentals of programming.  Based on Java, one of the most popular programming languages, Processing simplifies Java to help creatives to develop programming literacy.  With the mission of allowing visual artists develop interactive systems, Processing provides a language, libraries, and a development environment.  You can use it to export applications for the Web, Windows, Mac OSX, Android, and Linux.  Processing is completely free and open source.  Many game developers learned to program with it and the concepts it teaches are useful for many pro...\n\n      more description for NCRD-UT 1614 »\n\n      \n\n\n\nProcessing is a great tool for learning the fundamentals of programming.  Based on Java, one of the most popular programming languages, Processing simplifies Java to help creatives to develop programming literacy.  With the mission of allowing visual artists develop interactive systems, Processing provides a language, libraries, and a development environment.  You can use it to export applications for the Web, Windows, Mac OSX, Android, and Linux.  Processing is completely free and open source.  Many game developers learned to program with it and the concepts it teaches are useful for many programming languages and game engines.  We will explore Processing beyond the Processing IDE, working with Processing in Eclipse, peeling back a layer to see how professional developers work with Processing and Java. Beyond simply learning to program, students in this class will explore models and algorithms useful for developing games.  We will discuss how platforms, libraries, frameworks, and engines affect game design, in both empowering and limiting ways.  Finally, we will discuss the history of digital games, how new tools have democratized the process of game development, and the costs and benefits of those trends.\n\n      less description for NCRD-UT 1614 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1906",
            "course_name": "Acting I",
            "description": "NCRD-UT 1906 Acting I \nThis beginner’s course explores the use of games, monologues, and scene work in order to develop knowledge of basic acting skills. Students are encouraged toward self-exploration and creative expression.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1910",
            "course_name": "",
            "description": "NCRD-UT 1910\n\n   Comic Relief\n\nThis class explores the acting of comedy through theater games that focus on comedic techniques such as quick change, neurosis, obsession, shift of status, body part out of control, etc. as well as through analysis and performance of comedic text. If drama holds a mirror up to life, comedy holds up a magnifying glass. The boldness of choice and degree of commitment demanded by comedy are what make it so difficult to perform, especially because bold choices must be supported by psychological truth. Characters' objectives, obsessions, needs and phobias are what compel them to act in comical ways...\n\n      more description for NCRD-UT 1910 »\n\n      \n\n\n\nThis class explores the acting of comedy through theater games that focus on comedic techniques such as quick change, neurosis, obsession, shift of status, body part out of control, etc. as well as through analysis and performance of comedic text. If drama holds a mirror up to life, comedy holds up a magnifying glass. The boldness of choice and degree of commitment demanded by comedy are what make it so difficult to perform, especially because bold choices must be supported by psychological truth. Characters' objectives, obsessions, needs and phobias are what compel them to act in comical ways; if actors don't find the pain and truth of these catalysts, their behavior becomes silly, and the comedy, shtick. The exercises employed in this course (many of which have their roots in commedia dell'arte) help participants to free their bodies and voices, allowing them to commit both boldly and truthfully, and will be used to analyze and bring to life comedic text from television, to movies and theater.\n\n      less description for NCRD-UT 1910 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1924",
            "course_name": "",
            "description": "NCRD-UT 1924\n\n   Fundamentals of Acting I\n\nAn introduction to the central tools and skills that make up the actor’s art and craft. Through theatre games, structured improvisation, and beginning scene work, students will exercise their imaginations, learn how to work as an ensemble, and develop a sense of their bodies as expressive instruments. All techniques covered have been developed by the most celebrated 20th century theorists, such as Stanislavski, Grotowski, and Bogart, and are the same theories that underlie the training of the Tisch undergraduate acting conservatory. No prior experience necessary. Not open to Tisch Drama Majors...\n\n      more description for NCRD-UT 1924 »\n\n      \n\n\n\nAn introduction to the central tools and skills that make up the actor’s art and craft. Through theatre games, structured improvisation, and beginning scene work, students will exercise their imaginations, learn how to work as an ensemble, and develop a sense of their bodies as expressive instruments. All techniques covered have been developed by the most celebrated 20th century theorists, such as Stanislavski, Grotowski, and Bogart, and are the same theories that underlie the training of the Tisch undergraduate acting conservatory. No prior experience necessary. Not open to Tisch Drama Majors.\n\n      less description for NCRD-UT 1924 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 1961",
            "course_name": "City in Motion",
            "description": "NCRD-UT 1961 City in Motion",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2801",
            "course_name": "Stage Combat",
            "description": "NCRD-UT 2801 Stage Combat",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2802",
            "course_name": "Fight Scene",
            "description": "NCRD-UT 2802 Fight Scene",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2803",
            "course_name": "Business of Business",
            "description": "NCRD-UT 2803 Business of Business",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2804",
            "course_name": "Audition Tech",
            "description": "NCRD-UT 2804 Audition Tech",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2805",
            "course_name": "Theatre in New York: The One Act in Festival",
            "description": "NCRD-UT 2805 Theatre in New York: The One Act in Festival",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2806",
            "course_name": "Vector Works",
            "description": "NCRD-UT 2806 Vector Works",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2807",
            "course_name": "Auto Cad",
            "description": "NCRD-UT 2807 Auto Cad",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2808",
            "course_name": "Sketchup",
            "description": "NCRD-UT 2808 Sketchup",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2809",
            "course_name": "Musical Thea",
            "description": "NCRD-UT 2809 Musical Thea",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2810",
            "course_name": "Theatre in New York Practicum",
            "description": "NCRD-UT 2810 Theatre in New York Practicum",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2811",
            "course_name": "Mask Theatre",
            "description": "NCRD-UT 2811 Mask Theatre",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2812",
            "course_name": "Private Voice Training",
            "description": "NCRD-UT 2812 Private Voice Training",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2813",
            "course_name": "Spoken Word:  Voiceover Technique",
            "description": "NCRD-UT 2813 Spoken Word:  Voiceover Technique",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2814",
            "course_name": "The Actors Craft:",
            "description": "NCRD-UT 2814 The Actors Craft:",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2815",
            "course_name": "Shakespeare On Film",
            "description": "NCRD-UT 2815 Shakespeare On Film",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2816",
            "course_name": "Producing Practicum: How",
            "description": "NCRD-UT 2816 Producing Practicum: How",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2817",
            "course_name": "European Origins",
            "description": "NCRD-UT 2817 European Origins",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2820",
            "course_name": "Viewpoints Intensive: Fundamentals",
            "description": "NCRD-UT 2820 Viewpoints Intensive: Fundamentals",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2821",
            "course_name": "Viewpoints Intensive: Fundamentals",
            "description": "NCRD-UT 2821 Viewpoints Intensive: Fundamentals",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2822",
            "course_name": "Viewpoints Intensive: Applications",
            "description": "NCRD-UT 2822 Viewpoints Intensive: Applications",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2824",
            "course_name": "Meisner Extension Summer",
            "description": "NCRD-UT 2824 Meisner Extension Summer",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2826",
            "course_name": "New Studio Music Thea Intensive",
            "description": "NCRD-UT 2826 New Studio Music Thea Intensive",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2828",
            "course_name": "Ensemble Track",
            "description": "NCRD-UT 2828 Ensemble Track",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2830",
            "course_name": "Directing Practicum",
            "description": "NCRD-UT 2830 Directing Practicum",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2840",
            "course_name": "Stage Combat Intensive",
            "description": "NCRD-UT 2840 Stage Combat Intensive",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2850",
            "course_name": "Fundamentals of Acting I",
            "description": "NCRD-UT 2850 Fundamentals of Acting I",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2851",
            "course_name": "Fundamentals of Actng II",
            "description": "NCRD-UT 2851 Fundamentals of Actng II",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 2866",
            "course_name": "Performing Objects: Practicum",
            "description": "NCRD-UT 2866 Performing Objects: Practicum",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 3000",
            "course_name": "Master Class in Producing Workshop",
            "description": "NCRD-UT 3000 Master Class in Producing Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 3001",
            "course_name": "Master Class in Scriptwriting Workshop",
            "description": "NCRD-UT 3001 Master Class in Scriptwriting Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 3301",
            "course_name": "Intro to Physical Computing",
            "description": "NCRD-UT 3301 Intro to Physical Computing",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4201",
            "course_name": "Topics/Perfrmng Culture:",
            "description": "NCRD-UT 4201 Topics/Perfrmng Culture:",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4202",
            "course_name": "Gend/Prf:Playng Gender& Race Rmns:Pol/Rep & Perf",
            "description": "NCRD-UT 4202 Gend/Prf:Playng Gender& Race Rmns:Pol/Rep & Perf",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4203",
            "course_name": "Topics/Politics & Perf: Polit Perf in Latin Amer",
            "description": "NCRD-UT 4203 Topics/Politics & Perf: Polit Perf in Latin Amer",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4204",
            "course_name": "Topics/Lat Perf:Latino/a Perf & Performativity",
            "description": "NCRD-UT 4204 Topics/Lat Perf:Latino/a Perf & Performativity",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4205",
            "course_name": "Topics/Diasp St:Race Mem & Hist Cons/Rel/Afr Dias",
            "description": "NCRD-UT 4205 Topics/Diasp St:Race Mem & Hist Cons/Rel/Afr Dias",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4206",
            "course_name": "Performance Composition",
            "description": "NCRD-UT 4206 Performance Composition",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4207",
            "course_name": "Performance Writing Workshop",
            "description": "NCRD-UT 4207 Performance Writing Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4208",
            "course_name": "Theatre and Performance in New York",
            "description": "NCRD-UT 4208 Theatre and Performance in New York",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4209",
            "course_name": "Performance Workshop With East Coast Artists",
            "description": "NCRD-UT 4209 Performance Workshop With East Coast Artists",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4210",
            "course_name": "Internationl Performance Research: Brazil",
            "description": "NCRD-UT 4210 Internationl Performance Research: Brazil",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4211",
            "course_name": "Performance and Tech: Performatvty/Tech/Resist",
            "description": "NCRD-UT 4211 Performance and Tech: Performatvty/Tech/Resist",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4212",
            "course_name": "Performance Compostion",
            "description": "NCRD-UT 4212 Performance Compostion",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4213",
            "course_name": "Studies in Dance: Movement",
            "description": "NCRD-UT 4213 Studies in Dance: Movement",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4214",
            "course_name": "Topics in Queer Theory: Queer Performance",
            "description": "NCRD-UT 4214 Topics in Queer Theory: Queer Performance",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4215",
            "course_name": "Hemispheric Institute: Perf Festival & Seminar",
            "description": "NCRD-UT 4215 Hemispheric Institute: Perf Festival & Seminar",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4216",
            "course_name": "Performance in New York",
            "description": "NCRD-UT 4216 Performance in New York",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4217",
            "course_name": "Topics in Perf Culture: Perf Story in Cult & Soc",
            "description": "NCRD-UT 4217 Topics in Perf Culture: Perf Story in Cult & Soc",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4501",
            "course_name": "",
            "description": "NCRD-UT 4501\n\n   Pedro Almodovar\n\nPedro Almodóvar is the most notorious Spanish filmmaker since Luis Buñuel, and, like Buñuel, he rapidly gained international acclaim.  This course will attend to Almodóvar’s appealing body of work (What Have I Done to Deserve This, Matador, Law of Desire, Tie Me Up Tie Me Down, All About My Mother, Talk to Her, Bad Education, Volver, Women on the Verge of a Nervous Breakdown, The Skin I Live In, among others) in relation to: national political history; international film exhibition; intertextual popular culture; comedy-thriller-melodrama genre mixing; convoluted narrative structures; theatrica...\n\n      more description for NCRD-UT 4501 »\n\n      \n\n\n\nPedro Almodóvar is the most notorious Spanish filmmaker since Luis Buñuel, and, like Buñuel, he rapidly gained international acclaim.  This course will attend to Almodóvar’s appealing body of work (What Have I Done to Deserve This, Matador, Law of Desire, Tie Me Up Tie Me Down, All About My Mother, Talk to Her, Bad Education, Volver, Women on the Verge of a Nervous Breakdown, The Skin I Live In, among others) in relation to: national political history; international film exhibition; intertextual popular culture; comedy-thriller-melodrama genre mixing; convoluted narrative structures; theatrical uses of color, music, acting, and scale; interrelated themes of family, desire, and identity; and an aesthetics of excess. Finally we will consider the “outstanding” Almodóvar within a context of “influence.”\n\n      less description for NCRD-UT 4501 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4502",
            "course_name": "Kubrick",
            "description": "NCRD-UT 4502 Kubrick \nThe films of Stanley Kubrick constitute one of the most innovative bodies of work in the commercial cinema.  This course investigates Kubrick’s films in detail with emphasis on their narrative conceptions and structures.  The course will explore the uses of irony and voiceover, the representation of the relationship between humans and technology, the centrality of the topic of war, and the relationship of his films to issues of genre.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 4503",
            "course_name": "",
            "description": "NCRD-UT 4503\n\n   Close Analysis of Film\n\nThis class examines a small number of films in great detail with the intention of enhancing student comprehension of the multiple levels at which films are made and received.  Among the films we will analyze are Touch of Evil (1958), Do the Right Thing (1989), In the Mood For Love (2000), Pan’s Labyrinth (2006), Run, Lola, Run (1998), and Gilda (1946). The course encourages the intensive, and comparative study of film, and concentrates on the formal analysis of the sound and image track, the segmentation of the scenario/narrative, techniques of stylistic analysis, and a consideration of a film...\n\n      more description for NCRD-UT 4503 »\n\n      \n\n\n\nThis class examines a small number of films in great detail with the intention of enhancing student comprehension of the multiple levels at which films are made and received.  Among the films we will analyze are Touch of Evil (1958), Do the Right Thing (1989), In the Mood For Love (2000), Pan’s Labyrinth (2006), Run, Lola, Run (1998), and Gilda (1946). The course encourages the intensive, and comparative study of film, and concentrates on the formal analysis of the sound and image track, the segmentation of the scenario/narrative, techniques of stylistic analysis, and a consideration of a film’s surrounding documents, such as studio papers, posters, and critical reviews.   Students will acquire vocabulary and tools through which to describe the textual patterns and forces by which a film produces its meanings and effects.  As a key part of the course, each student will closely analyze an individual film they have chosen, for a final presentation.\n\n      less description for NCRD-UT 4503 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5004",
            "course_name": "Tisch Dance Summer Residency Festival I",
            "description": "NCRD-UT 5004 Tisch Dance Summer Residency Festival I",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5005",
            "course_name": "Tisch Dance Summer Residency Festival II",
            "description": "NCRD-UT 5005 Tisch Dance Summer Residency Festival II",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5014",
            "course_name": "Encore:a Residency Extra",
            "description": "NCRD-UT 5014 Encore:a Residency Extra",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5635",
            "course_name": "N/C Writing The Feature Film",
            "description": "NCRD-UT 5635 N/C Writing The Feature Film",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5655",
            "course_name": "N/C Scriptwriting I",
            "description": "NCRD-UT 5655 N/C Scriptwriting I",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5656",
            "course_name": "N/C Script Writing II",
            "description": "NCRD-UT 5656 N/C Script Writing II",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5682",
            "course_name": "N/C Fund of Producing",
            "description": "NCRD-UT 5682 N/C Fund of Producing",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5684",
            "course_name": "N/C Script Analysis",
            "description": "NCRD-UT 5684 N/C Script Analysis",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 5695",
            "course_name": "Producing for Film",
            "description": "NCRD-UT 5695 Producing for Film",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 7200",
            "course_name": "Cinema Studies for The",
            "description": "NCRD-UT 7200 Cinema Studies for The",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 7925",
            "course_name": "Web Design for The High School Teacher",
            "description": "NCRD-UT 7925 Web Design for The High School Teacher",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 7972",
            "course_name": "Sociable Objects Wks",
            "description": "NCRD-UT 7972 Sociable Objects Wks",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8001",
            "course_name": "",
            "description": "NCRD-UT 8001\n\n   Playwriting I\n\nSame as DWPG-UT 30/DWPG-GT 2030\n\nA vigorous review of the basic principles taught in Craft I and II with strong emphasis on characterization, dialogue, and structure, including identification of the major dramatic incident and turning points. Classes will focus on both analysis of dramatic texts from contemporary playwrights and student scripts. Professor will give notes on all final projects. Meets twice weekly. Coursework includes reading and writing assignments. Students will not be admitted into Playwriting II without full completion of Playwriting I. A completed full-length play is the re...\n\n      more description for NCRD-UT 8001 »\n\n      \n\n\n\nSame as DWPG-UT 30/DWPG-GT 2030\n\nA vigorous review of the basic principles taught in Craft I and II with strong emphasis on characterization, dialogue, and structure, including identification of the major dramatic incident and turning points. Classes will focus on both analysis of dramatic texts from contemporary playwrights and student scripts. Professor will give notes on all final projects. Meets twice weekly. Coursework includes reading and writing assignments. Students will not be admitted into Playwriting II without full completion of Playwriting I. A completed full-length play is the required final project.\n\nFee: $2,870.00\n\n      less description for NCRD-UT 8001 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8002",
            "course_name": "Playwriting II",
            "description": "NCRD-UT 8002 Playwriting II \nSame as DWPG-UT 1040 and DWPG-GT 2040. Prerequisites: Play I or permission of the department\n\nThe goal of the course is to complete a rewrite of a full-length play and at minimum, the first half of a new play, with the remainder outlined. For the new full-length play, completion is recommended, but a minimum of 50 pages must be submitted for final evaluation. REQUIRED FINAL PROJECT: Either a complete new play or a full rewrite of play completed in Playwriting I, based on notes.\n\nFee: $2,870.00",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8003",
            "course_name": "Screenwriting I",
            "description": "NCRD-UT 8003 Screenwriting I \nSame as DWPG-UT 35/DWPG-GT 2035.\n\nStudents are required to complete at least 60 pages of a full-length screenplay, along with a revised outline of the full screenplay. It is highly encouraged that students complete a full draft of their screenplay. The reading and analysis of six to eight screenplays is required in conjunction with the student’s original work. Students must come to the first class with at least two ideas for full-length screenplays. Each idea should be described as per the instructor’s directions. Students must complete the required work to move on to the next level.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8004",
            "course_name": "",
            "description": "NCRD-UT 8004\n\n   Screenwriting II\n\nSame as DWPG-UT 1045 and DWPG-GT 2045.  Prerequisites: Screen I or permission of the department.\n\nScreen II offers a continuation of methodology introduced in Screen I. The goal of the class is completion. You will either: a) begin and complete a new screenplay, or b) complete the screenplay started in Screenwriting I and do a full rewrite. The focus in this class will be on screenplay structure. An understanding of film language will also be emphasized. If you plan to do a new work, you must (again) come to first class with two ideas for full-length screenplays. Completion is required in orde...\n\n      more description for NCRD-UT 8004 »\n\n      \n\n\n\nSame as DWPG-UT 1045 and DWPG-GT 2045.  Prerequisites: Screen I or permission of the department.\n\nScreen II offers a continuation of methodology introduced in Screen I. The goal of the class is completion. You will either: a) begin and complete a new screenplay, or b) complete the screenplay started in Screenwriting I and do a full rewrite. The focus in this class will be on screenplay structure. An understanding of film language will also be emphasized. If you plan to do a new work, you must (again) come to first class with two ideas for full-length screenplays. Completion is required in order to move to the next level.\n\n      less description for NCRD-UT 8004 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8005",
            "course_name": "",
            "description": "NCRD-UT 8005\n\n   Intro Half Hour Comedy\n\nSame as DWPG-UT 1042 and DWPG-GT 2042.\n\nThis class provides a ground-up exposure to the rigors of half-hour TV comedy script-writing, moving step by step, from premise lines, to the one-page outline, to writing pages, through revision and classroom workshop critiquing. The focus in here will be on a script for a current television half-hour comedy (live-action or animated). As a goal, students will be expected to complete both a full Story and a script for them to revise in a later advanced-level TV class. While this class is not a class for Pilots, which are mainly reserved for some upper-lev...\n\n      more description for NCRD-UT 8005 »\n\n      \n\n\n\nSame as DWPG-UT 1042 and DWPG-GT 2042.\n\nThis class provides a ground-up exposure to the rigors of half-hour TV comedy script-writing, moving step by step, from premise lines, to the one-page outline, to writing pages, through revision and classroom workshop critiquing. The focus in here will be on a script for a current television half-hour comedy (live-action or animated). As a goal, students will be expected to complete both a full Story and a script for them to revise in a later advanced-level TV class. While this class is not a class for Pilots, which are mainly reserved for some upper-level classes, during two final weeks of the class students who feel that they will otherwise complete the goals of the class, may be allowed to pitch and put a half-hour pilot through an early developmental stage. This course prepares students for the professional world.\n\n      less description for NCRD-UT 8005 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8006",
            "course_name": "Graphic Story Telling",
            "description": "NCRD-UT 8006 Graphic Story Telling",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8007",
            "course_name": "Special Topics",
            "description": "NCRD-UT 8007 Special Topics",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8008",
            "course_name": "One Hour Drama",
            "description": "NCRD-UT 8008 One Hour Drama \nPrerequisites: Intro to Half Hour Comedy, TV I or permission of the department. Same as DWPG-UT 1048 and DWPG-GT 2048.\n\nThis workshop course takes the student step-by-step through writing their own script for an ongoing one-hour television dramatic series. The course will go from premise lines, through the outline/beat sheet, to writing a draft of the script that may be polished in Advanced or Thesis. As a goal, students will complete and revise a full 1-Hour story and at least half a script. (No pilots.)",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8009",
            "course_name": "Independent Study",
            "description": "NCRD-UT 8009 Independent Study",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8010",
            "course_name": "Intro to Comics Writing",
            "description": "NCRD-UT 8010 Intro to Comics Writing",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8011",
            "course_name": "Advanced TV: Comedy Writing",
            "description": "NCRD-UT 8011 Advanced TV: Comedy Writing \nSame as DWPG-UT 1150/DWPG-GT 2150\nThis Advanced class is for the revision or completion of previous work in either \nthe half-hour comedy or one-hour dramatic field.  Around the midway point students may begin a new work or a pilot, if their initial spec is properly polished.  The teacher will provide a list of acceptable shows during the summer before class begins.  This is a high-level Thesis-like class.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8012",
            "course_name": "",
            "description": "NCRD-UT 8012\n\n   Writing for Sketch Comedy\n\nSame as DWPG-UT 1047/DWPG-GT 2047\n\nThis is a sketch writing workshop class. A survey of sketch genres and approaches will be integrated with writing assignments and rewriting of one’s own sketches: both privately and collaboratively. The goal is for each student to emerge from the class with several polished sketches. For this class, it helps to have a good sense of humor that you want to get even better at putting down on the page. There will be a lot of group critiquing and occasionally group rewriting. So it helps to stop thinking that your first draft is perfect. Because it isn’t. This can...\n\n      more description for NCRD-UT 8012 »\n\n      \n\n\n\nSame as DWPG-UT 1047/DWPG-GT 2047\n\nThis is a sketch writing workshop class. A survey of sketch genres and approaches will be integrated with writing assignments and rewriting of one’s own sketches: both privately and collaboratively. The goal is for each student to emerge from the class with several polished sketches. For this class, it helps to have a good sense of humor that you want to get even better at putting down on the page. There will be a lot of group critiquing and occasionally group rewriting. So it helps to stop thinking that your first draft is perfect. Because it isn’t. This can be a pretty wild class, so it also helps to never think that comedy can go “too far.” The course may have a guest lecturer. \nNOTE: Everyone must bring 1 (ONE) original sketch idea to Class 1 that you will pitch in 3-4 sentences tops. (And perhaps write for Class 2.)\n\n      less description for NCRD-UT 8012 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8021",
            "course_name": "Producing Live Music Events",
            "description": "NCRD-UT 8021 Producing Live Music Events",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8022",
            "course_name": "Legal & Business Essentials for the Performing Artist",
            "description": "NCRD-UT 8022 Legal & Business Essentials for the Performing Artist",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8026",
            "course_name": "Funding Your Music Venture",
            "description": "NCRD-UT 8026 Funding Your Music Venture",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8040",
            "course_name": "",
            "description": "NCRD-UT 8040\n\n   Playwriting Practicum\n\nAn introductory course on the basic techniques employed in writing a play. Class includes discussion of samples of the students’ work in addition to discussion of theory and various theatrical exercises. Students read selected plays to enhance discussions of structuring a dramatic piece of writing. The course addresses actors writing material for themselves and focuses on character and dialogue as well as examining scene work, outlining, and the completion of a first draft of a one-act play. This course counts towards Theatre Studies requirements for Drama students and as elective credits for ...\n\n      more description for NCRD-UT 8040 »\n\n      \n\n\n\nAn introductory course on the basic techniques employed in writing a play. Class includes discussion of samples of the students’ work in addition to discussion of theory and various theatrical exercises. Students read selected plays to enhance discussions of structuring a dramatic piece of writing. The course addresses actors writing material for themselves and focuses on character and dialogue as well as examining scene work, outlining, and the completion of a first draft of a one-act play. This course counts towards Theatre Studies requirements for Drama students and as elective credits for other TSOA students.\n\n      less description for NCRD-UT 8040 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8055",
            "course_name": "Hip Hop: The New York City Experience",
            "description": "NCRD-UT 8055 Hip Hop: The New York City Experience",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8150",
            "course_name": "Writint Workshop",
            "description": "NCRD-UT 8150 Writint Workshop",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8155",
            "course_name": "Crafts of Musical Thtr: Composing",
            "description": "NCRD-UT 8155 Crafts of Musical Thtr: Composing",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8160",
            "course_name": "Crafts of Musical Theatre: Lyric Wrting",
            "description": "NCRD-UT 8160 Crafts of Musical Theatre: Lyric Wrting",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8165",
            "course_name": "Craft of Musical Theatre Bookwriting",
            "description": "NCRD-UT 8165 Craft of Musical Theatre Bookwriting",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8200",
            "course_name": "N/C Photo-Career Options",
            "description": "NCRD-UT 8200 N/C Photo-Career Options",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8201",
            "course_name": "",
            "description": "NCRD-UT 8201\n\n   Photography I\n\nMany photographers who have been utilizing digital cameras are turning (and returning) to traditional, silver-based film and papers. This intensive course is designed to introduce and explore the practical and creative applications of analog photography. All fundamental analog camera applications will be covered, including 35mm and 120mm medium roll-film formats as well as the larger 4x5 view camera systems, utilizing sheet film. Attention will be given to the special character and unique possibilities of each of these format categories, from the responsive immediacy of 35mm to the high-resolu...\n\n      more description for NCRD-UT 8201 »\n\n      \n\n\n\nMany photographers who have been utilizing digital cameras are turning (and returning) to traditional, silver-based film and papers. This intensive course is designed to introduce and explore the practical and creative applications of analog photography. All fundamental analog camera applications will be covered, including 35mm and 120mm medium roll-film formats as well as the larger 4x5 view camera systems, utilizing sheet film. Attention will be given to the special character and unique possibilities of each of these format categories, from the responsive immediacy of 35mm to the high-resolution and perspective control of view camera options. Students will learn essential composition and optical principles and metering techniques. Supported by a comprehensive lab facility, students will learn film processing and archival projection print enlarging methods as well as the basics of print finishing and presentation. Classes will incorporate slide lectures of important historical and contemporary imagery, hands-on studio and laboratory demonstrations, critiques of student work and field trips. For those who may wish to combine analog image capture with digital printing alternatives, negative scanning fundamentals will be introduced at the conclusion of the course. There is a lab fee charged for this course.\n\n      less description for NCRD-UT 8201 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8202",
            "course_name": "",
            "description": "NCRD-UT 8202\n\n   Photography II:\n\nThis course is designed for those who have completed basic courses in either analog B&W or digital photography. Recommended for transfer students. Utilizing medium format (120mm roll film) and large format (4”x5” and 8”x10” sheet film) cameras, students will explore the special creative advantages of working with larger format films and cameras. Even as digital cameras have replaced 35mm analog cameras, the higher resolution and creative flexibility of medium and large format cameras afford artists the opportunity to render their subjects with greater fidelity and at a larger scale. For some, ...\n\n      more description for NCRD-UT 8202 »\n\n      \n\n\n\nThis course is designed for those who have completed basic courses in either analog B&W or digital photography. Recommended for transfer students. Utilizing medium format (120mm roll film) and large format (4”x5” and 8”x10” sheet film) cameras, students will explore the special creative advantages of working with larger format films and cameras. Even as digital cameras have replaced 35mm analog cameras, the higher resolution and creative flexibility of medium and large format cameras afford artists the opportunity to render their subjects with greater fidelity and at a larger scale. For some, the more deliberate process of working at a slower pace can significantly enhance their interpretation of portraits, still-lifes and architectural subjects.       \n\nLectures will consist of studio and lab demonstrations, slides presentations of historical and contemporary work, and critiques of assignments. All students will be expected to complete a modest portfolio based on a subject of their own choosing.  Representative medium and large format cameras, as well as tripods and light meters will be provided.  Students will have the opportunity to work in a professional lab with excellent technical support. Those who successfully complete this course can expect to have practical experience with camera operation, advanced metering, film processing for contrast control, analog printing, as well as negative scanning for digital output of their negatives. Demonstration materials will be furnished. Participants will be required to provide film and paper for the execution of their assignments.\n\nThis course is charged a lab fee of $372.00.\n\n      less description for NCRD-UT 8202 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8203",
            "course_name": "",
            "description": "NCRD-UT 8203\n\n   Editorial Photography for New Media\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the int...\n\n      more description for NCRD-UT 8203 »\n\n      \n\n\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and written text. A lab fee of $365.00 is charged for this course.\n\n      less description for NCRD-UT 8203 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8204",
            "course_name": "",
            "description": "NCRD-UT 8204\n\n   Adv. Dir Projects: Photo and Humanrights\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and writt...\n\n      more description for NCRD-UT 8204 »\n\n      \n\n\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and written text.  This course is charged a lab fee of $350.00.\n\n      less description for NCRD-UT 8204 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8206",
            "course_name": "Human Rights and Photography",
            "description": "NCRD-UT 8206 Human Rights and Photography",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8211",
            "course_name": "Intro to Career Options",
            "description": "NCRD-UT 8211 Intro to Career Options",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8213",
            "course_name": "",
            "description": "NCRD-UT 8213\n\n   Lighting:\n\nThis class teaches lighting as a series of the most common lighting problems encountered in professional photography and cinematography.  The course philosophy is that the most complex and difficult lighting problems are really just combinations of small, easily resolved, problems. Starting with basic three-point lighting for portraiture using simple continuous source lighting, the course will progress quickly to extremely complex set ups using electronic flash as well as lighting for the new generation of hybrid dslr’s  (video/still camera) as it moves through multiple environments. Subjects ...\n\n      more description for NCRD-UT 8213 »\n\n      \n\n\n\nThis class teaches lighting as a series of the most common lighting problems encountered in professional photography and cinematography.  The course philosophy is that the most complex and difficult lighting problems are really just combinations of small, easily resolved, problems. Starting with basic three-point lighting for portraiture using simple continuous source lighting, the course will progress quickly to extremely complex set ups using electronic flash as well as lighting for the new generation of hybrid dslr’s  (video/still camera) as it moves through multiple environments. Subjects covered include: Lighting for portraits, still life, fashion, interiors, documentary, and exterior location lighting using battery powered flash. Location scouting and planning according to location limitations. Color temperature and color control.  Light shaping and control. Students will learn how to use:  Digital SLR’s, medium format cameras, Leaf Aptus electronic capture, direct tethered capture using Adobe Lightroom, continuous lighting, electronic flash, color temperature meters and custom white balance profiles as well as the basics of video/sound capture. Lighting equipment is provided. There is a lab fee charged for this course.\n\n      less description for NCRD-UT 8213 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8214",
            "course_name": "",
            "description": "NCRD-UT 8214\n\n   Large Format\n\nPrerequisite: Photography & Imaging: Analog and Digital.\n\nMany artists turn to 4x5 and 8x10 large-format cameras for the creative control that view cameras afford, as well as for the high resolution and potentially large scale of the resulting prints. This course introduces the special characteristics of large format photography, including perspective control, creative approaches to selective focus and metering strategies facilitated by single negative processing. The exposure and development methods known as the Zone System will also be considered. Because large format work is physically dema...\n\n      more description for NCRD-UT 8214 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging: Analog and Digital.\n\nMany artists turn to 4x5 and 8x10 large-format cameras for the creative control that view cameras afford, as well as for the high resolution and potentially large scale of the resulting prints. This course introduces the special characteristics of large format photography, including perspective control, creative approaches to selective focus and metering strategies facilitated by single negative processing. The exposure and development methods known as the Zone System will also be considered. Because large format work is physically demanding and relatively slow, this is also an opportunity to work more deliberately and, in some respects, more consciously. It may also inform one’s understanding of the methods and approaches of 19th and early 20th Century artists. \n\nThe high resolution of large format description can often produce a compelling image of relatively static subject matter that might not otherwise succeed if recorded in smaller formats. Surfaces and details evoke a more “complete”, or even tactile appreciation of some subjects. Following a series of practical exercises during the first half of the course, students are expected to develop an appropriate project on which to concentrate and apply their evolving skills in the production of an original and integrated body of work. Technical material covered includes different large format camera types and applications, lenses and optics, metering, filters, special B&W developers, large format printing and scanning for digital output. Early historical processes are introduced, current exhibitions of artists and photographers in New York are discussed and field trips are arranged. A variety of cameras, lenses and tripods are available for student use.\n\nA lab fee of $372.00 is charged for this course.\n\n      less description for NCRD-UT 8214 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8215",
            "course_name": "",
            "description": "NCRD-UT 8215\n\n   Picture Essay for Paper and Pixel\n\nThis course is designed for students that are taking all of the Human Rights courses. However there is space available to other students interested in this topic.  Please contact the Department for permission to register.\n\nThe course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of historical models from magazines, newspapers, books, exhibitions and digital ...\n\n      more description for NCRD-UT 8215 »\n\n      \n\n\n\nThis course is designed for students that are taking all of the Human Rights courses. However there is space available to other students interested in this topic.  Please contact the Department for permission to register.\n\nThe course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of historical models from magazines, newspapers, books, exhibitions and digital environments, including the Web. The impact of media strategies, both contemporary and historical, on human rights issues will be a central component of the class.\n\n      less description for NCRD-UT 8215 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8216",
            "course_name": "Directed Projects:",
            "description": "NCRD-UT 8216 Directed Projects: \nFirst priority is given to students who are taking all of the Photography and Human Rights courses.\n\nThis is a multi-topic course. Please see the notes for more information.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8220",
            "course_name": "N\\C Intro to Color Printing",
            "description": "NCRD-UT 8220 N\\C Intro to Color Printing",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8221",
            "course_name": "",
            "description": "NCRD-UT 8221\n\n   In Design\n\nThis course is devoted to a different level of understanding the design and production of making a book. On the first day of class, students bring in digital versions of their art and decide to translate it into a printed piece.  The class we’ll focus on book design. Students will begin to explore InDesign and learn how to use the program to create a publication, deciding on the size nand order of image and where text will go.  On the second day of class students learn how to work with type. The class explores how to make type work for you and what typefaces work best depending on your design ...\n\n      more description for NCRD-UT 8221 »\n\n      \n\n\n\nThis course is devoted to a different level of understanding the design and production of making a book. On the first day of class, students bring in digital versions of their art and decide to translate it into a printed piece.  The class we’ll focus on book design. Students will begin to explore InDesign and learn how to use the program to create a publication, deciding on the size nand order of image and where text will go.  On the second day of class students learn how to work with type. The class explores how to make type work for you and what typefaces work best depending on your design and art. The class will talk about image pacing and the flow of text throughout a publication. On the third day of class, homework is reviewed and InDesign files are revised if needed. The class then turns to production. We will go over each file and make it as final as possible and ready for print.  The class will also discuss the different ways to get your document published and how to do each one. In the beginning of this course the students will walk into the classroom with a loose body of work and leave, after the third day, with their work organized into a book format. This course is charged a lab fee of $175.00. Graduate course numbers are available on Albert.\n\n      less description for NCRD-UT 8221 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8225",
            "course_name": "Color Digital",
            "description": "NCRD-UT 8225 Color Digital",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8229",
            "course_name": "N/C Advanced History Photography",
            "description": "NCRD-UT 8229 N/C Advanced History Photography",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8230",
            "course_name": "Directed Projects I",
            "description": "NCRD-UT 8230 Directed Projects I \nThis is a multi-topic course. Please see the notes below for more information.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8233",
            "course_name": "Topics in Contemporary Photography",
            "description": "NCRD-UT 8233 Topics in Contemporary Photography",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8235",
            "course_name": "",
            "description": "NCRD-UT 8235\n\n   Web Design\n\nPrerequisite: Photography II or permission from the Department. Contact the Department for permission: 721 Broadway, 8th Floor, 212-998-1930. This course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will b...\n\n      more description for NCRD-UT 8235 »\n\n      \n\n\n\nPrerequisite: Photography II or permission from the Department. Contact the Department for permission: 721 Broadway, 8th Floor, 212-998-1930. This course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students will: 1. Know how to create basic web pages using xHTML and CSS, 2. Become comfortable using Dreamweaver to aid in web design and construction, 3. Gain an understanding of the unique design problems involved in web design, 4. Develop ability to design and problem-solve through the creation of their own projects, and 5. Evaluate and explore effective web-based design and the web as a medium. There is a lab fee for this course.\n\n      less description for NCRD-UT 8235 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8238",
            "course_name": "",
            "description": "NCRD-UT 8238\n\n   Web Design\n\nThis course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students...\n\n      more description for NCRD-UT 8238 »\n\n      \n\n\n\nThis course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students will: 1. Know how to create basic web pages using xHTML and CSS, 2. Become comfortable using Dreamweaver to aid in web design and construction, 3. Gain an understanding of the unique design problems involved in web design, 4. Develop an ability to design and problem-solve through the creation of their own projects, and 5. Evaluate and explore effective web-based design and the web as a medium. For Summer 2011, this course is charged a lab fee of $175.00.\n\n      less description for NCRD-UT 8238 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8239",
            "course_name": "Web Design II",
            "description": "NCRD-UT 8239 Web Design II",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8240",
            "course_name": "Digital Tools Noncredit",
            "description": "NCRD-UT 8240 Digital Tools Noncredit",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8245",
            "course_name": "",
            "description": "NCRD-UT 8245\n\n   Photoshop: Creative Imaging\n\nPrerequisite: Basic computer experience. \n\nThis three-week course focusing on Photoshop explores the possibilities for image manipulation and the steps involved in learning to translate traditional darkroom skills into digital artwork and montage. Starting from the empty canvas, we look at all the basic elements of Photoshop, including selection tools, text, scale, retouching, and collage. Introducing the principles of layers and masks we will look at creating composite images from photographic images and web sources. We also cover scanning negatives and flat artwork as well as color adjustmen...\n\n      more description for NCRD-UT 8245 »\n\n      \n\n\n\nPrerequisite: Basic computer experience. \n\nThis three-week course focusing on Photoshop explores the possibilities for image manipulation and the steps involved in learning to translate traditional darkroom skills into digital artwork and montage. Starting from the empty canvas, we look at all the basic elements of Photoshop, including selection tools, text, scale, retouching, and collage. Introducing the principles of layers and masks we will look at creating composite images from photographic images and web sources. We also cover scanning negatives and flat artwork as well as color adjustment using levels and curves. We look at all aspects of image creation and enhancement with equal importance given to the aesthetic effect and technical ease. By working on a creative project, students use the software to convey their ideas in this digital environment. Class time is divided between work-in-progress sessions, critiques, and lectures. Because of the holiday, that session will be rescheduled sometime during the three weeks of class. There is a lab fee charged for this course. Graduate course numbers are available on Albert.\n\n      less description for NCRD-UT 8245 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8247",
            "course_name": "",
            "description": "NCRD-UT 8247\n\n   Digital Printing\n\nPrerequisite: Photography I, Digital Tools for Non-Majors, or permission from the Department.\n\nThis 3-week workshop will explore a range of digital imaging and printing resources. The aesthetic and technical aspects of color will be discussed along with the implication of scanning, file preparation, resolution requirements and color management for printout. The subtleties of various output devices from laser and ink jet printers to large format ink jet plotters and digital C printing will be covered. The objective will be to discover and execute a printing method best suited for individual pro...\n\n      more description for NCRD-UT 8247 »\n\n      \n\n\n\nPrerequisite: Photography I, Digital Tools for Non-Majors, or permission from the Department.\n\nThis 3-week workshop will explore a range of digital imaging and printing resources. The aesthetic and technical aspects of color will be discussed along with the implication of scanning, file preparation, resolution requirements and color management for printout. The subtleties of various output devices from laser and ink jet printers to large format ink jet plotters and digital C printing will be covered. The objective will be to discover and execute a printing method best suited for individual projects. Students will have the opportunity to complete a small project of their own. Class time will be devoted to lectures and demonstrations on scanning, color and color printing, group critiques and possible field trips. Although the department will have a few digital cameras for student use, it is highly recommended that students own their own digital camera. A lab fee of $182.50 is charged for this course.\n\n      less description for NCRD-UT 8247 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8250",
            "course_name": "Digital Imaging",
            "description": "NCRD-UT 8250 Digital Imaging",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8260",
            "course_name": "",
            "description": "NCRD-UT 8260\n\n   Intermediate Photoshop\n\nPrerequisite: Photography & Imaging Digital, Photoshop or permission of the Department.\n\nIn this intermediate workshop students will build on their existing knowledge of Photoshop. Whether you want to work in print, on the web, or in video, Photoshop offers extraordinary creative freedom to manipulate existing images, create new artwork, and integrate basic graphic design elements. Emphasis in this class will be on using Photoshop for image manipulation as well as on graphic design principles and non-destructive image editing techniques. You will learn to construct images from photographic sou...\n\n      more description for NCRD-UT 8260 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging Digital, Photoshop or permission of the Department.\n\nIn this intermediate workshop students will build on their existing knowledge of Photoshop. Whether you want to work in print, on the web, or in video, Photoshop offers extraordinary creative freedom to manipulate existing images, create new artwork, and integrate basic graphic design elements. Emphasis in this class will be on using Photoshop for image manipulation as well as on graphic design principles and non-destructive image editing techniques. You will learn to construct images from photographic source material, as well as starting from scratch using Photoshop’s design and media tools.  While grounding in the basics of Photoshop and digital photography is assumed, early sessions will review basic tools to expand and better control these fundamental building blocks of digital imaging. Specifically we will explore creating and using layer masks and image effects, creating paths and shapes, custom fills and patterns. We will review working with layers, adjustment layers and text layers, as well as reviewing the details of resizing, sharpening, and image resolution for various output destinations. The course will be project-based with several short assignments and a final project of the students’ choosing. A lab fee is charged for this course.\n\n      less description for NCRD-UT 8260 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8270",
            "course_name": "",
            "description": "NCRD-UT 8270\n\n   Digital Tools for Documentary Practice\n\nThis course will explore a variety of digital media tools that are useful for a documentary photographer. The class will explore issues relating to the digital camera, as well as to image capture, preservation, presentation and transmission. Lighting, audio interviewing, and the production of short videos will also be covered at a basic level. Students work on several small assignments to experiment with software and hardware, and will have the opportunity to complete a small project of their own. This course is intended to give students a fundamental understanding of the efficiencies and poss...\n\n      more description for NCRD-UT 8270 »\n\n      \n\n\n\nThis course will explore a variety of digital media tools that are useful for a documentary photographer. The class will explore issues relating to the digital camera, as well as to image capture, preservation, presentation and transmission. Lighting, audio interviewing, and the production of short videos will also be covered at a basic level. Students work on several small assignments to experiment with software and hardware, and will have the opportunity to complete a small project of their own. This course is intended to give students a fundamental understanding of the efficiencies and possibilities of the digital realm. This class is specifically intended for students enrolled in Photography and Human Rights courses, but is open to others as well. This course is charged a lab fee of $175.00.\n\n      less description for NCRD-UT 8270 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8291",
            "course_name": "Directed Projects",
            "description": "NCRD-UT 8291 Directed Projects",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8292",
            "course_name": "Directed Projects Maui-Non Credit",
            "description": "NCRD-UT 8292 Directed Projects Maui-Non Credit",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8293",
            "course_name": "Digital Imaging",
            "description": "NCRD-UT 8293 Digital Imaging",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8294",
            "course_name": "Digital Imaging: Maui Non Credit",
            "description": "NCRD-UT 8294 Digital Imaging: Maui Non Credit",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8500",
            "course_name": "The Music Industry of New York",
            "description": "NCRD-UT 8500 The Music Industry of New York \nMaster-class lectures by Recorded Music faculty and Industry panels comprised of known innovators and visionaries on topics such as touring, artist management and digital media will be offered exclusively to participants in this program.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8501",
            "course_name": "",
            "description": "NCRD-UT 8501\n\n   Studio Recording for the Modern Producer/Engineer I\n\nStudio Recording for the Modern Producer/Engineer I is a hands-on music recording course that familiarizes students with the practical aspects of the recording process. Taught by veteran professional recording engineers from today’s music industry, students will be introduced to the basics of recording through lectures, demonstrations, supplemental reading and assignments. Students will utilize the Institute’s state-of-the-art SSL console-equipped recording studio to explore topics which include: analog signal flow, the propagation of sound, hearing and audio perception, microphone types, usag...\n\n      more description for NCRD-UT 8501 »\n\n      \n\n\n\nStudio Recording for the Modern Producer/Engineer I is a hands-on music recording course that familiarizes students with the practical aspects of the recording process. Taught by veteran professional recording engineers from today’s music industry, students will be introduced to the basics of recording through lectures, demonstrations, supplemental reading and assignments. Students will utilize the Institute’s state-of-the-art SSL console-equipped recording studio to explore topics which include: analog signal flow, the propagation of sound, hearing and audio perception, microphone types, usage and microphone placement techniques, equalization and signal processing. The course will culminate with the students recording and mixing an original song.\n\n      less description for NCRD-UT 8501 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8502",
            "course_name": "",
            "description": "NCRD-UT 8502\n\n   Studio Recording for the Modern Producer/Engineer II\n\nStudio Recording for the Modern Producer/Engineer II is a continuation of the Institute’s hands-on music recording course. Taught by veteran professional recording engineers through lectures, demonstrations, supplemental reading and assignments, students will be introduced to the “tools of the trade“ of the producer/engineer. Utilizing the Institute’s state-of-the-art SSL console-equipped recording studio, students will explore topics which include: compression, expansion/gating, time domain processes (delay, reverberation), vocal recording techniques, stereo microphone recording techniques, a...\n\n      more description for NCRD-UT 8502 »\n\n      \n\n\n\nStudio Recording for the Modern Producer/Engineer II is a continuation of the Institute’s hands-on music recording course. Taught by veteran professional recording engineers through lectures, demonstrations, supplemental reading and assignments, students will be introduced to the “tools of the trade“ of the producer/engineer. Utilizing the Institute’s state-of-the-art SSL console-equipped recording studio, students will explore topics which include: compression, expansion/gating, time domain processes (delay, reverberation), vocal recording techniques, stereo microphone recording techniques, and mixing techniques. The course will culminate with the students recording and mixing an original song.\n\n      less description for NCRD-UT 8502 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8503",
            "course_name": "Beats & Beatmaking",
            "description": "NCRD-UT 8503 Beats & Beatmaking",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8504",
            "course_name": "Music Theory & Ear Train Ing for Producers",
            "description": "NCRD-UT 8504 Music Theory & Ear Train Ing for Producers",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8505",
            "course_name": "Advanced Music Theory",
            "description": "NCRD-UT 8505 Advanced Music Theory",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8506",
            "course_name": "The Songbooks of Lennon & McCartney",
            "description": "NCRD-UT 8506 The Songbooks of Lennon & McCartney",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8507",
            "course_name": "Topics in Recorder Music:Punk",
            "description": "NCRD-UT 8507 Topics in Recorder Music:Punk",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8508",
            "course_name": "Constructing a Record La",
            "description": "NCRD-UT 8508 Constructing a Record La",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8509",
            "course_name": "The Beatles",
            "description": "NCRD-UT 8509 The Beatles",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8510",
            "course_name": "Topics: Miles Davis",
            "description": "NCRD-UT 8510 Topics: Miles Davis",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8511",
            "course_name": "Producing The Visual Ima",
            "description": "NCRD-UT 8511 Producing The Visual Ima",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8512",
            "course_name": "Rock Music in Historic Context",
            "description": "NCRD-UT 8512 Rock Music in Historic Context",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8513",
            "course_name": "Marketing & Distribution",
            "description": "NCRD-UT 8513 Marketing & Distribution",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8514",
            "course_name": "The Basics of Artist Management",
            "description": "NCRD-UT 8514 The Basics of Artist Management \nAndy Gould once said \"An artist manager's true job is to stand between the artist's gun and the artist's foot.\" In actuality, a manager’s job is to oversee all aspects of creative careers in music and is charged with the responsibility of furthering that career—from independent, DIY artists to multi-platinum superstars. Students in this course will learn about different career trajectories and gain hands-on experience developing management strategies that can be applied to different creative careers in the music industry.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8515",
            "course_name": "",
            "description": "NCRD-UT 8515\n\n   The Basics of Entrepreneurship\n\nThis course is designed for students who are interested in future careers as innovative music executives and industry leaders.  Topics include: different revenue sources; company operations and management; identification of new opportunities; effective market research techniques and strategies for successful implementation; and new venture formation.  Strategies for successful leadership will be discussed as students focus on the career paths and the circumstances behind the success of key music industry leaders and innovators (through reading assignments, in-class presentations and guest lect...\n\n      more description for NCRD-UT 8515 »\n\n      \n\n\n\nThis course is designed for students who are interested in future careers as innovative music executives and industry leaders.  Topics include: different revenue sources; company operations and management; identification of new opportunities; effective market research techniques and strategies for successful implementation; and new venture formation.  Strategies for successful leadership will be discussed as students focus on the career paths and the circumstances behind the success of key music industry leaders and innovators (through reading assignments, in-class presentations and guest lecturers).  Effective communication techniques will b learned in a series of collaborative class exercises involving public speaking, business letter writing and deal negotiations.  This course is not for ReMu majors.\n\n      less description for NCRD-UT 8515 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8516",
            "course_name": "Social Entrepreneurship in Music",
            "description": "NCRD-UT 8516 Social Entrepreneurship in Music",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8517",
            "course_name": "The Recorded Music Indus Try: Past Present Future",
            "description": "NCRD-UT 8517 The Recorded Music Indus Try: Past Present Future",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8518",
            "course_name": "",
            "description": "NCRD-UT 8518\n\n   Contracts & Dealmaking\n\nMaster the essential contracts and learn how to negotiate the terms of deals to support and execute your music projects.  Contracts explored include: recording agreements, 360 deals, digital download agreements, songwriter deals, DJ performance and residency agreements, artist management deals, music synchronization deals, composer agreements for multimedia projects, video games and more. Different contract terms and their business implications will be analyzed from a broad framework and students will learn how to structure, negotiate, and close deals on their behalf - and how to help others d...\n\n      more description for NCRD-UT 8518 »\n\n      \n\n\n\nMaster the essential contracts and learn how to negotiate the terms of deals to support and execute your music projects.  Contracts explored include: recording agreements, 360 deals, digital download agreements, songwriter deals, DJ performance and residency agreements, artist management deals, music synchronization deals, composer agreements for multimedia projects, video games and more. Different contract terms and their business implications will be analyzed from a broad framework and students will learn how to structure, negotiate, and close deals on their behalf - and how to help others do the same.\n\n      less description for NCRD-UT 8518 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8519",
            "course_name": "The Basics of Branding",
            "description": "NCRD-UT 8519 The Basics of Branding \nBrands generate loyalty, trust and familiarity with consumers. Nearly anyone can release an artist, or an album, or start their own MP3 download site, but those versed in branding have the ability to successfully capture the attention of their audience and speak to them in clear and persuasive terms. Students will learn the ins and outs of branding theory and consider why some brands succeed where others fail.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8520",
            "course_name": "Fundamentals of Audio Workstations I",
            "description": "NCRD-UT 8520 Fundamentals of Audio Workstations I \nStudents will acquire an in-depth, theoretical and practical knowledge of Digital Audio Workstations with an emphasis on file management and system configurations. Utilizing Pro Tools and Logic Pro, students will learn the operating modes and tools, gain structure and multi-tracking techniques, and will use overdubs to build an arrangement.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8521",
            "course_name": "",
            "description": "NCRD-UT 8521\n\n   Fundamentals of Audio Workstations II\n\nA continuation of part one of this course, students will apply what they have already learned to MIDI.  Selection techniques, quantization, real-time properties, synchronization and an introduction to virtual instruments and programming. They will then focus on mixing both outside and inside “the box.” Setting up the mix environment, using equalization, compression, and effects plug-ins and finally using automation. Emphasize will be made on proper mix master delivery, as well as preparing for mastering.  The course will end with a project that will enable students to apply all they learned ov...\n\n      more description for NCRD-UT 8521 »\n\n      \n\n\n\nA continuation of part one of this course, students will apply what they have already learned to MIDI.  Selection techniques, quantization, real-time properties, synchronization and an introduction to virtual instruments and programming. They will then focus on mixing both outside and inside “the box.” Setting up the mix environment, using equalization, compression, and effects plug-ins and finally using automation. Emphasize will be made on proper mix master delivery, as well as preparing for mastering.  The course will end with a project that will enable students to apply all they learned over the entirety of the course.\n\n      less description for NCRD-UT 8521 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8522",
            "course_name": "Producing Music With Software & Midi I",
            "description": "NCRD-UT 8522 Producing Music With Software & Midi I \nThrough a series of discussions, in-class exercises, and assignments, this course will cover digital audio and synchronization, as well as provide an opportunity for students to learn how to use “programming” tools to create music. This course assumes significant prior knowledge of digital audio workstations.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8523",
            "course_name": "",
            "description": "NCRD-UT 8523\n\n   The Virtual Producer: Software, Instruments, and FX\n\nIf you are a Pop Music producer, EDM producer/artist, DJ, Remixer, or self-produced artist looking for detail-oriented, pragmatic advanced in-the-box production instruction - this class is for you. Topics include, but are not limited to: Sampling, (using software such as Kontakt and Geist), Synthesis (Additive, Subtractive, Granular, FM, etc.), Loops and Looping, Percussive Sampling, Virtual Instruments, (including software such as Massive, Sylenth, FM8, etc.), Control Surfaces (OSC and MIDI), Effects (such as Convolution Reverb vs Algorithmic Reverb and MIDI controlled effects), and Filtering...\n\n      more description for NCRD-UT 8523 »\n\n      \n\n\n\nIf you are a Pop Music producer, EDM producer/artist, DJ, Remixer, or self-produced artist looking for detail-oriented, pragmatic advanced in-the-box production instruction - this class is for you. Topics include, but are not limited to: Sampling, (using software such as Kontakt and Geist), Synthesis (Additive, Subtractive, Granular, FM, etc.), Loops and Looping, Percussive Sampling, Virtual Instruments, (including software such as Massive, Sylenth, FM8, etc.), Control Surfaces (OSC and MIDI), Effects (such as Convolution Reverb vs Algorithmic Reverb and MIDI controlled effects), and Filtering (including FabFIlter and Korg MS20,etc.)\n\n      less description for NCRD-UT 8523 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8524",
            "course_name": "",
            "description": "NCRD-UT 8524\n\n   Song Performance Intensive: Getting Your Act Together\n\nHitting the right notes is important, but a real and effective performance in made up of so much more than musical proficiency. A good song tells a story, and a good singer is a storyteller and actor. This workshop emphasizes this aspect of singing - allowing  students to develop a personal, natural, and conversational style. This enables a more direct connection with the performer's audience. The classes will cover lyric interpretation, song selection, arrangements, tempo, focus, physicality and movement, microphone technique and overcoming nerves. The focus is to help students to develop the...\n\n      more description for NCRD-UT 8524 »\n\n      \n\n\n\nHitting the right notes is important, but a real and effective performance in made up of so much more than musical proficiency. A good song tells a story, and a good singer is a storyteller and actor. This workshop emphasizes this aspect of singing - allowing  students to develop a personal, natural, and conversational style. This enables a more direct connection with the performer's audience. The classes will cover lyric interpretation, song selection, arrangements, tempo, focus, physicality and movement, microphone technique and overcoming nerves. The focus is to help students to develop their personal performance skills, to make a song their own, and tell its story in a way that is unique to them.\n\n      less description for NCRD-UT 8524 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8525",
            "course_name": "",
            "description": "NCRD-UT 8525\n\n   Songwriting Workshop\n\nMusic sits at the forefront of creative and technological revolutions, and songwriting remains the fundamental form of its expression. This seminar will focus on the creative process of songwriting, but will contextualize the art form within a fundamentally shifting industry. Students will write, co-write, and analyze songs in order to establish and engage their own songwriting voice. In addition, focus will be placed on what the song is from a business standpoint. Issues of publishing, copyright, mechanical royalties, licensing and synchronization will be discussed via readings and guest spea...\n\n      more description for NCRD-UT 8525 »\n\n      \n\n\n\nMusic sits at the forefront of creative and technological revolutions, and songwriting remains the fundamental form of its expression. This seminar will focus on the creative process of songwriting, but will contextualize the art form within a fundamentally shifting industry. Students will write, co-write, and analyze songs in order to establish and engage their own songwriting voice. In addition, focus will be placed on what the song is from a business standpoint. Issues of publishing, copyright, mechanical royalties, licensing and synchronization will be discussed via readings and guest speakers from music's legal and administrative worlds.\n\n      less description for NCRD-UT 8525 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8539",
            "course_name": "The Business of Electronic & Dance Music",
            "description": "NCRD-UT 8539 The Business of Electronic & Dance Music",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8540",
            "course_name": "Engineering I",
            "description": "NCRD-UT 8540 Engineering I",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8541",
            "course_name": "Engineering II",
            "description": "NCRD-UT 8541 Engineering II",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8555",
            "course_name": "Studio Lab Ensembles",
            "description": "NCRD-UT 8555 Studio Lab Ensembles",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8567",
            "course_name": "",
            "description": "NCRD-UT 8567\n\n   Launching the Project or Home Studio\n\nAs recording budgets shrink, so to has the size and grandeur of the traditional recording studio.  Even with this decrease, digital audio has enabled us to improve creative functionality with a much smaller real estate footprint and upfront investment.  This course will introduce students to the concepts, gear, and techniques necessary to facilitate a pragmatic and economical hybrid integration of analog processing and \"in-the-box\" DAW-based recording technology.  Students will develop a personal approach to building and customizing their own affordable and scalable project studios that meet t...\n\n      more description for NCRD-UT 8567 »\n\n      \n\n\n\nAs recording budgets shrink, so to has the size and grandeur of the traditional recording studio.  Even with this decrease, digital audio has enabled us to improve creative functionality with a much smaller real estate footprint and upfront investment.  This course will introduce students to the concepts, gear, and techniques necessary to facilitate a pragmatic and economical hybrid integration of analog processing and \"in-the-box\" DAW-based recording technology.  Students will develop a personal approach to building and customizing their own affordable and scalable project studios that meet their sonic and aesthetic needs.  Topics will include analog summing mixers, A/D and D/A conversion, customizing signal flow and signal processing, and MIDI and DAW controllers.  Hector Castillo has been working int he NYC music science as a producer, mixer and engineer for more than ten years.  He has worked with artists such as Björk, Lou Reed, Rufus Wainwright and Philip Glass.  He is a winner of four Latin Grammy awards.\n\n      less description for NCRD-UT 8567 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8568",
            "course_name": "",
            "description": "NCRD-UT 8568\n\n   The Art of Recording Classic Drums\n\nDrum sounds have the potential to exhibit as much personality on a recording as a vocalist or soloist. However, a great drum sound can be difficult to obtain. Through this course, the creative student will learn the techniques necessary to expand their acoustic drum-sound \"library.\" This hands-on studio course covers techniques of instrument and head selection, micing, tuning, and recording the \"classic\" drum sounds typified by Ringo Starr, Phil Spector's Wall of Sound (Hal Blaine), Rudy Van Gelder's jazz sound (Miles Davis), Motown, drum sounds of the early 70s and John Bonham. The workshop w...\n\n      more description for NCRD-UT 8568 »\n\n      \n\n\n\nDrum sounds have the potential to exhibit as much personality on a recording as a vocalist or soloist. However, a great drum sound can be difficult to obtain. Through this course, the creative student will learn the techniques necessary to expand their acoustic drum-sound \"library.\" This hands-on studio course covers techniques of instrument and head selection, micing, tuning, and recording the \"classic\" drum sounds typified by Ringo Starr, Phil Spector's Wall of Sound (Hal Blaine), Rudy Van Gelder's jazz sound (Miles Davis), Motown, drum sounds of the early 70s and John Bonham. The workshop will be complemented with extensive historical documentation culled from personal interviews with engineering legends Geoff Emerick (Beatles), Elliot Scheiner (Steely Dan), Chris Huston (Led Zeppelin), session set-up sheets and photos.\n\n      less description for NCRD-UT 8568 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8569",
            "course_name": "",
            "description": "NCRD-UT 8569\n\n   The Virtual Producer: Beats & Beatmaking\n\nThe emergence of \"virtual instrument\" technology has revolutionized the sound and production of music at a pace and to a degree never before seen.  Virtual instruments use algorithms and binary code, as opposed to analog circuitry to generate sound waves used in the production of music and sound design for film, theater and fine arts. The first commercially available hardware synthesizer was introduced in 1964 by Robert Moog.  A few hundred hardware synthesizers have been developed in the last 50 years at great expense to both developer and consumer. However, thousands of affordable and pro-qu...\n\n      more description for NCRD-UT 8569 »\n\n      \n\n\n\nThe emergence of \"virtual instrument\" technology has revolutionized the sound and production of music at a pace and to a degree never before seen.  Virtual instruments use algorithms and binary code, as opposed to analog circuitry to generate sound waves used in the production of music and sound design for film, theater and fine arts. The first commercially available hardware synthesizer was introduced in 1964 by Robert Moog.  A few hundred hardware synthesizers have been developed in the last 50 years at great expense to both developer and consumer. However, thousands of affordable and pro-quality virtual instruments have been developed and released int he past decade alone. As you can imagine, navigating this space in an informed way is a daunting task.  This hands-on course will cover a broad spectrum of industry leading virtual instruments, effects and vocoders. By working through a series of practical activities, the students will gain an understanding of the skills necessary to program their own sounds using different types of synthesis.  The class will begin by introducing the basics of how synthesizers work, from concept to actual programming.  From that point the class will explore more elaborate methods of sound creation techniques that students will then be able to apply to any hardware or software synthesizer they may encounter.\n\n      less description for NCRD-UT 8569 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8570",
            "course_name": "",
            "description": "NCRD-UT 8570\n\n   Topics: SynthPop-Electronic\n\nThe course begins with a brief overview of early electronics and first traces the movement of these musical ideas into the popular music avant-garde of bands such as Neu! and Cabaret Voltaire.  Using Giorgio Moroder's production of the Donna Summer classic \"I Feel Love\" as the tipping point, the class will focus on the emergence the musical style SynthPop and examine artists including Kraftwerk, New Order, and Depeche Mode.  Through various texts, media and demonstrations we will survey the genre from its post-punk beginnings through its decade's dominance on the charts before finally being 'u...\n\n      more description for NCRD-UT 8570 »\n\n      \n\n\n\nThe course begins with a brief overview of early electronics and first traces the movement of these musical ideas into the popular music avant-garde of bands such as Neu! and Cabaret Voltaire.  Using Giorgio Moroder's production of the Donna Summer classic \"I Feel Love\" as the tipping point, the class will focus on the emergence the musical style SynthPop and examine artists including Kraftwerk, New Order, and Depeche Mode.  Through various texts, media and demonstrations we will survey the genre from its post-punk beginnings through its decade's dominance on the charts before finally being 'unplugged' by grunge.  Beyond historical considerations, we'll finish with an exploration of the music's legacy and study its development into a number of new genres as well as the latest software and technology making it.\n\n      less description for NCRD-UT 8570 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8571",
            "course_name": "Pro Tools for Educators",
            "description": "NCRD-UT 8571 Pro Tools for Educators",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8572",
            "course_name": "Logic for Educators",
            "description": "NCRD-UT 8572 Logic for Educators",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8573",
            "course_name": "Recording for Educators",
            "description": "NCRD-UT 8573 Recording for Educators",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8580",
            "course_name": "Producing with Bob Power",
            "description": "NCRD-UT 8580 Producing with Bob Power \nProducer/Mixer/Recordist Bob Power (Erkyah Badu, Common, D’Angelo, A Tribe Called Quest) will present a balance of practical and conceptual information designed to expose students to the various recording and production techniques he uses to create his consistent brand of effective production.  This studio class is centered around an in-class production executed by Mr. Power with a prominent New York based artist with accompanying session players.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8581",
            "course_name": "The Art of Mixing with Bob Power",
            "description": "NCRD-UT 8581 The Art of Mixing with Bob Power \nCommonly referred to as a mystifying ‘Dark Art,’ mixing records involves composing a final assemblage and balancing of a song’s recorded elements, with the final goal of enabling a recording to deliver a clear and emotional intended message. In this week-long, intensive master class, world-class record mixer and producer Bob Power will provide a complete exposition of his mix methodology and technique in the state of the art facilities of the Clive Davis Institute of Recorded Music.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8582",
            "course_name": "Dj History, Culture, & Technique with Djs Rekha & Shiftee",
            "description": "NCRD-UT 8582 Dj History, Culture, & Technique with Djs Rekha & Shiftee",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8584",
            "course_name": "The Art and Business of The Remix",
            "description": "NCRD-UT 8584 The Art and Business of The Remix",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8585",
            "course_name": "Music Photography With Mick Rock:a Masterclass",
            "description": "NCRD-UT 8585 Music Photography With Mick Rock:a Masterclass",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8586",
            "course_name": "Making it The Muasic Biz W/Kevin Liles:Masterclas",
            "description": "NCRD-UT 8586 Making it The Muasic Biz W/Kevin Liles:Masterclas",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8587",
            "course_name": "The Soundtrack Auteur",
            "description": "NCRD-UT 8587 The Soundtrack Auteur",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8590",
            "course_name": "Music & Fashion",
            "description": "NCRD-UT 8590 Music & Fashion",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8595",
            "course_name": "World Music",
            "description": "NCRD-UT 8595 World Music",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 8596",
            "course_name": "Writing About Popular Music",
            "description": "NCRD-UT 8596 Writing About Popular Music",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9035",
            "course_name": "",
            "description": "NCRD-UT 9035\n\n   Fundamentals of Developing the Screenplay\n\nThe course combines lectures on the basics of feature length screenwriting with the development of the student’s own writing work. Students are required to complete 50-70 pages of a full length screenplay with an outline of the rest. The students study story structure, conflict, and character, in conjunction with the screening and study of several classic films and screenplays. The writing process starts in the first month with a focus on exercises to help students develop five story ideas with the complexity and depth to sustain a full-length screenplay. One of these ideas will serve as the b...\n\n      more description for NCRD-UT 9035 »\n\n      \n\n\n\nThe course combines lectures on the basics of feature length screenwriting with the development of the student’s own writing work. Students are required to complete 50-70 pages of a full length screenplay with an outline of the rest. The students study story structure, conflict, and character, in conjunction with the screening and study of several classic films and screenplays. The writing process starts in the first month with a focus on exercises to help students develop five story ideas with the complexity and depth to sustain a full-length screenplay. One of these ideas will serve as the basis for the required work. Each idea can be described in one or two paragraphs. Special instructions: All students must come to the first class with three ideas for full-length screenplays.\n\n      less description for NCRD-UT 9035 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9045",
            "course_name": "Writing the TV Sitcom",
            "description": "NCRD-UT 9045 Writing the TV Sitcom \nAdapted from the Dramatic Writing Program’s popular “Introduction to the Sitcom” course, this intensive scriptwriting class answers the question, “What do I need to break into TV writing?” – the student will be guided through the step-by-step development of an episode for an ongoing TV sitcom, from premise line to one-page outline, to pages and revisions. The course will require the completion of a polished draft while introducing students to the rigors of professional standards through weekly story goals.",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9503",
            "course_name": "",
            "description": "NCRD-UT 9503\n\n   Film Dvlpmnt: The Tools of Creative Movie Prodc\n\nThis course de-mystifies the film development process and teaches students the key tools necessary for a successful career as a film executive or producer.  This course will chart the key stages of finding and preparing a good script for production. These steps include how to find, evaluate and shape material from the producer's perspective. Students will learn the practical art of writing script coverage and notes, as well as how to establish a tracking group and develop tracking reports for new material. Other topics include the role of key players in the process, such as agents and studio e...\n\n      more description for NCRD-UT 9503 »\n\n      \n\n\n\nThis course de-mystifies the film development process and teaches students the key tools necessary for a successful career as a film executive or producer.  This course will chart the key stages of finding and preparing a good script for production. These steps include how to find, evaluate and shape material from the producer's perspective. Students will learn the practical art of writing script coverage and notes, as well as how to establish a tracking group and develop tracking reports for new material. Other topics include the role of key players in the process, such as agents and studio executives, and how to avoid \"development hell.\"\n\n      less description for NCRD-UT 9503 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9504",
            "course_name": "",
            "description": "NCRD-UT 9504\n\n   Producing in The Digital Revolution\n\nThis is an interdisciplinary course for film and non-film students to better understand the industry and the historical and creative significance of digital cinema as well as anyone interested in exploring the brave new digital world. The course includes live and video-conference discussions with directors, writers, cinematographers, producers, cast, and crew directly involved with productions. Some of the films to be discussed include Miguel Arteta's Chuck and Buck, Lars Von Trier's Dancer in the Dark, Brian De Palma's Redacted, and Rebecca Miller's Personal Velocity among others. Students wi...\n\n      more description for NCRD-UT 9504 »\n\n      \n\n\n\nThis is an interdisciplinary course for film and non-film students to better understand the industry and the historical and creative significance of digital cinema as well as anyone interested in exploring the brave new digital world. The course includes live and video-conference discussions with directors, writers, cinematographers, producers, cast, and crew directly involved with productions. Some of the films to be discussed include Miguel Arteta's Chuck and Buck, Lars Von Trier's Dancer in the Dark, Brian De Palma's Redacted, and Rebecca Miller's Personal Velocity among others. Students will view examples of how the digital revolution has been adopted and transformed filmmaking throughout the world, from Nigeria's regional Nollywood movement to South Africa's Neill Blomkamp, whose no-budget digital special effects short Alive in Joberg catapulted him straight to helming this summer's blockbuster hit District 9.\n\n      less description for NCRD-UT 9504 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9508",
            "course_name": "",
            "description": "NCRD-UT 9508\n\n   Acting for The Camera\n\nThis course is for actors who want to explore and cultivate their filmic talents and for directors who want to create performances that exploit the potential of the camera. Part one of the course reviews the fundamentals of the acting process. Through exercises, improvisations and scene work, techniques and criteria for performances are established. In part two, students work before the camera. The minimalism of film acting is the primary thrust, illustrating the camera’s ability to capture nuances of behavior, and requiring from the actor less physicalization, greater concentration and maxima...\n\n      more description for NCRD-UT 9508 »\n\n      \n\n\n\nThis course is for actors who want to explore and cultivate their filmic talents and for directors who want to create performances that exploit the potential of the camera. Part one of the course reviews the fundamentals of the acting process. Through exercises, improvisations and scene work, techniques and criteria for performances are established. In part two, students work before the camera. The minimalism of film acting is the primary thrust, illustrating the camera’s ability to capture nuances of behavior, and requiring from the actor less physicalization, greater concentration and maximal inner-life. In the third part of the course, scenes are rehearsed, lit, framed, and taped in a series of camera set-ups. Each student in the course receives a tape of his or her major project suitable, after basic editing, as a work sample or audition piece.\n\n      less description for NCRD-UT 9508 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9510",
            "course_name": "",
            "description": "NCRD-UT 9510\n\n   Film Dvlpmnt: The Tools of Creative Movie Prodc\n\nThis course de-mystifies the film development process and teaches students the key tools necessary for a successful career as a film executive or producer.  This course will chart the key stages of finding and preparing a good script for production. These steps include how to find, evaluate and shape material from the producer's perspective. Students will learn the practical art of writing script coverage and notes, as well as how to establish a tracking group and develop tracking reports for new material. Other topics include the role of key players in the process, such as agents and studio e...\n\n      more description for NCRD-UT 9510 »\n\n      \n\n\n\nThis course de-mystifies the film development process and teaches students the key tools necessary for a successful career as a film executive or producer.  This course will chart the key stages of finding and preparing a good script for production. These steps include how to find, evaluate and shape material from the producer's perspective. Students will learn the practical art of writing script coverage and notes, as well as how to establish a tracking group and develop tracking reports for new material. Other topics include the role of key players in the process, such as agents and studio executives, and how to avoid \"development hell.\" \n\n      less description for NCRD-UT 9510 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9511",
            "course_name": "",
            "description": "NCRD-UT 9511\n\n   Urban Arts Workshop\n\nThis course will be composed of lectures, slide shows, screenings, readings, field trips, field assignments, written reactions, discussion and blogs, as well as visits from guest speakers and artists designed to expose students to the key concepts and fundamental theories of urban studies, public art and the urban-inspired works of many great artists and writers based in New York City. Each week another “form” of urban art will be investigated, including discussions about and encounters with street photography, graffiti, sculpture, installation art, dance, performance art, parkour (freestyle s...\n\n      more description for NCRD-UT 9511 »\n\n      \n\n\n\nThis course will be composed of lectures, slide shows, screenings, readings, field trips, field assignments, written reactions, discussion and blogs, as well as visits from guest speakers and artists designed to expose students to the key concepts and fundamental theories of urban studies, public art and the urban-inspired works of many great artists and writers based in New York City. Each week another “form” of urban art will be investigated, including discussions about and encounters with street photography, graffiti, sculpture, installation art, dance, performance art, parkour (freestyle street gymnastics), gorilla theater, art vandalism and underground art, urban sound projects, large-scale projections, poetry, essays and short stories with an aim to understand how such art forms came into being and how they express a distinctly urban message to the inhabitants and visitors of New York City. The instructor seeks to combine the critical and theoretical with the experiential and personal in order to lead students to a deeper and more fruitful relationship with their city, the arts and themselves.\n\n      less description for NCRD-UT 9511 «",
            "offering": false
        },
        {
            "course_id": "NCRD-UT 9512",
            "course_name": "",
            "description": "NCRD-UT 9512\n\n   Game Development Workshop\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the clo...\n\n      more description for NCRD-UT 9512 »\n\n      \n\n\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the close supervision of instructors, students will collaborate on the creation of a playable game. As a creative constraint to help inspire them and guide their designs, the students will be given a theme to express in their game projects.\n\n      less description for NCRD-UT 9512 «",
            "offering": false
        }
    ]
}