{
    "major_id": "OPMG-UB",
    "file": "./2015-2016/Operations_Management_(OPMG-UB).html",
    "courses": [
        {
            "course_id": "OPMG-UB 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9388",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC25",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Pinedo, Michael"
                },
                {
                    "format": "Lecture",
                    "class_id": "9389",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 4-80",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Reed, Joshua"
                },
                {
                    "format": "Lecture",
                    "class_id": "9390",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 4-80",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Reed, Joshua"
                }
            ],
            "course_name": "",
            "description": "OPMG-UB    1\n\n   Operations Management\n\nDesigned to give students a better understanding of how firms can gain competitive advantage from their operations function. Typically this requires the firm to achieve, at a minimum, cost, quality, and ecological parity; responsiveness and adaptability to customer needs and desires; rapid time to market; process technology leadership; and sufficient and responsive capacity. A problem-solving framework is developed that enables students to undertake managerial and technical analysis that should result in the desired comparative advantage. Both service and manufacturing case examples are utiliz...\n\n      more description for OPMG-UB    1 »\n\n      \n\n\n\nDesigned to give students a better understanding of how firms can gain competitive advantage from their operations function. Typically this requires the firm to achieve, at a minimum, cost, quality, and ecological parity; responsiveness and adaptability to customer needs and desires; rapid time to market; process technology leadership; and sufficient and responsive capacity. A problem-solving framework is developed that enables students to undertake managerial and technical analysis that should result in the desired comparative advantage. Both service and manufacturing case examples are utilized.\n\n      less description for OPMG-UB    1 «",
            "offering": true
        },
        {
            "course_id": "OPMG-UB 5",
            "course_name": "Supply Chain Management",
            "description": "OPMG-UB    5 Supply Chain Management",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 6",
            "course_name": "",
            "description": "OPMG-UB    6\n\n   Supply Chain Management\n\nIThe function of supply chain management is to design and manage the flow of material and information, starting from the raw materials until finished goods reach customers. Typically, logistics-related costs account for 20 to 25 percent of firms total costs. On the revenue side, the supply chain decisions have a direct impact on market penetration and customer service. With the globalization of the economy and advances in information technology, supply chain design and coordination have become important tools for gaining competitive advantage. Therefore, the objectives of the course are to (1)...\n\n      more description for OPMG-UB    6 »\n\n      \n\n\n\nIThe function of supply chain management is to design and manage the flow of material and information, starting from the raw materials until finished goods reach customers. Typically, logistics-related costs account for 20 to 25 percent of firms total costs. On the revenue side, the supply chain decisions have a direct impact on market penetration and customer service. With the globalization of the economy and advances in information technology, supply chain design and coordination have become important tools for gaining competitive advantage. Therefore, the objectives of the course are to (1) develop an understanding of individual components of the supply chain (such as order management, transportation, network design, distribution channel management, after-sales service, and customer service strategy) and their interrelationships with other functions of firms, such as marketing, manufacturing, and accounting (2) impart analytical and problem-solving skills necessary to develop solutions for a variety of logistics problems (3) understand the complexity of interfirm and intrafirm coordination in implementing programs such as quick response and vendor-managed inventories and (4) develop the ability to design logistics systems and formulate integrated supply chain strategy, so that all components are not only internally synchronized but also tuned to fit corporate strategy, competitive realities, and market needs.\n\n      less description for OPMG-UB    6 «",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 15",
            "course_name": "Operations in Financial Services",
            "description": "OPMG-UB   15 Operations in Financial Services \nThis course focuses on products and processes in financial services. It analyzes the design and the operations of the different distribution channels (branch, ATMs, call center, www, etc.) and considers productivity measurements as well as performance measurements. It goes into quality control issues and analyzes operational risk. It concludes with the design and implementation of decision support systems in practice. This course should be a very useful course for a student who will end up working somewhere in the finance world.",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 60",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9677",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC19",
                    "time": "Thu 6.30 PM - 9.15 PM",
                    "open": true,
                    "professor": "Atkins, Benjamin"
                }
            ],
            "course_name": "",
            "description": "OPMG-UB   60\n\n   Real Estate Development and Entrepreneurship\n\nThis course will introduce students to the operating process of real estate development from an entrepreneurial perspective. It is directed to students interested in real estate development from the point of view of three classes of investors: 1. an entrepreneurial investor, looking to buy a coop, condo or small property for individual use or rental 2. a working general partner of a small group of investors, who will actually manage and/or be responsible for overseeing the property after purchase 3. a passive outside investor, who may be searching for an investment that is limited in liability...\n\n      more description for OPMG-UB   60 »\n\n      \n\n\n\nThis course will introduce students to the operating process of real estate development from an entrepreneurial perspective. It is directed to students interested in real estate development from the point of view of three classes of investors: 1. an entrepreneurial investor, looking to buy a coop, condo or small property for individual use or rental 2. a working general partner of a small group of investors, who will actually manage and/or be responsible for overseeing the property after purchase 3. a passive outside investor, who may be searching for an investment that is limited in liability to the original investment.\n\n      less description for OPMG-UB   60 «",
            "offering": true
        },
        {
            "course_id": "OPMG-UB 94",
            "course_name": "Ind Study: Oper Mgmt",
            "description": "OPMG-UB   94 Ind Study: Oper Mgmt",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 95",
            "course_name": "Independent Study in Operations Management",
            "description": "OPMG-UB   95 Independent Study in Operations Management",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 96",
            "course_name": "Independent Study in Operations Management",
            "description": "OPMG-UB   96 Independent Study in Operations Management",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 98",
            "course_name": "Ind Study: Oper Mgmt",
            "description": "OPMG-UB   98 Ind Study: Oper Mgmt",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 99",
            "course_name": "Ind Study: Oper Mgmt",
            "description": "OPMG-UB   99 Ind Study: Oper Mgmt",
            "offering": false
        },
        {
            "course_id": "OPMG-UB 9001",
            "course_name": "",
            "description": "OPMG-UB 9001\n\n   Operations Management\n\nDesigned to give students a better understanding of how firms can gain competitive advantage from their operations function. Typically this requires the firm to achieve, at a minimum cost, quality, and ecological parity; responsiveness and adaptability to customer needs and desires; rapid time to market; process technology leadership; and sufficient and responsive capacity. A problem-solving framework is developed that enables students to undertake managerial and technical analysis that should result in the desired comparative advantage. Both service and manufacturing case examples are utilize...\n\n      more description for OPMG-UB 9001 »\n\n      \n\n\n\nDesigned to give students a better understanding of how firms can gain competitive advantage from their operations function. Typically this requires the firm to achieve, at a minimum cost, quality, and ecological parity; responsiveness and adaptability to customer needs and desires; rapid time to market; process technology leadership; and sufficient and responsive capacity. A problem-solving framework is developed that enables students to undertake managerial and technical analysis that should result in the desired comparative advantage. Both service and manufacturing case examples are utilized.\n\n      less description for OPMG-UB 9001 «",
            "offering": false
        }
    ]
}