{
    "major_id": "ORBC1-UC",
    "file": "./2015-2016/Organizational_Behavior_and_Change(ORBC1-UC).html",
    "courses": [
        {
            "course_id": "ORBC1-UC 1301",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9969",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "194M 210",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Davidson, Lynne"
                },
                {
                    "format": "Lecture",
                    "class_id": "9970",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Williams, Denise",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Organizational Behavior",
            "description": "ORBC1-UC 1301 Organizational Behavior \nThis course addresses human behavior and behavioral issues in organization as it is viewed from the perspectives of the individual, the group, and the large-scale structure. It explores job satisfaction, team effectiveness, motivation, leadership, performance appraisal, communication, power and conflict, career dynamics, and organizational change. It makes extensive use of experiential learning and case studies, involving occasional group work outside of class.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2201",
            "course_name": "Organizational Communication",
            "description": "ORBC1-UC 2201 Organizational Communication \nThis course examines how organizational culture, structure, and processes influence patterns of communication. The influence of factors like power relations, changing organizational designs, and small group dynamics on communication are discussed. The course also helps develop communication skills through simulation projects and fieldwork.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2202",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "10106",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Lum, Man",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Multicultural Communication",
            "description": "ORBC1-UC 2202 Multicultural Communication \nOrganizations are part of the larger cultures in which they exist. This course examines multicultural communication on two levels: globally, using insights from anthropology, sociology, media studies, social psychology, linguistics; and nationally, exploring the values and behaviors of diverse cultural groups in the United States.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2205",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9965",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "194M 210",
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Davidson, Lynne"
                }
            ],
            "course_name": "Current Issues in Organizational Behavior",
            "description": "ORBC1-UC 2205 Current Issues in Organizational Behavior \nOrganizational behavior as a field of analysis seeks to enhance intuitive explanations with a systematic study of the actions and attitudes that people exhibit within organizations. This course critically examines characteristics of the latest practices in organizational behavior, focusing on the nature of organizations, relevant research, and issues of measurable results.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2209",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17054",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "WAVE 429"
                }
            ],
            "course_name": "Organizational Change",
            "description": "ORBC1-UC 2209 Organizational Change \nThis course introduces students to theories about change management, such as business process reengineering, total quality management, and other models that are constantly emerging. Students learn how organizational development change management agents and consultants implement strategies for organizational intervention. Using case study, role play, and critical analysis, students develop the skills necessary to evaluate and analyze how to lead effective changes in the workplace.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2213",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17055",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {}
            ],
            "course_name": "",
            "description": "ORBC1-UC 2213\n\n   Collaborative Team Processes\n\nDuring a period of rapid organizational change in the workplace, consulting in organizational behavior and management has become an increasingly important field from both the theoretical and practitioner perspectives. This course examines the various models of consulting, types of organizational interventions, and the role of the consultant. The processes of consulting and coaching are analyzed from contract through implementation, as well as the ethics and integrity of the consulting process. Use of case studies enriches the integration of both theory and practice in consulting, team building...\n\n      more description for ORBC1-UC 2213 »\n\n      \n\n\n\nDuring a period of rapid organizational change in the workplace, consulting in organizational behavior and management has become an increasingly important field from both the theoretical and practitioner perspectives. This course examines the various models of consulting, types of organizational interventions, and the role of the consultant. The processes of consulting and coaching are analyzed from contract through implementation, as well as the ethics and integrity of the consulting process. Use of case studies enriches the integration of both theory and practice in consulting, team building, and other group processes.\n\n      less description for ORBC1-UC 2213 «",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2220",
            "course_name": "",
            "description": "ORBC1-UC 2220\n\n   Managing Diversity in the Global Workplace\n\nA rapidly expanding global economy requires expert knowledge and sensitivities to a vast array of individual, group, and cultural diversities. In this course, students analyze multicultural concerns and the competencies that impact  work relationships, communications, and performance. By examining one's own culturally developed orientations and biases, students are encouraged to embrace the positive functions of diversity and inclusion to overcome obstacles to cross-cultural adaptation. Analysis of the ethnocentric American model is challenged. Racial, ethnic, gender, age, family status, and g...\n\n      more description for ORBC1-UC 2220 »\n\n      \n\n\n\nA rapidly expanding global economy requires expert knowledge and sensitivities to a vast array of individual, group, and cultural diversities. In this course, students analyze multicultural concerns and the competencies that impact  work relationships, communications, and performance. By examining one's own culturally developed orientations and biases, students are encouraged to embrace the positive functions of diversity and inclusion to overcome obstacles to cross-cultural adaptation. Analysis of the ethnocentric American model is challenged. Racial, ethnic, gender, age, family status, and global cross-cultural differences of several countries provide the foundation on which we build best-practice models of the future.\n\n      less description for ORBC1-UC 2220 «",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2221",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9789",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "SILV 508",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Bear, Michael"
                }
            ],
            "course_name": "",
            "description": "ORBC1-UC 2221\n\n   Leadership Strategies for The Global Workplace\n\nEffective leadership strategies for the new global workplace require multi-dimensional knowledge of organizational design, operations, and long- term vision of best- practice models. A clear alignment of human resources, multicultural knowledge systems, technology, and business innovations are critical. Broad strategic goals must be distilled into key performance indicators that, in turn, are communicated to the entire organization. Leaders of the future hold the key to developing cultures that foster creative integration, productivity, and workplace integrity. High-level leaders will serve as...\n\n      more description for ORBC1-UC 2221 »\n\n      \n\n\n\nEffective leadership strategies for the new global workplace require multi-dimensional knowledge of organizational design, operations, and long- term vision of best- practice models. A clear alignment of human resources, multicultural knowledge systems, technology, and business innovations are critical. Broad strategic goals must be distilled into key performance indicators that, in turn, are communicated to the entire organization. Leaders of the future hold the key to developing cultures that foster creative integration, productivity, and workplace integrity. High-level leaders will serve as guest speakers to enrich expert knowledge.\n\n      less description for ORBC1-UC 2221 «",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2222",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9973",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "194M 208",
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Mullings, Lena"
                }
            ],
            "course_name": "Leadership: Theory & Practice",
            "description": "ORBC1-UC 2222 Leadership: Theory & Practice \nExplore various aspects of leadership in the turbulent contemporary workplace. The course frames the inherent problems of leadership analysis, providing a lens through which the evolution of modern theory can be meaningfully understood. Students diagnose and then develop their own effective leadership skills.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2224",
            "course_name": "",
            "description": "ORBC1-UC 2224\n\n   Corporate Social Responsibility\n\nThis course studies corporate stances on the issue of social responsibility. Students  review the evolution of CSR and international variations in CSR philosophy. Current research on  and possible future directions of CSR are discussed in relation to: environmental sustainability and global climate change; globalization and outsourcing; labor practices and policies; consumer preferences; social entrepreneurship and economic development in the attack on poverty and disease; work-life balance; the international geopolitical influence of corporations; and the opportunity for businesses to \"change...\n\n      more description for ORBC1-UC 2224 »\n\n      \n\n\n\nThis course studies corporate stances on the issue of social responsibility. Students  review the evolution of CSR and international variations in CSR philosophy. Current research on  and possible future directions of CSR are discussed in relation to: environmental sustainability and global climate change; globalization and outsourcing; labor practices and policies; consumer preferences; social entrepreneurship and economic development in the attack on poverty and disease; work-life balance; the international geopolitical influence of corporations; and the opportunity for businesses to \"change the world\" through their power to deploy resources.  In addition to developing familiarity with broad issues, students research a CSR topic to report issues and trends.\n\n      less description for ORBC1-UC 2224 «",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2242",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9901",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Thomson, Sheila",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Business Writing",
            "description": "ORBC1-UC 2242 Business Writing \nBusiness writing requires precision, concise language, and a keen insight into the writer's audience. This course covers several types of business writing, including corporate annual reports, solicited and unsolicited proposals, and technical manuals with graphic support. Students compose a variety of organizational communications, such as executive summaries, press releases, and performance appraisals. Style and the social impact of technology communications are examined.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2245",
            "course_name": "Conflict Management",
            "description": "ORBC1-UC 2245 Conflict Management \nA growing body of literature portrays conflict as neither good nor bad, but as a neutral and anticipated aspect of human interaction. The course teaches students how to diagnose and manage conflict, examines the use of a third party in conflict resolution, and demonstrates intervention techniques to create win-win situations. The course combines readings in theory with case studies and experiential exercises.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2246",
            "course_name": "Gender Issues in Organizations",
            "description": "ORBC1-UC 2246 Gender Issues in Organizations \nIn this course, students use psychological, sociological, linguistic, and organizational approaches to help explain traditional expectations of men's and women's roles and how these roles are changing. The course examines sexual bias in the workplace, conceptions of empowerment, and patterns of communication.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2247",
            "course_name": "Mgmt Tech: Organizatnal & Workplace Design",
            "description": "ORBC1-UC 2247 Mgmt Tech: Organizatnal & Workplace Design \nNumerous theories of change management and organizational interventions exist along with case studies and models of best practice. However, the technological knowledge necessary to design and implement change processes lags seriously behind. This course explores new technologies that drive future organizational change initiatives and surveys existing technology and software products. Students conduct needs assessments for new product development.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2248",
            "course_name": "Talent Management and Performance Effectiveness",
            "description": "ORBC1-UC 2248 Talent Management and Performance Effectiveness \nIntense competition among firms in the global economy now demands superior performance in all aspects of individual, group, and organizational operation and strategy. New ways of managing knowledge systems focusing on learning organizations, and executive coaching for individual and group development are only a few of the cutting-edge perspectives aimed to drive superior performance. New instruments to manage performance compete with traditional ones to address performance effectiveness in organizations. This course explores and critiques today's popular theories and practices.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2249",
            "course_name": "Corporate Culture & Organizational Learning",
            "description": "ORBC1-UC 2249 Corporate Culture & Organizational Learning \nThe course provides a framework for diagnosing and managing organizational cultures, with specific focus on corporate culture and the way values and learning systems are embedded within the organization. Sample topics include understanding \"neurotic\" organizations, cultural dynamics of interpersonal relationships, and assumptions of the learning/knowledge systems that make up corporate cultures.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2251",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9972",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "SILV 515",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Brown, Deborah"
                }
            ],
            "course_name": "Mindfulness, Spirituality and Meaning in the Workplace",
            "description": "ORBC1-UC 2251 Mindfulness, Spirituality and Meaning in the Workplace \nThis course looks at the trends that have led to an interest in spirituality in the workplace, and explores how spirituality's definition is separate from religion. It analyzes the application of spirituality in organizations on four levels: individual, group, organizational, and societal. Topics include work and individual meaning, leadership and spirituality, spirituality and innovation, and systemic approaches to creating enlightened organizations.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2252",
            "course_name": "",
            "description": "ORBC1-UC 2252\n\n   Career Management and Transitions\n\nManaging career transitions poses challenges for both the organization and the employee. Individuals face change and uncertainty as organizations no longer view employment security as a social responsibility. This course examines recent shifts in employment relationships from the perspectives of both the employee and the organization. The course examines the importance of individual and group values, identity, and diversity in career selection and advancement, and the complex knowledge that managers need to acquire in order to implement best-practice career management techniques in the organiz...\n\n      more description for ORBC1-UC 2252 »\n\n      \n\n\n\nManaging career transitions poses challenges for both the organization and the employee. Individuals face change and uncertainty as organizations no longer view employment security as a social responsibility. This course examines recent shifts in employment relationships from the perspectives of both the employee and the organization. The course examines the importance of individual and group values, identity, and diversity in career selection and advancement, and the complex knowledge that managers need to acquire in order to implement best-practice career management techniques in the organization. It examines and critiques the role of career counseling and executive coaching.\n\n      less description for ORBC1-UC 2252 «",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2260",
            "course_name": "",
            "description": "ORBC1-UC 2260\n\n   Storytelling and Employee Engagement\n\nNarrative and storytelling are powerful tools to further the goals of organizations. As an interdisciplinary approach to understanding narrative in organizations, this course is grounded in theories and methods of narrative psychology, anthropology, sociology, and literary thought. Intrinsic to human behavior, the narrative application is predicted to become mainstream in business and organizational studies. Students develop a critical understanding of the use and limits of narrative and storytelling within group and organizational settings. Interactive exercises and guest lecturers engage stu...\n\n      more description for ORBC1-UC 2260 »\n\n      \n\n\n\nNarrative and storytelling are powerful tools to further the goals of organizations. As an interdisciplinary approach to understanding narrative in organizations, this course is grounded in theories and methods of narrative psychology, anthropology, sociology, and literary thought. Intrinsic to human behavior, the narrative application is predicted to become mainstream in business and organizational studies. Students develop a critical understanding of the use and limits of narrative and storytelling within group and organizational settings. Interactive exercises and guest lecturers engage students in the power of narrative.\n\n      less description for ORBC1-UC 2260 «",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2280",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9790",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Li, Chuni",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Organizational Behavior Research Methods",
            "description": "ORBC1-UC 2280 Organizational Behavior Research Methods \nStudents learn the primary research principles in the organizational behavior field, which include hypothesis building as well as how to design, conduct, and analyze the validity and reliability of research. The course provides students with the opportunity to understand applied and scholarly empirical research. Students also engage in effective library and computer techniques for secondary data location and evaluation of key issues. They learn how to develop and substantiate a thesis argument that integrates theory and research that culminates into a cohesive document.",
            "offering": true
        },
        {
            "course_id": "ORBC1-UC 2281",
            "course_name": "Emotional Intelligence in The Workplace",
            "description": "ORBC1-UC 2281 Emotional Intelligence in The Workplace \nCorporations and other organizations are placing increased value on the effectiveness of human behavioral and relationship skills of both employees and managers in the workplace. This course focuses on understanding one's self and others as critical factors in productivity and the success of any organization, especially service organizations.  It also analyzes and provides diagnostics for managing interpersonal relationships and powerful/difficult conversations in the workplace.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2282",
            "course_name": "Uses & Abuses of Assess- Ments in Organizations",
            "description": "ORBC1-UC 2282 Uses & Abuses of Assess- Ments in Organizations \nThis course is designed to facilitate critical thinking about the use and misuse of assessment tools in organizations. Industrial-organizational psychologists, consultants, and human resource professionals use these assessments to facilitate employee selection and development. Students learn about the practical and ethical use of assessments in organizations and about the types of assessments that can supplement management decision making. Students have the opportunity to complete and review actual assessments.",
            "offering": false
        },
        {
            "course_id": "ORBC1-UC 2290",
            "course_name": "Sp Tpcs in Organizatnal Behavior & Communication",
            "description": "ORBC1-UC 2290 Sp Tpcs in Organizatnal Behavior & Communication \nThis course provides the opportunity for intensive study of specific topics in organizational behavior and communication and focuses on a different theme or topic each semester. The specific topic is listed in each semester's course schedule.",
            "offering": false
        }
    ]
}