{
    "major_id": "PHTI-UT",
    "file": "./2015-2016/Photography_and_Imaging_(PHTI-UT).html",
    "courses": [
        {
            "course_id": "PHTI-UT 1",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14089",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Novak, Lorie",
                    "time": "Wed 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Studio",
                    "class_id": "14090",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Jenkinson, Mark",
                    "time": "Wed 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT    1\n\n   Photography & Imaging Digital\n\nPre-requisite: This is the first course in Photography & Imaging: Digital and Analog sequence to be taken in the first year. Open to majors only.                                 This is an intro class about photographic image making, digital methods of output, and basic theory addressing the cultural uses of photography. This course is designed to familiarize students with fundamental concepts and techniques of photographic equipment, processes, materials, and philosophy of digital photography. This course will familiarize students with the basic use of the camera and workings of Adobe Photosh...\n\n      more description for PHTI-UT    1 »\n\n      \n\n\n\nPre-requisite: This is the first course in Photography & Imaging: Digital and Analog sequence to be taken in the first year. Open to majors only.                                 This is an intro class about photographic image making, digital methods of output, and basic theory addressing the cultural uses of photography. This course is designed to familiarize students with fundamental concepts and techniques of photographic equipment, processes, materials, and philosophy of digital photography. This course will familiarize students with the basic use of the camera and workings of Adobe Photoshop as well as scanning, capturing, and outputting digital images. Upon completion of the class, students will know how to digitize, edit, and/or manipulate images in Photoshop, prepare images in Photoshop for the intended output, and output images via printers and other output devices. Students will also develop basic camera and computer imaging skills.  Screenings/exhibitions may be assigned as the semester progresses. The course will address the contemporary photographic culture and emphasize the development of individual voice and vision through self-directed projects and research; and the establishment of a self-sufficient working process and critical dialogue.\n\n      less description for PHTI-UT    1 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 2",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14091",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Drysdale, Thomas",
                    "time": "Wed 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Studio",
                    "class_id": "14092",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mesina, Editha",
                    "time": "Wed 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT    2\n\n   Photography & Imaging Analog\n\nPre-requisite: This is the first course in Photography & Imaging: Digital and Analog sequence to be taken in the first year. Open to majors only.                                 This course examines creative expression in the context of traditional analog methodology. It is a class about seeing and translating one?s vision into images.  Topics include understanding light as an expressive element in a photograph.  Form, content and ideas relating to portraiture, documentary, narrative, landscape and the still life will be incorporated into assignments and discussed at length. Through a series o...\n\n      more description for PHTI-UT    2 »\n\n      \n\n\n\nPre-requisite: This is the first course in Photography & Imaging: Digital and Analog sequence to be taken in the first year. Open to majors only.                                 This course examines creative expression in the context of traditional analog methodology. It is a class about seeing and translating one?s vision into images.  Topics include understanding light as an expressive element in a photograph.  Form, content and ideas relating to portraiture, documentary, narrative, landscape and the still life will be incorporated into assignments and discussed at length. Through a series of exercises, students will be immersed in the craft of the medium: understanding exposure and metering, the physical and chemical development of film and print materials, and the means of making fine quality enlargements. Weekly assignments are designed to help the students develop a discipline in their working habits. The weekly critiques are designed to provide students with a forum in which to give each other critical and constructive feedback. Students will view slide lectures on contemporary photography as well as photographs from the medium?s rich past. They will visit and respond to relevant gallery and museum exhibits. The aim of this course is to immerse the student in the issues and ideas that have surfaced in the medium?s 200-year history. It is the teacher?s hope to provide the students with an environment wherein they can grow as perceptive image-makers, interesting thinkers and engaged human beings.\nStudents must also register for Friday Recitation.\n\n      less description for PHTI-UT    2 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 3",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14093",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Kilroy, Elizabeth",
                    "time": "Mon 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Studio",
                    "class_id": "14579",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Photography & Imaging 3MultimediaTopic:  Video",
            "description": "PHTI-UT    3 Photography & Imaging 3MultimediaTopic:  Video \nSee class notes for the course description since this course is multi-topic.",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 4",
            "course_name": "Screen Based Projects",
            "description": "PHTI-UT    4 Screen Based Projects",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 38",
            "course_name": "",
            "description": "PHTI-UT   38\n\n   Web Design I\n\nThis course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students...\n\n      more description for PHTI-UT   38 »\n\n      \n\n\n\nThis course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students will: 1. Know how to create basic web pages using xHTML and CSS, 2. Become comfortable using Dreamweaver to aid in web design and construction, 3. Gain an understanding of the unique design problems involved in web design, 4. Develop an ability to design and problem-solve through the creation of their own projects, and 5. Evaluate and explore effective web-based design and the web as a medium.\n\n      less description for PHTI-UT   38 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 39",
            "course_name": "",
            "description": "PHTI-UT   39\n\n   Web Design 2\n\nThis course may be taken directly after Web Design 1 or alone if the student has an elementary understnanding of the subject. This course introduces students to the basics of web design and is intended to be taken in sequence with Web Design I or for students already have a elementary understanding of Web Design. Students will learn coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be deve...\n\n      more description for PHTI-UT   39 »\n\n      \n\n\n\nThis course may be taken directly after Web Design 1 or alone if the student has an elementary understnanding of the subject. This course introduces students to the basics of web design and is intended to be taken in sequence with Web Design I or for students already have a elementary understanding of Web Design. Students will learn coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students will: 1. Know how to create basic web pages using xHTML and CSS, 2. Become comfortable using Dreamweaver to aid in web design and construction, 3. Gain an understanding of the unique design problems involved in web design, 4. Develop an ability to design and problem-solve through the creation of their own projects, and 5. Evaluate and explore effective web-based design and the web as a medium. This course is charged a lab fee of $339.00. If a student takes two 2-credit courses, they will only be charged one lab fee.\n\n      less description for PHTI-UT   39 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1001",
            "course_name": "",
            "description": "PHTI-UT 1001\n\n   Photography I\n\nThere is no prerequisite for this course. \n\nMany photographers who have been utilizing digital cameras are turning (and returning) to traditional, silver-based film and papers. This intensive course is designed to introduce and explore the practical and creative applications of analog photography. Students will learn camera operation, composition principles, and metering techniques. Supported by a comprehensive lab facility, students will learn film processing and archival projection print enlarging methods as well as the basics of print finishing and presentation. Classes will incorporate cri...\n\n      more description for PHTI-UT 1001 »\n\n      \n\n\n\nThere is no prerequisite for this course. \n\nMany photographers who have been utilizing digital cameras are turning (and returning) to traditional, silver-based film and papers. This intensive course is designed to introduce and explore the practical and creative applications of analog photography. Students will learn camera operation, composition principles, and metering techniques. Supported by a comprehensive lab facility, students will learn film processing and archival projection print enlarging methods as well as the basics of print finishing and presentation. Classes will incorporate critiques of student work, slide lectures of important historical and contemporary imagery, hands-on studio and laboratory demonstrations, and field trips. Students will be assigned reading for class discussion and relevant photography exhibits to view. Students are required to complete a minimum of 4 hours of lab work per week (hours arranged by the student) in addition to regular class attendance. This course is designed to engage the student in a photographic dialogue within a productive semester. A lab fee is charged for this course.\n\n      less description for PHTI-UT 1001 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1002",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14649",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Frocheur, Nichole",
                    "time": "Thu 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1002\n\n   Photography 2Photography 2 for Nonmajors\n\nPrerequisite: Photography I or permission from the Department. This course is recommended for transfer students and non-majors. During the Fall and Spring, non-majors must fill out the following form to request access to the course: http://photo.tisch.nyu.edu/object/pinonmajorrequestform.html\n\nPhoto II is a course that expands upon the principles and tools of Photography I. Students will start out continuing to refine analog skills through a series of short technical assignments. Students will work on exercises with on-camera flash, medium format camera, and tungsten lighting to further their ...\n\n      more description for PHTI-UT 1002 »\n\n      \n\n\n\nPrerequisite: Photography I or permission from the Department. This course is recommended for transfer students and non-majors. During the Fall and Spring, non-majors must fill out the following form to request access to the course: http://photo.tisch.nyu.edu/object/pinonmajorrequestform.html\n\nPhoto II is a course that expands upon the principles and tools of Photography I. Students will start out continuing to refine analog skills through a series of short technical assignments. Students will work on exercises with on-camera flash, medium format camera, and tungsten lighting to further their technical skills. At the heart of the class is the development of two long-term projects in which students can hone their creative vision. Weekly critiques of students' projects will include discussions on content, aesthetics, editing, and technique. \n \nClass time will also be spent on slide presentations of historical and contemporary photography, technical lectures, and lab demonstrations. While students will predominantly be working in analog, digital photography will be introduced. Topics to be covered include the use of a digital SLR, the basics of Adobe Photoshop, and film scanning. Students are required to have a film camera with a light meter and manual functions in addition to film and photographic paper to execute their assignments.\n\n A lab fee is charged for this course.\n\n      less description for PHTI-UT 1002 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1003",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14094",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "14095",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Fiedorek, Kara",
                    "time": "Fri 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1003\n\n   Culture, Hist/Imaging Photography Studies\n\nOffered Fall Only. Required of all freshmen majors and highly recommended for incoming transfers. Students are required to register for the lecture and the recitation sections. No prerequisites for this course.                                                                                                                                   The course will consist of a series of weekly lectures, discussions, readings and field trips to museums and galleries in the city. Lectures will present historic and contemporary art and photography and it's ideation as a basis for understanding the work the...\n\n      more description for PHTI-UT 1003 »\n\n      \n\n\n\nOffered Fall Only. Required of all freshmen majors and highly recommended for incoming transfers. Students are required to register for the lecture and the recitation sections. No prerequisites for this course.                                                                                                                                   The course will consist of a series of weekly lectures, discussions, readings and field trips to museums and galleries in the city. Lectures will present historic and contemporary art and photography and it's ideation as a basis for understanding the work the students are viewing on their weekly field trips. Students will visit selected exhibitions chosen for their quality and relevance and arranged by geographic area of the city (One week the Whitney, the next Chelsea, etc). Students will be required to monitor the daily press and periodicals for reviews of work they've seen and to highlight exhibitions the class should see. Additional readings of historic material will be assigned and short papers will be required.\n\n      less description for PHTI-UT 1003 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1004",
            "course_name": "Previsualiztn Zone Syste",
            "description": "PHTI-UT 1004 Previsualiztn Zone Syste",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1005",
            "course_name": "The Portrait",
            "description": "PHTI-UT 1005 The Portrait",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1006",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14776",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Bussell, Mark",
                    "time": "Tue 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1006\n\n   Documentary Strategies\n\nPrerequisite: Photography & Imaging II, or permission of the department.\nThis course considers the creative possibilities of a variety of documentary strategies. The editing of images, their structuring into an essay form, the interpretation of their various meanings, and the impact of the documentary essay on the world are all discussed. Students are assigned a range of problems that explore visual description and interpretation ranging from the photojournalistic to the autobiographical. In addition each student devotes a significant amount of time to producing a single-subject documentary pr...\n\n      more description for PHTI-UT 1006 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging II, or permission of the department.\nThis course considers the creative possibilities of a variety of documentary strategies. The editing of images, their structuring into an essay form, the interpretation of their various meanings, and the impact of the documentary essay on the world are all discussed. Students are assigned a range of problems that explore visual description and interpretation ranging from the photojournalistic to the autobiographical. In addition each student devotes a significant amount of time to producing a single-subject documentary project. Classes are lecture-demonstration with critiques of student work and regular presentations of documentary photographs made throughout history, in different cultures and for different reasons, including the personal and the societal. Each student must have a still camera or a video camera. This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1006 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1007",
            "course_name": "Photoshop:",
            "description": "PHTI-UT 1007 Photoshop:",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1010",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14096",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Yun-Edwards, Cheryl",
                    "time": "Tue 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1010\n\n   Visual Thinking\n\nFor Photography and Imaging Freshmen only.                                                  \n\nVisual thinking is a foundation course in Tisch Department of Photography and Imaging designed to broaden the student?s aesthetic explorations and to inform their photography. The course will expose and explore basic visual ideas to help the student develop a visual language based on contemporary, cross-disciplinary and cross - cultural artistic strategies. Through a series of projects and exercises students will be encouraged to experiment with line, composition, scale, text/type, performance, collab...\n\n      more description for PHTI-UT 1010 »\n\n      \n\n\n\nFor Photography and Imaging Freshmen only.                                                  \n\nVisual thinking is a foundation course in Tisch Department of Photography and Imaging designed to broaden the student?s aesthetic explorations and to inform their photography. The course will expose and explore basic visual ideas to help the student develop a visual language based on contemporary, cross-disciplinary and cross - cultural artistic strategies. Through a series of projects and exercises students will be encouraged to experiment with line, composition, scale, text/type, performance, collaboration, narrative, design, sound, software and with materials in order to develop strong tools for further awareness and visual expression.\n\n      less description for PHTI-UT 1010 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1013",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14097",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Owen, Paul",
                    "time": "Thu 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1013\n\n   Lighting:\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class teaches lighting as a series of the most common lighting problems encountered in professional photography and cinematography.  The course philosophy is that the most complex and difficult lighting problems are really just combinations of small, easily resolved, problems. Starting with basic three-point lighting for portraiture using simple continuous source lighting, the course will progress quickly to extremely complex set ups using electronic flash as well as lighting for the new generation of hybrid Dslr’s  (video/s...\n\n      more description for PHTI-UT 1013 »\n\n      \n\n\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class teaches lighting as a series of the most common lighting problems encountered in professional photography and cinematography.  The course philosophy is that the most complex and difficult lighting problems are really just combinations of small, easily resolved, problems. Starting with basic three-point lighting for portraiture using simple continuous source lighting, the course will progress quickly to extremely complex set ups using electronic flash as well as lighting for the new generation of hybrid Dslr’s  (video/still camera) as it moves through multiple environments. Subjects covered include: Lighting for portraits, still life, fashion, interiors, documentary, and exterior location lighting using battery powered flash. Location scouting and planning according to location limitations. Color temperature and color control.  Light shaping and control. Students will learn how to use:  Digital SLR’s, medium format cameras, Leaf Aptus electronic capture, direct tethered capture using Adobe Lightroom, continuous lighting, electronic flash, color temperature meters and custom white balance profiles as well as the basics of video/sound capture. Lighting equipment is provided. A lab fee is charged for this course.\n\n      less description for PHTI-UT 1013 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1014",
            "course_name": "",
            "description": "PHTI-UT 1014\n\n   Large Format\n\nPrerequisite: Photography & Imaging: Analog and Digital. Many artists turn to 4x5 and 8x10 large-format cameras for the creative control that view cameras afford, as well as for the high resolution and potentially large scale of the resulting prints. This course introduces the special characteristics of large format photography, including perspective control, creative approaches to selective focus and metering strategies facilitated by single negative processing. The exposure and development methods known as the Zone System will also be considered. Because large format work is physically deman...\n\n      more description for PHTI-UT 1014 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging: Analog and Digital. Many artists turn to 4x5 and 8x10 large-format cameras for the creative control that view cameras afford, as well as for the high resolution and potentially large scale of the resulting prints. This course introduces the special characteristics of large format photography, including perspective control, creative approaches to selective focus and metering strategies facilitated by single negative processing. The exposure and development methods known as the Zone System will also be considered. Because large format work is physically demanding and relatively slow, this is also an opportunity to work more deliberately and, in some respects, more consciously. It may also inform one’s understanding of the methods and approaches of 19th and early 20th Century artists. The high resolution of large format description can often produce a compelling image of relatively static subject matter that might not otherwise succeed if recorded in smaller formats. Surfaces and details evoke a more “complete”, or even tactile appreciation of some subjects. Following a series of practical exercises during the first half of the course, students are expected to develop an appropriate project on which to concentrate and apply their evolving skills in the production of an original and integrated body of work. Technical material covered includes different large format camera types and applications, lenses and optics, metering, filters, special B&W developers, large format printing and scanning for digital output. Early historical processes are introduced, current exhibitions of artists and photographers in New York are discussed and field trips are arranged. A variety of cameras, lenses and tripods are available for student use. A lab fee is charged for this course.\n\n      less description for PHTI-UT 1014 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1015",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14098",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1015\n\n   Photojournalism\n\nPrerequisite: Photography & Imaging: Analog and Digital.                                     \n\nThis course will be based on weekly assignments under the pressure of deadlines.  Students will be working with digital cameras as well as with traditional film and printing in the darkroom. Topics to be covered include: 1. how to build a story 2. the demands of a one-day feature 3. how to  present your story ideas and your assignments to editors 4. ethics of representation  5. working in different communities and cultures 6. copyright, libel, privacy, and other legal issues 7. practical issues inclu...\n\n      more description for PHTI-UT 1015 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging: Analog and Digital.                                     \n\nThis course will be based on weekly assignments under the pressure of deadlines.  Students will be working with digital cameras as well as with traditional film and printing in the darkroom. Topics to be covered include: 1. how to build a story 2. the demands of a one-day feature 3. how to  present your story ideas and your assignments to editors 4. ethics of representation  5. working in different communities and cultures 6. copyright, libel, privacy, and other legal issues 7. practical issues including how to get permits and the business of photojournalism 8. how to transmit photos under combat conditions 9. how to develop your style of photography in a journalistic context.  Assignments will often echo current events. Class time will include lectures, critiques, and visits by editors and photographers from the New York Times and other periodicals.\n\n      less description for PHTI-UT 1015 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1016",
            "course_name": "Directed Projects",
            "description": "PHTI-UT 1016 Directed Projects \nFirst priority is given to students who are taking all of the Photography & Human Rights courses.\n\nThis is a multi-topic class. See notes for course description.",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1017",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14741",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Devries, Erica; deVries, Erica",
                    "time": "Thu 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1017\n\n   Photo & Performance\n\nPrerequisite: Photography & Imaging III or department permission.                         \n\nThe media of Photography and Performance Art share a long history. Beginning with projected light, magic lantern shows and camera obscura in live performance, through early staged allegorical photographs and pornography, to the photograph as ?anti object? in 1960?s/70?s performance art and happenings, to contemporary highly choreographed and directed ?staged? photography and contemporary live performance staged specifically for media spectacle and cameras. This class is a combination of lecture and stud...\n\n      more description for PHTI-UT 1017 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging III or department permission.                         \n\nThe media of Photography and Performance Art share a long history. Beginning with projected light, magic lantern shows and camera obscura in live performance, through early staged allegorical photographs and pornography, to the photograph as ?anti object? in 1960?s/70?s performance art and happenings, to contemporary highly choreographed and directed ?staged? photography and contemporary live performance staged specifically for media spectacle and cameras. This class is a combination of lecture and studio work with cross cultural and theoretical study including; body art, feminist art, artmaking as an extension of life living, identity, media, ritual, spectacle and intervention. Class projects include performing for the camera, collaborative work, live performance exercises, and a self directed related project.  This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1017 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1020",
            "course_name": "Design Projects",
            "description": "PHTI-UT 1020 Design Projects \nPrerequisite: Photography & Imaging: Multimedia or permission by the department. \nThis is an intense design class for the crossover creature who yearns to design their own exhibit, create a street poster, develop an ad campaign, design titles for a film, invent a visual identity for a musical score, etc. This will be a hands-on process-driven class that will push you to imagine, create, and produce. Students must know InDesign.",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1021",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14581",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "Fallon, Catherine",
                    "time": "Fri 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1021\n\n   Indesign\n\nThis course is devoted to a different level of understanding the design and production of making a book. On the first day of class, students bring in digital versions of their art and decide to translate it into a printed piece.  The class we’ll focus on book design. Students will begin to explore InDesign and learn how to use the program to create a publication, deciding on the size nand order of image and where text will go.  On the second day of class students learn how to work with type. The class explores how to make type work for you and what typefaces work best depending on your design ...\n\n      more description for PHTI-UT 1021 »\n\n      \n\n\n\nThis course is devoted to a different level of understanding the design and production of making a book. On the first day of class, students bring in digital versions of their art and decide to translate it into a printed piece.  The class we’ll focus on book design. Students will begin to explore InDesign and learn how to use the program to create a publication, deciding on the size nand order of image and where text will go.  On the second day of class students learn how to work with type. The class explores how to make type work for you and what typefaces work best depending on your design and art. The class will talk about image pacing and the flow of text throughout a publication. On the third day of class, homework is reviewed and InDesign files are revised if needed. The class then turns to production. We will go over each file and make it as final as possible and ready for print.  The class will also discuss the different ways to get your document published and how to do each one. In the beginning of this course the students will walk into the classroom with a loose body of work and leave, after the third day, with their work organized into a book format. This course is charged a lab fee. Graduate course numbers are available on Albert.\n\n      less description for PHTI-UT 1021 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1022",
            "course_name": "",
            "description": "PHTI-UT 1022\n\n   The Magazine as Visual Piazza\n\nPrerequisite: Photography & Imaging III. Computer skills such as Photoshop and Indesign are recommended, but not required.                                                                  This course will explore Fashion Magazines as a theatre for the imagination. We will consider in-depth the work of such legendary art directors as Alexy Brodovitch and Marvin Israel, and their collaboration with prominent photographers including Richard Avedon, Irving Penn, Hiro and William Klein. Through magazine spreads from Harper?s Bazaar, Vogue, Egoste, and Portfolio Magazine along with film screenings o...\n\n      more description for PHTI-UT 1022 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging III. Computer skills such as Photoshop and Indesign are recommended, but not required.                                                                  This course will explore Fashion Magazines as a theatre for the imagination. We will consider in-depth the work of such legendary art directors as Alexy Brodovitch and Marvin Israel, and their collaboration with prominent photographers including Richard Avedon, Irving Penn, Hiro and William Klein. Through magazine spreads from Harper?s Bazaar, Vogue, Egoste, and Portfolio Magazine along with film screenings of Funny Face, Qui tes-vous Polly Maggoo?, Blow up and Who is Marvin Israel?, we will consider the fashion magazine?s historical context, contemporary relevance and its role as a force for social change. Field trips will include a visit to The Richard Avedon Foundation and a contemporary fashion magazine.         During the course of the semester, students will make a fashion magazine. Which will include the magazine development process will include brainstorming, concept development, maquette sketches, photography, photo editing, writing, layout design and type design. The finished product will be a 64-page publication. Students will work collaboratively in small groups. This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1022 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1023",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14629",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Typography",
            "description": "PHTI-UT 1023 Typography",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1025",
            "course_name": "",
            "description": "PHTI-UT 1025\n\n   Intro to Color\n\nPrerequisite:Photography & Imaging II, Photography II for Nonmajors, or equivalent. This course integrates both transparency and color printing techniques to examine the aesthetic and technical aspects of color. Class time is devoted to technical lectures/demonstrations on color theory and color printing, group critiques, and slide lectures. The emphasis of the class is on development of an idiosyncratic approach to photography and the world. Consequently, no photographic assignments are given; instead, students are expected to generate work from their own interests, goals, and motivation. Stu...\n\n      more description for PHTI-UT 1025 »\n\n      \n\n\n\nPrerequisite:Photography & Imaging II, Photography II for Nonmajors, or equivalent. This course integrates both transparency and color printing techniques to examine the aesthetic and technical aspects of color. Class time is devoted to technical lectures/demonstrations on color theory and color printing, group critiques, and slide lectures. The emphasis of the class is on development of an idiosyncratic approach to photography and the world. Consequently, no photographic assignments are given; instead, students are expected to generate work from their own interests, goals, and motivation. Students are expected to work on an extended project of their own choosing for the second half of the course. Students should not only expect to purchase film and paper but also budget for lab costs of processing slides (E6) and negative film (C41). The students have access to a 30\" automatic color processor. This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1025 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1030",
            "course_name": "",
            "description": "PHTI-UT 1030\n\n   Directed Projects: I\n\nPre-requisite: Photography & Imaging II, or permission of the department.\nThis course is designed for P&I sophomores and juniors who want to work on a self-designed semester long project. Students may work in any photo-based media and form of presentation. Weekly work-in-progress critiques will be accompanied by discussions of contemporary and historical art works that relate to the student project ideas. Individual research is crucial in developing an artistic practice so students will be expected read and see exhibitions both off and online. Modes of presentation and editing for exhibitions ...\n\n      more description for PHTI-UT 1030 »\n\n      \n\n\n\nPre-requisite: Photography & Imaging II, or permission of the department.\nThis course is designed for P&I sophomores and juniors who want to work on a self-designed semester long project. Students may work in any photo-based media and form of presentation. Weekly work-in-progress critiques will be accompanied by discussions of contemporary and historical art works that relate to the student project ideas. Individual research is crucial in developing an artistic practice so students will be expected read and see exhibitions both off and online. Modes of presentation and editing for exhibitions and online presentation will also be explored. If you would like to discuss project ideas for the course, please feel free to email lorie.novak@nyu.edu. This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1030 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1031",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "17735",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Studio",
                    "class_id": "17735",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "Drawing: An Introduction",
            "description": "PHTI-UT 1031 Drawing: An Introduction \nWorking from the idea that drawing is fundamental to all image-making, this course will begin with an introduction to the basics of drawing, such as line, value, form and spatial relations. Students will work in class from still life set-ups and figure drawing from the model. In-class work time will be supplemented with discussion and slide lectures to introduce historic and contemporary examples of drawing. The course will also include explorations of the expressive, experimental and conceptual aspects of drawing as a medium.  This course requires a nonrefundable lab fee.",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1100",
            "course_name": "",
            "description": "PHTI-UT 1100\n\n   Business of Art\n\nThis class will attempt to demystify the questions and decisions young artists face when choosing a profession in the arts. Central to the course is understanding an artist's creative growth and lifestyle choices are inextricably entwined with his/her financial security. Young, creative professionals need to realistically assess their future goals and aspirations in order to find their niche in the worlds of both art and commerce, while supporting their larger creative vision.                                  This class is largely a survey of the many career choices available to artists. Topic...\n\n      more description for PHTI-UT 1100 »\n\n      \n\n\n\nThis class will attempt to demystify the questions and decisions young artists face when choosing a profession in the arts. Central to the course is understanding an artist's creative growth and lifestyle choices are inextricably entwined with his/her financial security. Young, creative professionals need to realistically assess their future goals and aspirations in order to find their niche in the worlds of both art and commerce, while supporting their larger creative vision.                                  This class is largely a survey of the many career choices available to artists. Topics covered will be: graduate schools, careers in teaching, editorial, advertising, stock and corporate photography, art buying and photo editing, photo assisting, galleries, artist's residencies, grants and fundraising sources, portfolio preparation and marketing rsums.                                                                             The class relies heavily on guests from the publishing, business and art world, giving students the chance to show their work to, and elicit advice from, top industry professionals. This course requires a nonrefundable lab fee\n\n      less description for PHTI-UT 1100 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1101",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14693",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 300",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Rice, Shelley"
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1101\n\n   Social History of Photography\n\nOffered Fall only.( Required of all sophomore majors. Prerequisite: CHIPS H82.1003.\nThis class will chronicle the history of photography?s complex and symbiotic relationship to the other visual arts: painting sculpture, architechture, installation and performance, among others. Beginning with the medium?s invention and the early fights of its practitioners to establish themselves as fine artists, the course will describe photographers? unique attempts to negotiate their relationships with both artistic movements and the media culture of which they are a part. Robinson, Cameron, Emerson, F. Hol...\n\n      more description for PHTI-UT 1101 »\n\n      \n\n\n\nOffered Fall only.( Required of all sophomore majors. Prerequisite: CHIPS H82.1003.\nThis class will chronicle the history of photography?s complex and symbiotic relationship to the other visual arts: painting sculpture, architechture, installation and performance, among others. Beginning with the medium?s invention and the early fights of its practitioners to establish themselves as fine artists, the course will describe photographers? unique attempts to negotiate their relationships with both artistic movements and the media culture of which they are a part. Robinson, Cameron, Emerson, F. Holland Day, Stieglitz, Moholy-Nagy, Rodchenko, Weston, Alvarez Bravo, Lartigue, De Carava, Cahun, Robert Frank, Diane Arbus and Cindy Sherman (among others) will be seen within the context of their respective art worlds, so the impact of art movements, cultural attitudes and new technologies on photographers during different historical periods can be assessed.\n\n      less description for PHTI-UT 1101 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1102",
            "course_name": "",
            "description": "PHTI-UT 1102\n\n   Aesthetic History of Photography\n\nOpen only to Photography & Imaging majors. Sophomore Standing.                                     This class will chronicle the history of photography?s complex and symbiotic relationship to the other visual arts: painting, sculpture, architecture, installation and performance, among others. Beginning with the medium?s invention and the early fights of its practitioners to establish themselves as fine artists, the course will describe photographers? unique attempts to negotiate their relationships with both artistic movements and the media culture of which they are a part. Robinson, Cameron, ...\n\n      more description for PHTI-UT 1102 »\n\n      \n\n\n\nOpen only to Photography & Imaging majors. Sophomore Standing.                                     This class will chronicle the history of photography?s complex and symbiotic relationship to the other visual arts: painting, sculpture, architecture, installation and performance, among others. Beginning with the medium?s invention and the early fights of its practitioners to establish themselves as fine artists, the course will describe photographers? unique attempts to negotiate their relationships with both artistic movements and the media culture of which they are a part. Robinson, Cameron, Emerson, F. Holland Day, Stieglitz, Moholy-Nagy, Rodchenko, Weston, Alvarez Bravo, Lartigue, De Carava, Cahun, Robert Frank, Diane Arbus and Cindy Sherman (among others) will be seen within the context of their respective art worlds, so the impact of art movements, cultural attitudes and new technologies on photographers during different historical periods can be assessed.\n\n      less description for PHTI-UT 1102 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1115",
            "course_name": "",
            "description": "PHTI-UT 1115\n\n   Picture Essay for Paper and Pixel\n\nThis course is designed for students that are taking all of the Human Rights courses. However there is space available to other students interested in this topic.  Please contact the Department for permission to register.\n\nThe course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of models from magazines, newspapers, books, exhibitions and digital environment...\n\n      more description for PHTI-UT 1115 »\n\n      \n\n\n\nThis course is designed for students that are taking all of the Human Rights courses. However there is space available to other students interested in this topic.  Please contact the Department for permission to register.\n\nThe course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of models from magazines, newspapers, books, exhibitions and digital environments, including the Web. The impact of media strategies, both contemporary and historical, on human rights issues will be a central component of the class.\n\n      less description for PHTI-UT 1115 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1116",
            "course_name": "",
            "description": "PHTI-UT 1116\n\n   Human Rights and Photography\n\nThis class will focus on photography, representation, and human rights. Specifically, we will examine the crucial role that photography plays in the global human rights movement. Many photographers who once considered themselves to be working within a documentary tradition now conceive of themselves as also working within a human rights framework.  In order to understand this change, we need to view the many historical and contemporary movements related to documentary photography. We will also explore critical issues surrounding the ethics and politics of photographic representation and the di...\n\n      more description for PHTI-UT 1116 »\n\n      \n\n\n\nThis class will focus on photography, representation, and human rights. Specifically, we will examine the crucial role that photography plays in the global human rights movement. Many photographers who once considered themselves to be working within a documentary tradition now conceive of themselves as also working within a human rights framework.  In order to understand this change, we need to view the many historical and contemporary movements related to documentary photography. We will also explore critical issues surrounding the ethics and politics of photographic representation and the different mediums (such as traditional print media versus new media) used to express human rights issues. We will also carefully place photography and visual representation within the wider field of human rights. And finally, we will study the impact photography has had on social change and the many possibilities photographs may have in the future struggle for universal human rights. This course is charged a lab fee of $339.00.\n\n      less description for PHTI-UT 1116 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1118",
            "course_name": "Arts Writing: Rendering Photography",
            "description": "PHTI-UT 1118 Arts Writing: Rendering Photography \nPrerequisite: Social and Asthtic History of Photography.                                           A writing course with the larger aim of getting students to be more critical viewers and hence possess a more convincing voice?whether conveying, describing, analyzing, challenging, and/or critiquing what they see. The course will require students to attend exhibitions (mostly photography) on a regular basis (some of which will happen during class time), and to write on a weekly basis. Initial assignments will take the form of exercises, evolving into a more in-depth, content-driven criticism",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14763",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced History SeminarHistory of New Media",
            "description": "PHTI-UT 1120 Advanced History SeminarHistory of New Media \nSee class notes for this semester's course description since it is multi-topic.",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1121",
            "course_name": "Adv History Seminar:",
            "description": "PHTI-UT 1121 Adv History Seminar:",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1122",
            "course_name": "Advanced History Seminar Books",
            "description": "PHTI-UT 1122 Advanced History Seminar Books",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1129",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14655",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 814",
                    "time": "Tue 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Rice, Shelley"
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1129\n\n   Toward a Critical Vocabulary\n\nPrerequisite: Social and Aesthetic history of Photography. This class takes as its main emphasis the analysis and synthesis of visual and written information. The readings include essays by Roland Barthes, Donna Harraway and Frederick Jameson as well as articles or excerpts by Thomas Kuhn, Mircea Eliade and John Berger; also included are The Tibetan Book of the Dead, Black Elk Speaks, Amin Malouf's Murderous Identities and Deborah Willis' Picturing Us. This mixture of topics and issues is designed to broaden students' understanding of important concerns in philosophy, art history, science, lit...\n\n      more description for PHTI-UT 1129 »\n\n      \n\n\n\nPrerequisite: Social and Aesthetic history of Photography. This class takes as its main emphasis the analysis and synthesis of visual and written information. The readings include essays by Roland Barthes, Donna Harraway and Frederick Jameson as well as articles or excerpts by Thomas Kuhn, Mircea Eliade and John Berger; also included are The Tibetan Book of the Dead, Black Elk Speaks, Amin Malouf's Murderous Identities and Deborah Willis' Picturing Us. This mixture of topics and issues is designed to broaden students' understanding of important concerns in philosophy, art history, science, literature, and psychology that are relevant to photography. Class time is spent in analysis of these texts in relation to historical and contemporary pictures\n\n      less description for PHTI-UT 1129 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1130",
            "course_name": "",
            "description": "PHTI-UT 1130\n\n   Contemporary Photography\n\nPrerequisite: Social and Aesthetic History of Photography. Digital technology today allows the combination of still images and moving images with unprecedented ease. As a result, the boundaries that once existed between still photographers, filmmakers, and videomakers are becoming increasingly blurred. By examining a wide range of visual materials, both historic and contemporary, this class will attempt to understand the changing relation between the still photographic image and the moving image. We will concentrate on three major areas: (1) We will examine the rarely seen films made by celebr...\n\n      more description for PHTI-UT 1130 »\n\n      \n\n\n\nPrerequisite: Social and Aesthetic History of Photography. Digital technology today allows the combination of still images and moving images with unprecedented ease. As a result, the boundaries that once existed between still photographers, filmmakers, and videomakers are becoming increasingly blurred. By examining a wide range of visual materials, both historic and contemporary, this class will attempt to understand the changing relation between the still photographic image and the moving image. We will concentrate on three major areas: (1) We will examine the rarely seen films made by celebrated still photographers such as Paul Strand, Man Ray, Laszlo Moholy-Nagy, Robert Frank, William Klein, Henri Cartier-Bresson, Helen Levitt, and Susan Meiselas. (2) We will consider a number of classic films and videos which make innovative use of the still photograph, the freeze-frame image, and the static camera. These filmmakers include Dziga Vertov, Agnès Varda, Jean-Luc Godard, Federico Fellini, Andy Warhol, Chris Marker, Hollis Frampton, Bill Viola, and James Benning. (3) We will discuss a selected group of contemporary artists whose work imaginatively embraces both still photographs and moving images. These artists include Isaac Julian, Douglas Gordon, Lorna Simpson, Stan Douglas, Eyal Sivan, Tracey Moffat, and David Claerbout. Throughout the class, we will explore an unusually wide range of visual materials: still photographs, photo books, feature films, avant-garde films, documentaries, and artists' films and videos. Class readings will introduce a range of critical approaches to the relation between the still and moving image, and will also highlight key works and visual innovators.\n\n      less description for PHTI-UT 1130 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1133",
            "course_name": "",
            "description": "PHTI-UT 1133\n\n   Topics:\n\nPrerequisite: Junior standing or permission of the department.                               This seminar explores the development of contemporary photographic and video practices as they relate to Africa. Organized thematically, it focuses on individual case studies?primarily living artists and public exhibitions?that comprise the dynamic and international realm of contemporary photo and video by artists living on and off the African continent. Emphasis will be placed on the changing significance and role of photography within African and trans-African contexts. As a part of this process, we ...\n\n      more description for PHTI-UT 1133 »\n\n      \n\n\n\nPrerequisite: Junior standing or permission of the department.                               This seminar explores the development of contemporary photographic and video practices as they relate to Africa. Organized thematically, it focuses on individual case studies?primarily living artists and public exhibitions?that comprise the dynamic and international realm of contemporary photo and video by artists living on and off the African continent. Emphasis will be placed on the changing significance and role of photography within African and trans-African contexts. As a part of this process, we will consider issues of representation; documentation, critiques, the re-framing of socio-political issues and global relations; the visual articulation of racial, ethnic, gendered and religious identities; as well as aesthetic ideas, performance and the role of varied audiences and reception.\n\n      less description for PHTI-UT 1133 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1135",
            "course_name": "Body Politics",
            "description": "PHTI-UT 1135 Body Politics",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1145",
            "course_name": "Landscape Workshop",
            "description": "PHTI-UT 1145 Landscape Workshop",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1160",
            "course_name": "Visual Arts,Pop Culture",
            "description": "PHTI-UT 1160 Visual Arts,Pop Culture",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1200",
            "course_name": "Voting for An Image",
            "description": "PHTI-UT 1200 Voting for An Image",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1201",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14099",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Drysdale, Thomas",
                    "time": "Thu 9.30 AM - 1.15 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Studio",
                    "class_id": "14494",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Novak, Lorie",
                    "time": "Tue 9.30 AM - 1.15 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Studio",
                    "class_id": "14100",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mesina, Editha",
                    "time": "Tue 9.30 AM - 1.15 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1201\n\n   Senior Directed Projects:\n\nOffered Fall only. Prerequisite: Required of all P&I Seniors. Open to Juniors by submission of portfolio and permission of the department.                                       In this intensive critique course, students produce their senior thesis project for exhibition in the spring semester. Students are encouraged to use any photo-based method or approach that can best serve their individual ideas and directions. Later emphasis will be on refining and editing each project, with assistance in determining a final completed form. Critical emphasis will encourage the development of personal vi...\n\n      more description for PHTI-UT 1201 »\n\n      \n\n\n\nOffered Fall only. Prerequisite: Required of all P&I Seniors. Open to Juniors by submission of portfolio and permission of the department.                                       In this intensive critique course, students produce their senior thesis project for exhibition in the spring semester. Students are encouraged to use any photo-based method or approach that can best serve their individual ideas and directions. Later emphasis will be on refining and editing each project, with assistance in determining a final completed form. Critical emphasis will encourage the development of personal vision and project forms that best serve specific choices. Students will be expected to challenge themselves and each other to delve deeper with their work and take risks. On the first day of class, students must bring a past project and be prepared to present their project ideas.\n\n      less description for PHTI-UT 1201 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1202",
            "course_name": "",
            "description": "PHTI-UT 1202\n\n   Advanced Lighting\n\nPre-requisite: Lighting or permission of the department.                                     From Gregory Crewdson to David LaChapelle, photographers are making images that are increasingly complex in their production techniques- rivaling those of Hollywood films. This class picks up on the skills students have learned in basic lighting and allows them to develop a body of work that utilizes more complex lighting and production skills.                                                                     The class begins with a series of demos and assignments designed to challenge and hone the s...\n\n      more description for PHTI-UT 1202 »\n\n      \n\n\n\nPre-requisite: Lighting or permission of the department.                                     From Gregory Crewdson to David LaChapelle, photographers are making images that are increasingly complex in their production techniques- rivaling those of Hollywood films. This class picks up on the skills students have learned in basic lighting and allows them to develop a body of work that utilizes more complex lighting and production skills.                                                                     The class begins with a series of demos and assignments designed to challenge and hone the students existing skills and transitions into a directed project of the students choice later in the semester. Students may work on any project/portfolio they choose, from fine art to fashion, with an emphasis on using light consistently thoughout the body of work to convey a unified vision. Students are encouraged to have the broad ideas for a project/portfolio before registering for the class.      Topics covered will be: Advanced lighting techniques/light shaping, casting talent/crew, production organization, special effects, RAW image conversion, shooting/lighting on location, and special lighting techniques for documentary projects. This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1202 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1203",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14580",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Jenkinson, Mark",
                    "time": "Thu 2.00 PM - 5.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1203\n\n   Editorial Photography for New Media\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the int...\n\n      more description for PHTI-UT 1203 »\n\n      \n\n\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and written text. A lab fee is charged for this course.\n\n      less description for PHTI-UT 1203 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1204",
            "course_name": "",
            "description": "PHTI-UT 1204\n\n   Adv. Directed Projects:\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and writt...\n\n      more description for PHTI-UT 1204 »\n\n      \n\n\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and written text.  This course is charged a lab fee of $350.00. Graduate course numbers are available on Albert.\n\n      less description for PHTI-UT 1204 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1206",
            "course_name": "Adv Photojournalism & Documentary Photography",
            "description": "PHTI-UT 1206 Adv Photojournalism & Documentary Photography",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1214",
            "course_name": "",
            "description": "PHTI-UT 1214\n\n   Historical Processes\n\nPrerequisite: Photography & Imaging Analog and Digital, Photo II, or permission of the department. Large Format Photography is recommended. This course explores a number of 19th century non-silver and silver-based photographic processes that involve unique handmade methods for making negatives and prints. In examining these early techniques, students will make connections among scientific inquiry, photo history, modern technology and creative practice. Through demonstrations and workshops, photographic and written assignments, readings, exhibition visits and in-class critiques, students will l...\n\n      more description for PHTI-UT 1214 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging Analog and Digital, Photo II, or permission of the department. Large Format Photography is recommended. This course explores a number of 19th century non-silver and silver-based photographic processes that involve unique handmade methods for making negatives and prints. In examining these early techniques, students will make connections among scientific inquiry, photo history, modern technology and creative practice. Through demonstrations and workshops, photographic and written assignments, readings, exhibition visits and in-class critiques, students will learn how to make their own pinhole cameras, paper negatives (on black & white or color RC paper), large-format black and white film negatives, wet-collodion negatives & ambroytypes on glass, digital negatives for contact printing and several hand-coated printing processes over the course of the semester. Processes will be put in historical and contemporary contexts by discussions of different photographic movements in the medium and historical events, and through looking at the work of photographers using the processes from the nineteenth century through the present day. Students will mix working formulas from raw chemicals, keep a lab notebook of all their experiments and take meticulous notes in order to understand the characteristics of each of the different processes and develop more precise working methods. A final project will allow the student to master at least one of the processes presented during the course.\n\n      less description for PHTI-UT 1214 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1216",
            "course_name": "",
            "description": "PHTI-UT 1216\n\n   Advanced Documentary\n\nPrerequisites: Photojournalism I or the equivalent experience\n\nBeginning photojournalists develop a project, and acquire the practical knowledge to enter the profession. Students will work with a director of photography to develop a long-term project with an eye-toward publication (print, blog, self-published). Students will develop an idea; consider similar projects/competition; research appropriate publications/outlets for their work; craft a pitch; present to editors; explore alternative modes of production and distribution; and learn about practical business considerations (representation,...\n\n      more description for PHTI-UT 1216 »\n\n      \n\n\n\nPrerequisites: Photojournalism I or the equivalent experience\n\nBeginning photojournalists develop a project, and acquire the practical knowledge to enter the profession. Students will work with a director of photography to develop a long-term project with an eye-toward publication (print, blog, self-published). Students will develop an idea; consider similar projects/competition; research appropriate publications/outlets for their work; craft a pitch; present to editors; explore alternative modes of production and distribution; and learn about practical business considerations (representation, rights, etc).\n\nStudents should come to the first meeting with a one-page project proposal in hand.\n\nThere is a lab fee charged for this course.\n\nStudents should email photo.tsoa@nyu.edu to be enrolled in this course. The email should list relevant experience or courses taken that fulfill the prerequisite.\n\n\nWhitney Johnson is the Director of Photography at The New Yorker where she oversees the photographic vision for the print magazine, digital editions, and the website. She produced and edited the photo essays “Service” and “Portraits of Power”, which won National Magazine Awards in 2009 and 2010, and contributes regularly to Photo Booth, the magazine’s photography blog. Before joining the magazine, Johnson worked at the Open Society Foundations, coordinating a grant competition for photographers and the Moving Walls exhibition.\nJohnson teaches at New York University’s Tisch School for the Arts, Columbia University’s School of Journalism, and the International Center of Photography, and is on the advisory council of the Alexia Foundation. She holds a BA in American Literature from Barnard College, and pursued postgraduate work in American Studies at Columbia University.\n\n      less description for PHTI-UT 1216 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1220",
            "course_name": "",
            "description": "PHTI-UT 1220\n\n   Community Collaboration\n\nOffered Spring only. Prerequisite: Junior standing or permission of the department.        COMMUNITY COLLABORATIONS is a Photography & Imaging and Art and Public Policy Course where the NYU students collaborate with teens in Lower Manhattan to create photo stories about their lives. Working in teams of two or three, the NYU students co-facilitate small workshops with teens from the Lower East Side Girls Club, East Side Community High School, and Norman Thomas High School. Digital cameras will be provided for the teens to photograph their families, friends, and communities to create photographi...\n\n      more description for PHTI-UT 1220 »\n\n      \n\n\n\nOffered Spring only. Prerequisite: Junior standing or permission of the department.        COMMUNITY COLLABORATIONS is a Photography & Imaging and Art and Public Policy Course where the NYU students collaborate with teens in Lower Manhattan to create photo stories about their lives. Working in teams of two or three, the NYU students co-facilitate small workshops with teens from the Lower East Side Girls Club, East Side Community High School, and Norman Thomas High School. Digital cameras will be provided for the teens to photograph their families, friends, and communities to create photographic essays exploring their day-to-day lives, dreams, concerns, and social-political challenges. During the course time for NYU students, focus will be on workshop development, discussion of challenges, collaboration and supervision from the instructor. There will also be guest speakers and visits to other community-based art programs. Each group will create an online exhibition that will be added to the Community Collaborations website: http://photoandimaging.net/coco.                                                              Groups with the teens meet two afternoons a week in addition to the course time. When you plan your schedule, make sure you have a minimum of two afternoons a week free from 3:30-6. (Saturdays may also a possibility.) Once you have a sense of your schedule, please email lorie.novak@nyu.edu.\n\n      less description for PHTI-UT 1220 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1230",
            "course_name": "Crafts: Making Ideas Concrete",
            "description": "PHTI-UT 1230 Crafts: Making Ideas Concrete",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1236",
            "course_name": "Advanced Digital Printing",
            "description": "PHTI-UT 1236 Advanced Digital Printing",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1238",
            "course_name": "",
            "description": "PHTI-UT 1238\n\n   Web Design\n\nPrerequisite: Photography II or permission from the department.                           This course combines theory and practice as it pertains to making art projects for the World Wide Web. The course will investigate what it means to work in this new environment and how the medium might influence the work made. The course will investigate a variety of approaches such as conceptual, experimental, documentary and diaristic. Special consideration will be given to the ways in which structure (nonlinear vs. linear), interactivity and metaphor influence meaning. Formal design elements such as co...\n\n      more description for PHTI-UT 1238 »\n\n      \n\n\n\nPrerequisite: Photography II or permission from the department.                           This course combines theory and practice as it pertains to making art projects for the World Wide Web. The course will investigate what it means to work in this new environment and how the medium might influence the work made. The course will investigate a variety of approaches such as conceptual, experimental, documentary and diaristic. Special consideration will be given to the ways in which structure (nonlinear vs. linear), interactivity and metaphor influence meaning. Formal design elements such as color, typography, scale and sequencing will also be examined. In addition, the nuance of html tags, hexadecimal colors and image compression will be explored. There will be several short projects as we get up-to-speed on the technical side. Two larger projects will comprise the remainder of the semester: a portfolio project that focuses on graphic and interface design; and a web project that uses \"web space\" as a medium for its own sake. Students should be prepared to exercise both sides of their brain. This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1238 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1240",
            "course_name": "",
            "description": "PHTI-UT 1240\n\n   Expanding Digital\n\nPrerequisite: Photography & Imaging III or department permission.           Photography's creative, artistic, and visual expression has changed the way we perceive the world around us and influenced our life more than any other medium. Yet, our perspective has been limited to the framed dimension, the classical notion of photography's capabilities. In this class we will challenge the conventional methods of photography by exploring new ways of capturing an image with non-camera alternatives. We will use emerging technology such as cell phones, 3D programs, the internet, screen capture devices,...\n\n      more description for PHTI-UT 1240 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging III or department permission.           Photography's creative, artistic, and visual expression has changed the way we perceive the world around us and influenced our life more than any other medium. Yet, our perspective has been limited to the framed dimension, the classical notion of photography's capabilities. In this class we will challenge the conventional methods of photography by exploring new ways of capturing an image with non-camera alternatives. We will use emerging technology such as cell phones, 3D programs, the internet, screen capture devices, stereo algorithms, and many more.                                                                                  Furthermore, our way of presenting the photograph has been limited by the physical space. We will break away from the traditional way of seeing and presenting the image. We will instead explore installation, book making, written and spoken words as image, and performance as non-tangible ephemeral image experience. This advanced course provides space for exploration of concepts and independent thinking with emphasis placed on realization of the student's unique, creative vision.  This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1240 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1244",
            "course_name": "Art of the Image Based Interaction",
            "description": "PHTI-UT 1244 Art of the Image Based Interaction",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1245",
            "course_name": "",
            "description": "PHTI-UT 1245\n\n   Photoshop: Creative Imaging\n\nThere is no prerequisite for this course. \n\nThis three-week course focusing on Photoshop explores the possibilities for image manipulation and the steps involved in learning to translate traditional darkroom skills into digital artwork and montage. Starting from the empty canvas, we look at all the basic elements of Photoshop, including selection tools, text, scale, retouching, and collage. Introducing the principles of layers and masks we will look at creating composite images from photographic images and web sources. We also cover scanning negatives and flat artwork as well as color adjustme...\n\n      more description for PHTI-UT 1245 »\n\n      \n\n\n\nThere is no prerequisite for this course. \n\nThis three-week course focusing on Photoshop explores the possibilities for image manipulation and the steps involved in learning to translate traditional darkroom skills into digital artwork and montage. Starting from the empty canvas, we look at all the basic elements of Photoshop, including selection tools, text, scale, retouching, and collage. Introducing the principles of layers and masks we will look at creating composite images from photographic images and web sources. We also cover scanning negatives and flat artwork as well as color adjustment using levels and curves. We look at all aspects of image creation and enhancement with equal importance given to the aesthetic effect and technical ease. By working on a creative project, students use the software to convey their ideas in this digital environment. Class time is divided between work-in-progress sessions, critiques, and lectures. Because of the holiday, that session will be rescheduled sometime during the three weeks of class. A lab fee is charged for this course.\n\n      less description for PHTI-UT 1245 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1247",
            "course_name": "",
            "description": "PHTI-UT 1247\n\n   Digital Printing\n\nPrerequisite: Photography I, Digital Tools for Non-Majors, or permission from the Department.\n\nThis 3-week workshop will explore a range of digital imaging and printing resources. The aesthetic and technical aspects of color will be discussed along with the implication of scanning, file preparation, resolution requirements and color management for printout. The subtleties of various output devices from laser and ink jet printers to large format ink jet plotters and digital C printing will be covered. The objective will be to discover and execute a printing method best suited for individual pro...\n\n      more description for PHTI-UT 1247 »\n\n      \n\n\n\nPrerequisite: Photography I, Digital Tools for Non-Majors, or permission from the Department.\n\nThis 3-week workshop will explore a range of digital imaging and printing resources. The aesthetic and technical aspects of color will be discussed along with the implication of scanning, file preparation, resolution requirements and color management for printout. The subtleties of various output devices from laser and ink jet printers to large format ink jet plotters and digital C printing will be covered. The objective will be to discover and execute a printing method best suited for individual projects. Students will have the opportunity to complete a small project of their own. Class time will be devoted to lectures and demonstrations on scanning, color and color printing, group critiques and possible field trips. Although the department will have a few digital cameras for student use, it is highly recommended that students own their own digital camera. A lab fee of $182.50 is charged for this course.\n\n      less description for PHTI-UT 1247 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1250",
            "course_name": "Advanced Web Design",
            "description": "PHTI-UT 1250 Advanced Web Design",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1251",
            "course_name": "",
            "description": "PHTI-UT 1251\n\n   Digital Camera\n\nPrerequisite: Basic understanding, experience and knowledge of your digital camera.    This workshop will focus primarily on fundamental techniques of photography using digital cameras. With newer and higher quality cameras, digital photography is now becoming something more attractive to the traditional photographer. The goal is to give students a sense of possibilities available to create images in an all-digital workflow - using current mid-range cameras allows for flexibility and creativity. Students will learn the fundamentals of the hardware, software, and digital workflow to parallel tr...\n\n      more description for PHTI-UT 1251 »\n\n      \n\n\n\nPrerequisite: Basic understanding, experience and knowledge of your digital camera.    This workshop will focus primarily on fundamental techniques of photography using digital cameras. With newer and higher quality cameras, digital photography is now becoming something more attractive to the traditional photographer. The goal is to give students a sense of possibilities available to create images in an all-digital workflow - using current mid-range cameras allows for flexibility and creativity. Students will learn the fundamentals of the hardware, software, and digital workflow to parallel traditional photographic methods and approaches. This includes the quality of data files, in-camera settings and functions such as white balance, color space, the advantages of shooting raw files versus jpeg, and camera memory/storage considerations. Once the images are captured we will look at the next step - uploading your files and working with basic color correction, adjusting levels and curves and printing them using Adobe Photoshop. By working on a creative project, students will use the cameras and software to create small portfolios of their images in the digital environment. Class time is divided between work-in-progress sessions, critiques, and lectures. This course is charged a lab fee of $332.00; however, if students register for two, 2-credit courses, only one lab fee will be charged. Graduate course numbers are available on Albert.\n\n      less description for PHTI-UT 1251 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1255",
            "course_name": "",
            "description": "PHTI-UT 1255\n\n   Intermediate Photoshop\n\nPrerequisite: Photography & Imaging Digital, Photoshop or permission of the Department.\n\nIn this intermediate workshop students will build on their existing knowledge of Photoshop. Whether you want to work in print, on the web, or in video, Photoshop offers extraordinary creative freedom to manipulate existing images, create new artwork, and integrate basic graphic design elements. Emphasis in this class will be on using Photoshop for image manipulation as well as on graphic design principles and non-destructive image editing techniques. You will learn to construct images from photographic sou...\n\n      more description for PHTI-UT 1255 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging Digital, Photoshop or permission of the Department.\n\nIn this intermediate workshop students will build on their existing knowledge of Photoshop. Whether you want to work in print, on the web, or in video, Photoshop offers extraordinary creative freedom to manipulate existing images, create new artwork, and integrate basic graphic design elements. Emphasis in this class will be on using Photoshop for image manipulation as well as on graphic design principles and non-destructive image editing techniques. You will learn to construct images from photographic source material, as well as starting from scratch using Photoshop’s design and media tools.  While grounding in the basics of Photoshop and digital photography is assumed, early sessions will review basic tools to expand and better control these fundamental building blocks of digital imaging. Specifically we will explore creating and using layer masks and image effects, creating paths and shapes, custom fills and patterns. We will review working with layers, adjustment layers and text layers, as well as reviewing the details of resizing, sharpening, and image resolution for various output destinations. The course will be project-based with several short assignments and a final project of the students’ choosing. A lab fee is charged for this course.\n\n      less description for PHTI-UT 1255 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1260",
            "course_name": "",
            "description": "PHTI-UT 1260\n\n   Advanced Photoshop\n\nOffered Spring only. Prerequisite: Photography & Imaging III.                         Through demonstrations and hands-on instruction, students will learn how to further control and expand their use of Photoshop - emphasis will be on photographic concerns, of tonality and color control as well as exploring the creative potential of constructing images from photographic source material and graphic design principals. A brief review of basic concepts and file formats and a discussion of workflow including the integration of the enhanced Adobe Bridge will start the semester. We will review color c...\n\n      more description for PHTI-UT 1260 »\n\n      \n\n\n\nOffered Spring only. Prerequisite: Photography & Imaging III.                         Through demonstrations and hands-on instruction, students will learn how to further control and expand their use of Photoshop - emphasis will be on photographic concerns, of tonality and color control as well as exploring the creative potential of constructing images from photographic source material and graphic design principals. A brief review of basic concepts and file formats and a discussion of workflow including the integration of the enhanced Adobe Bridge will start the semester. We will review color correction and various selection refinements. Layering and layer masks will be extensively examined and we will touch on collage methods. We will also look at automating routine actions to streamline your workflow. A thorough review of camera RAW image processing for greater control and retention of highlights and shadow detail will also be included.  This course requires a nonrefundable lab fee.\n\n      less description for PHTI-UT 1260 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1270",
            "course_name": "",
            "description": "PHTI-UT 1270\n\n   Digital Tools for Documentary Practice\n\nThis course will explore a variety of digital media tools that are useful for a documentary photographer. The class will explore issues relating to the digital camera, as well as to image capture, preservation, presentation and transmission. Lighting, audio interviewing, and the production of short videos will also be covered at a basic level. Students work on several small assignments to experiment with software and hardware, and will have the opportunity to complete a small project of their own. This course is intended to give students a fundamental understanding of the efficiencies and poss...\n\n      more description for PHTI-UT 1270 »\n\n      \n\n\n\nThis course will explore a variety of digital media tools that are useful for a documentary photographer. The class will explore issues relating to the digital camera, as well as to image capture, preservation, presentation and transmission. Lighting, audio interviewing, and the production of short videos will also be covered at a basic level. Students work on several small assignments to experiment with software and hardware, and will have the opportunity to complete a small project of their own. This course is intended to give students a fundamental understanding of the efficiencies and possibilities of the digital realm. This class is specifically intended for students enrolled in Photography and Human Rights courses, but is open to others as well. This course is charged a lab fee of $175.00.\n\n      less description for PHTI-UT 1270 «",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1300",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "PHTI-UT 1300\n\n   Internship\n\nPrerequisite: Open to Juniors and Seniors only.                                                     All students intending to pursue an internship are required to turn in the forms available through the internship link on this website to Mark Jenkinson, Internship Advisor, scheduled during the first week of classes for the semester. Students CANNOT register themselves through Albert; with Mark Jenkinson's signature, students may then turn the registration form to Irene for registration on Albert.     Juniors and seniors gain valuable work experience and insight into the professional world thro...\n\n      more description for PHTI-UT 1300 »\n\n      \n\n\n\nPrerequisite: Open to Juniors and Seniors only.                                                     All students intending to pursue an internship are required to turn in the forms available through the internship link on this website to Mark Jenkinson, Internship Advisor, scheduled during the first week of classes for the semester. Students CANNOT register themselves through Albert; with Mark Jenkinson's signature, students may then turn the registration form to Irene for registration on Albert.     Juniors and seniors gain valuable work experience and insight into the professional world through this opportunity that bridges the academic and professional worlds. Students have been enrolled in internships at museums, art galleries, commercial photography studios, major publications and with artists. Faculty advisor Mark Jenkinson facilitates the internship placement with regard to the student's interests as well as ensures the educational propriety of the work. Credits vary according to the nature of the placement. Instructions and forms for internships arelisted under Related Links. Students are registered by the department upon receipt of a signed Internship Agreement Form. A maximum of 6 credits total in Internship is allowed during your student career.\n\n      less description for PHTI-UT 1300 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1301",
            "course_name": "Internship",
            "description": "PHTI-UT 1301 Internship",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1302",
            "course_name": "Internship",
            "description": "PHTI-UT 1302 Internship",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1350",
            "course_name": "Chemistry for Photo",
            "description": "PHTI-UT 1350 Chemistry for Photo",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1400",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14102",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Cuomo, Yolanda",
                    "time": "Wed 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1400\n\n   The Anatomy of the Book\n\nOffered Fall only. Prerequisite: Juniors and Seniors only. Knowledge of Photoshop.                               \n\nThis course needs an enrollment of 8 or more to run. Students may petition to take this course for 2 credits. This class conceives and produces the senior catalog. The workshop nature of the class stresses collaboration and experimentation.  Lectures include topics such as making type beautiful, process as place, being a visual scavenger.  In addition to exploring the creative process, workshops in Indesign, type design, photo editing, and pagination will be taught throughout the ...\n\n      more description for PHTI-UT 1400 »\n\n      \n\n\n\nOffered Fall only. Prerequisite: Juniors and Seniors only. Knowledge of Photoshop.                               \n\nThis course needs an enrollment of 8 or more to run. Students may petition to take this course for 2 credits. This class conceives and produces the senior catalog. The workshop nature of the class stresses collaboration and experimentation.  Lectures include topics such as making type beautiful, process as place, being a visual scavenger.  In addition to exploring the creative process, workshops in Indesign, type design, photo editing, and pagination will be taught throughout the semester.  Students will learn the craft and execute a handmade book.  After the design process is completed, students begin the production process: choosing paper,  constructing digital files, coordinating with a printer, and working out printing budgets.\n\n      less description for PHTI-UT 1400 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1500",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "14103",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "PHTI-UT 1500 Independent Study \nIndependent studies are only granted in special cases, not as substitutes for our advanced classes. Students must propose their project to a faculty advisor and after approval, must submit a specific written proposal for full faculty review. The proposal should outline project concepts, expectations, and goals as well as desired credits and plans for meeting with advisor. (Submit a written copy with advisor's signature and also email the proposal to liz.andrews@nyu.edu for circulation.) Students are registered by the department upon approval of the curriculum committee.",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1501",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "14104",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study Abroad",
            "description": "PHTI-UT 1501 Independent Study Abroad \nIndependent studies are only granted in special cases, not as substitutes for our advanced classes. Students must propose their project to a faculty advisor and after approval, must submit a specific written proposal for full faculty review. The proposal should outline project concepts, expectations, and goals as well as desired credits and plans for meeting with advisor. (Submit a written copy with advisor's signature and also email the proposal to liz.andrews@nyu.edu for circulation.) Students are registered by the department upon approval of the curriculum committee.",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 1502",
            "course_name": "Adv Independent Study",
            "description": "PHTI-UT 1502 Adv Independent Study",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1550",
            "course_name": "Independent Projects",
            "description": "PHTI-UT 1550 Independent Projects",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1555",
            "course_name": "Ind Projects France: Photo Production",
            "description": "PHTI-UT 1555 Ind Projects France: Photo Production",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1600",
            "course_name": "Guest Artist Workshop",
            "description": "PHTI-UT 1600 Guest Artist Workshop",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1601",
            "course_name": "Guest Artist Seminar",
            "description": "PHTI-UT 1601 Guest Artist Seminar",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1610",
            "course_name": "Master'S Photo",
            "description": "PHTI-UT 1610 Master'S Photo",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 1650",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14654",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Brielmaier, Isolde",
                    "time": "Tue 6.00 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PHTI-UT 1650\n\n   Visual Culture Colloquium\n\nPrerequisite: Junior standing, Photography & Imaging III. \nPhotographic media participates in a pervasive, diverse and influential manner in contemporary society. As a means of considering the relevant issues of photography, this course will derive from a series of weekly lectures offered by established practitioners and professionals. \nThis course focuses on the work and practices of working photographers from their own perspective.  Invited guests from a range of photographic fields including contemporary art, commercial/advertising, fashion, and photo-journalism/editorial, speak on their ow...\n\n      more description for PHTI-UT 1650 »\n\n      \n\n\n\nPrerequisite: Junior standing, Photography & Imaging III. \nPhotographic media participates in a pervasive, diverse and influential manner in contemporary society. As a means of considering the relevant issues of photography, this course will derive from a series of weekly lectures offered by established practitioners and professionals. \nThis course focuses on the work and practices of working photographers from their own perspective.  Invited guests from a range of photographic fields including contemporary art, commercial/advertising, fashion, and photo-journalism/editorial, speak on their own work, and process and critically assess and explore their position within the broad field of photography today.\nIn past semesters? series, guests to the class have included Joel Agee, Hilton Als, Larry Clark, Sheryl Conkelton, John Coplans, Stephen Frailey, Jim Goldberg, Nan Goldin, Andy Grundberg, Renee Iijima, Larry Krone, Michael Lesy, Michael Martone, Susan Meiselas, Vic Muiz, Dread Scott, Bruce Davidson, Shirin Neshat, Maggie Steber, Larry Sultan, Penelope Umbrico, Renee Cox, and Wendy Ewald.\n\n      less description for PHTI-UT 1650 «",
            "offering": true
        },
        {
            "course_id": "PHTI-UT 9001",
            "course_name": "Photography I (in English)",
            "description": "PHTI-UT 9001 Photography I (in English)",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 9901",
            "course_name": "Directed Projects Maui",
            "description": "PHTI-UT 9901 Directed Projects Maui",
            "offering": false
        },
        {
            "course_id": "PHTI-UT 9945",
            "course_name": "Digital Imaging: Maui",
            "description": "PHTI-UT 9945 Digital Imaging: Maui",
            "offering": false
        }
    ]
}