{
    "major_id": "REBS1-UC",
    "file": "./2015-2016/Schack_Undergraduate_Real_Esta(REBS1-UC).html",
    "courses": [
        {
            "course_id": "REBS1-UC 1001",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17174",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "SILV 403",
                    "time": "Thu 2.00 PM - 4.30 PM",
                    "open": true,
                    "professor": "Hallenborg, Mary"
                }
            ],
            "course_name": "Real Estate Principles",
            "description": "REBS1-UC 1001 Real Estate Principles \nThis course introduces the terminology, concepts and basic practices of real estate.  It surveys real estate law, appraisal, marketing, brokerage, management, finance, investment analysis and taxation.  Topics include property rights, valuation methods, listing agreements, purchase and sale contracts, deeds, mortgages, leases, management and development.",
            "offering": true
        },
        {
            "course_id": "REBS1-UC 1002",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17175",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "SILV 403",
                    "time": "Wed 2.00 PM - 4.30 PM",
                    "open": true,
                    "professor": "Hallenborg, Mary"
                }
            ],
            "course_name": "Real Estate Law",
            "description": "REBS1-UC 1002 Real Estate Law \nThis course examines the interplay between private property rights and governmental restrictions on private property, including eminent domain, zoning ordinances, building codes and environmental laws. Different forms of real estate business entities and co-ownership are evaluated. Students study  deeds, easements, transferable development rights, and the legal aspects of a variety of real estate related contracts, including listing agreements, letters of intent, options, purchase and sale contracts, mortgages, insurance, construction contracts, and leases.",
            "offering": true
        },
        {
            "course_id": "REBS1-UC 1005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17179",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "WAVE 369"
                }
            ],
            "course_name": "",
            "description": "REBS1-UC 1005\n\n   Real Estate Finance\n\nThis course investigates the institutions, instruments, and structures by which real estate investments are financed. It reviews capital markets, the sources and uses of real estate funds, components of a capital structure, and the role of government in real estate finance. Students apply core financial principles to real estate, and become acquainted with different methods used by professional investors to evaluate commercial real estate acquisitions and development opportunities including common formulas, financial projections and models. \nRisks and strategies employed by commercial real es...\n\n      more description for REBS1-UC 1005 »\n\n      \n\n\n\nThis course investigates the institutions, instruments, and structures by which real estate investments are financed. It reviews capital markets, the sources and uses of real estate funds, components of a capital structure, and the role of government in real estate finance. Students apply core financial principles to real estate, and become acquainted with different methods used by professional investors to evaluate commercial real estate acquisitions and development opportunities including common formulas, financial projections and models. \nRisks and strategies employed by commercial real estate investors are also reviewed.\n\n      less description for REBS1-UC 1005 «",
            "offering": true
        },
        {
            "course_id": "REBS1-UC 1009",
            "course_name": "Real Estate Valuation",
            "description": "REBS1-UC 1009 Real Estate Valuation \nThis course provides an introduction to the valuation process, and to the income, market, and cost approaches to real estate value. Topics include highest and best use analysis, depreciation, and capitalization fundamentals, including discounted cash flow analysis. Students evaluate different types of appraisal reports and apply valuation techniques to case studies.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "10109",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "25W4 C-13",
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Rosen, David"
                },
                {
                    "format": "Lecture",
                    "class_id": "17173",
                    "section": "002",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "SILV 621",
                    "time": "Thu 9.30 AM - 12.00 PM",
                    "open": true,
                    "professor": "Amsler, Shawn"
                }
            ],
            "course_name": "Real Estate Development Process",
            "description": "REBS1-UC 1010 Real Estate Development Process \nThis course provides a chronological overview of the real estate development process from idea conception to project completion. Students study principal stages of development including: preliminary planning and market analysis, feasibility studies, site selection and acquisition, deal structure, permitting and entitlements, construction, marketing, and asset management. The course also examines trends including mixed-use projects, public‐private partnerships, and transit‐oriented development.",
            "offering": true
        },
        {
            "course_id": "REBS1-UC 1012",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17177",
                    "section": "001",
                    "period": "09/03/2015 - 12/22/2015",
                    "location": null,
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "WAVE 566A"
                }
            ],
            "course_name": "Real Estate Accounting and Taxation",
            "description": "REBS1-UC 1012 Real Estate Accounting and Taxation \nThis course reviews accounting principles, concepts, rules, regulations, and reporting requirements applied to long-term construction projects and income-producing properties. It also examines the tax implications of business entity selection, basis, loss deductions, depreciation, like-kind tax-free exchanges, and various leases. Balance sheet analysis is also covered.",
            "offering": true
        },
        {
            "course_id": "REBS1-UC 1015",
            "course_name": "Market Analysis in Real Estate",
            "description": "REBS1-UC 1015 Market Analysis in Real Estate \nThis course presents methods for the measurement of demand for real estate products and projects in specific markets and neighborhoods. It studies the effects on specific markets of national, regional, and local factors such as economic change, social attitudes, changing laws and legal interpretations, and changes in individual attitudes. This course introduces appropriate data sources and modeling techniques useful in analyzing and forecasting real estate demand and supply in different markets for specific property types at specific locations.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1020",
            "course_name": "Real Estate and Sustainability",
            "description": "REBS1-UC 1020 Real Estate and Sustainability \nThis course examines the sustainability movement and the impacts it has had on the real estate industry and built environment. Sustainable construction and retrofitting methodologies, green building certifications and building codes are also discussed. Research and best practices are presented on the topics of site selection, building orientation, material selection, low-impact development, water conservation, energy efficiency and waste management. Solutions are evaluated from economic, environmental and social justice perspectives.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1025",
            "course_name": "Commercial Lease Analysis",
            "description": "REBS1-UC 1025 Commercial Lease Analysis \nThis course analyzes key lease clauses relating to rent, loss factors, use, subletting, assignment, and leasehold improvements. Various methods and cash-flow implications for allocating expenses for base building taxes, insurance, and energy consumption are examined. Sample leases are used to train students to review, abstract, and negotiate the business terms of a variety of commercial real estate leases.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1033",
            "course_name": "",
            "description": "REBS1-UC 1033\n\n   Managing the Construction Process: Cost and Project Management Systems\n\nThis course provides an introduction to the construction business, with an emphasis on cost and project management systems. Topics include organizational forms; marketing and sales; types of contracts; general contractor and construction manager contracts; the requisition process from a lender’s, owner’s, and subcontractor’s perspectives; estimating, bidding, and award practices; bonds and insurance; subcontracts and material purchasing; cash-flow life-cycle analysis; field supervision; scheduling and expediting changes, claims, and extras; community, public agency, and labor relations; compan...\n\n      more description for REBS1-UC 1033 »\n\n      \n\n\n\nThis course provides an introduction to the construction business, with an emphasis on cost and project management systems. Topics include organizational forms; marketing and sales; types of contracts; general contractor and construction manager contracts; the requisition process from a lender’s, owner’s, and subcontractor’s perspectives; estimating, bidding, and award practices; bonds and insurance; subcontracts and material purchasing; cash-flow life-cycle analysis; field supervision; scheduling and expediting changes, claims, and extras; community, public agency, and labor relations; company finances, cash management, accounting/accounting/cost control procedures; and sources of capital.\n\n      less description for REBS1-UC 1033 «",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1034",
            "course_name": "",
            "description": "REBS1-UC 1034\n\n   Planning and Scheduling: Construction Project Management Practices\n\nThis course acquaints students with analytical and quantitative techniques used in effective project management. It examines the roles of the project manager, superintendent, architect, engineer, and owner-representatives in planning and scheduling. Topics include feasibility studies, developing the project plan and network, CPM and PERT techniques, optimizing resource allocation and costs, schedule and budget control programs, plan and schedule updating and corrective action process, time/cost analysis, and network compression. Payment requisitions, project delays; labor rules and regulations...\n\n      more description for REBS1-UC 1034 »\n\n      \n\n\n\nThis course acquaints students with analytical and quantitative techniques used in effective project management. It examines the roles of the project manager, superintendent, architect, engineer, and owner-representatives in planning and scheduling. Topics include feasibility studies, developing the project plan and network, CPM and PERT techniques, optimizing resource allocation and costs, schedule and budget control programs, plan and schedule updating and corrective action process, time/cost analysis, and network compression. Payment requisitions, project delays; labor rules and regulations are also discussed.\n\n      less description for REBS1-UC 1034 «",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1040",
            "course_name": "Introduction to Risk and Portfolio Management",
            "description": "REBS1-UC 1040 Introduction to Risk and Portfolio Management \nThis course provides an understanding of the concept of portfolio management and the importance of diversification in controlling portfolio risk. It discusses modern portfolio theory and asset-pricing models to value and select from alternative investments. Students learn to quantify risk, explain and construct an optimal portfolio, apply risk/return concepts to different real estate investments, and explain how lenders, developers, and investors mitigate risk and analyze possible investments.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1041",
            "course_name": "Asset Management",
            "description": "REBS1-UC 1041 Asset Management \nThis course presents techniques for managing a single real estate asset as well as a diverse portfolio of real estate assets. It reviews strategies to increase net operating income and to create and preserve asset value. Topics include identifying owner investment goals, strategic planning, cost control techniques, financial reporting, leasing, and operations.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1042",
            "course_name": "Real Estate Capital Markets and Corporate Finance",
            "description": "REBS1-UC 1042 Real Estate Capital Markets and Corporate Finance \nThis course introduces students to the debt and equity real estate capital markets. Economic investment drivers, financing vehicles, and public and private sources of capital are discussed. Students gain an understanding of the ebb and flow of capital to real estate and its implications for owners, lenders, and investors. Also covered is real estate securitization, and the role of rating agencies, securities analysts and agents.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1045",
            "course_name": "Comparative Real Estate Markets from a Global Perspective",
            "description": "REBS1-UC 1045 Comparative Real Estate Markets from a Global Perspective \nThis course analyzes the risks and benefits of cross-border commercial real estate investments from an institutional perspective.  Students evaluate factors that affect the real estate economies in key international markets in Asia, Europe, and Latin America through the study of local land use controls, private property rights, contract enforcement, transaction costs and currency risks. Investment vehicles, urbanization trends, clusters, and the rise of megacities are also discussed.",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 1050",
            "course_name": "",
            "description": "REBS1-UC 1050\n\n   Real Estate Urban Economic Development\n\nThis course explores the economic, social, and political forces that shape cities, real estate demand, and urban economic development.  Students examine urban economic theory and practice, including the methods by which local economic development projects are created, evaluated, and implemented. The financing of urban economic development projects is also considered. Topics include public-private real estate development partnerships, development on public land, zoning and urban renewal, tax incentives, exactions, affordable housing, public infrastructure, landmark preservation and community fa...\n\n      more description for REBS1-UC 1050 »\n\n      \n\n\n\nThis course explores the economic, social, and political forces that shape cities, real estate demand, and urban economic development.  Students examine urban economic theory and practice, including the methods by which local economic development projects are created, evaluated, and implemented. The financing of urban economic development projects is also considered. Topics include public-private real estate development partnerships, development on public land, zoning and urban renewal, tax incentives, exactions, affordable housing, public infrastructure, landmark preservation and community facilities.\n\n      less description for REBS1-UC 1050 «",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 7990",
            "course_name": "Special Topics in Real Estate",
            "description": "REBS1-UC 7990 Special Topics in Real Estate \nThis course offers intensive study of specific topics in Real Estate focusing on different themes. (As offered).",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 7991",
            "course_name": "",
            "description": "REBS1-UC 7991\n\n   Real Estate Senior Project\n\nThis course allows students to develop a real estate project under the guidance of a faculty member. Experience acquired through a real estate internship will be a valuable input to this project. The seminar requires regular class attendance to discuss and document project progress, as well as individual meetings with the instructor. The project may be in any one of the degree’s various concentration areas. Projects must be the student’s individual, original work and include the product, the technical documentation, and a learning experience essay summarizing the process and skills used. In ad...\n\n      more description for REBS1-UC 7991 »\n\n      \n\n\n\nThis course allows students to develop a real estate project under the guidance of a faculty member. Experience acquired through a real estate internship will be a valuable input to this project. The seminar requires regular class attendance to discuss and document project progress, as well as individual meetings with the instructor. The project may be in any one of the degree’s various concentration areas. Projects must be the student’s individual, original work and include the product, the technical documentation, and a learning experience essay summarizing the process and skills used. In addition, students present their projects orally to a jury panel at the end of the semester.\n\n      less description for REBS1-UC 7991 «",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 7992",
            "course_name": "",
            "description": "REBS1-UC 7992\n\n   Real Estate Internship\n\nThe internship project provides advanced students with an opportunity to test and apply the theories and concepts of the classroom in an actual public or private real estate industry setting. Students are required to log at least eight hours per week of “on-the-job” experience during the semester. In addition, students meet regularly with an internship advisor, maintain weekly logs or journals, and complete a final learning-experience essay summarizing the outcome. (Students’ regular employment cannot serve as an internship.  All internship proposals must be reviewed and approved by the intern...\n\n      more description for REBS1-UC 7992 »\n\n      \n\n\n\nThe internship project provides advanced students with an opportunity to test and apply the theories and concepts of the classroom in an actual public or private real estate industry setting. Students are required to log at least eight hours per week of “on-the-job” experience during the semester. In addition, students meet regularly with an internship advisor, maintain weekly logs or journals, and complete a final learning-experience essay summarizing the outcome. (Students’ regular employment cannot serve as an internship.  All internship proposals must be reviewed and approved by the internship advisor prior to registration of the course).\n\n      less description for REBS1-UC 7992 «",
            "offering": false
        },
        {
            "course_id": "REBS1-UC 7993",
            "course_name": "Real Estate Independent Study",
            "description": "REBS1-UC 7993 Real Estate Independent Study \nStudents conduct an independent investigation of a selected topic outside the boundaries of the classroom.  Independent study allows students to pursue specialized interests, within the framework of the discipline, that are not covered in existing courses. Although self-directed, students work closely with a faculty member who guides and evaluates their work.",
            "offering": false
        }
    ]
}