{
    "major_id": "SOC-UA",
    "file": "./2015-2016/Sociology_(SOC-UA).html",
    "courses": [
        {
            "course_id": "SOC-UA 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "8538",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "CANT 200",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Arum, Richard"
                },
                {
                    "format": "Recitation",
                    "class_id": "8539",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "25W4 C-11"
                },
                {
                    "format": "Recitation",
                    "class_id": "8540",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "194M 204"
                },
                {
                    "format": "Recitation",
                    "class_id": "8541",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "194M 205"
                },
                {
                    "format": "Recitation",
                    "class_id": "8542",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "194M 206"
                },
                {
                    "format": "Recitation",
                    "class_id": "8543",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "194M 301"
                },
                {
                    "format": "Recitation",
                    "class_id": "8544",
                    "section": "007",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "194M 208"
                },
                {
                    "format": "Recitation",
                    "class_id": "8545",
                    "section": "008",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "25W4 C-4"
                },
                {
                    "format": "Recitation",
                    "class_id": "8546",
                    "section": "009",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "194M 204"
                },
                {
                    "format": "Recitation",
                    "class_id": "8547",
                    "section": "010",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "194M 205"
                },
                {
                    "format": "Recitation",
                    "class_id": "8548",
                    "section": "011",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "194M 209"
                },
                {
                    "format": "Recitation",
                    "class_id": "8549",
                    "section": "012",
                    "period": "09/17/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "7E12 LL27"
                },
                {
                    "format": "Recitation",
                    "class_id": "8550",
                    "section": "013",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "194M 308"
                }
            ],
            "course_name": "Intro to Sociology",
            "description": "SOC-UA    1 Intro to Sociology \nOffered every semester. 4 points. Survey of the field of sociology: its basic concepts, theories, and research orientation. Threshold course that provides the student with insights into the social factors in human life. Topics include social interaction, socialization, culture, social structure, stratification, political power, deviance, social institutions, and social change.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 2",
            "course_name": "",
            "description": "SOC-UA    2\n\n   Intro to Sociology (Honors)\n\nHonors course. Lehman, Persell. Offered every year. 4 points. How sociologists view the world compared to common sense understandings. Exposes students to the intellectual strategies at the center of modern sociology, but also shows that sociological analysis does not occur in a historical vacuum. Sociology attempts to explain events, but it is also a historical product like other human belief systems. Addresses the human condition: where we came from, where we are, where we are headed, and why. Same topics as V93.0001, but more intensive. Recommended for students who would like to be challeng...\n\n      more description for SOC-UA    2 »\n\n      \n\n\n\nHonors course. Lehman, Persell. Offered every year. 4 points. How sociologists view the world compared to common sense understandings. Exposes students to the intellectual strategies at the center of modern sociology, but also shows that sociological analysis does not occur in a historical vacuum. Sociology attempts to explain events, but it is also a historical product like other human belief systems. Addresses the human condition: where we came from, where we are, where we are headed, and why. Same topics as V93.0001, but more intensive. Recommended for students who would like to be challenged.\n\n      less description for SOC-UA    2 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 3",
            "course_name": "Introduction to Sociology: Great Books",
            "description": "SOC-UA    3 Introduction to Sociology: Great Books \nOriginal thinkers in sociology?their pathbreaking works and challenging views. Critical explanation and analysis of the principles and main themes of sociology as they appear in these works. Topics: the social bases of knowledge, the development of urban societies, social structure and movements, group conflict, bureaucratic organization, the nature of authority, the social roots of human nature, suicide, power and politics, and race, class, and gender.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 4",
            "course_name": "Historical Sociology",
            "description": "SOC-UA    4 Historical Sociology \nExamines the prime facets in the social and cultural transformation of Western Europe from the Middle Ages to present day and the models that have been used to explain phases and dimensions of the social-historical structure. Examines the methods and possibilities of historical sociology.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 10",
            "course_name": "Sociological Inquiry",
            "description": "SOC-UA   10 Sociological Inquiry",
            "offering": false
        },
        {
            "course_id": "SOC-UA 19",
            "course_name": "Public Opinion & Social Change",
            "description": "SOC-UA   19 Public Opinion & Social Change",
            "offering": false
        },
        {
            "course_id": "SOC-UA 20",
            "course_name": "Information Skills for The Social Sciences",
            "description": "SOC-UA   20 Information Skills for The Social Sciences",
            "offering": false
        },
        {
            "course_id": "SOC-UA 21",
            "course_name": "Sex and Gender",
            "description": "SOC-UA   21 Sex and Gender \nWhat forms does gender inequality take, and how can it best be explained? How and why are the relations between women and men changing? What are the most important social, political, and economic consequences of this ?gender revolution?? The course provides answers to these questions by examining a range of theories about gender in light of empirical findings about women?s and men?s behavior.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 22",
            "course_name": "Intro to Gender & Sexuality",
            "description": "SOC-UA   22 Intro to Gender & Sexuality",
            "offering": false
        },
        {
            "course_id": "SOC-UA 23",
            "course_name": "",
            "description": "SOC-UA   23\n\n   Sex and Love in Modern Society\n\nThis course illustrates how social factors influence even the very personal realms of sex and love, and how these topics can be studied scientifically. Focusing on modern societies, topics include dating and romantic relationships; relational and casual sex; contraception and unintended pregnancy; heterosexual, gay, lesbian, and bisexual sexualities; cultural attitudes toward sexuality; changing meanings of marriage.  The aim of the course is to expose students to sociological research on sexuality and love.  Students often like taking courses on this topic because they are personally interest...\n\n      more description for SOC-UA   23 »\n\n      \n\n\n\nThis course illustrates how social factors influence even the very personal realms of sex and love, and how these topics can be studied scientifically. Focusing on modern societies, topics include dating and romantic relationships; relational and casual sex; contraception and unintended pregnancy; heterosexual, gay, lesbian, and bisexual sexualities; cultural attitudes toward sexuality; changing meanings of marriage.  The aim of the course is to expose students to sociological research on sexuality and love.  Students often like taking courses on this topic because they are personally interested in the topic.  I am happy to have such students, but I explain at the outset that the fact that we are studying a “fun” topic does not mean that this is not a rigorous course.  As with other courses, the focus should be dual:  that they are exposed to the substance of research on the topic, and that they learn about the way social scientists do research and draw conclusions from data analysis.\n\n      less description for SOC-UA   23 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 30",
            "course_name": "Art of The City: a Sociological Perspective",
            "description": "SOC-UA   30 Art of The City: a Sociological Perspective",
            "offering": false
        },
        {
            "course_id": "SOC-UA 53",
            "course_name": "Sociology of Spain",
            "description": "SOC-UA   53 Sociology of Spain",
            "offering": false
        },
        {
            "course_id": "SOC-UA 95",
            "course_name": "Sociology of Spain",
            "description": "SOC-UA   95 Sociology of Spain",
            "offering": false
        },
        {
            "course_id": "SOC-UA 111",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7458",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL150",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Abend, Gabriel"
                },
                {
                    "format": "Recitation",
                    "class_id": "7459",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "25W4 C-17"
                },
                {
                    "format": "Recitation",
                    "class_id": "7460",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "194M 204"
                }
            ],
            "course_name": "Sociological Theory",
            "description": "SOC-UA  111 Sociological Theory \nPrerequisite: one previous course in sociology, junior standing, or permission of the instructor. Brenner, Corradi, Ertman, Goodwin, Lukes. Offered every semester. 4 points. Examines the nature of sociological theory and the value of and problems in theorizing. Provides a detailed analysis of the writings of major social theorists since the 19th century in both Europe and America: Tocqueville, Marx, Durkheim, Weber, Simmel, Freud, Mead, Parsons, Merton, Goffman, Habermas, Giddens, Alexander, and Bourdieu.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 112",
            "course_name": "Soc Science Theorizing",
            "description": "SOC-UA  112 Soc Science Theorizing",
            "offering": false
        },
        {
            "course_id": "SOC-UA 118",
            "course_name": "Communications: Class, Culture & The Media",
            "description": "SOC-UA  118 Communications: Class, Culture & The Media \nThe media and mass communication in social context. Deals primarily with contemporary American media: television, radio, newspapers, magazines, and film. Formal and informal patterns of media control, content, audiences, and effect. The persuasive power of the media, the role of the media in elections, and the effects on crime and violence. Does not deal with instructional media or aesthetic criticism.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 130",
            "course_name": "Groups and Organizations",
            "description": "SOC-UA  130 Groups and Organizations \nMajor organizational theories (from Marx and Weber to Taylorism and modern decision and systems theory). Examines case studies illustrating the various approaches together with the major methods of organizational analysis. Explores links between organizations and their environments as well as alternatives to bureaucracy.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 133",
            "course_name": "Comparative Modern Societies",
            "description": "SOC-UA  133 Comparative Modern Societies \nThe theory and methodology of the study of modern societies and their major components. Examines several modern societies with different cultural backgrounds as case studies with respect to the theories and propositions learned. Attempts to synthesize sociologically the nature of modernity and its implications for the individual, his or her society, and the world.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 134",
            "course_name": "Globalization and The Nation-State",
            "description": "SOC-UA  134 Globalization and The Nation-State",
            "offering": false
        },
        {
            "course_id": "SOC-UA 135",
            "course_name": "",
            "description": "SOC-UA  135\n\n   Race and Ethnicity\n\nWhat is 'race' exactly?  Defining the concept presents a real challenge.  This class explores what race and ethnicity mean, beginning with historical ideas about human difference.  Comparing American beliefs and practices to those found in other societies, we will pay special attention to the particular notions and hierarchies of race that emerge in different times and places.  The course also investigates the roles that institutions like the media, the arts, the state, and the sciences play in shaping our understandings of race and ethnicity.  We will conclude by considering the predictions t...\n\n      more description for SOC-UA  135 »\n\n      \n\n\n\nWhat is 'race' exactly?  Defining the concept presents a real challenge.  This class explores what race and ethnicity mean, beginning with historical ideas about human difference.  Comparing American beliefs and practices to those found in other societies, we will pay special attention to the particular notions and hierarchies of race that emerge in different times and places.  The course also investigates the roles that institutions like the media, the arts, the state, and the sciences play in shaping our understandings of race and ethnicity.  We will conclude by considering the predictions that scholars have made about the future of racial stratification in the United States.\n\n      less description for SOC-UA  135 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 136",
            "course_name": "Blacks in American  Society",
            "description": "SOC-UA  136 Blacks in American  Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 137",
            "course_name": "",
            "description": "SOC-UA  137\n\n   Wealth, Power & Status: Inequality in Society\n\nPrerequisite: Introduction to Sociology (V93.0001) recommended but not required. Chibber, Conley, Guthrie, Heyns, Jackson, Manza, Persell, Torche. Offered every year. 4 points. Sociological overview of the causes and consequences of social inequality. Topics include the concepts, theories, and measures of inequality; race, gender, and other caste systems; social mobility and social change; institutional supports for stratification, including family, schooling, and work; political power and the role of elites; and comparative patterns of inequality, including capitalist, socialist, and postsoci...\n\n      more description for SOC-UA  137 »\n\n      \n\n\n\nPrerequisite: Introduction to Sociology (V93.0001) recommended but not required. Chibber, Conley, Guthrie, Heyns, Jackson, Manza, Persell, Torche. Offered every year. 4 points. Sociological overview of the causes and consequences of social inequality. Topics include the concepts, theories, and measures of inequality; race, gender, and other caste systems; social mobility and social change; institutional supports for stratification, including family, schooling, and work; political power and the role of elites; and comparative patterns of inequality, including capitalist, socialist, and postsocialist societies.\n\n      less description for SOC-UA  137 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 138",
            "course_name": "Collective Memory in Contemporary Europe",
            "description": "SOC-UA  138 Collective Memory in Contemporary Europe",
            "offering": false
        },
        {
            "course_id": "SOC-UA 139",
            "course_name": "",
            "description": "SOC-UA  139\n\n   The American Ghetto\n\nThis course examines the concept of the “ghetto,” with particular focus on urban communities in the post World War II era. We will use empirical research, literature and other forms of text and media to consider the following questions: What is a ghetto, and what forms has the ghetto taken in the United States? Is there something unique about urban, African-American ghettos? How and why did urban ghettos emerge, and how have they changed over time? What, if any, are the consequences of the American ghetto for racial and economic inequality in America? What role has the state played in the prod...\n\n      more description for SOC-UA  139 »\n\n      \n\n\n\nThis course examines the concept of the “ghetto,” with particular focus on urban communities in the post World War II era. We will use empirical research, literature and other forms of text and media to consider the following questions: What is a ghetto, and what forms has the ghetto taken in the United States? Is there something unique about urban, African-American ghettos? How and why did urban ghettos emerge, and how have they changed over time? What, if any, are the consequences of the American ghetto for racial and economic inequality in America? What role has the state played in the production, maintenance or dismantling of the ghetto, and what role can/should it play?\n\n      less description for SOC-UA  139 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 141",
            "course_name": "Social Change",
            "description": "SOC-UA  141 Social Change \nConcepts and data tools for the study of social change with an emphasis on the United States. Lectures will cover both substance and methods; students will do projects that apply what they have learned to public data on social change. Goals of the course include the search for evidence, integrating theory and evidence, and social science tools for analyzing change.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 148",
            "course_name": "The Holocaust & Israeli Society",
            "description": "SOC-UA  148 The Holocaust & Israeli Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 150",
            "course_name": "Women and Work",
            "description": "SOC-UA  150 Women and Work \nThe occupational socialization of women in the domestic labor force and the labor force as it is commonly conceptualized by economists and other social scientists. How gender socialization and constraints affect women?s labor force participation and how the social and cultural conditions of American society give rise to and perpetuate occupational discrimination. Considers some theoretical explanations.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 186",
            "course_name": "Immigration in Israeli Society",
            "description": "SOC-UA  186 Immigration in Israeli Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 187",
            "course_name": "Women in Israeli Society",
            "description": "SOC-UA  187 Women in Israeli Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 201",
            "course_name": "Social Psychology",
            "description": "SOC-UA  201 Social Psychology \nExamines emotional experience and expression; language and communication; self, identity, and biography; time conceptions, experiences, and practices; and the variations in the character of the ?individual? historically and culturally. Each area of discussion and analysis is concerned with processes of social interaction, social organization, and the socialization of persons. Focuses special attention on organizational, historical, and ideological contexts.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 202",
            "course_name": "Social Psychol of Time",
            "description": "SOC-UA  202 Social Psychol of Time",
            "offering": false
        },
        {
            "course_id": "SOC-UA 205",
            "course_name": "Social Movements, Protest, and Conflict",
            "description": "SOC-UA  205 Social Movements, Protest, and Conflict \nWhy and how do people form groups to change their society? Analyzes reformist, revolutionary, and nationalistic struggles; their typical patterns and cycles; and the role of leaders as well as symbols, slogans, and ideologies. Concentrates on recent social movements such as civil rights, feminism, ecology, the antinuclear movement, and the New Right; asks how these differ from workers? movements. Examines reformist versus radical tendencies in political movements.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 206",
            "course_name": "Sociology of Developing Countries",
            "description": "SOC-UA  206 Sociology of Developing Countries",
            "offering": false
        },
        {
            "course_id": "SOC-UA 207",
            "course_name": "Social Aspects of Mental Health & Illness",
            "description": "SOC-UA  207 Social Aspects of Mental Health & Illness",
            "offering": false
        },
        {
            "course_id": "SOC-UA 208",
            "course_name": "Islam & The West",
            "description": "SOC-UA  208 Islam & The West",
            "offering": false
        },
        {
            "course_id": "SOC-UA 251",
            "course_name": "Tpcs: Human Rights & Justice",
            "description": "SOC-UA  251 Tpcs: Human Rights & Justice",
            "offering": false
        },
        {
            "course_id": "SOC-UA 252",
            "course_name": "Topics in Law & Society",
            "description": "SOC-UA  252 Topics in Law & Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 301",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7461",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 202",
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Haney, Lynne"
                },
                {
                    "format": "Laboratory",
                    "class_id": "7462",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "12WV L111"
                },
                {
                    "format": "Laboratory",
                    "class_id": "7463",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "194M 304"
                }
            ],
            "course_name": "Research Methods",
            "description": "SOC-UA  301 Research Methods \nOffered every semester. 4 points. Examines the several methodologies employed in sociological analysis. Studies the relationship between the sociological question raised and the method employed. Some methods covered include survey design and analysis, unobtrusive measures, historical sociology, interviews, content analysis, and participant observation. Introduc-tion to methods of quantitative data processing.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 302",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7464",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 518",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Maisel, Richard"
                },
                {
                    "format": "Laboratory",
                    "class_id": "7465",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "12WV L111"
                },
                {
                    "format": "Laboratory",
                    "class_id": "7466",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "12WV L111"
                }
            ],
            "course_name": "Statistics for Social Research",
            "description": "SOC-UA  302 Statistics for Social Research \nGives students in the social sciences (sociology, anthropology, political science, and metropolitan studies) an introduction to the logic and methods of descriptive and inferential statistics with social science applications. Deals with univariate and bivariate statistics and introduces multivariate methods. Problems of causal inference. Computer computation.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 313",
            "course_name": "Social Policy in Modern Societies",
            "description": "SOC-UA  313 Social Policy in Modern Societies \nExamination of the controversies and research concerning the development of welfare states and public social provision. Special attention to the U.S. public social spending system, in historical and comparative perspective. Explanations of developments in social policies and an assessment of their applicability to the American welfare state and those of other societies.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 386",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7563",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL23",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Chibber, Vivek"
                },
                {
                    "format": "Recitation",
                    "class_id": "7809",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "SILV 507"
                },
                {
                    "format": "Recitation",
                    "class_id": "7810",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "7E12 129"
                }
            ],
            "course_name": "American Capitalism in theory and Practice",
            "description": "SOC-UA  386 American Capitalism in theory and Practice",
            "offering": true
        },
        {
            "course_id": "SOC-UA 412",
            "course_name": "Sociology of Occupations and Professions",
            "description": "SOC-UA  412 Sociology of Occupations and Professions \nHeyns. Offered every three years. 4 points. Evaluation of definitions, nature, and development of occupations and professions. Occupational associations such as guilds, trade associations, and labor unions. Individual personalities and their relations to occupational identities; concepts of mobility; career and career patterns; how occupations maintain control over members? behavior; how they relate to the wider community; and how they influence family patterns, lifestyle, and leisure time.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 413",
            "course_name": "Law and Society",
            "description": "SOC-UA  413 Law and Society \nSociological perspectives on law and legal institutions: the meaning and complexity of legal issues; the relation between law and social change; the effects of law; uses of law to overcome social disadvantage. Topics: ?limits of law,? legal disputes and the courts, regulation, comparative legal systems, legal education, organization of legal work, and lawyers? careers.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 414",
            "course_name": "Sociology of Medicine",
            "description": "SOC-UA  414 Sociology of Medicine \nThe goal is to map out the social terrain of medicine: the health care professions, health care systems, illness, and healing. Employs a historical approach to uncover the evolution of health care in the United States and evaluate how sickness and healing are socially constructed and organized. Explores how competing and changing social institutions have reshaped the social landscape of living and dying.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 415",
            "course_name": "Sociology of Education",
            "description": "SOC-UA  415 Sociology of Education \nExamines the relationship between education and other societal institutions in America and other nations. Considers such educational ideas as IQ, merit, curriculum, tracking, and learning, as well as the bureaucratic organization of education as sociologically problematic. Analyzes the role of teachers, their expectations, and how they interact with students?particularly those of different social genders, classes, and ethnic groups.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 416",
            "course_name": "Soc of The Legal Profession",
            "description": "SOC-UA  416 Soc of The Legal Profession",
            "offering": false
        },
        {
            "course_id": "SOC-UA 417",
            "course_name": "The Sociology of Law",
            "description": "SOC-UA  417 The Sociology of Law \nSociological perspectives on law and legal institutions: the meaning and complexity of legal issues; the relation between law and social change; the effects of law; uses of law to overcome social disadvantage. Topics: \"limits of law,\" legal disputes and the courts, regulation, comparative legal systems, legal education, organization of legal work, and lawyers' careers.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 432",
            "course_name": "Religion and Society",
            "description": "SOC-UA  432 Religion and Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 433",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16714",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 361",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Corradi, Juan"
                },
                {
                    "format": "Recitation",
                    "class_id": "16715",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "295L 4130"
                },
                {
                    "format": "Recitation",
                    "class_id": "16716",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "295L 4130"
                }
            ],
            "course_name": "Sociology of Music, Art & Literature",
            "description": "SOC-UA  433 Sociology of Music, Art & Literature \nCorradi, Ertman. Offered every two years. 4 points. Production, distribution, and consumption of music, art, and literature in their social contexts.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 434",
            "course_name": "Sociology of Fashion",
            "description": "SOC-UA  434 Sociology of Fashion",
            "offering": false
        },
        {
            "course_id": "SOC-UA 451",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16718",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 305",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Wu, Lawrence"
                },
                {
                    "format": "Recitation",
                    "class_id": "16719",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "25W4 C-10"
                },
                {
                    "format": "Recitation",
                    "class_id": "16720",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "25W4 C-9"
                }
            ],
            "course_name": "The Family",
            "description": "SOC-UA  451 The Family \nIntroduction to the sociology of family life. Addresses a range of questions: What is the relationship between family life and social arrangements outside the family (e.g., in the workplace, the economy, the government)? How is the division of labor in the family related to gender, age, class, and ethnic inequality? Why and how have families changed historically? What are the contours of contemporary American families, and why are they changing?",
            "offering": true
        },
        {
            "course_id": "SOC-UA 452",
            "course_name": "Immigration",
            "description": "SOC-UA  452 Immigration \nAfter a brief historical study of immigration trends, this course focuses on the causes and processes of contemporary international migration; the economic incorporation of new immigrants into the U.S. economy; the participation and impact of immigrants on the political process; the formulation and practice of immigration law; intergroup relations between immigrants and native-born Americans; and the construction of new racial, ethnic, class, gender, and sexual identities.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 453",
            "course_name": "Race, Immigration and Cities",
            "description": "SOC-UA  453 Race, Immigration and Cities",
            "offering": false
        },
        {
            "course_id": "SOC-UA 460",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "8557",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC9",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Sharkey, Patrick"
                },
                {
                    "format": "Recitation",
                    "class_id": "8558",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "SILV 405"
                },
                {
                    "format": "Recitation",
                    "class_id": "8559",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "BOBS LL138"
                }
            ],
            "course_name": "Cities, Communities, & Urban Life:",
            "description": "SOC-UA  460 Cities, Communities, & Urban Life: \nIntroduction to urban sociology. Historical development of American cities and theories about cities. Ongoing processes of urban community life. Are cities sites of individual opportunity and rich communal life, or are they sources of individual pathology and community decline? What social, economic, and political factors promote one outcome or the other? How do different groups fare in the urban context, and why?",
            "offering": true
        },
        {
            "course_id": "SOC-UA 464",
            "course_name": "Family and City: Soc Implic of Demogr Cha",
            "description": "SOC-UA  464 Family and City: Soc Implic of Demogr Cha",
            "offering": false
        },
        {
            "course_id": "SOC-UA 465",
            "course_name": "",
            "description": "SOC-UA  465\n\n   The Sociology of Childhood\n\nExplores the theories of Aries, Rousseau, and Locke to understand and compare children as miniature adults, as symbolic figures representing the state of nature or innocence, and as essential to the discourse and limits of human rights. Examines the origins and development of services for children, beginning with juvenile courts, children?s hospitals, asylums for orphans, and homes for the dependent in 19th-century America. Aims to enlarge our vision of childhood by examining diverse institutions and practitioners in the public realm, beyond families and schools. Compares the emergence and dev...\n\n      more description for SOC-UA  465 »\n\n      \n\n\n\nExplores the theories of Aries, Rousseau, and Locke to understand and compare children as miniature adults, as symbolic figures representing the state of nature or innocence, and as essential to the discourse and limits of human rights. Examines the origins and development of services for children, beginning with juvenile courts, children?s hospitals, asylums for orphans, and homes for the dependent in 19th-century America. Aims to enlarge our vision of childhood by examining diverse institutions and practitioners in the public realm, beyond families and schools. Compares the emergence and development of specialized services for children with other forms of professionalism, particularly in medicine, law, and social welfare.\n\n      less description for SOC-UA  465 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 471",
            "course_name": "Politics, Power, and Society",
            "description": "SOC-UA  471 Politics, Power, and Society \nThe nature and dimensions of power in society. Theoretical and empirical material dealing with national power structures of the contemporary United States and with power in local communities. Topics: the iron law of oligarchy, theoretical and empirical considerations of democracy, totalitarianism, mass society theories, voting and political participation, the political and social dynamics of advanced and developing societies, and the political role of intellectuals. Considers selected models for political analysis.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 472",
            "course_name": "",
            "description": "SOC-UA  472\n\n   The Sociology of Conflict and War\n\nWar is a type of social conflict, a form of organized violence that is bloody, persistent, and widespread. War is a central experience of humanity. Consider this: in its 238 years of existence, the U.S. has spent 217 at war in one form or another, and only 21 in peace. Keep counting: today we are winding down two major wars, and starting a third. This course is designed to understand conflict and war. How, when, and why? We will review current research and learn how to conduct research in the field. Lectures and discussions with the instructors and guests. Materials will include articles, book...\n\n      more description for SOC-UA  472 »\n\n      \n\n\n\nWar is a type of social conflict, a form of organized violence that is bloody, persistent, and widespread. War is a central experience of humanity. Consider this: in its 238 years of existence, the U.S. has spent 217 at war in one form or another, and only 21 in peace. Keep counting: today we are winding down two major wars, and starting a third. This course is designed to understand conflict and war. How, when, and why? We will review current research and learn how to conduct research in the field. Lectures and discussions with the instructors and guests. Materials will include articles, books, visual media, and maps.\nThis course is open to sophomores, juniors and seniors; some background in history, politics, sociology, and/or literature is highly recommended.\n\n      less description for SOC-UA  472 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 500",
            "course_name": "Caring Institutions: Crit Perspec On Soc Prov",
            "description": "SOC-UA  500 Caring Institutions: Crit Perspec On Soc Prov",
            "offering": false
        },
        {
            "course_id": "SOC-UA 501",
            "course_name": "Population",
            "description": "SOC-UA  501 Population",
            "offering": false
        },
        {
            "course_id": "SOC-UA 502",
            "course_name": "Deviance & Social Contrl",
            "description": "SOC-UA  502 Deviance & Social Contrl \nHow statuses and behaviors come to be considered deviant or normal; theories of causation, deviant cultures, communities, and careers. Functioning of social control agencies. The politics of deviance. Consideration of policy implications.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 503",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16721",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 408",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Dixon, Jo"
                },
                {
                    "format": "Recitation",
                    "class_id": "16722",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "194M 208"
                },
                {
                    "format": "Recitation",
                    "class_id": "16723",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "25W4 C-11"
                }
            ],
            "course_name": "Criminology",
            "description": "SOC-UA  503 Criminology \nExamines the making of criminal laws and their enforcement by police, courts, prisons, probation and parole, and other agencies. Criminal behavior systems, theories of crime and delinquency causation, victimization, corporate and governmental crime, and crime in the mass media. Policy questions.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 504",
            "course_name": "Juvenile Delinquency",
            "description": "SOC-UA  504 Juvenile Delinquency",
            "offering": false
        },
        {
            "course_id": "SOC-UA 505",
            "course_name": "Drugs in Society",
            "description": "SOC-UA  505 Drugs in Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 510",
            "course_name": "Contemporary Social Problems",
            "description": "SOC-UA  510 Contemporary Social Problems \nExamination of some of the public problems Americans face today as well as the tools we have for recognizing and attempting to solve them. Aims to create knowledgeable, critical citizens capable of understanding and contributing to public debates. Examines the political, economic, and cultural structures that generate and shape social problems.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 511",
            "course_name": "Sexual Diversity in Society",
            "description": "SOC-UA  511 Sexual Diversity in Society \nVariation in human sexuality. Explores the social nature of sexual expression and how one arrives at erotic object choice and identity. Past and contemporary explanations for sexual variation. Heterosexuality, homosexuality, bisexuality, transvestism, transgenderism, incest, sadomasochism, rape, prostitution, and pornography. Origin of sexual norms and prejudices. Lifestyles in the social worlds of sexual minorities. Problems of sexual minorities in such institutions as religion, marriage, polity, economy, military, prison, and laws. The politics of sex.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 601",
            "course_name": "Approches to Metropolitan Studies",
            "description": "SOC-UA  601 Approches to Metropolitan Studies",
            "offering": false
        },
        {
            "course_id": "SOC-UA 742",
            "course_name": "Theories of Gender and Sexuality",
            "description": "SOC-UA  742 Theories of Gender and Sexuality",
            "offering": false
        },
        {
            "course_id": "SOC-UA 784",
            "course_name": "Tpcs: Israeli Society Since 1948",
            "description": "SOC-UA  784 Tpcs: Israeli Society Since 1948",
            "offering": false
        },
        {
            "course_id": "SOC-UA 801",
            "course_name": "Research Practicum in Qualitative Methods",
            "description": "SOC-UA  801 Research Practicum in Qualitative Methods \nDirected independent research projects using qualitative research techniques such as participant observation and in-depth interviewing. Students write major papers based on their data collected.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 848",
            "course_name": "Transgender: Histories Identities & Politics",
            "description": "SOC-UA  848 Transgender: Histories Identities & Politics",
            "offering": false
        },
        {
            "course_id": "SOC-UA 934",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "8659",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-6",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Maisel, Richard"
                }
            ],
            "course_name": "Seminar:Internet",
            "description": "SOC-UA  934 Seminar:Internet \nSee the student services administrator for content and other information.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 935",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7467",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 131",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Garland, David"
                }
            ],
            "course_name": "Seminar in SociologySociology of Punishment",
            "description": "SOC-UA  935 Seminar in SociologySociology of Punishment \nSee the student services administrator for content and other information.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 936",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7468",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "295L 4130",
                    "time": "Wed 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Lee, Dohoon"
                }
            ],
            "course_name": "Adv Sem:Adv Sem:Sociology of Childhood",
            "description": "SOC-UA  936 Adv Sem:Adv Sem:Sociology of Childhood \nSee the student services administrator for content and other information.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 937",
            "course_name": "Seminar:",
            "description": "SOC-UA  937 Seminar: \nSee the student services administrator for content and other information.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 938",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "8658",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-14",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Abend, Gabriel"
                }
            ],
            "course_name": "Seminar:Sociology of Good and Evil",
            "description": "SOC-UA  938 Seminar:Sociology of Good and Evil \nSee the student services administrator for content and other information.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 939",
            "course_name": "Seminar:",
            "description": "SOC-UA  939 Seminar: \nSee the student services administrator for content and other information.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 940",
            "course_name": "Seminar:",
            "description": "SOC-UA  940 Seminar:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 941",
            "course_name": "Seminar:",
            "description": "SOC-UA  941 Seminar: \nPrerequisite: junior standing and three courses in sociology, including Introduction to Sociology (V93.0001), or written permission of the instructor. 4 points. See the student services administrator for content and other information.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 942",
            "course_name": "Adv Seminar:",
            "description": "SOC-UA  942 Adv Seminar:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 950",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7470",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "295L 4155",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Tavory, Iddo"
                }
            ],
            "course_name": "Senior Honors Research Seminar",
            "description": "SOC-UA  950 Senior Honors Research Seminar \nRequired both semesters of senior year for all honors students. 4 points. Assists students in designing and completing senior thesis projects and finding appropriate faculty advisers.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 951",
            "course_name": "Senior Honors Research Seminar",
            "description": "SOC-UA  951 Senior Honors Research Seminar",
            "offering": false
        },
        {
            "course_id": "SOC-UA 970",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "8656",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 401",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Goodwin, Jeffrey"
                },
                {
                    "format": "Recitation",
                    "class_id": "16712",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 8.00 AM - 9.30 AM",
                    "open": true,
                    "professor": "SILV 404"
                },
                {
                    "format": "Recitation",
                    "class_id": "16713",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "25W4 C-2"
                },
                {
                    "format": "Lecture",
                    "class_id": "17853",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 514",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Dacosta, Kimberly"
                }
            ],
            "course_name": "Variable Tpcs:Consumerism in Comparative PerspectiveUnderstanding Terrorism",
            "description": "SOC-UA  970 Variable Tpcs:Consumerism in Comparative PerspectiveUnderstanding Terrorism \nOffered every year. 4 points.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 996",
            "course_name": "Sexual Rights & Wrongs:",
            "description": "SOC-UA  996 Sexual Rights & Wrongs:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 997",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "7471",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "SOC-UA  997 Independent Study \nPrerequisite: permission of the department. 2 or 4 points per term. Intensive research under the supervision of a department faculty member.",
            "offering": true
        },
        {
            "course_id": "SOC-UA 998",
            "course_name": "Independent Study",
            "description": "SOC-UA  998 Independent Study",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9021",
            "course_name": "Gender:Politics & Law",
            "description": "SOC-UA 9021 Gender:Politics & Law",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9053",
            "course_name": "Sociology of Spain (in Spanish)",
            "description": "SOC-UA 9053 Sociology of Spain (in Spanish)",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9054",
            "course_name": "Sociology in Spain (in English)",
            "description": "SOC-UA 9054 Sociology in Spain (in English)",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9111",
            "course_name": "Sociological Theory",
            "description": "SOC-UA 9111 Sociological Theory",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9133",
            "course_name": "Comparative Modern Societies",
            "description": "SOC-UA 9133 Comparative Modern Societies",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9136",
            "course_name": "Kafka and His Contexts",
            "description": "SOC-UA 9136 Kafka and His Contexts",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9137",
            "course_name": "Inequality: Social Stratification Chgn Wrld",
            "description": "SOC-UA 9137 Inequality: Social Stratification Chgn Wrld",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9138",
            "course_name": "Collective Memory in Contemporary Europe",
            "description": "SOC-UA 9138 Collective Memory in Contemporary Europe",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9141",
            "course_name": "Social Change: Transitional Societies",
            "description": "SOC-UA 9141 Social Change: Transitional Societies",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9160",
            "course_name": "Topics:",
            "description": "SOC-UA 9160 Topics:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9205",
            "course_name": "Social Movements, Protest and Conflict",
            "description": "SOC-UA 9205 Social Movements, Protest and Conflict",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9209",
            "course_name": "Environmental Social Movements",
            "description": "SOC-UA 9209 Environmental Social Movements \nHow do social movements form in response to environmental concerns? What\nmakes them effective or ineffective? This course analyses the various\nsocial movements that organized in response to environmental concerns. Both\nhistorical and sociological dimensions of environmental movements are\ncovered, with particular attention given to how issues of environmental\nprotection and social justice intersect. At NYU Berlin, the course includes\nAmerican (I), European, and in particular German (II), as well as global\nmovements (III).",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9302",
            "course_name": "Statistics for Social Research",
            "description": "SOC-UA 9302 Statistics for Social Research",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9313",
            "course_name": "Soc Pol in Mod Soc: Comp Pol Eco of US & Europe",
            "description": "SOC-UA 9313 Soc Pol in Mod Soc: Comp Pol Eco of US & Europe",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9413",
            "course_name": "Law & Human Rights in Central Europe",
            "description": "SOC-UA 9413 Law & Human Rights in Central Europe",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9414",
            "course_name": "Soc of Medicine:Illness, Healthcare & Dev -Ghana",
            "description": "SOC-UA 9414 Soc of Medicine:Illness, Healthcare & Dev -Ghana",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9415",
            "course_name": "Sociology of EducationGlobal Education in the 21st century",
            "description": "SOC-UA 9415 Sociology of EducationGlobal Education in the 21st century",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9433",
            "course_name": "Sociology of The Arts:",
            "description": "SOC-UA 9433 Sociology of The Arts:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9434",
            "course_name": "Sociology of Western Culture:",
            "description": "SOC-UA 9434 Sociology of Western Culture:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9435",
            "course_name": "Tpcs in 20th-C German Lit:Traditions of City Writing",
            "description": "SOC-UA 9435 Tpcs in 20th-C German Lit:Traditions of City Writing",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9452",
            "course_name": "Immigration",
            "description": "SOC-UA 9452 Immigration \nTo provide an understanding of the main immigration trends in Britain, France and Germany since 1850 To provide an understanding of the problems attending the social and political integration of immigrants in contemporary Western Europe To compare the experience and understanding of immigration in Europe with the experience and understanding of immigration in the United States To examine the ways in which the memory of immigration is represented in literature and contemporary culture.",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9460",
            "course_name": "Cities,Commun,&Urb Life: Expl Hist & Cont Berlin",
            "description": "SOC-UA 9460 Cities,Commun,&Urb Life: Expl Hist & Cont Berlin",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9461",
            "course_name": "Between Fiction and Reality: New York and Paris",
            "description": "SOC-UA 9461 Between Fiction and Reality: New York and Paris",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9471",
            "course_name": "Politics,Power,&Society: Politics of Europ Union",
            "description": "SOC-UA 9471 Politics,Power,&Society: Politics of Europ Union",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9506",
            "course_name": "",
            "description": "SOC-UA 9506\n\n   The Politics of Organized CrimeItalian Mafias in a Comparative Persepective\n\nWhat most people know about Italian criminal organizations comes from stereotypical representations in popular culture – films and literature. The analysis of real-world data, such as investigations, proceedings and crime statistics, dismisses many of the accepted myths about Italian mafias over the last decades. The purpose of this course is to introduce students to the definitions of this complex phenomenon by demystifying criminal underworld. This course will examine the organization of mafia groups in Italy, their codes and symbols, their activities both in legal and illegal markets, and t...\n\n      more description for SOC-UA 9506 »\n\n      \n\n\n\nWhat most people know about Italian criminal organizations comes from stereotypical representations in popular culture – films and literature. The analysis of real-world data, such as investigations, proceedings and crime statistics, dismisses many of the accepted myths about Italian mafias over the last decades. The purpose of this course is to introduce students to the definitions of this complex phenomenon by demystifying criminal underworld. This course will examine the organization of mafia groups in Italy, their codes and symbols, their activities both in legal and illegal markets, and their relationship to politics and other social institutions. The Italian case will be compared with those countries where Italian mafia groups migrated (such as the United States) and other nations where similar groups operate. Comparisons will enable students to disentangle different types of organized crime and to discover patterns and mechanisms of emergence and persistence across countries. The course will include also a review of the policies designed to control organized crime and of the grassroots initiatives to reduce the risk and combat mafia infiltration into local economy and society.\n\n      less description for SOC-UA 9506 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9510",
            "course_name": "Contemporary Social Relations",
            "description": "SOC-UA 9510 Contemporary Social Relations",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9515",
            "course_name": "Contemporary Irish Politics & Society",
            "description": "SOC-UA 9515 Contemporary Irish Politics & Society",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9525",
            "course_name": "Crossrds of Cult: South Africa Befor/Aft Aparthd",
            "description": "SOC-UA 9525 Crossrds of Cult: South Africa Befor/Aft Aparthd",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9701",
            "course_name": "",
            "description": "SOC-UA 9701\n\n   Issues in Contemporary British Pol & Culture\n\nThis course will introduce students to the context of life in modern Britain through a series of talks by prominent figures in British society. The main objectives of the course are to give students access to those at the top of British politics and culture; to make students aware of the unique characteristics of British culture and to examine the reasons for the far-reaching changes in British society over the last thirty or forty years. It is important for NYU undergraduates who are studying abroad to study the socio-political context of that country as part of their experience abroad. This ...\n\n      more description for SOC-UA 9701 »\n\n      \n\n\n\nThis course will introduce students to the context of life in modern Britain through a series of talks by prominent figures in British society. The main objectives of the course are to give students access to those at the top of British politics and culture; to make students aware of the unique characteristics of British culture and to examine the reasons for the far-reaching changes in British society over the last thirty or forty years. It is important for NYU undergraduates who are studying abroad to study the socio-political context of that country as part of their experience abroad. This course will begin to explore important social and political issues that Britain has handled differently than the United States.\n\n      less description for SOC-UA 9701 «",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9702",
            "course_name": "Perspective On Israeli Society and History",
            "description": "SOC-UA 9702 Perspective On Israeli Society and History",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9934",
            "course_name": "Gender in Transition in Post-Communist Soc",
            "description": "SOC-UA 9934 Gender in Transition in Post-Communist Soc",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9935",
            "course_name": "Topics:",
            "description": "SOC-UA 9935 Topics:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9936",
            "course_name": "Adv Sem:",
            "description": "SOC-UA 9936 Adv Sem:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9937",
            "course_name": "Consumption:",
            "description": "SOC-UA 9937 Consumption:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9938",
            "course_name": "Sem:Europ Dream of Amer Amer Dream of Europe",
            "description": "SOC-UA 9938 Sem:Europ Dream of Amer Amer Dream of Europe",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9939",
            "course_name": "Adv Seminar:",
            "description": "SOC-UA 9939 Adv Seminar:",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9940",
            "course_name": "Advanced Seminar:Shaping an Educ Landscape: Museum Island of BL",
            "description": "SOC-UA 9940 Advanced Seminar:Shaping an Educ Landscape: Museum Island of BL",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9941",
            "course_name": "Adv Sem: Architectural Landscapes of Berlin",
            "description": "SOC-UA 9941 Adv Sem: Architectural Landscapes of Berlin",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9942",
            "course_name": "Advanced Seminar:Marx, Nietzsche & Freud",
            "description": "SOC-UA 9942 Advanced Seminar:Marx, Nietzsche & Freud",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9970",
            "course_name": "Topics:Collective Identity in a Totalitarian RegimeGlobalization & The Developing WorldReligion, Pol & State",
            "description": "SOC-UA 9970 Topics:Collective Identity in a Totalitarian RegimeGlobalization & The Developing WorldReligion, Pol & State",
            "offering": false
        },
        {
            "course_id": "SOC-UA 9998",
            "course_name": "Independent Study",
            "description": "SOC-UA 9998 Independent Study",
            "offering": false
        }
    ]
}