{
    "major_id": "SOIM-SHU",
    "file": "./2015-2016/Social_Impact_(SOIM-SHU).html",
    "courses": [
        {
            "course_id": "SOIM-SHU 9006",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19524",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SOIM-SHU 9006\n\n   Law, Business, & Society\n\nEvery professional businessperson must be aware of how legal systems work and affect business decisions. Furthermore, the interaction between law and business is multidimensional, involving international, ethical, and technological considerations. In this course, students examine how key areas of business law, including contracts, torts, and business organizations, influence the structure of business relationships. Students actively participate in legal studies designed to enhance business skills such as analytical thinking, written communication, oral presentation, conflict resolution, and te...\n\n      more description for SOIM-SHU 9006 »\n\n      \n\n\n\nEvery professional businessperson must be aware of how legal systems work and affect business decisions. Furthermore, the interaction between law and business is multidimensional, involving international, ethical, and technological considerations. In this course, students examine how key areas of business law, including contracts, torts, and business organizations, influence the structure of business relationships. Students actively participate in legal studies designed to enhance business skills such as analytical thinking, written communication, oral presentation, conflict resolution, and teamwork problem solving.\n\n      less description for SOIM-SHU 9006 «",
            "offering": true
        },
        {
            "course_id": "SOIM-SHU 9065",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19525",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Hanssen, Brian",
                    "time": "Mon,Wed 1.15 PM - 2.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SOIM-SHU 9065\n\n   Organizational Comm & Its Soci\n\nStudents learn how organizations communicate with multiple types of audiences, focusing on the interconnections between business and society. The course uses the stakeholder model of the corporation to introduce the strategic implications of communication for modern organizations. Students focus on strategic and tactical aspects of corporate communication to study and practice the ways in which organizations communicate to their varied internal and external stakeholders. Assignments develop students? abilities in speaking and writing to these varied audiences, both to inform and to persuade. T...\n\n      more description for SOIM-SHU 9065 »\n\n      \n\n\n\nStudents learn how organizations communicate with multiple types of audiences, focusing on the interconnections between business and society. The course uses the stakeholder model of the corporation to introduce the strategic implications of communication for modern organizations. Students focus on strategic and tactical aspects of corporate communication to study and practice the ways in which organizations communicate to their varied internal and external stakeholders. Assignments develop students? abilities in speaking and writing to these varied audiences, both to inform and to persuade. The course emphasizes bridging theoretical fundamentals, and action learning is stressed, which includes applying communication strategy to the following: oral and written business assignments; presentation delivery techniques; visual communication analysis and practice; team communication.\n\n      less description for SOIM-SHU 9065 «",
            "offering": true
        }
    ]
}