{
    "major_id": "THEAT-AD",
    "file": "./2015-2016/Theater_(THEAT-AD).html",
    "courses": [
        {
            "course_id": "THEAT-AD 100",
            "course_name": "",
            "description": "THEAT-AD  100\n\n   Making Theater\n\nWorking as a performance company, students learn the fundamentals of collaborative theater-making. Acting and performance are central to the process, but so is the recognition that a performance takes place in a space that has to be invested with rules and conventions before it can tell a story. Exploring the possibilities offered by these rules and conventions is key to understanding the potential for theater as a means of expression and mode of knowledge. Combining the tools and techniques of Aristotle, Stanislavsky, Meyerhold, Brecht, Grotowski, Brook, and Bogart, students work in groups to...\n\n      more description for THEAT-AD  100 »\n\n      \n\n\n\nWorking as a performance company, students learn the fundamentals of collaborative theater-making. Acting and performance are central to the process, but so is the recognition that a performance takes place in a space that has to be invested with rules and conventions before it can tell a story. Exploring the possibilities offered by these rules and conventions is key to understanding the potential for theater as a means of expression and mode of knowledge. Combining the tools and techniques of Aristotle, Stanislavsky, Meyerhold, Brecht, Grotowski, Brook, and Bogart, students work in groups to devise and stage silent stories as well as textual scenes to explore what it means to create a theatrical experience. All students participate as directors, actors, designers, and audience, and discuss each other’s work in order to develop a clearer and more objective relationship to their own.\n\n      less description for THEAT-AD  100 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17192",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 017 with Levine, Debra08/30/2015 - 12/17/2015 Thu 9.15 AM - 11.55 AM at COMP_RES 017",
                    "time": "Tue 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Levine, Debra"
                }
            ],
            "course_name": "",
            "description": "THEAT-AD  101\n\n   Thinking Theater\n\nThis seminar offers an overview of theatre and its intersectionalites with other disciplines in the arts, sciences, and humanities.  The course introduces key terms and methodologies for understanding performance as an object of analysis and a means of expressive behavior.  We explore how particular theories of drama emerge at historical moments and why; we do so by looking at those theories embodiment on the stage, in dramatic literature, in public, and in everyday life.  The aim of this class is to provide a performance vocabulary that will serve as a foundation and framework for advanced st...\n\n      more description for THEAT-AD  101 »\n\n      \n\n\n\nThis seminar offers an overview of theatre and its intersectionalites with other disciplines in the arts, sciences, and humanities.  The course introduces key terms and methodologies for understanding performance as an object of analysis and a means of expressive behavior.  We explore how particular theories of drama emerge at historical moments and why; we do so by looking at those theories embodiment on the stage, in dramatic literature, in public, and in everyday life.  The aim of this class is to provide a performance vocabulary that will serve as a foundation and framework for advanced studies.  Although this is not a survey of theatre history, the course will draw from a wide variety of historical plays and performances to elucidate the critical concerns of the field.\n\n      less description for THEAT-AD  101 «",
            "offering": true
        },
        {
            "course_id": "THEAT-AD 110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12763",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 045",
                    "time": "Tue,Thu 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Coray, Catherine"
                }
            ],
            "course_name": "Fundamentals of Acting",
            "description": "THEAT-AD  110 Fundamentals of Acting \nStudents begin to build a performance vocabulary by using a range of techniques for translating the actor’s imagination into stage action. Students are introduced to the internal and external demands of turning psychology into behavior. Students explore acting fundamentals, such as investing yourself in the moment, genuinely listening, personalizing fictional material; and playing objectives are initially explored via games, improvisations, and exercises, followed by partnered scene work, ensemble technique, and solo performance.",
            "offering": true
        },
        {
            "course_id": "THEAT-AD 111",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17194",
                    "section": "001",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": "ARTS_CENT 045",
                    "time": "Tue,Thu 9.15 AM - 11.55 AM",
                    "open": true,
                    "professor": "Pabotoy, Orlando"
                }
            ],
            "course_name": "",
            "description": "THEAT-AD  111\n\n   Body at Work: Movement for the Artist\n\nA voice and movement course for actors, musicians, and visual artists. We engage the body as an expressive tool in support of artistic craft and technique and build confidence in our ability to translate creative impulses through physical action. The course guides the student through awareness of and release from habitual tensions and into body alignment, breathing, resonators, sound and movement, group interaction, and the exploration of individual and group creativity. We focus on the kinetic application of movement in the art-making process, using core energy, dynamics, breath connection, s...\n\n      more description for THEAT-AD  111 »\n\n      \n\n\n\nA voice and movement course for actors, musicians, and visual artists. We engage the body as an expressive tool in support of artistic craft and technique and build confidence in our ability to translate creative impulses through physical action. The course guides the student through awareness of and release from habitual tensions and into body alignment, breathing, resonators, sound and movement, group interaction, and the exploration of individual and group creativity. We focus on the kinetic application of movement in the art-making process, using core energy, dynamics, breath connection, strength, flexibility, range of motion, stamina, and relaxation techniques in order to strengthen our creative output. The goal is a free voice in a free body and the ability to express thought and emotion with openness and truth.\n\n      less description for THEAT-AD  111 «",
            "offering": true
        },
        {
            "course_id": "THEAT-AD 113",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13081",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 045",
                    "time": "Mon,Wed 12.45 PM - 3.25 PM",
                    "open": true,
                    "professor": "Tsunoda, Tomi"
                }
            ],
            "course_name": "",
            "description": "THEAT-AD  113\n\n   Collaborative Art: Fundamentals of Stage Design and Production\n\nIn this course students learn to create visceral, theatrical experiences that tell clear stories through deep investigation of what comprises aesthetic experience and the fundamental tenants of design and stage composition. Students will acquire tools to: identify, externalize, and develop aesthetic impulses; actualize the world of a text through simple, powerful choices; facilitate collaborations with a design team; synthesize script analysis and point of view with rich, textured design worlds; develop an empathetic imagination; and build work with generosity toward the audience’s experience....\n\n      more description for THEAT-AD  113 »\n\n      \n\n\n\nIn this course students learn to create visceral, theatrical experiences that tell clear stories through deep investigation of what comprises aesthetic experience and the fundamental tenants of design and stage composition. Students will acquire tools to: identify, externalize, and develop aesthetic impulses; actualize the world of a text through simple, powerful choices; facilitate collaborations with a design team; synthesize script analysis and point of view with rich, textured design worlds; develop an empathetic imagination; and build work with generosity toward the audience’s experience.\n\n      less description for THEAT-AD  113 «",
            "offering": true
        },
        {
            "course_id": "THEAT-AD 115",
            "course_name": "",
            "description": "THEAT-AD  115\n\n   Directing the Actor\n\nA course for theater directors, filmmakers, actors, and visual artists. Students build a directorial vocabulary for translating impulse and imagination into compelling narrative and non-narrative staged moments. Using techniques from Brecht, Brook, Grotowski, and Bogart, students learn to articulate ideas to actors in compelling and inspiring ways. Students explore physical exercises to increase their range as directors; tools with which to fuel actors physically and emotionally; and theories of collaboration and ensemble. The core of the class is the exploration of directing as a physical col...\n\n      more description for THEAT-AD  115 »\n\n      \n\n\n\nA course for theater directors, filmmakers, actors, and visual artists. Students build a directorial vocabulary for translating impulse and imagination into compelling narrative and non-narrative staged moments. Using techniques from Brecht, Brook, Grotowski, and Bogart, students learn to articulate ideas to actors in compelling and inspiring ways. Students explore physical exercises to increase their range as directors; tools with which to fuel actors physically and emotionally; and theories of collaboration and ensemble. The core of the class is the exploration of directing as a physical collaboration with actors within a landscape of thought, emotion, openness, and truth.\n\n      less description for THEAT-AD  115 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 117",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12850",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 144",
                    "time": "Mon,Wed 9.15 AM - 11.55 AM",
                    "open": true,
                    "professor": "Celik, Aysan"
                }
            ],
            "course_name": "Voice, Speech, and Text",
            "description": "THEAT-AD  117 Voice, Speech, and Text \nStudents learn the fundamentals of voice, vocal production, and vocal expression. The course is designed to help students discover their vocal potential, to reduce obstructive physical habits and tensions and to move towards free, full-range voices. This course is built to cultivate vocal-physical development and sensorial acuteness. Students will begin to understand, in themselves, the connection between thought/impulse/idea, voice, communication and audience.",
            "offering": true
        },
        {
            "course_id": "THEAT-AD 132",
            "course_name": "",
            "description": "THEAT-AD  132\n\n   Roots of Global Performance\n\nCrosslisted with The Ancient World\nHow have different cultures used performance to communicate and for what purposes: social, political, spiritual? This course examines some of the most distinctive and influential performance traditions, past and present, from around the globe, and reflect upon their significance to our contemporary globalized culture. What structural, aesthetic, and expressive possibilities might artists today borrow from, for example, performance forms such as African masquerade, Korean Shamanistic performance, Athenian Tragedy, Indian Sanskrit drama, Medieval Cycle Drama, ...\n\n      more description for THEAT-AD  132 »\n\n      \n\n\n\nCrosslisted with The Ancient World\nHow have different cultures used performance to communicate and for what purposes: social, political, spiritual? This course examines some of the most distinctive and influential performance traditions, past and present, from around the globe, and reflect upon their significance to our contemporary globalized culture. What structural, aesthetic, and expressive possibilities might artists today borrow from, for example, performance forms such as African masquerade, Korean Shamanistic performance, Athenian Tragedy, Indian Sanskrit drama, Medieval Cycle Drama, Iranian Ta’zieh, Roman imperial spectacle, Japanese Kabuki, Italian Commedia dell’arte, and European Modernism?\n\n      less description for THEAT-AD  132 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 133",
            "course_name": "",
            "description": "THEAT-AD  133\n\n   Theater in Ancient Greece\n\nCrosslisted with The Ancient World\nAn in-depth study of the great tragedies of Aeschylus, Sophocles, Euripides, the comedies of Aristophanes, and of the theater culture that produced them. We consider such topics as: the relation of the Greek theater to ritual and myth; the role and meaning of the Greek tragic chorus; the importance of the theatrical contest of the City Dionysia; the physical theater space; and the social function of Greek theater in establishing and strengthening Greek democracy. The Greek plays are seen not only as the root of dramatic art in the West, but as repositories o...\n\n      more description for THEAT-AD  133 »\n\n      \n\n\n\nCrosslisted with The Ancient World\nAn in-depth study of the great tragedies of Aeschylus, Sophocles, Euripides, the comedies of Aristophanes, and of the theater culture that produced them. We consider such topics as: the relation of the Greek theater to ritual and myth; the role and meaning of the Greek tragic chorus; the importance of the theatrical contest of the City Dionysia; the physical theater space; and the social function of Greek theater in establishing and strengthening Greek democracy. The Greek plays are seen not only as the root of dramatic art in the West, but as repositories of key concepts of Western thought on such subjects as gender relationships, the role of the citizen in a democracy, war, power, and personal responsibility.\n\n      less description for THEAT-AD  133 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 134",
            "course_name": "JX",
            "description": "THEAT-AD  134JX\n\n   Theater in the Arab World\n\nThis class examines recent trends in contemporary Arab theatre, contextualizing these within a broader history of Arab performance including film. Particular attention is given to how experimental practitioners have explored issues of human rights and the control of territories under the modern state. Strategies addressed include: the conflation of past and present as a means of exploring the persistence of the colonial power structure in the modern Arab world (Wannus’s Historical Miniatures, ‘Udwan’s The Trial of the Man Who Didn’t Fight); the use of parable to speak truth to power (Wannus’s ...\n\n      more description for THEAT-AD  134JX »\n\n      \n\n\n\nThis class examines recent trends in contemporary Arab theatre, contextualizing these within a broader history of Arab performance including film. Particular attention is given to how experimental practitioners have explored issues of human rights and the control of territories under the modern state. Strategies addressed include: the conflation of past and present as a means of exploring the persistence of the colonial power structure in the modern Arab world (Wannus’s Historical Miniatures, ‘Udwan’s The Trial of the Man Who Didn’t Fight); the use of parable to speak truth to power (Wannus’s The Elephant, Diyab’s Strangers Don’t Drink the Coffee); the incorporation of populist entertainment forms that directly engage the audience (a-Sadiki’s use of the halqa and Wannus’ inclusion of hekoatee); and the use of familiar tales to explore new political realities (Wannus’s and Farag’s use of the Arabian Nights Tales, Al-Hakim’s use of pharaonic myth, Al-Hakim and Salim’s use of Greek myth).\n\n      less description for THEAT-AD  134JX «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 135",
            "course_name": "",
            "description": "THEAT-AD  135\n\n   Theater in Asia\n\nThis course examines different traditions, innovations, representations, and locations of Asian theater. The influence of major aesthetic texts such as the Natyasastra and the Kadensho are studied in relationship to specific forms of theater such as Kagura, Bugaku, Noh, Bunraku, Kabuki, Shingeki, Jingxi, Geju, Zaju, Kathakali, Kathak, Odissi, Chau, Manipuri, Krishnattam, Kutiyattam, Raslila, and P’ansori. The dramatization of religious beliefs, myths, and legends are examined in a contemporary context. Different focuses include: Middle Eastern performance, Japanese theater, traditional Asian p...\n\n      more description for THEAT-AD  135 »\n\n      \n\n\n\nThis course examines different traditions, innovations, representations, and locations of Asian theater. The influence of major aesthetic texts such as the Natyasastra and the Kadensho are studied in relationship to specific forms of theater such as Kagura, Bugaku, Noh, Bunraku, Kabuki, Shingeki, Jingxi, Geju, Zaju, Kathakali, Kathak, Odissi, Chau, Manipuri, Krishnattam, Kutiyattam, Raslila, and P’ansori. The dramatization of religious beliefs, myths, and legends are examined in a contemporary context. Different focuses include: Middle Eastern performance, Japanese theater, traditional Asian performances on contemporary stages, religion and drama in Southeast Asia, and traditions of India.\n\n      less description for THEAT-AD  135 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 137",
            "course_name": "Topics in Performance Studies",
            "description": "THEAT-AD  137 Topics in Performance Studies \nThis course (different each time) uses key theoretical concepts of the field of performance studies to examine a diverse range of performance practices. Topics include: ritual studies, gender, tourist performances, celebrity and stardom, animals and animality, the body, the city.",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 151",
            "course_name": "",
            "description": "THEAT-AD  151\n\n   Dramas from the African Continent\n\nIn this course, we critique 20th- and 21st century plays from the African continent, including works from Kenya, Nigeria, Ghana, Uganda, Ethiopia, and South Africa (the Sub-Saharan countries) as well as from Tunis, Algeria, Egypt, Libya Morocco, and Tunisia (North African countries). From a variety of critical theoretical discourses, our discussions focus on the theatrical practices demanded by the texts, along with the intersections and divergences of structures and topics shared by continental plays, such as blackness and race, exile, colonialism and post-colonialism, violence, gender inequa...\n\n      more description for THEAT-AD  151 »\n\n      \n\n\n\nIn this course, we critique 20th- and 21st century plays from the African continent, including works from Kenya, Nigeria, Ghana, Uganda, Ethiopia, and South Africa (the Sub-Saharan countries) as well as from Tunis, Algeria, Egypt, Libya Morocco, and Tunisia (North African countries). From a variety of critical theoretical discourses, our discussions focus on the theatrical practices demanded by the texts, along with the intersections and divergences of structures and topics shared by continental plays, such as blackness and race, exile, colonialism and post-colonialism, violence, gender inequality, family, moral and social values, interraciality, religion, and political resistance. The plays from North Africa that align with the Arab world will serve as a bridge to introduce noteworthy works from the African diaspora, with plays written by Africans or those of African ancestry living in the Middle East, Europe, and the United States.\n\n      less description for THEAT-AD  151 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 152",
            "course_name": "",
            "description": "THEAT-AD  152\n\n   Art, Performance, and Social Practice\n\nHow do we begin to know each other differently from the way in which dominant social systems and communicative technologies structure our daily interactions?  This question drives art and performance’s “social turn” to real-world collaborations between artists and performers who act in the role of instigators or catalysts with the communities around them. The social turn explicitly rejects the artist’s more traditional role as the producer of a consumable aesthetic object or theatrical performance and instead proposes that the conscious processes of collaborative engagement -- activist, partic...\n\n      more description for THEAT-AD  152 »\n\n      \n\n\n\nHow do we begin to know each other differently from the way in which dominant social systems and communicative technologies structure our daily interactions?  This question drives art and performance’s “social turn” to real-world collaborations between artists and performers who act in the role of instigators or catalysts with the communities around them. The social turn explicitly rejects the artist’s more traditional role as the producer of a consumable aesthetic object or theatrical performance and instead proposes that the conscious processes of collaborative engagement -- activist, participatory, coauthored – must be understood and valued as art.  In this intertwining of art with performance, cooperative processes are foregrounded as frameworks to understand and shift the impact of political and social policy, architecture, art history, urban planning, and new media on our lives. The social practice of art proposes that in making encounters where artists engage with the members of communities as “expert participants,” we might construct more livable alternatives through social cooperation.  Art as social practice also insists that this process is an aesthetic practice.   In this course we will read recent critical theories and histories of the aesthetics and politics of the social practice of art, explore case studies of “relational art,” and collaborate on our own “living as form” project that engages with the built and social environment of Abu Dhabi.\n\n      less description for THEAT-AD  152 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 153",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20447",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "COMP_RES 017",
                    "time": "Tue,Thu 12.45 PM - 3.25 PM",
                    "open": true,
                    "professor": "Vorlicky, Robert"
                }
            ],
            "course_name": "",
            "description": "THEAT-AD  153\n\n   African Women Playwrights\n\n“African Women Playwrights” is a reading intensive course that focuses on the structurally and narratively diversified theatrical texts written by women from the continent in the 20th and 21st century. We’ll critique the plays as both literature and dramatic texts intended for production. What is clearly evident in African women playwrights’ writing is its focus on women’s agency; generational legacies; tradition, colonialism, and modernism; tribal and national identities; family relationships; intimacy and commitment; the spirit world of rituals, polytheism, and monotheism; the challenging co...\n\n      more description for THEAT-AD  153 »\n\n      \n\n\n\n“African Women Playwrights” is a reading intensive course that focuses on the structurally and narratively diversified theatrical texts written by women from the continent in the 20th and 21st century. We’ll critique the plays as both literature and dramatic texts intended for production. What is clearly evident in African women playwrights’ writing is its focus on women’s agency; generational legacies; tradition, colonialism, and modernism; tribal and national identities; family relationships; intimacy and commitment; the spirit world of rituals, polytheism, and monotheism; the challenging coexistence between Christianity and Islam; the impact of the global diaspora on African identity; and the intersecting issues of blackness, Africanness, and womanhood. The course will address these various foci through the works of Andiah Kisia (Kenya), Nathalie Etoke, Werewere Liking (Cameroon), Tsitsi Dangarembga (Zimbabwe), Fatima Gallaire (Algeria), Penina Mlama, Amadina Lihamba (Tanzania), Ama Ata Aidoo, Efua Sutherland (Ghana), Osonye Tess Onwueme, Zulu Sofola, Julie Okoh (Nigeria), Sindiwe Magona, Malika Ndlovu, Gcina Mhlope (South Africa), Violet Barungi, and Deborah Asiimwe (Uganda). The foundational critical theories for the course are postcolonialism, feminism, critical race theory, and diasporic studies. We will also engage the new plays by African women that are produced at the 2nd Annual Kampala International Theatre Festival (Nov 25-29, 2015) through the assistance of award-winning Ugandan playwright, Deborah Asiimwe, who is co-director of this East African theatre festival (as well as the representative for the Sundance Institute East Africa).\n\n      less description for THEAT-AD  153 «",
            "offering": true
        },
        {
            "course_id": "THEAT-AD 160",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17193",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "ARTS_CENT 045"
                }
            ],
            "course_name": "Fundamentals of Playwriting",
            "description": "THEAT-AD  160 Fundamentals of Playwriting \nThis course engages the basic principles of the craft of play writing with strong emphasis on characterization, dialogue, and structure, including identification of the major dramatic incident and turning points. Classes will focus on both analysis of dramatic texts from contemporary play writes and student scripts. Professor will give notes on all final projects. Coursework includes reading and writing assignments and a completed full-length play is the required final project.",
            "offering": true
        },
        {
            "course_id": "THEAT-AD 198",
            "course_name": "Directed Study",
            "description": "THEAT-AD  198 Directed Study \nOffered by application Prerequisite: permission of the instructor Closely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 210",
            "course_name": "",
            "description": "THEAT-AD  210\n\n   Character and Action\n\nStudents develop advanced performance skills by using techniques associated with Patsy Rodenburg, Shin’ichi Suzuki, Stanislavski, Anne Bogart, and Yoshi Oida, among others. Training exercises are used to develop kinesthetic awareness, focus, listening, character, action, creativity, imagination, and collaboration. Through a holistic approach connected to recent findings in cognitive science, students build technical craft as well as begin to remove obstructive physical, vocal and mental habits, so as to release the full potential of the responsiveness, expressivity, and presence of their actor...\n\n      more description for THEAT-AD  210 »\n\n      \n\n\n\nStudents develop advanced performance skills by using techniques associated with Patsy Rodenburg, Shin’ichi Suzuki, Stanislavski, Anne Bogart, and Yoshi Oida, among others. Training exercises are used to develop kinesthetic awareness, focus, listening, character, action, creativity, imagination, and collaboration. Through a holistic approach connected to recent findings in cognitive science, students build technical craft as well as begin to remove obstructive physical, vocal and mental habits, so as to release the full potential of the responsiveness, expressivity, and presence of their actor/performer instruments: the body-mind.\n\n      less description for THEAT-AD  210 «",
            "offering": false
        },
        {
            "course_id": "THEAT-AD 230",
            "course_name": "Advanced Design and Production",
            "description": "THEAT-AD  230 Advanced Design and Production \nThis advanced course engages topics in the history of stage practice (including theatre architecture, stage structure, costume, scenery and lighting design, theatre technology, and contemporaneous cultural and art history), and provides training to various aspects of current production and theatre technology. Interested students can receive focused training in lighting, scenery and costuming. All students participate in production design.",
            "offering": false
        }
    ]
}