{
    "major_id": "TRAN1-GC",
    "file": "./2015-2016/Translation_(TRAN1-GC).html",
    "courses": [
        {
            "course_id": "TRAN1-GC 1000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17758",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Shreve, Gregory M",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2753",
                    "section": "002",
                    "period": "09/14/2015 - 12/14/2015",
                    "location": "Savova, Milena V",
                    "time": "Mon 2.30 PM - 5.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Theory and Practice of Translation",
            "description": "TRAN1-GC 1000 Theory and Practice of Translation \nIn this course students learn the basic concepts and general conceptual framework for the analysis\nand understanding of translation as a process and a product. Topics include translation adequacy and\nequivalence, text coherence between source and target text, translation as a decision-making process,\nlinguistic and extralinguistic factors in translation, realia, evaluation, and others.",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 1010",
            "course_name": "",
            "description": "TRAN1-GC 1010\n\n   Theory & Practice of Terminology\n\nThis course introduces students to the basic principles and methods of contemporary terminology and documentation. \nWhile the emphasis is on applied terminology, students learn the theoretical background of contemporary terminological practice, including relevant aspects of linguistics, lexicography, and classification. Various methodologies for conducting terminological research are also examined, with particular emphasis on the application of terminology to translation. Students explore representative aspects of research and documentation, typical methods for recording and storing terminolog...\n\n      more description for TRAN1-GC 1010 »\n\n      \n\n\n\nThis course introduces students to the basic principles and methods of contemporary terminology and documentation. \nWhile the emphasis is on applied terminology, students learn the theoretical background of contemporary terminological practice, including relevant aspects of linguistics, lexicography, and classification. Various methodologies for conducting terminological research are also examined, with particular emphasis on the application of terminology to translation. Students explore representative aspects of research and documentation, typical methods for recording and storing terminology, database record structure, and computer-based systems for terminology management.\n\n      less description for TRAN1-GC 1010 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 1030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2981",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2981",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "Introduction to Pragmatics",
            "description": "TRAN1-GC 1030 Introduction to Pragmatics \nThis course examines the relation between language use and human action. Some topics to be emphasized are: conversational logic and implicature, presuppositions, speech act theory, politeness, social role, psychological perception of oneself and language, variation in language use. Students are expected to apply the general principles to their working languages.",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 1040",
            "course_name": "Discourse Analysis",
            "description": "TRAN1-GC 1040 Discourse Analysis \nIn this course students examine language beyond the sentence. They look at the larger discourse context in order to understand how it affects the meaning of the sentence. Topics include global and local properties of connected speech and writing, narrative structures, new and old information, subjects and topics, foregrounding and backgrounding, discourse markers, etc.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 1050",
            "course_name": "Cross-Cultural Communication",
            "description": "TRAN1-GC 1050 Cross-Cultural Communication \nStudents learn theories and basic concepts of cross-cultural communication.  They examine the influence of socio-cultural forces on human interaction as well as how these forces direct the communication patterns of people from various cultures.  The analysis focuses on verbal and nonverbal symbols used in intercultural communication and on the challenges presented when an intercultural partner employs a different language system.  Students examine the impact of verbal idiosyncrasies and distinctions on problem solving, speaking, perception, translation, interpreting, and understanding.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 1060",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2946",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Bishop, Lloyd",
                    "time": "Tue 2.00 PM - 4.40 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 1060\n\n   Technical & Business Writing\n\nThis course focuses on producing user-friendly documents by mastering the tools and methods professional technical writers use to draft definitions, descriptions, instructions, as well as other relevant reports.  Emphasis during the technical portion of the class is placed on narrowing material so only essential information is conveyed, understanding the mechanics of sentences and how readers relate to them, using visual devices and formatting to enhance clarity, impact and readability of technical information.  The business portion of the class targets writing effectively for the business env...\n\n      more description for TRAN1-GC 1060 »\n\n      \n\n\n\nThis course focuses on producing user-friendly documents by mastering the tools and methods professional technical writers use to draft definitions, descriptions, instructions, as well as other relevant reports.  Emphasis during the technical portion of the class is placed on narrowing material so only essential information is conveyed, understanding the mechanics of sentences and how readers relate to them, using visual devices and formatting to enhance clarity, impact and readability of technical information.  The business portion of the class targets writing effectively for the business environment.  Students work on organizing information, word choice, proper phrasing, and editing their work, through analysis of memos, letters, reports, news articles, features, and letters to the editor.\n\n      less description for TRAN1-GC 1060 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 1120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2755",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 1120\n\n   Contrastive Stylistics: Spanish/English\n\nStylistics is the part of language study that explores the connotative rather than the denotative level of\na message. It is very important for translators to be able to identify the elements that make up the style\nof the original and preserve it in their translation. In this course students learn how to identify and use\nthe lexical, syntactic and communicative aspects of aesthetic tonality, i.e. common language vs. poetic,\nliterary, and written language, as well as the functional specializations of language, i.e. administrative,\nlegal, business, scientific, etc. The course deals with the ...\n\n      more description for TRAN1-GC 1120 »\n\n      \n\n\n\nStylistics is the part of language study that explores the connotative rather than the denotative level of\na message. It is very important for translators to be able to identify the elements that make up the style\nof the original and preserve it in their translation. In this course students learn how to identify and use\nthe lexical, syntactic and communicative aspects of aesthetic tonality, i.e. common language vs. poetic,\nliterary, and written language, as well as the functional specializations of language, i.e. administrative,\nlegal, business, scientific, etc. The course deals with the specific issues posed by Spanish and English.\n\n      less description for TRAN1-GC 1120 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 1220",
            "course_name": "",
            "description": "TRAN1-GC 1220\n\n   Contrastive Stylistics: French/English\n\nStylistics is the part of language study that explores the connotative rather than the\ndenotative level of a message. It is very important for translators to be able to identify the elements\nthat make up the style of the original and preserve it in their translation. In this course students learn\nhow to identify and use the lexical, syntactic and communicative aspects of aesthetic tonality, i.e.\ncommon language vs. poetic, literary, and written language, as well as the functional specializations of\nlanguage, i.e. administrative, legal, business, scientific, etc. The course deals with the ...\n\n      more description for TRAN1-GC 1220 »\n\n      \n\n\n\nStylistics is the part of language study that explores the connotative rather than the\ndenotative level of a message. It is very important for translators to be able to identify the elements\nthat make up the style of the original and preserve it in their translation. In this course students learn\nhow to identify and use the lexical, syntactic and communicative aspects of aesthetic tonality, i.e.\ncommon language vs. poetic, literary, and written language, as well as the functional specializations of\nlanguage, i.e. administrative, legal, business, scientific, etc. The course deals with the specific issues\nposed by French and English.\n\n      less description for TRAN1-GC 1220 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 1320",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2955",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 1320\n\n   Contrastive Stylistics:Chinese/English\n\nStylistics is the part of language study that explores the connotative rather than the denotative level of a message.  It is very important for translators to be able to identify the elements that make up the style of the original and preserve it in their translation.  In this course students learn how to identify and use the lexical, syntactic and communicative aspects of aesthetic tonality, i.e. common language vs. poetic, literary, and written language, as well as the functional specializations of language, i.e. administrative, legal, business, scientific, etc.  The course deals with the sp...\n\n      more description for TRAN1-GC 1320 »\n\n      \n\n\n\nStylistics is the part of language study that explores the connotative rather than the denotative level of a message.  It is very important for translators to be able to identify the elements that make up the style of the original and preserve it in their translation.  In this course students learn how to identify and use the lexical, syntactic and communicative aspects of aesthetic tonality, i.e. common language vs. poetic, literary, and written language, as well as the functional specializations of language, i.e. administrative, legal, business, scientific, etc.  The course deals with the specific issues posed by each language pair.\n\n      less description for TRAN1-GC 1320 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 2010",
            "course_name": "Comparative Banking & Accounting Systems",
            "description": "TRAN1-GC 2010 Comparative Banking & Accounting Systems \nThis course provides students with the theoretical background needed in order to specialize as translators in the field of banking, accounting and finance in an international environment.  Some of the topics covered are: accounting principles and practices; presentation of financial statements; accounting systems; investment banking; financial reporting and analysis; banking systems, operations and transactions.  The emphasis is on comparing concepts as they apply to each language pair, with country-specific variations.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 2020",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2754",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Rozan, Alain",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 2020\n\n   Comparative Legal Systems\n\nThis course gives students a basic understanding of the Anglo-\nAmerican common-law system and the code-law system that prevails in many other countries.\nIt also covers the implications of each for the organization of legal institutions, day-to-day\nadministration of justice, and the translation of legal documentation. Topics covered include\ncomparison of the inquisitorial-investigative systems and adversarial-accusatorial systems,\nlegal procedure (organization of court systems, theoretical exposition of the nature of a lawsuit,\nprocedures of various courts and types of proceedings, the ro...\n\n      more description for TRAN1-GC 2020 »\n\n      \n\n\n\nThis course gives students a basic understanding of the Anglo-\nAmerican common-law system and the code-law system that prevails in many other countries.\nIt also covers the implications of each for the organization of legal institutions, day-to-day\nadministration of justice, and the translation of legal documentation. Topics covered include\ncomparison of the inquisitorial-investigative systems and adversarial-accusatorial systems,\nlegal procedure (organization of court systems, theoretical exposition of the nature of a lawsuit,\nprocedures of various courts and types of proceedings, the roles of judge and jury), as well as\nbusiness, marriage, inheritance, and divorce practices.\n\n      less description for TRAN1-GC 2020 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 2030",
            "course_name": "",
            "description": "TRAN1-GC 2030\n\n   Comparative Corporate Practice\n\nThe dot com phenomenon, globalization, pressures for global regulation, mega-mergers and the productivity imperative are among the trends characterizing the corporate sector in the last decade. This course examines how corporations in diverse fields and regions deal with heightened competition, public scrutiny, government oversight, non-governmental organizations and other pressures while at the same time safeguarding profits and productivity and meeting shareholder expectations. It contrasts approaches of diverse industries facing similar and different challenges. It peers inside to assess th...\n\n      more description for TRAN1-GC 2030 »\n\n      \n\n\n\nThe dot com phenomenon, globalization, pressures for global regulation, mega-mergers and the productivity imperative are among the trends characterizing the corporate sector in the last decade. This course examines how corporations in diverse fields and regions deal with heightened competition, public scrutiny, government oversight, non-governmental organizations and other pressures while at the same time safeguarding profits and productivity and meeting shareholder expectations. It contrasts approaches of diverse industries facing similar and different challenges. It peers inside to assess the roles of corporate image, marketing, sales, research and development, technology, governance and other critical factors in meeting and protecting the bottom line.\n\n      less description for TRAN1-GC 2030 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 2040",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2756",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Salmon, Michael",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 2040\n\n   Understanding the Discourse of Global Economics\n\nThe main objective of this course is that of providing students from various academic backgrounds with a condensed overview of the current structure of world economy in order to better prepare them for translation projects that involve economic materials. While some attention will be given to theory, those with little or no academic background in economics should be able to develop\na thorough understanding of the forces that shape our current global economy, and reflect on the implications thereof. Beginning with an overview of the structural characteristics of the modern world economy, we pro...\n\n      more description for TRAN1-GC 2040 »\n\n      \n\n\n\nThe main objective of this course is that of providing students from various academic backgrounds with a condensed overview of the current structure of world economy in order to better prepare them for translation projects that involve economic materials. While some attention will be given to theory, those with little or no academic background in economics should be able to develop\na thorough understanding of the forces that shape our current global economy, and reflect on the implications thereof. Beginning with an overview of the structural characteristics of the modern world economy, we proceed to discuss issues related to international trade, global governance, international financial markets, regional economic integration and resource movements. The course culminates in a review of recent and ongoing economic transformations, and how these may be instructive in our quest to better understand the logic of economic and social development, and the language used in its description and analysis.\n\n      less description for TRAN1-GC 2040 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 2111",
            "course_name": "",
            "description": "TRAN1-GC 2111\n\n   Translating for the International Financial Institutions - Spanish\n\nThe international financial institutions (IFIs) hold a central place in today’s globalized economy. Born out of the economic chaos that followed World War II, the International Bank for Reconstruction and Development (now part of the World Bank Group) and the International Monetary Fund, collectively known as the Bretton Woods institutions, have grown beyond their original mandate of stabilizing international trade and finance. Along with the World Trade Organization, established in 1995, they are playing a direct role in global governance. Because these organizations practice multilingualism ...\n\n      more description for TRAN1-GC 2111 »\n\n      \n\n\n\nThe international financial institutions (IFIs) hold a central place in today’s globalized economy. Born out of the economic chaos that followed World War II, the International Bank for Reconstruction and Development (now part of the World Bank Group) and the International Monetary Fund, collectively known as the Bretton Woods institutions, have grown beyond their original mandate of stabilizing international trade and finance. Along with the World Trade Organization, established in 1995, they are playing a direct role in global governance. Because these organizations practice multilingualism as part of the United Nations system, they offer unparalleled opportunities for linguists. This course equips  students with the skills they need to compete for a job as a staff or freelance translator with an IFI. Students become familiar with the content, terminology and style of documents produced in IFIs, as well as strategies and techniques for turning out sparkling, polished translations in the relevant subject areas. This course is offered online in a blended asynchronous and synchronous format.\n\n      less description for TRAN1-GC 2111 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 2320",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2979",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015",
                    "location": "Wickeri, Elisabeth",
                    "time": "Wed 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 2320\n\n   Comparative Legal Systems - Chinese\n\nThis course gives students a basic understanding of the Anglo-American common-law system and the code-law system that prevails in many other countries.  It also covers the implications of each for the organization of legal institutions, day-to-day administration of justice, and the translation of legal documentation.  Topics covered include comparison of the inquisitorial-investigative systems and adversarial-accusatorial systems, legal procedure (organization of court systems, jurisdiction and procedures of various courts and types of proceedings), as well as business, investment, marriage an...\n\n      more description for TRAN1-GC 2320 »\n\n      \n\n\n\nThis course gives students a basic understanding of the Anglo-American common-law system and the code-law system that prevails in many other countries.  It also covers the implications of each for the organization of legal institutions, day-to-day administration of justice, and the translation of legal documentation.  Topics covered include comparison of the inquisitorial-investigative systems and adversarial-accusatorial systems, legal procedure (organization of court systems, jurisdiction and procedures of various courts and types of proceedings), as well as business, investment, marriage and inheritance practices. This is an on-site course.\n\n      less description for TRAN1-GC 2320 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3010",
            "course_name": "Introduction to Software & Website Localization",
            "description": "TRAN1-GC 3010 Introduction to Software & Website Localization \nSoftware localization is a new and growing area of translation and is closely linked to the globalization of the explosion of electronic communications. In this introductory course students learn how to adapt software for international markets as well as to how to translate web sites.  It is important to emphasize that this area draws upon traditional translation skills, deep cultural knowledge and familiarity with technology.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3015",
            "course_name": "Editing in Translation",
            "description": "TRAN1-GC 3015 Editing in Translation \nThis course reinforces the basic principles of translation and of logical progression. It gives students a chance to strengthen their passive language by reinforcing their vocabulary in different areas, adding a special emphasis on style, register, and the specific demands of certain text categories. They research corresponding idiomatic expressions in both languages and review and compare the grammatical structures of both the active and passive languages in order to avoid the pitfalls of literal translation. Discussions of the theory of translation emerge naturally in this context.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3100",
            "course_name": "Professional Translation Workshop - Spanish",
            "description": "TRAN1-GC 3100 Professional Translation Workshop - Spanish",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3105",
            "course_name": "Translation into the \"B\" Language - Spanish",
            "description": "TRAN1-GC 3105 Translation into the \"B\" Language - Spanish \nThis course reinforces the basic principles of translation and of logical progression. It gives students a chance to strengthen their passive language by reinforcing their vocabulary in different areas, adding a special emphasis on style, register, and the specific demands of certain text categories. They research corresponding idiomatic expressions in both languages and review and compare the grammatical structures of both the active and passive languages in order to avoid the pitfalls of literal translation. Discussions of the theory of translation emerge naturally in this context.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2982",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Ashby, Gaylene M",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Financial Translation I - Spanish",
            "description": "TRAN1-GC 3120 Financial Translation I - Spanish \nThis course surveys various banking and finance-related documents. Students get an overview of the types of \ndocuments a financial translator encounters daily. Among the topics covered are annual reports, articles of incorporation, \nbylaws, financial statements, guarantees, insurance, mutual funds, shareholders meetings, and taxes. Students are expected \nto make extensive use of the Internet, other specialized terminology sources, and parallel documents.",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3125",
            "course_name": "Financial Translation II - Spanish",
            "description": "TRAN1-GC 3125 Financial Translation II - Spanish \nThis course builds on the knowledge acquired in Financial Translation I.  It explores more complex financial topics such as derivatives, economic analysis, trust structures, securities markets, shareholder agreements, tenders, and term sheets. Since the terminology required to translate these documents is rarely found in bilingual sources, this course also covers the evaluation of terminology found in alternative sources.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3130",
            "course_name": "",
            "description": "TRAN1-GC 3130\n\n   Legal Translation I - Spanish\n\nTopics covered in this course include birth, marriage, and death certificates, concepts and structures of contracts, the organization of companies, with emphasis on types of partnership and corporations, court systems, the judiciary, and the legal profession, and the prosecuting of civil and criminal cases.  On-line discussions present factual information about the civil-law and common-law approaches to the pertinent topics, as well as discussions of terminology and terminology resources.  Materials for translation include contracts, articles of incorporation, minutes of meetings, summonses an...\n\n      more description for TRAN1-GC 3130 »\n\n      \n\n\n\nTopics covered in this course include birth, marriage, and death certificates, concepts and structures of contracts, the organization of companies, with emphasis on types of partnership and corporations, court systems, the judiciary, and the legal profession, and the prosecuting of civil and criminal cases.  On-line discussions present factual information about the civil-law and common-law approaches to the pertinent topics, as well as discussions of terminology and terminology resources.  Materials for translation include contracts, articles of incorporation, minutes of meetings, summonses and complaints, petitions, motions, judgments, and orders.\n\n      less description for TRAN1-GC 3130 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3135",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2864",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3135\n\n   Legal Translation II - Spanish\n\nBuilding on the materials covered in Legal Translation I, this course covers advanced topics to include appeals, marriage and divorce, decedent estates, patents and trademarks, and real property transfers.  Classroom discussions present basic information about civil-law and common-law practices pertaining to appellate courts and types of appeals, marital property systems, marital-property and separation agreements, the prosecuting of divorce cases, inheritance laws, preparation of wills, administration of estates, patent and trademark applications, and property instruments.  Materials for tran...\n\n      more description for TRAN1-GC 3135 »\n\n      \n\n\n\nBuilding on the materials covered in Legal Translation I, this course covers advanced topics to include appeals, marriage and divorce, decedent estates, patents and trademarks, and real property transfers.  Classroom discussions present basic information about civil-law and common-law practices pertaining to appellate courts and types of appeals, marital property systems, marital-property and separation agreements, the prosecuting of divorce cases, inheritance laws, preparation of wills, administration of estates, patent and trademark applications, and property instruments.  Materials for translation include appellate briefs and decisions, pre-nuptial agreements, separation agreements, petitions for divorce, judgments of divorce, wills, certificates of inheritance, and deeds.\n\n      less description for TRAN1-GC 3135 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3135",
            "course_name": "",
            "description": "TRAN1-GC 3135\n\n   Legal Translation II -Spanish\n\nBuilding on the materials covered in Legal Translation I, this course covers\nadvanced topics to include appeals, marriage and divorce, decedent estates,\npatents and trademarks, and real property transfers.  Classroom discussions\npresent basic information about civil-law and common-law practices\npertaining to appellate courts and types of appeals, marital property\nsystems, marital-property and separation agreements, the prosecuting of\ndivorce cases, inheritance laws, preparation of wills, administration of\nestates, patent and trademark applications, and property instruments.\nMaterials for trans...\n\n      more description for TRAN1-GC 3135 »\n\n      \n\n\n\nBuilding on the materials covered in Legal Translation I, this course covers\nadvanced topics to include appeals, marriage and divorce, decedent estates,\npatents and trademarks, and real property transfers.  Classroom discussions\npresent basic information about civil-law and common-law practices\npertaining to appellate courts and types of appeals, marital property\nsystems, marital-property and separation agreements, the prosecuting of\ndivorce cases, inheritance laws, preparation of wills, administration of\nestates, patent and trademark applications, and property instruments.\nMaterials for translation include appellate briefs and decisions,\npre-nuptial agreements, separation agreements, petitions for divorce,\njudgments of divorce, wills, certificates of inheritance, and deeds.\n\n      less description for TRAN1-GC 3135 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3140",
            "course_name": "Translation of Trial and Court Documents:  Written and Sight Translation - Spanish",
            "description": "TRAN1-GC 3140 Translation of Trial and Court Documents:  Written and Sight Translation - Spanish \nStudents analyze and translate a variety of authentic contractual and evidentiary texts for use in typical court proceedings.  The focus is on differences in register, difficult legal jargon, and slang or substandard language use.  Handwritten texts, audio and video evidence are discussed, transcribed and/or translated.  Strategies for sight translation are evaluated and practiced, and court proceedings related to translated evidence are reviewed.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3145",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3212",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hague, Daryl",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3145\n\n   Translation of Contracts - Spanish\n\nThis course gives students intensive practice in translating a wide variety of contracts.  The theoretical considerations presented cover the underlying concepts of the contract (a promise supported by consideration, in the common-law system; an agreement between parties, according to the code-law view), the requirements for the existence of a contract, and a comparative study of the structure and terminology of common contract clauses.  Contracts for translation include employment agreements, leases, loan agreements, assignments of rights of various kinds, property management contracts, and c...\n\n      more description for TRAN1-GC 3145 »\n\n      \n\n\n\nThis course gives students intensive practice in translating a wide variety of contracts.  The theoretical considerations presented cover the underlying concepts of the contract (a promise supported by consideration, in the common-law system; an agreement between parties, according to the code-law view), the requirements for the existence of a contract, and a comparative study of the structure and terminology of common contract clauses.  Contracts for translation include employment agreements, leases, loan agreements, assignments of rights of various kinds, property management contracts, and contracts for the sale of properties, goods, and services.\n\n      less description for TRAN1-GC 3145 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3160",
            "course_name": "Translation of Accounting Documents - Spanish",
            "description": "TRAN1-GC 3160 Translation of Accounting Documents - Spanish \nThis course offers students the opportunity to translate specialized documents from the vast field of accounting.  Emphasis is placed on the types of accounting documents most frequently encountered in each language pair.  A better understanding of underlying concepts is sought through translation and analysis of texts such as: balance sheets, income statements, statements of cash flow, documents related to account payables and account receivables, and cost accounting documentation. Students learn how to research terminology previously unknown to them and find reliable sources of information.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3165",
            "course_name": "Translation of Banking Documents - Spanish",
            "description": "TRAN1-GC 3165 Translation of Banking Documents - Spanish \nThis course prepares students to translate highly specialized documents such as those drawn from documentation used in international banking operations, mergers and acquisitions, initial public offerings, and stock market operations.  Issues related to the translation of banking software packages are also discussed. Students learn where to find sources for specialized terminology and how to apply previously acquired knowledge to new types of texts.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3170",
            "course_name": "Translation for the Securities Market - Spanish",
            "description": "TRAN1-GC 3170 Translation for the Securities Market - Spanish \nThis course delves more deeply into the field of financial translation, focusing on the securities market.  Students learn techniques for reading and comprehension of market analyses and equity research reports.  Examples of these documents as well as documents related to initial public offerings (IPOs), financial futures, currencies, stock indexes, and the commodities market are translated.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3175",
            "course_name": "Translation of Debt-Related Material - Spanish",
            "description": "TRAN1-GC 3175 Translation of Debt-Related Material - Spanish \nDebt is the engine of the world markets, and constitutes a language unto itself.  In this course students explore the various forms of debt.  Documents examined include a variety of negotiable instruments such as loans, bonds, debentures, bankers acceptances, repos and reverse repos, and other commercial papers.  At the end of this course, students have the tools to translate any debt-related documents they may encounter.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3180",
            "course_name": "",
            "description": "TRAN1-GC 3180\n\n   Translation of Insurance Documents - Spanish\n\nThis course familiarizes students with the different types of insurance through translation and analysis of various policies, certificates, and claim forms such as those used in health insurance, life insurance, liability insurance, transport and marine insurance, and other types of coverage. The emphasis is on insurance documents most often encountered in the translation industry, and in particular on those required in the field of import-export operations, travel and tourism, and multinational-companies management.  Students learn to research specialized terminology and develop their writing...\n\n      more description for TRAN1-GC 3180 »\n\n      \n\n\n\nThis course familiarizes students with the different types of insurance through translation and analysis of various policies, certificates, and claim forms such as those used in health insurance, life insurance, liability insurance, transport and marine insurance, and other types of coverage. The emphasis is on insurance documents most often encountered in the translation industry, and in particular on those required in the field of import-export operations, travel and tourism, and multinational-companies management.  Students learn to research specialized terminology and develop their writing skills in accordance with the style and usage specific to the field.\n\n      less description for TRAN1-GC 3180 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3195",
            "course_name": "Patents Translation - Spanish",
            "description": "TRAN1-GC 3195 Patents Translation - Spanish \nStudents analyze and translate a variety of authentic contractual and evidentiary texts for use in typical court proceedings.  The focus is on differences in register, difficult legal jargon, and slang or substandard language use.  Handwritten texts, audio and video evidence are discussed, transcribed and/or translated.  Strategies for sight translation are evaluated and practiced, and court proceedings related to translated evidence are reviewed.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3196",
            "course_name": "",
            "description": "TRAN1-GC 3196\n\n   Intellectual Property Translation: Spanish-English\n\nCourse description: Intellectual property (IP) is the umbrella term covering\nareas such as copyright, trademark law, unfair competition and patent law.\nStudents study an outline of the legislation and salient aspect of each\narea, to become familiar with the mechanics and terminology, and then see\nthis applied by translating from Spanish aspects of real-life case studies\ninvolving intellectual property lawsuits. This approach provide an overview\nof generalist education in intellectual property law and policy as well as\nfocus on a specific area, such as biotech patents, media and entertainment\nl...\n\n      more description for TRAN1-GC 3196 »\n\n      \n\n\n\nCourse description: Intellectual property (IP) is the umbrella term covering\nareas such as copyright, trademark law, unfair competition and patent law.\nStudents study an outline of the legislation and salient aspect of each\narea, to become familiar with the mechanics and terminology, and then see\nthis applied by translating from Spanish aspects of real-life case studies\ninvolving intellectual property lawsuits. This approach provide an overview\nof generalist education in intellectual property law and policy as well as\nfocus on a specific area, such as biotech patents, media and entertainment\nlaw, gene patents, Napster-like peer-to-peer file sharing, etc. \n\n \n\nStudents carry out research using relevant multilingual databases and\nresources from international organizations. Becoming familiar with the\ncontent, terminology and style of documents involved in this field, as well\nas with the appropriate translation strategies and techniques prepares\nparticipants to produce professional-level translations in these specific\nsubject areas, helping them gain an advantage over those competing for\nsimilar work but with only a general background.\n\n      less description for TRAN1-GC 3196 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3200",
            "course_name": "Professional Translation Workshop - French",
            "description": "TRAN1-GC 3200 Professional Translation Workshop - French",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3205",
            "course_name": "Translation into the \"B\" Language - French",
            "description": "TRAN1-GC 3205 Translation into the \"B\" Language - French \nThis course reinforces the basic principles of translation and of logical progression. It gives students a chance to strengthen their passive language by reinforcing their vocabulary in different areas, adding a special emphasis on style, register, and the specific demands of certain text categories. They research corresponding idiomatic expressions in both languages and review and compare the grammatical structures of both the active and passive languages in order to avoid the pitfalls of literal translation. Discussions of the theory of translation emerge naturally in this context.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3220",
            "course_name": "Financial Translation I - French",
            "description": "TRAN1-GC 3220 Financial Translation I - French \nThis course surveys various banking and finance-related documents. Students get an overview of the types of \ndocuments a financial translator encounters daily. Among the topics covered are annual reports, articles of incorporation, \nbylaws, financial statements, guarantees, insurance, mutual funds, shareholders meetings, and taxes. Students are expected \nto make extensive use of the Internet, other specialized terminology sources, and parallel documents.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3225",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2874",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Huhule, Roxana",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Financial Translation II - French",
            "description": "TRAN1-GC 3225 Financial Translation II - French \nThis course builds on the knowledge acquired in Financial Translation I.  It explores more complex financial topics such as derivatives, economic analysis, trust structures, securities markets, shareholder agreements, tenders, and term sheets. Since the terminology required to translate these documents is rarely found in bilingual sources, this course also covers the evaluation of terminology found in alternative sources.",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3230",
            "course_name": "",
            "description": "TRAN1-GC 3230\n\n   Legal Translation I - French\n\nTopics covered in this course include birth, marriage, and death certificates, concepts and structures of contracts, the organization of companies, with emphasis on types of partnership and corporations, court systems, the judiciary, and the legal profession, and the prosecuting of civil and criminal cases.  On-line discussions present factual information about the civil-law and common-law approaches to the pertinent topics, as well as discussions of terminology and terminology resources.  Materials for translation include contracts, articles of incorporation, minutes of meetings, summonses an...\n\n      more description for TRAN1-GC 3230 »\n\n      \n\n\n\nTopics covered in this course include birth, marriage, and death certificates, concepts and structures of contracts, the organization of companies, with emphasis on types of partnership and corporations, court systems, the judiciary, and the legal profession, and the prosecuting of civil and criminal cases.  On-line discussions present factual information about the civil-law and common-law approaches to the pertinent topics, as well as discussions of terminology and terminology resources.  Materials for translation include contracts, articles of incorporation, minutes of meetings, summonses and complaints, petitions, motions, judgments, and orders.\n\n      less description for TRAN1-GC 3230 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3235",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3211",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hennessy, Eileen",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Legal Translation II - French",
            "description": "TRAN1-GC 3235 Legal Translation II - French",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3240",
            "course_name": "Translation of Trial and Court Documents:  Written and Sight Translation - French",
            "description": "TRAN1-GC 3240 Translation of Trial and Court Documents:  Written and Sight Translation - French \nStudents analyze and translate a variety of authentic contractual and\nevidentiary texts for use in typical court proceedings.  The focus is on\ndifferences in register, difficult legal jargon, and slang or substandard\nlanguage use.  Handwritten texts, audio and video evidence are discussed,\ntranscribed and/or translated.  Strategies for sight translation are\nevaluated and practiced, and court proceedings related to translated\nevidence are reviewed.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3245",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2939",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hennessy, Eileen",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3245\n\n   Translation of Contracts - French\n\nThis course gives students intensive practice in translating a wide variety of contracts.  The theoretical considerations presented cover the underlying concepts of the contract (a promise supported by consideration, in the common-law system; an agreement between parties, according to the code-law view), the requirements for the existence of a contract, and a comparative study of the structure and terminology of common contract clauses.  Contracts for translation include employment agreements, leases, loan agreements, assignments of rights of various kinds, property management contracts, and c...\n\n      more description for TRAN1-GC 3245 »\n\n      \n\n\n\nThis course gives students intensive practice in translating a wide variety of contracts.  The theoretical considerations presented cover the underlying concepts of the contract (a promise supported by consideration, in the common-law system; an agreement between parties, according to the code-law view), the requirements for the existence of a contract, and a comparative study of the structure and terminology of common contract clauses.  Contracts for translation include employment agreements, leases, loan agreements, assignments of rights of various kinds, property management contracts, and contracts for the sale of properties, goods, and services.\n\n      less description for TRAN1-GC 3245 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3260",
            "course_name": "Translation of Accounting Documents - French",
            "description": "TRAN1-GC 3260 Translation of Accounting Documents - French \nThis course offers students the opportunity to translate specialized documents from the vast field of accounting.  Emphasis is placed on the types of accounting documents most frequently encountered in each language pair.  A better understanding of underlying concepts is sought through translation and analysis of texts such as: balance sheets, income statements, statements of cash flow, documents related to account payables and account receivables, and cost accounting documentation. Students learn how to research terminology previously unknown to them and find reliable sources of information.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3265",
            "course_name": "Translation of Banking Documents - French",
            "description": "TRAN1-GC 3265 Translation of Banking Documents - French \nThis course prepares students to translate highly specialized documents such as those drawn from documentation used in international banking operations, mergers and acquisitions, initial public offerings, and stock market operations.  Issues related to the translation of banking software packages are also discussed. Students learn where to find sources for specialized terminology and how to apply previously acquired knowledge to new types of texts.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3270",
            "course_name": "Translation for the Securities Market - French",
            "description": "TRAN1-GC 3270 Translation for the Securities Market - French \nThis course delves more deeply into the field of financial translation, focusing on the securities market.  Students learn techniques for reading and comprehension of market analyses and equity research reports.  Examples of these documents as well as documents related to initial public offerings (IPOs), financial futures, currencies, stock indexes, and the commodities market are translated.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3275",
            "course_name": "Translation of Debt-Related Materials - French",
            "description": "TRAN1-GC 3275 Translation of Debt-Related Materials - French \nDebt is the engine of the world markets, and constitutes a language unto itself.  In this course students explore the various forms of debt.  Documents examined include a variety of negotiable instruments such as loans, bonds, debentures, bankers acceptances, repos and reverse repos, and other commercial papers.  At the end of this course, students have the tools to translate any debt-related documents they may encounter.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3280",
            "course_name": "",
            "description": "TRAN1-GC 3280\n\n   Translation of Insurance Documents - French\n\nThis course familiarizes students with the different types of insurance through translation and analysis of various policies, certificates, and claim forms such as those used in health insurance, life insurance, liability insurance, transport and marine insurance, and other types of coverage. The emphasis is on insurance documents most often encountered in the translation industry, and in particular on those required in the field of import-export operations, travel and tourism, and multinational-companies management.  Students learn to research specialized terminology and develop their writing...\n\n      more description for TRAN1-GC 3280 »\n\n      \n\n\n\nThis course familiarizes students with the different types of insurance through translation and analysis of various policies, certificates, and claim forms such as those used in health insurance, life insurance, liability insurance, transport and marine insurance, and other types of coverage. The emphasis is on insurance documents most often encountered in the translation industry, and in particular on those required in the field of import-export operations, travel and tourism, and multinational-companies management.  Students learn to research specialized terminology and develop their writing skills in accordance with the style and usage specific to the field.\n\n      less description for TRAN1-GC 3280 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3295",
            "course_name": "Patents Translation - French",
            "description": "TRAN1-GC 3295 Patents Translation - French \nThis course introduces students to the world of patent writing by translating various patent and trademark applications and claims, covering different areas including chemical, mechanical, electrical, industrial, pharmaceutical documents, etc.  Students learn special terminology, semantic and grammatical constructions, and the formats particular to patents and trademarks.  Concepts necessary for patent translation are also discussed, such as application and filing, intellectual property, copyright, and research techniques.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3300",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2977",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015",
                    "location": "Peng, Hsin-Yi",
                    "time": "Thu 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3300\n\n   Professional Translation Workshop (Chinese to English)\n\nThis course serves as an overview of the practice of professional translation and offers a hands-on approach to a wide-range of translation areas. Translation is a complex and multi-faceted field which has been greatly impacted by the advances in technology and sophisticated business practices. Thus, the successful translator of the future must have a breadth of understanding about the scope of work in the field as well as the business aspects of the profession.  Students learn how to: use key translation resources; develop strategies; determine criteria for evaluation; work in revision mode; ...\n\n      more description for TRAN1-GC 3300 »\n\n      \n\n\n\nThis course serves as an overview of the practice of professional translation and offers a hands-on approach to a wide-range of translation areas. Translation is a complex and multi-faceted field which has been greatly impacted by the advances in technology and sophisticated business practices. Thus, the successful translator of the future must have a breadth of understanding about the scope of work in the field as well as the business aspects of the profession.  Students learn how to: use key translation resources; develop strategies; determine criteria for evaluation; work in revision mode; and evaluate the major theoretical and historical landmarks of the field. They practice translating academic documents, consumer-oriented texts, scientific and technical texts, material for the medical profession, legal firms, financial organizations, literary publications, and the Web.\n\n      less description for TRAN1-GC 3300 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3305",
            "course_name": "Translation into the \"B\" Language: Chinese",
            "description": "TRAN1-GC 3305 Translation into the \"B\" Language: Chinese \nThis course reinforces the basic principles of translation and of logical progression. It gives students a chance to strengthen their passive language by reinforcing their vocabulary in different areas, adding a special emphasis on style, register, and the specific demands of certain text categories. They research corresponding idiomatic expressions in both languages and review and compare the grammatical structures of both the active and passive languages in order to avoid the pitfalls of literal translation. Discussions of the theory of translation emerge naturally in this context.",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3330",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2980",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Wong, Andy",
                    "time": "Tue 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3330\n\n   Legal Translation I - Chinese\n\nTopics covered in this course include birth, marriage, and death certificates, concepts and structures of contracts, the organization of companies, with emphasis on types of partnership and corporations, court systems, the judiciary, and the legal profession, and the prosecuting of civil and criminal cases.  On-line discussions present factual information about the civil-law and common-law approaches to the pertinent topics, as well as discussions of terminology and terminology resources.  Materials for translation include contracts, articles of incorporation, minutes of meetings, summonses an...\n\n      more description for TRAN1-GC 3330 »\n\n      \n\n\n\nTopics covered in this course include birth, marriage, and death certificates, concepts and structures of contracts, the organization of companies, with emphasis on types of partnership and corporations, court systems, the judiciary, and the legal profession, and the prosecuting of civil and criminal cases.  On-line discussions present factual information about the civil-law and common-law approaches to the pertinent topics, as well as discussions of terminology and terminology resources.  Materials for translation include contracts, articles of incorporation, minutes of meetings, summonses and complaints, petitions, motions, judgments, and orders.\n\n      less description for TRAN1-GC 3330 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3335",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2978",
                    "section": "001",
                    "period": "09/04/2015 - 12/11/2015",
                    "location": "Wong, Andy",
                    "time": "Fri 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3335\n\n   Legal translation II - Chinese\n\nBuilding on the materials covered in Legal Translation I, this course covers advanced topics to include appeals, marriage and divorce, decedent estates, patents and trademarks, and real property transfers.  Classroom discussions present basic information about civil-law and common-law practices pertaining to appellate courts and types of appeals, marital property systems, marital-property and separation agreements, the prosecuting of divorce cases, inheritance laws, preparation of wills, administration of estates, patent and trademark applications, and property instruments.  Materials for tran...\n\n      more description for TRAN1-GC 3335 »\n\n      \n\n\n\nBuilding on the materials covered in Legal Translation I, this course covers advanced topics to include appeals, marriage and divorce, decedent estates, patents and trademarks, and real property transfers.  Classroom discussions present basic information about civil-law and common-law practices pertaining to appellate courts and types of appeals, marital property systems, marital-property and separation agreements, the prosecuting of divorce cases, inheritance laws, preparation of wills, administration of estates, patent and trademark applications, and property instruments.  Materials for translation include appellate briefs and decisions, pre-nuptial agreements, separation agreements, petitions for divorce, judgments of divorce, wills, certificates of inheritance, and deeds.\n\n      less description for TRAN1-GC 3335 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3350",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3012",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Tay, Julie",
                    "time": "Tue 12.00 PM - 2.40 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3350\n\n   Commercial Translation I (Chinese to English)\n\nThis course provides guidance and practice in translating documents relating to business, economics, financial markets, marketing and advertising for small businesses and larger organizations. Students learn terminology, the style and register of the various types of business communication and ultimately, the adequate translation into English of texts written in another language. The course progresses from relatively simple texts to longer and more difficult ones. Topics covered include business correspondence, corporate and other company structures, types of businesses, from manufacturing to ...\n\n      more description for TRAN1-GC 3350 »\n\n      \n\n\n\nThis course provides guidance and practice in translating documents relating to business, economics, financial markets, marketing and advertising for small businesses and larger organizations. Students learn terminology, the style and register of the various types of business communication and ultimately, the adequate translation into English of texts written in another language. The course progresses from relatively simple texts to longer and more difficult ones. Topics covered include business correspondence, corporate and other company structures, types of businesses, from manufacturing to \"New Economy”, news articles on business and finance, marketing and advertising of commercial products, accounting terms, financial reports, tax matters, sales, payment and shipping terms.\n\n      less description for TRAN1-GC 3350 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3355",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3221",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015",
                    "location": "Tay, Julie",
                    "time": "Thu 2.30 PM - 5.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3355\n\n   Commercial Translation II (Chinese to English)\n\nThis course builds upon the knowledge and skills acquired in Commercial Translation I.  Students work on documents used in international commerce and macro-economics. Through authentic documents in both languages, they delve into more complex topics such as economic analysis, trust structures, shareholder agreements, tenders, and term sheets.  Other topics include stockholder meetings, contracts, labor and employee relations, bylaws and other aspects of commercial law.  Students learn to apply basic concepts of economics and business to real-world texts, thereby improving their command of the ...\n\n      more description for TRAN1-GC 3355 »\n\n      \n\n\n\nThis course builds upon the knowledge and skills acquired in Commercial Translation I.  Students work on documents used in international commerce and macro-economics. Through authentic documents in both languages, they delve into more complex topics such as economic analysis, trust structures, shareholder agreements, tenders, and term sheets.  Other topics include stockholder meetings, contracts, labor and employee relations, bylaws and other aspects of commercial law.  Students learn to apply basic concepts of economics and business to real-world texts, thereby improving their command of the technical terminology of these fields. The terminology required to translate these documents is rarely found in bilingual sources, so students also learn how to research and evaluate terminology found in alternative sources and, consequently, build their own terminological databases.\n\n      less description for TRAN1-GC 3355 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3390",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17759",
                    "section": "001",
                    "period": "09/14/2015 - 12/14/2015",
                    "location": "Ren, Ming",
                    "time": "Mon 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAN1-GC 3390\n\n   Technical Translation (Chinese to English)\n\nIn this course you will gain practical knowledge of the process of technical translation. The course focuses on some of the most commonly encountered engineering fields. The technical documents used as sample translations cover a broad range of fields and appear in numerous contexts. Students discover new terminology sources in various media. They learn how to develop their own strategies for resolving terminology issues and learn how to research technical subjects.  Students do this through practical exercises, doing translations that are authentic documents which were given for translation. ...\n\n      more description for TRAN1-GC 3390 »\n\n      \n\n\n\nIn this course you will gain practical knowledge of the process of technical translation. The course focuses on some of the most commonly encountered engineering fields. The technical documents used as sample translations cover a broad range of fields and appear in numerous contexts. Students discover new terminology sources in various media. They learn how to develop their own strategies for resolving terminology issues and learn how to research technical subjects.  Students do this through practical exercises, doing translations that are authentic documents which were given for translation. They translate them as if they were doing a real paid job, trying to approach professional conditions as much as possible (deadline, presentation).\n\n      less description for TRAN1-GC 3390 «",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 3401",
            "course_name": "",
            "description": "TRAN1-GC 3401\n\n   Legal Translation I: English to Spanish\n\nThis course is an introduction to the challenging work of translating between the languages of two different legal systems. It includes a comparative survey of Anglo-American and Ibero-Latin American concepts and legal practice, and addresses legal writing styles, terminology, and specialized reference materials. The course covers translation of various types of contracts and the basic documents involved in the prosecuting of civil and criminal cases: summonses and complaints, certificates of service of documents, pleadings, and judgments. Students are expected to do on-line research as necess...\n\n      more description for TRAN1-GC 3401 »\n\n      \n\n\n\nThis course is an introduction to the challenging work of translating between the languages of two different legal systems. It includes a comparative survey of Anglo-American and Ibero-Latin American concepts and legal practice, and addresses legal writing styles, terminology, and specialized reference materials. The course covers translation of various types of contracts and the basic documents involved in the prosecuting of civil and criminal cases: summonses and complaints, certificates of service of documents, pleadings, and judgments. Students are expected to do on-line research as necessary, and to participate in the weekly Forum exchanges. There will be a weekly on-line synchronous session, on dates and at times to be arranged. Differences between the systems of the various Spanish-speaking countries are discussed and their impact on translation decisions. An important aspect of the course is learning to meet clients’ needs and translating for the various Spanish language markets including the one in the USA.\n\n      less description for TRAN1-GC 3401 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3402",
            "course_name": "",
            "description": "TRAN1-GC 3402\n\n   Legal Translation II: English to Spanish\n\nThis workshop course builds on the translation experience acquired in Legal Translation I. It goes deeper into areas of civil and commercial law and covers topics of marriage and divorce, decedent estates, and real property, as well class action and anti-trust litigation.  Students continue to master pertinent civil-law and case-law concepts, terminology, and legal writing styles. Weekly assignments for translation include pre-nuptial agreements, separation agreements, and judgments of divorce; last wills, certificates of inheritance, powers of attorney for sale of real property and contracts ...\n\n      more description for TRAN1-GC 3402 »\n\n      \n\n\n\nThis workshop course builds on the translation experience acquired in Legal Translation I. It goes deeper into areas of civil and commercial law and covers topics of marriage and divorce, decedent estates, and real property, as well class action and anti-trust litigation.  Students continue to master pertinent civil-law and case-law concepts, terminology, and legal writing styles. Weekly assignments for translation include pre-nuptial agreements, separation agreements, and judgments of divorce; last wills, certificates of inheritance, powers of attorney for sale of real property and contracts of sale of real property. \n\nStudents are expected to do on-line research as necessary, and are required to participate in the weekly asynchronous Forum exchanges and to attend the weekly on-line synchronous sessions, held on dates and at times to be arranged. An important aspect of the course is learning to meet clients’ needs and translating for the various Spanish language markets including the one in the USA.\n\n      less description for TRAN1-GC 3402 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3403",
            "course_name": "",
            "description": "TRAN1-GC 3403\n\n   Financial Translation I: English to Spanish\n\nThis course presents and discusses the most common documents in the field of financial translation. Students learn how to analyze and translate progressively more difficult documents ranging from financial statements, notes to financial statements, and annual reports to valuation reports, surety bonds and letters of credit, prospectuses and purchase orders. Students are expected to make extensive use of the Internet, specialized terminology sources and parallel documents (both previous translations and original target-language documents). \n\nAn important aspect of the course is learning to work...\n\n      more description for TRAN1-GC 3403 »\n\n      \n\n\n\nThis course presents and discusses the most common documents in the field of financial translation. Students learn how to analyze and translate progressively more difficult documents ranging from financial statements, notes to financial statements, and annual reports to valuation reports, surety bonds and letters of credit, prospectuses and purchase orders. Students are expected to make extensive use of the Internet, specialized terminology sources and parallel documents (both previous translations and original target-language documents). \n\nAn important aspect of the course is learning to work with clients and translating for the various Spanish language markets including the one in the USA.\n\n      less description for TRAN1-GC 3403 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3404",
            "course_name": "",
            "description": "TRAN1-GC 3404\n\n   Financial Translation II: English to Spanish\n\nThis course builds upon the knowledge and skills acquired in the prerequisite course Financial Translation I: English to Spanish, furthering the discussion and analysis of documents and concepts encountered in the field of financial translation. The topics covered include shareholders’ agreements, loan agreements, promissory notes, trusts, derivatives, reinsurance, mergers, economic reports and annuities. Students are expected to make extensive use of the Internet, specialized terminology sources and parallel documents (both previous translations and original target-language documents). \n\nIn t...\n\n      more description for TRAN1-GC 3404 »\n\n      \n\n\n\nThis course builds upon the knowledge and skills acquired in the prerequisite course Financial Translation I: English to Spanish, furthering the discussion and analysis of documents and concepts encountered in the field of financial translation. The topics covered include shareholders’ agreements, loan agreements, promissory notes, trusts, derivatives, reinsurance, mergers, economic reports and annuities. Students are expected to make extensive use of the Internet, specialized terminology sources and parallel documents (both previous translations and original target-language documents). \n\nIn this course, students will further deepen their knowledge of the areas that comprise the specialty of financial translation. Students will develop skills necessary for researching and solving a number of financial terminology problems. Special emphasis will be placed on translating in proper style register and producing accurate work. \n\nThis course presents and discusses more challenging documents in the field of financial translation. Students learn how to analyze and translate letters of credit, shareholders agreements, corporate bylaws, reinsurance documents, promissory notes, and others.  Students are expected to make extensive use of the Internet, specialized terminology sources and parallel documents (both previous translations and original target-language documents). \n\nAn important aspect of the course is learning to work with clients and translating for the various Spanish language markets including the one in the USA.\n\n      less description for TRAN1-GC 3404 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 3405",
            "course_name": "",
            "description": "TRAN1-GC 3405\n\n   Translation of Contracts: English to Spanish\n\nContracts are the product of a bargaining process, and they employ language designed to ensure that all parties understand their responsibilities. In this course, students become familiar with contract language and the resources necessary to translate contracts effectively from English to Spanish. Students explore the specifics of the common law and civil law systems in the area of contracts and the strategies that need to be employed in the process of translation. The course places special emphasis on developing the comprehension and research skills students need to be successful translators....\n\n      more description for TRAN1-GC 3405 »\n\n      \n\n\n\nContracts are the product of a bargaining process, and they employ language designed to ensure that all parties understand their responsibilities. In this course, students become familiar with contract language and the resources necessary to translate contracts effectively from English to Spanish. Students explore the specifics of the common law and civil law systems in the area of contracts and the strategies that need to be employed in the process of translation. The course places special emphasis on developing the comprehension and research skills students need to be successful translators. Attention is also paid to the laws of the various Spanish-speaking countries.     \n\nAn important aspect of the course is learning to meet clients’ needs and translating for the various Spanish language markets including the one in the USA.\n\n      less description for TRAN1-GC 3405 «",
            "offering": false
        },
        {
            "course_id": "TRAN1-GC 4000",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2938",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Preston, Afua; Savova, Milena V; Tay, Julie",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Thesis Project",
            "description": "TRAN1-GC 4000 Thesis Project \nThe thesis can be a large translation of complexity, a localization project, or a research project. Students select their projects with the approval of an advisor and the program director. While working on their projects they have regular communication with their advisors. The thesis is defended in person on the NYU campus or via video conference.",
            "offering": true
        },
        {
            "course_id": "TRAN1-GC 4010",
            "course_name": "Independent Study",
            "description": "TRAN1-GC 4010 Independent Study",
            "offering": false
        }
    ]
}