{
    "major_id": "AHSEM-UA",
    "file": "./2015-2016/Advanced_Honors_Seminars_(AHSEM-UA).html",
    "courses": [
        {
            "course_id": "AHSEM-UA 101",
            "course_name": "Just and Unjust Wars",
            "description": "AHSEM-UA  101 Just and Unjust Wars",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 102",
            "course_name": "Storytelling",
            "description": "AHSEM-UA  102 Storytelling",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 103",
            "course_name": "Legal Aspects of Amer Use of Force Since WWII",
            "description": "AHSEM-UA  103 Legal Aspects of Amer Use of Force Since WWII",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 104",
            "course_name": "",
            "description": "AHSEM-UA  104\n\n   The Politics of Human Rights\n\nThis course offers an introduction to the political history of the current international human rights regime, the major sources of prominent contemporary human rights problems, the extent to which major human rights problems are being successfully addressed by the international system and its institutions, and the strategies that are currently being advocated to more effectively reduce the high level of human rights violations. A major emphasis of the course is on analyzing the political inspirations behind the creation of the human rights regime, the role that politics plays in generating hum...\n\n      more description for AHSEM-UA  104 »\n\n      \n\n\n\nThis course offers an introduction to the political history of the current international human rights regime, the major sources of prominent contemporary human rights problems, the extent to which major human rights problems are being successfully addressed by the international system and its institutions, and the strategies that are currently being advocated to more effectively reduce the high level of human rights violations. A major emphasis of the course is on analyzing the political inspirations behind the creation of the human rights regime, the role that politics plays in generating human rights crises, and the political forces that operate to limit the effectiveness of international and regional institutions in addressing human rights problems and the suffering that they create.\n\n      less description for AHSEM-UA  104 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 105",
            "course_name": "",
            "description": "AHSEM-UA  105\n\n   Urban Collective Violence in America\n\nThis seminar examines the urban origins, character, and changing patterns of violence in American cities. It focuses on collective violence rather than on individual acts of violence, regardless of how many victims an individual may have claimed. One part of the course considers the extent to which American culture and political institutions encourage, sanctify, or militate against aggressive behavior and create a climate for or against violence. In that context, some of our concerns must be comparative, cross-cultural, and transnational. In addition, we address broad interdisciplinary concept...\n\n      more description for AHSEM-UA  105 »\n\n      \n\n\n\nThis seminar examines the urban origins, character, and changing patterns of violence in American cities. It focuses on collective violence rather than on individual acts of violence, regardless of how many victims an individual may have claimed. One part of the course considers the extent to which American culture and political institutions encourage, sanctify, or militate against aggressive behavior and create a climate for or against violence. In that context, some of our concerns must be comparative, cross-cultural, and transnational. In addition, we address broad interdisciplinary conceptual questions that anthropologists, psychologists, and sociologists, in particular, ask about human nature, gender conditioning in Western cultures, and ?deviant? subcultures. In creating a typology for the analysis of violence in American cities over time, we distinguish between forms of violence, the direction of changes sought, and the social and material characteristics of the antagonists?is the conflict generated, for example, by a privileged elite seeking to protect the authority that it feels is being jeopardized by aspiring newcomers, or is it rooted in efforts by the dispossessed struggling to gain some notion of a fair share?\n\n      less description for AHSEM-UA  105 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 106",
            "course_name": "",
            "description": "AHSEM-UA  106\n\n   Reading Vergil'S Aeneid\n\nWhile not everyone agrees on what books constitute the Western ?canon,? Vergil?s Aeneid is surely one of those texts that, for better or worse, has influenced how we think and act. The book is the epic story of a hero, Aeneas, who escapes from his homeland in Asia, Troy, after it has been sacked by the Greeks. Aeneas wanders westward in search of a new home, arrives in Italy, and then wages a war with the native population to set in motion a divinely ordained process that culminates, centuries after his death, in the founding of Rome. Apart from being a gripping story, the Aeneid can also be r...\n\n      more description for AHSEM-UA  106 »\n\n      \n\n\n\nWhile not everyone agrees on what books constitute the Western ?canon,? Vergil?s Aeneid is surely one of those texts that, for better or worse, has influenced how we think and act. The book is the epic story of a hero, Aeneas, who escapes from his homeland in Asia, Troy, after it has been sacked by the Greeks. Aeneas wanders westward in search of a new home, arrives in Italy, and then wages a war with the native population to set in motion a divinely ordained process that culminates, centuries after his death, in the founding of Rome. Apart from being a gripping story, the Aeneid can also be read as a foundation myth for the West. It explores the tension between public and private, and between duty and desire; it raises questions about the benefits?and costs?of empire; and it explores increasingly timely questions about the effects that war has on nations and on individuals. The poem also problematizes knowledge, raising very real questions about how (or even if) we know what we think we know. Involves close analysis of this single book, in English translation and collateral readings from other ancient texts as well as a discussion of recent scholarly literature. Students participate in special study trips to several major museums and develop their own special projects.\n\n      less description for AHSEM-UA  106 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 107",
            "course_name": "Political Cinema and Representation of Other",
            "description": "AHSEM-UA  107 Political Cinema and Representation of Other",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 108",
            "course_name": "Reading Don Quixote",
            "description": "AHSEM-UA  108 Reading Don Quixote",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 109",
            "course_name": "20th Century Europe in Literature and Memory",
            "description": "AHSEM-UA  109 20th Century Europe in Literature and Memory",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 110",
            "course_name": "Law, Health, and Poverty",
            "description": "AHSEM-UA  110 Law, Health, and Poverty",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 111",
            "course_name": "Scientific Thinking and Speculation",
            "description": "AHSEM-UA  111 Scientific Thinking and Speculation",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 112",
            "course_name": "",
            "description": "AHSEM-UA  112\n\n   Cinema & Society in Europe Since 1945\n\nThis seminar addresses aspects of the history of European history since World War II through postwar European cinema. The seminar pays attention to the films themselves, as art and as entertainment; but also and above all is concerned with their subject matter, their contemporary setting, and their impact (at the time and since). Participants meet twice weekly: once to see that week?s film, once for discussion. In addition to watching the films, students are required to read assigned works of history dealing with the period. Among the themes to be addressed?in the films, the readings, the clas...\n\n      more description for AHSEM-UA  112 »\n\n      \n\n\n\nThis seminar addresses aspects of the history of European history since World War II through postwar European cinema. The seminar pays attention to the films themselves, as art and as entertainment; but also and above all is concerned with their subject matter, their contemporary setting, and their impact (at the time and since). Participants meet twice weekly: once to see that week?s film, once for discussion. In addition to watching the films, students are required to read assigned works of history dealing with the period. Among the themes to be addressed?in the films, the readings, the class discussion, and, eventually, the final papers?are the following: war and civil war as represented and remembered in the postwar decades; the Cold War; decolonization; the European ?economic miracle? and its attendant social impact; the ?sixties?; different generations of migration, both into Europe and within and between countries; national identities and the attached stereotypes; the Yugoslav Wars; remembering (and forgetting) Communism; the Holocaust in postwar European consciousness. A final paper requires students to choose one theme and then, with instructor?s assistance, identify a body of related films to see and discuss.\n\n      less description for AHSEM-UA  112 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 113",
            "course_name": "",
            "description": "AHSEM-UA  113\n\n   A History of Disbelief\n\nThis seminar will take up an extended history of atheism and doubt (in the context of a history of religion). It will begin in Greece and then move on to a brief discussion of anthropological perspectives on belief, before returning to Greece, to the Hebrews and Rome, to India and Baghdad, and then back to Europe during the Renaissance, the Scientific Revolution, the Enlightenment, and the Romantic period. Time will be spent in England and America in the 19th century, when disbelief was being tied to radical politics, before moving on to the connection between disbelief and realism, modernism ...\n\n      more description for AHSEM-UA  113 »\n\n      \n\n\n\nThis seminar will take up an extended history of atheism and doubt (in the context of a history of religion). It will begin in Greece and then move on to a brief discussion of anthropological perspectives on belief, before returning to Greece, to the Hebrews and Rome, to India and Baghdad, and then back to Europe during the Renaissance, the Scientific Revolution, the Enlightenment, and the Romantic period. Time will be spent in England and America in the 19th century, when disbelief was being tied to radical politics, before moving on to the connection between disbelief and realism, modernism and postmodernism. The main arguments for and against the existence of God will be considered. However, the main purpose of this course will be to force students to confront and grapple with some of the most sophisticated and profound human expressions of disbelief. Authors whose works will be read may include Cicero, Hume, Holbach, Paine, Shelley, Dostoevsky, Nietzsche, Woolf, and Freud, among others.\n\n      less description for AHSEM-UA  113 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 114",
            "course_name": "Geology & Antiquity in The Mediterranean",
            "description": "AHSEM-UA  114 Geology & Antiquity in The Mediterranean",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 115",
            "course_name": "Greek and Roman Coins and Economies",
            "description": "AHSEM-UA  115 Greek and Roman Coins and Economies",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 116",
            "course_name": "Pol & Moral Conflicts & The U.S. Constitution",
            "description": "AHSEM-UA  116 Pol & Moral Conflicts & The U.S. Constitution",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 117",
            "course_name": "The Port of New York",
            "description": "AHSEM-UA  117 The Port of New York",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 118",
            "course_name": "",
            "description": "AHSEM-UA  118\n\n   Civil Rights to Gay Lib: U.S. Soc Mvmnts, 1950-80\n\nSocial movements have been theorized primarily by social scientists; a typical sociological definition is, episodes of collective behavior and action that create significant social change and command significant grassroots participation.?We consider these theories but also ask various questions: What do ?organizers? do??How do social movements construct identities and how do identities affect social movements? How do social movements use or repress multiple identities??When are social movements political??How and when do social movements yield or grow out of organizations and what is the impac...\n\n      more description for AHSEM-UA  118 »\n\n      \n\n\n\nSocial movements have been theorized primarily by social scientists; a typical sociological definition is, episodes of collective behavior and action that create significant social change and command significant grassroots participation.?We consider these theories but also ask various questions: What do ?organizers? do??How do social movements construct identities and how do identities affect social movements? How do social movements use or repress multiple identities??When are social movements political??How and when do social movements yield or grow out of organizations and what is the impact of the relation between movements and organizations??Are there elite social movements??Are social movements always democratic? When do social movements become violent? Are social movements inevitably vulnerable to demagoguery and authoritarianism?\n\n      less description for AHSEM-UA  118 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 119",
            "course_name": "",
            "description": "AHSEM-UA  119\n\n   Jesus and Muhammad\n\nJesus and Muhammad were the founders, though in very different senses, of the world?s two most populous religious traditions, Christianity and Islam. As such they have been the objects of veneration since their own lifetime and also, since the 19th century, the subjects of intense historical scrutiny by both believers and nonbelievers. The ?quest for the historical Jesus? has become in fact almost a laboratory experiment in historiography, and with increasing confidence in the results. The same quest for the ?Muhammad of history,? as opposed to the ?Muhammad of faith,? though conducted in much...\n\n      more description for AHSEM-UA  119 »\n\n      \n\n\n\nJesus and Muhammad were the founders, though in very different senses, of the world?s two most populous religious traditions, Christianity and Islam. As such they have been the objects of veneration since their own lifetime and also, since the 19th century, the subjects of intense historical scrutiny by both believers and nonbelievers. The ?quest for the historical Jesus? has become in fact almost a laboratory experiment in historiography, and with increasing confidence in the results. The same quest for the ?Muhammad of history,? as opposed to the ?Muhammad of faith,? though conducted in much the same way, and with much the same kind of evidence?the testimony of believers?has been somewhat less successful. This seminar attempts to investigate why and, in the process, to expose the participants to the basic tools of ?text? historiography: source, form, and redaction criticism, in a comparative setting and as applied to two very similar and yet very different?and very important?men of the past.\n\n      less description for AHSEM-UA  119 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 120",
            "course_name": "The Security Council and Peacekeeping Operations",
            "description": "AHSEM-UA  120 The Security Council and Peacekeeping Operations",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 121",
            "course_name": "Machiavelli'S Wake",
            "description": "AHSEM-UA  121 Machiavelli'S Wake",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 122",
            "course_name": "The United States and The War On Terror",
            "description": "AHSEM-UA  122 The United States and The War On Terror",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 123",
            "course_name": "Socrates Citizen",
            "description": "AHSEM-UA  123 Socrates Citizen",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 124",
            "course_name": "The Operas of Gilbert and Sullivan",
            "description": "AHSEM-UA  124 The Operas of Gilbert and Sullivan",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 125",
            "course_name": "Intro to Cognitive Science",
            "description": "AHSEM-UA  125 Intro to Cognitive Science",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 126",
            "course_name": "",
            "description": "AHSEM-UA  126\n\n   The Picture of Dorian Gray: A case Study in Literary Research\n\nOscar Wilde’s only novel, The Picture of Dorian Gray, is a cultural lightning rod. When it was first published in England, a firestorm of criticism hit the newspapers and literary magazines, decrying the work as “morbid” and “unhealthy”—coded language that suggested homosexuality to the late-Victorian public. The novel has a complicated publication history. It survives in two versions: the first was published in the U. S., six months before it appeared in England. Wilde’s novel provides a perfect case study in how to approach a literary text in its historical context. This three-week course wi...\n\n      more description for AHSEM-UA  126 »\n\n      \n\n\n\nOscar Wilde’s only novel, The Picture of Dorian Gray, is a cultural lightning rod. When it was first published in England, a firestorm of criticism hit the newspapers and literary magazines, decrying the work as “morbid” and “unhealthy”—coded language that suggested homosexuality to the late-Victorian public. The novel has a complicated publication history. It survives in two versions: the first was published in the U. S., six months before it appeared in England. Wilde’s novel provides a perfect case study in how to approach a literary text in its historical context. This three-week course will focus on the novel’s various manuscript and print versions, Wilde’s correspondence about the work, and critical responses to the text. Various themes of the work will be addressed, such as Wilde’s London, yellow journalism, British jurisprudence, the Labouchere Amendment, the language of flowers, opium dens, Aesthetic Movement philosophy, East End theater, 1890s fashion, “inversion,” late-Victorian portraiture, bibliophilia, book design, Victorian ghost stories, and French decadence. Students will be required to do in-depth research with the Fales Library’s holdings exploring these topics and their relevance to our understanding of the novel. The goal will be to allow students to do primary research and to see how vital original sources are for the study of literary texts.\n\n      less description for AHSEM-UA  126 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 127",
            "course_name": "Beauty Matters",
            "description": "AHSEM-UA  127 Beauty Matters",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 128",
            "course_name": "Origins of World War I",
            "description": "AHSEM-UA  128 Origins of World War I",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 129",
            "course_name": "Rethinking Who We Are: Interpersonal Approaches",
            "description": "AHSEM-UA  129 Rethinking Who We Are: Interpersonal Approaches",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 130",
            "course_name": "Representing Animals: The Discourse of Species",
            "description": "AHSEM-UA  130 Representing Animals: The Discourse of Species",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 131",
            "course_name": "Jews and Germans in Post-War Germany",
            "description": "AHSEM-UA  131 Jews and Germans in Post-War Germany",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 132",
            "course_name": "Readings in Modern Chinese Thought",
            "description": "AHSEM-UA  132 Readings in Modern Chinese Thought",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 133",
            "course_name": "Literature & Science: Pathways & Intersections",
            "description": "AHSEM-UA  133 Literature & Science: Pathways & Intersections",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 134",
            "course_name": "",
            "description": "AHSEM-UA  134\n\n   Past and Present in Irish Archaeology\n\nIreland has a rich archaeological heritage that includes hunter-gatherers of the Mesolithic Period, Megalithic tombs at Knowth and Newgrange, the Hill of Tara, early Christian monasteries such as Clonmacnoise, and the Viking settlements in Dublin itself. This course will consider how the Irish past has been constructed and what role that this construction of the Irish past has played in the modern world. We will review the archaeology of Ireland from its initial settlement in the Mesolithic through the British colonization of Northern Ireland in the early Modern Era. The course will also exami...\n\n      more description for AHSEM-UA  134 »\n\n      \n\n\n\nIreland has a rich archaeological heritage that includes hunter-gatherers of the Mesolithic Period, Megalithic tombs at Knowth and Newgrange, the Hill of Tara, early Christian monasteries such as Clonmacnoise, and the Viking settlements in Dublin itself. This course will consider how the Irish past has been constructed and what role that this construction of the Irish past has played in the modern world. We will review the archaeology of Ireland from its initial settlement in the Mesolithic through the British colonization of Northern Ireland in the early Modern Era. The course will also examine the impact of rapid economic development on Ireland?s archaeological resources, including the current debate surrounding the site of Tara.\n\n      less description for AHSEM-UA  134 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 135",
            "course_name": "Birth of The Mind:Genes, Evolution, Human Nature",
            "description": "AHSEM-UA  135 Birth of The Mind:Genes, Evolution, Human Nature",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 136",
            "course_name": "Pharmaceutical Drugs, Ethics, & Culture",
            "description": "AHSEM-UA  136 Pharmaceutical Drugs, Ethics, & Culture",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 137",
            "course_name": "American Mythology and Its Biblical Sources",
            "description": "AHSEM-UA  137 American Mythology and Its Biblical Sources",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 138",
            "course_name": "Socrates and His Critics",
            "description": "AHSEM-UA  138 Socrates and His Critics",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 139",
            "course_name": "Theatre of War: Ancient Warfare in Ancient Drama",
            "description": "AHSEM-UA  139 Theatre of War: Ancient Warfare in Ancient Drama",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 140",
            "course_name": "Writing in The Information Age",
            "description": "AHSEM-UA  140 Writing in The Information Age",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 141",
            "course_name": "The Being of Character: Making Modern Subjects",
            "description": "AHSEM-UA  141 The Being of Character: Making Modern Subjects",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 142",
            "course_name": "",
            "description": "AHSEM-UA  142\n\n   Abortion: Examining The Issues\n\nThis multidisciplinary course takes as its purpose a careful and thought-provoking examination of many issues surrounding abortion today. In a seminar setting, we will read about and discuss legal, medical, historical, psychological, political, religious, ethical, and gender questions in a balanced manner, considering both?indeed, sometimes several?sides of the issues involved. We will also look at the representation of and attitudes toward abortion in contemporary literature and popular culture. This seminar will provide a forum for civil, informed, and open discussion of this difficult issue...\n\n      more description for AHSEM-UA  142 »\n\n      \n\n\n\nThis multidisciplinary course takes as its purpose a careful and thought-provoking examination of many issues surrounding abortion today. In a seminar setting, we will read about and discuss legal, medical, historical, psychological, political, religious, ethical, and gender questions in a balanced manner, considering both?indeed, sometimes several?sides of the issues involved. We will also look at the representation of and attitudes toward abortion in contemporary literature and popular culture. This seminar will provide a forum for civil, informed, and open discussion of this difficult issue. This course will count towards the major in Gender and Sexuality Studies.\n\n      less description for AHSEM-UA  142 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 143",
            "course_name": "My Space: Writing Modern Selves, Diary Internet",
            "description": "AHSEM-UA  143 My Space: Writing Modern Selves, Diary Internet",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 144",
            "course_name": "",
            "description": "AHSEM-UA  144\n\n   Varieties of Religious Experience Revisited\n\nThis seminar will utilize but also update William James's pioneering approach to interpreting and understanding religion in psychological rather than theological terms. We will examine how the term \"religion\" is more confusing than helpful when it fails to differentiate between a wide variety of utterly incompatible beliefs and practices at different stages of cognitive and emotional development. We will discuss the phenomenon of \"political religions\" (nationalism, racism, totalitarianism, apocalyptic fundamentalism) as attempts to reject or distort modernity (the worldview of modern science),...\n\n      more description for AHSEM-UA  144 »\n\n      \n\n\n\nThis seminar will utilize but also update William James's pioneering approach to interpreting and understanding religion in psychological rather than theological terms. We will examine how the term \"religion\" is more confusing than helpful when it fails to differentiate between a wide variety of utterly incompatible beliefs and practices at different stages of cognitive and emotional development. We will discuss the phenomenon of \"political religions\" (nationalism, racism, totalitarianism, apocalyptic fundamentalism) as attempts to reject or distort modernity (the worldview of modern science), in order to fill the vacuum that Sartre called \"the God-shaped hole in the soul of modern man\" that resulted when the traditional sources of moral, legal, and political authority (God, religion, pure reason) lost their credibility as sources of knowledge. We will consider the political religions as resulting from psychological regression, and contrast them with the current moment in the evolution of religious consciousness, in which the challenge is to find progressive forms of religious expression, understanding and experience that are consistent with the modern scientific mentality, while not being reducible to it. The seminar will conclude by examining whether this is the context in which the next major step in the evolution of both culture and personality will need to occur.\n\n      less description for AHSEM-UA  144 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 145",
            "course_name": "Women'S Writing in Renaissance Italy",
            "description": "AHSEM-UA  145 Women'S Writing in Renaissance Italy",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 146",
            "course_name": "Before Democracy: Pol of Plurality--Ancient Iraq",
            "description": "AHSEM-UA  146 Before Democracy: Pol of Plurality--Ancient Iraq",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 147",
            "course_name": "",
            "description": "AHSEM-UA  147\n\n   The 14th Century: Europe Transformed\n\nThe century covered in this course saw disasters of many kinds, some all too familiar to us in the 21st century. It was a time of the Black Death and the decimation of the population on an enormous scale; a time of recession that changed the pattern of prosperity that had existed in the preceding two centuries; a time when the papacy and the Roman Church were faced with the rise of heresy and challenges to religious authority; a time of wars and rebellions. Yet, in the same era, there was a march forward—toward new ideas, new political forms, vernacular languages, a reawakening that brought ch...\n\n      more description for AHSEM-UA  147 »\n\n      \n\n\n\nThe century covered in this course saw disasters of many kinds, some all too familiar to us in the 21st century. It was a time of the Black Death and the decimation of the population on an enormous scale; a time of recession that changed the pattern of prosperity that had existed in the preceding two centuries; a time when the papacy and the Roman Church were faced with the rise of heresy and challenges to religious authority; a time of wars and rebellions. Yet, in the same era, there was a march forward—toward new ideas, new political forms, vernacular languages, a reawakening that brought changes of immense consequence for all of Europe… and for our own culture. Through the darkest periods, the great and beautiful changes that are the beginnings of the Italian Renaissance emerged. This was the age of Petrarch and Boccaccio, among many others, and the great Italian painters who transformed the nature and conception of literature and art and who informed our own worldview. Overall we will study a century that many historians have understood as the most creative and the most terrible of all the centuries before the 21st. Please note that this course does not satisfy the advanced research seminar requirement for the history major.\n\n      less description for AHSEM-UA  147 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 148",
            "course_name": "",
            "description": "AHSEM-UA  148\n\n   The Making of Iconic Images\n\nIconic images are pictures that become rooted in our personal memory and are stored away for future reference through our experiences with them. Often, the power of an iconic image extends beyond the meaning of its original purpose and takes on another form socially and historically. This seminar explores the range of ideas and methods used by photographers, artists, historians, filmmakers, and critical thinkers in addressing the notion of iconic images within photography, video, and film. It combines historical, contemporary, and theoretical approaches to identity politics and visual culture,...\n\n      more description for AHSEM-UA  148 »\n\n      \n\n\n\nIconic images are pictures that become rooted in our personal memory and are stored away for future reference through our experiences with them. Often, the power of an iconic image extends beyond the meaning of its original purpose and takes on another form socially and historically. This seminar explores the range of ideas and methods used by photographers, artists, historians, filmmakers, and critical thinkers in addressing the notion of iconic images within photography, video, and film. It combines historical, contemporary, and theoretical approaches to identity politics and visual culture, and addresses how images are constructed through art, media, advertising, political campaigns, war and disaster, beauty, and popular culture. Class discussions highlight the trends and transformations that have characterized the evolution of the iconic image. Using a series of case studies, we explore the construction of beauty and style, gendered images, race, and pop culture. We also consider issues of representation, display, and reception, as well as the wider social context in which art, music, and culture are experienced in private and public spaces. In addition to classes held on campus, field trips are taken to archives, museums and galleries. Each week students discuss a photograph of their own choice. Cross-listed with Photography and Imaging of the Tisch School of the Arts as PHTI-UT 1120, section 004.\n\n      less description for AHSEM-UA  148 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 149",
            "course_name": "",
            "description": "AHSEM-UA  149\n\n   Reading The Dream of The Red Chamber\n\nThe Dream of the Red Chamber is an epic literary classic produced by Cao Xueqin in the middle of the 18th century. Following the traditional form of Chinese fiction, known as ?the chaptered novel,? it covers a vast terrain of Chinese culture and social life and is widely regarded as the culmination of the vernacular novel of imperial China and a synthesis of Chinese aesthetic and philosophical traditions. With the tragic love story between two teenage members of an aristocratic clan in southern China at its dramatic center the novel intimately explores the questions concerning what is eternal ...\n\n      more description for AHSEM-UA  149 »\n\n      \n\n\n\nThe Dream of the Red Chamber is an epic literary classic produced by Cao Xueqin in the middle of the 18th century. Following the traditional form of Chinese fiction, known as ?the chaptered novel,? it covers a vast terrain of Chinese culture and social life and is widely regarded as the culmination of the vernacular novel of imperial China and a synthesis of Chinese aesthetic and philosophical traditions. With the tragic love story between two teenage members of an aristocratic clan in southern China at its dramatic center the novel intimately explores the questions concerning what is eternal and what is ephemeral; love and affection, or ?qing,? as the heart of being that both animates and destroys life; the nature of individual talent and its fragility; the excesses and decadence of the privileged; as well as the growing, if hidden, social and class tensions. Its manifold structure, intricate plot development, coupled with its dazzling array of memorable characters, makes this novel the most complex and colorful of all times. Both reading and discussions are conducted in English.\n\n      less description for AHSEM-UA  149 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 150",
            "course_name": "Soundscapes of Contemporary War",
            "description": "AHSEM-UA  150 Soundscapes of Contemporary War",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 151",
            "course_name": "Hispanic Cities: New York",
            "description": "AHSEM-UA  151 Hispanic Cities: New York",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 152",
            "course_name": "Muhammad and The Quran",
            "description": "AHSEM-UA  152 Muhammad and The Quran",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 153",
            "course_name": "Civil War at Rome",
            "description": "AHSEM-UA  153 Civil War at Rome",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 154",
            "course_name": "",
            "description": "AHSEM-UA  154\n\n   Metapatterns from Quarks to Culture\n\nThis TIMES seminar will consider the most basic patterns across the realms of nature and mind, and search for common functional principles that create those patterns. The guiding context is the fact that evolution is a form-generating process. In a general sense, evolution occurs on multiple scales: biological (Darwinian evolution), cultural (invention and social selection), and cognition (learning and creativity). All these scales possess unique but also similar subprocesses of replication, variation, and selection. Therefore, where the functional advantages of certain solutions are the same ...\n\n      more description for AHSEM-UA  154 »\n\n      \n\n\n\nThis TIMES seminar will consider the most basic patterns across the realms of nature and mind, and search for common functional principles that create those patterns. The guiding context is the fact that evolution is a form-generating process. In a general sense, evolution occurs on multiple scales: biological (Darwinian evolution), cultural (invention and social selection), and cognition (learning and creativity). All these scales possess unique but also similar subprocesses of replication, variation, and selection. Therefore, where the functional advantages of certain solutions are the same to the challenges of existence across the realms, we should expect to find common patterns as those solutions. (See the instructor?s book and papers on ?metapatterns? for more.) Students will find this an exciting area of inquiry, and will enlarge their intellectual horizons as they engage in research that becomes more self-chosen during the course. Students from all disciplines are encouraged to enroll. Indeed, we seek a diversity of interests and knowledge skills.\n\n      less description for AHSEM-UA  154 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 155",
            "course_name": "Justice and Injustice in Biblical Narrative",
            "description": "AHSEM-UA  155 Justice and Injustice in Biblical Narrative",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 156",
            "course_name": "",
            "description": "AHSEM-UA  156\n\n   Reconstructing World Violence: Hobbesian Appr\n\nHumans are as violent as any creature, but we have something in abundance that others may lack: the ability to sustain and glorify our violence by justifying it. After attempting to develop coherent accounts of this phenomenon, students in this seminar consider ways in which pacifist systems of thought have interacted with violent systems of justification, often but not always with genocidal results. It was in the midst of such a violent crisis that Hobbes initiated what remains an undeveloped approach. If one can extrapolate from Hobbes?s nationalist agenda and redirect his approach in a demo...\n\n      more description for AHSEM-UA  156 »\n\n      \n\n\n\nHumans are as violent as any creature, but we have something in abundance that others may lack: the ability to sustain and glorify our violence by justifying it. After attempting to develop coherent accounts of this phenomenon, students in this seminar consider ways in which pacifist systems of thought have interacted with violent systems of justification, often but not always with genocidal results. It was in the midst of such a violent crisis that Hobbes initiated what remains an undeveloped approach. If one can extrapolate from Hobbes?s nationalist agenda and redirect his approach in a democratic way, one can arrive (as many have) at the following claim: only when globally sovereign conflict-resolving institutions are fully authorized will any subordinate system justifying violence lose its force and coherence, except in the case of violent revolutionary movements which challenge the global authority itself. Partly by examining various fledgling attempts to operate aspects of a future sovereign system, we ask of this claim not so much whether it is practical as whether we resist its implications or suspect its grounding.\n\n      less description for AHSEM-UA  156 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 157",
            "course_name": "Don Quixote",
            "description": "AHSEM-UA  157 Don Quixote",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 158",
            "course_name": "New York Dance Scene: Perf & Criticism Today",
            "description": "AHSEM-UA  158 New York Dance Scene: Perf & Criticism Today",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 159",
            "course_name": "The Pastness of The Present",
            "description": "AHSEM-UA  159 The Pastness of The Present",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 160",
            "course_name": "",
            "description": "AHSEM-UA  160\n\n   Literature of The Absurd\n\nThe absurd sensibility has profoundly marked writers of many countries and languages since the start of the 20th century. The notion of the absurd is most closely associated with the Theater of the Absurd, launched in the 1950s in Paris by, notably, Beckett and Ionesco, and continued worldwide by such playwrights as Pinter, Albee, Havel, and Frisch. But the preoccupation with the absurd was not limited to the theater; in the immediate post?World War II period, the Existentialists already had posited the absurdity of the human condition, and works by Sartre and Camus brilliantly explored this p...\n\n      more description for AHSEM-UA  160 »\n\n      \n\n\n\nThe absurd sensibility has profoundly marked writers of many countries and languages since the start of the 20th century. The notion of the absurd is most closely associated with the Theater of the Absurd, launched in the 1950s in Paris by, notably, Beckett and Ionesco, and continued worldwide by such playwrights as Pinter, Albee, Havel, and Frisch. But the preoccupation with the absurd was not limited to the theater; in the immediate post?World War II period, the Existentialists already had posited the absurdity of the human condition, and works by Sartre and Camus brilliantly explored this philosophic position. The metaphysical anguish at the base of absurdist attitudes stemmed from what Martin Esslin, the author of the seminal Theater of the Absurd, called the disappearance of ?the certitudes and unshakable basic assumptions of former ages.? Kafka?s work is exemplary; many other writers view the world as fundamentally absurd, including Pirandello, Stein, Gombrowicz, Grass, Heller, Cortzar, Vonnegut, Pynchon, Kertsz. Many filmmakers shared these perspectives, including Antonioni and Godard. In a century that witnessed two unbelievably destructive worldwide conflicts, that made possible the Holocaust and other genocides, that produced Hiroshima and the capacity for humankind to destroy itself and the entire world, it is no surprise that the absurd was a dominant stance, even if often treated with devastating humor.\n\n      less description for AHSEM-UA  160 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 161",
            "course_name": "",
            "description": "AHSEM-UA  161\n\n   Beginnings & Endings (& Middles) in Music & Arts\n\nWhat are the strategies and approaches used to begin pieces of music? What gestures signal conclusion in jazz, pop music, or African drumming? How do we understand genres, such as opera and concerto, that, in effect, begin more than once, when the curtain opens or the soloist enters? This course looks at a broad repertoire of music, from Beethoven?s Fifth to ?I Heard It through the Grapevine,? and from worldbeat to hip-hop, in order to explore the way musical compositions are started and stopped. But we also explore a realm stranger still: the middle. For while middles have a reputation as exp...\n\n      more description for AHSEM-UA  161 »\n\n      \n\n\n\nWhat are the strategies and approaches used to begin pieces of music? What gestures signal conclusion in jazz, pop music, or African drumming? How do we understand genres, such as opera and concerto, that, in effect, begin more than once, when the curtain opens or the soloist enters? This course looks at a broad repertoire of music, from Beethoven?s Fifth to ?I Heard It through the Grapevine,? and from worldbeat to hip-hop, in order to explore the way musical compositions are started and stopped. But we also explore a realm stranger still: the middle. For while middles have a reputation as expendable transitions between points of importance, they are also places of great mystery, where material too strange, too delicate, or too sexy to touch the rest of the world finds a home. Although music will be at the ?core? of the course, we will also look comparatively at strategies in Shakespeare and experimental theater, in films such as those by David Lynch and the Coen Brothers, at examples from modern dance, and at storytelling ranging from the Bible and Moby Dick to manga. This course is designed to give students tools with which to ask new questions about what kind of stuff goes where and why that might be. There are no prerequisites for this course. It will count toward the Music major or minor.\n\n      less description for AHSEM-UA  161 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 162",
            "course_name": "Reading & Representation in Early Modern Europe",
            "description": "AHSEM-UA  162 Reading & Representation in Early Modern Europe",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 163",
            "course_name": "The Renaissance of The 12th Century",
            "description": "AHSEM-UA  163 The Renaissance of The 12th Century",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 164",
            "course_name": "Marx, Nietzsche, & Freud",
            "description": "AHSEM-UA  164 Marx, Nietzsche, & Freud",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 165",
            "course_name": "",
            "description": "AHSEM-UA  165\n\n   Edmund Wilson & The Art of Cultural Criticism\n\nEdmund Wilson (1895–1972) was the greatest cultural critic that America has ever produced—or so a good many cultural critics of our own time have come to believe. Wilson belonged to a circle of writers from the First World War generation that included John Dos Passos, F. Scott Fitzgerald, and Edna St. Vincent Millay. He wrote novels, poetry, plays, and diaries. But mostly he wrote book reviews and essays on literary, political and historical topics, which ran in the New Republic, the New Yorker, the New York Review of Books and other magazines. Reading a substantial sampling of Wilson’s work, ...\n\n      more description for AHSEM-UA  165 »\n\n      \n\n\n\nEdmund Wilson (1895–1972) was the greatest cultural critic that America has ever produced—or so a good many cultural critics of our own time have come to believe. Wilson belonged to a circle of writers from the First World War generation that included John Dos Passos, F. Scott Fitzgerald, and Edna St. Vincent Millay. He wrote novels, poetry, plays, and diaries. But mostly he wrote book reviews and essays on literary, political and historical topics, which ran in the New Republic, the New Yorker, the New York Review of Books and other magazines. Reading a substantial sampling of Wilson’s work, we will examine a series of large topics, including the cultural atmosphere of Greenwich Village early in the 20th century; the rise of literary modernism; the influence of Marxism; the literature of the Civil War; and various traditions of American thought and literature over the centuries. We will pay close attention to Wilson’s style of journalistic writing: his emphases on clarity, on conversational ease, and on emotional forcefulness. Students will be asked to apply Wilson’s principles of writing to their own compositions—an extremely useful thing to do for any student who seeks to become a better writer. Cross-listed with Journalism as JOUR-UA 401, section 001.\n\n      less description for AHSEM-UA  165 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 166",
            "course_name": "",
            "description": "AHSEM-UA  166\n\n   Power, Domination and Resistance\n\nThis course will introduce students to the complexities of conceptualizing and studying power. How do we determine where it lies? Who has more and who less? How do we study its mechanisms and effects, above all in view of the intuition that it is at its most effective when least observable by both agents and observers? Is power at its most effective when most imperceptible, and, if so, how are we to study it? What are the relations between the concept of “power” and such related concepts as “authority,” “influence,” “manipulation,” “coercion,” “force,” and “violence”? What is the relationship ...\n\n      more description for AHSEM-UA  166 »\n\n      \n\n\n\nThis course will introduce students to the complexities of conceptualizing and studying power. How do we determine where it lies? Who has more and who less? How do we study its mechanisms and effects, above all in view of the intuition that it is at its most effective when least observable by both agents and observers? Is power at its most effective when most imperceptible, and, if so, how are we to study it? What are the relations between the concept of “power” and such related concepts as “authority,” “influence,” “manipulation,” “coercion,” “force,” and “violence”? What is the relationship between so-called “hard” and “soft” power? We will look at some classical writings (from Thomas Hobbes to Max Weber), at modern writers (such as Hannah Arendt, Pierre Bourdieu, and Michel Foucault), and at work by contemporary political scientists and sociologists. Abstract discussion will be leavened throughout by case studies exemplifying the conceptual discussion.\n\n      less description for AHSEM-UA  166 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 167",
            "course_name": "Tpcs: Disability & Sexuality in Amer Cult",
            "description": "AHSEM-UA  167 Tpcs: Disability & Sexuality in Amer Cult",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 168",
            "course_name": "",
            "description": "AHSEM-UA  168\n\n   Civil Rights & Civil Liberties in 20th-C Amer\n\nConflicts over racial equality, freedom of speech, and equal protection under the law that were guaranteed in the Constitution have been contested terrain throughout U.S. history. These struggles sharpened in the 20th century as African Americans fought to end racial segregation, women sought equal rights, business interests resisted labor militancy, while federal and state governments suppressed radicals and other dissenters. This seminar examines the legal struggles and the social movements that took place as Americans fought for civil rights and civil liberties during periods of war, indust...\n\n      more description for AHSEM-UA  168 »\n\n      \n\n\n\nConflicts over racial equality, freedom of speech, and equal protection under the law that were guaranteed in the Constitution have been contested terrain throughout U.S. history. These struggles sharpened in the 20th century as African Americans fought to end racial segregation, women sought equal rights, business interests resisted labor militancy, while federal and state governments suppressed radicals and other dissenters. This seminar examines the legal struggles and the social movements that took place as Americans fought for civil rights and civil liberties during periods of war, industrial unrest, and social change. It will explore these stories by analyzing legal history through the lenses of political, social, and cultural history. This is an interdisciplinary course. Students study novels, poems, oral memoirs, view films, and read historical monographs that speak to this big and important subject. The Tamiment Library, one of the most important repositories in the United States documenting the history of radical politics, civil rights, and civil liberties, will be our laboratory. Students will work with archives and other special collections on a weekly basis. They will learn how to use and evaluate these primary sources, interpret evidence, make analytical arguments, and develop research questions. Cross-listed with History as HIST-UA 664. Please note that this course does not satisfy the advanced research seminar requirement for the history major.\n\n      less description for AHSEM-UA  168 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 169",
            "course_name": "Love and Violence",
            "description": "AHSEM-UA  169 Love and Violence",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 170",
            "course_name": "",
            "description": "AHSEM-UA  170\n\n   Political Cinema & Representation of the Other\"\n\nIn contemporary war, the ‘Other’ is viewed not only as an enemy to be fought but, often, as one to be eliminated. How do filmmakers fight against or, alternately, reinforce, such deadly representations? This seminar will focus primarily, though not exclusively, on one of the world’s most conflict-ridden regions—the Middle East—though it will also explore films from Soviet Russia, Nazi Germany, France and the United States. Through selected readings and film screenings, we will explore how the ‘Other’ is constructed politically, aesthetically and ethically. This class is designed for anyone int...\n\n      more description for AHSEM-UA  170 »\n\n      \n\n\n\nIn contemporary war, the ‘Other’ is viewed not only as an enemy to be fought but, often, as one to be eliminated. How do filmmakers fight against or, alternately, reinforce, such deadly representations? This seminar will focus primarily, though not exclusively, on one of the world’s most conflict-ridden regions—the Middle East—though it will also explore films from Soviet Russia, Nazi Germany, France and the United States. Through selected readings and film screenings, we will explore how the ‘Other’ is constructed politically, aesthetically and ethically. This class is designed for anyone interested in filmmaking and film criticism, in contemporary politics and history, especially those of the Middle East, in cinema of conflict and violence, and the ethical questions associated with them.\n\n      less description for AHSEM-UA  170 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 171",
            "course_name": "",
            "description": "AHSEM-UA  171\n\n   Commitment and Escape\n\nThe seventy-or-so years this seminar examines were among the most turbulent in the history of the world. They start with the butchery of World War II, the Shoah, and atomic devastation, and end with the often violent birth of new nations through the decolonization of African and Asian lands. But they were also years of reconstruction and modernization, leading to booming economies and social improvement. The rise of Arab nationalism and Islamic fundamentalism and the emergence of China as the colossus of the 21st century were among the signposts of a changing world in which peoples demanded—an...\n\n      more description for AHSEM-UA  171 »\n\n      \n\n\n\nThe seventy-or-so years this seminar examines were among the most turbulent in the history of the world. They start with the butchery of World War II, the Shoah, and atomic devastation, and end with the often violent birth of new nations through the decolonization of African and Asian lands. But they were also years of reconstruction and modernization, leading to booming economies and social improvement. The rise of Arab nationalism and Islamic fundamentalism and the emergence of China as the colossus of the 21st century were among the signposts of a changing world in which peoples demanded—and won—their freedom. Perhaps most revolutionary, women at last attained freedom and equality in many parts of the globe. Many writers and thinkers felt such concern for the world around them that they were inevitably drawn to dealing with contemporary issues. Others focused on broader, more philosophic approaches to the existential problems of man in this world; others still sought escape from commitment in artistic paths, removed from social and political considerations. By working with texts— novels, essays, short stories, plays, and films—that reflect artists’ and intellectuals’ reactions to their times, we will explore and analyze many of the leading creative voices of these turbulent years, including, but not limited to: Arthur Miller, Albert Camus, Assia Djebar, Samuel Beckett, Eugène Ionesco, Betty Friedan, and James Baldwin. The keynote to the seminar will come from Jean-Paul Sartre’s “What is Literature.” Cross-listed with Comparative Literature as COLIT-UA 181.\n\n      less description for AHSEM-UA  171 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 172",
            "course_name": "",
            "description": "AHSEM-UA  172\n\n   Mimesis & Mimicry\n\nThis course will center on the concepts of mimesis and its poor relation, mimicry. Mimesis refers to the way in which aesthetic works refer: that is, it is about the representation of reality in art. Mimicry is about closely imitating the superficial characteristics of something or someone: it tends to be less about art and more about life. Together, these concepts provoke anxiety and interest about the ways in which reality and the people and things in it can be reproduced, copied, faked, and fictionalized. We will explore the related concepts of denotation, appropriation, reference, plagiari...\n\n      more description for AHSEM-UA  172 »\n\n      \n\n\n\nThis course will center on the concepts of mimesis and its poor relation, mimicry. Mimesis refers to the way in which aesthetic works refer: that is, it is about the representation of reality in art. Mimicry is about closely imitating the superficial characteristics of something or someone: it tends to be less about art and more about life. Together, these concepts provoke anxiety and interest about the ways in which reality and the people and things in it can be reproduced, copied, faked, and fictionalized. We will explore the related concepts of denotation, appropriation, reference, plagiarism, and repetition. Texts may include: Plato’s Phaedrus; Aristotle’s Poetics; Michael Taussig’s Mimesis and Alterity; Derrida’s Dissemination; Svetlana Alper’s The Art of Describing; Roland Barthes, “The Reality Effect;” Homi Bhabha, “Of Mimicry and Man;” Luce Irigary, Speculum of the Other Woman; Eric Lott, Love and Theft; Theodor Adorno, “The Radio Voice.” Cross-listed with English as ENGL-UA 252, section 002.\n\n      less description for AHSEM-UA  172 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 173",
            "course_name": "",
            "description": "AHSEM-UA  173\n\n   The Spanish Inquisition\n\nIn contemporary media and in the wake of 9/11, the Spanish Inquisition has been used as shorthand to denote intolerance, persecution, fanaticism, and a disposition to cruelty in the pursuit of “truth”. While some elements of this reputation are well-earned, the history of the Inquisition is far more complex and interesting. We begin the semester with the heated question of the origins of the Inquisition and its key role in nation building, in order to then turn to the Inquisition’s internal organization and standard practices. From there, we consider the various targets of inquisitorial suspic...\n\n      more description for AHSEM-UA  173 »\n\n      \n\n\n\nIn contemporary media and in the wake of 9/11, the Spanish Inquisition has been used as shorthand to denote intolerance, persecution, fanaticism, and a disposition to cruelty in the pursuit of “truth”. While some elements of this reputation are well-earned, the history of the Inquisition is far more complex and interesting. We begin the semester with the heated question of the origins of the Inquisition and its key role in nation building, in order to then turn to the Inquisition’s internal organization and standard practices. From there, we consider the various targets of inquisitorial suspicion or persecution from the late fifteenth through the late seventeenth centuries: Judaism and crypto-Judaism (the conversos), Protestantism, prohibited books, mystics and Illuminati, witches, Islam and crypto-Islam (the moriscos), and those accused of sexual or religious misconduct (blasphemy, bigamy, and sodomy). We close the semester considering what finally brought about the definitive abolition of the Inquisition in 1834. We will read transcripts from Inquisitorial trials, edicts and proclamations, historical chronicles, novels, plays, autobiographies, an Inquisitor’s manual with instructions for torture, a witch hunting treatise, and devotional literature. We also will examine more contemporary reflections: Dostoevsky’s 1880 The Brothers Karamazov, Monty Python’s 1970 “Nobody expects the Spanish Inquisition” skit, and the film adaptation of J.K. Rowling’s 2003 Harry Potter and the Order of the Phoenix. Cross-listed with Spanish as SPAN-UA 952.\n\n      less description for AHSEM-UA  173 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 174",
            "course_name": "",
            "description": "AHSEM-UA  174\n\n   Mapping\n\nMaps are complex artifacts, both pictorial and abstract, technical and symbolic, works of art and science. This course will consider maps as ways of understanding, picturing and abstracting the world, with examples from ancient Egypt to Google Earth. Over time maps have become increasingly accurate, built with precise measurements and rich with data, but they are also ways of representing the world and conveying particular values and ideas. With maps fast becoming a preferred scaffolding to organize and access data—witness, for example, the many applications of Google Maps—the rich history and...\n\n      more description for AHSEM-UA  174 »\n\n      \n\n\n\nMaps are complex artifacts, both pictorial and abstract, technical and symbolic, works of art and science. This course will consider maps as ways of understanding, picturing and abstracting the world, with examples from ancient Egypt to Google Earth. Over time maps have become increasingly accurate, built with precise measurements and rich with data, but they are also ways of representing the world and conveying particular values and ideas. With maps fast becoming a preferred scaffolding to organize and access data—witness, for example, the many applications of Google Maps—the rich history and complex nature of mapping has particular relevance today. Topics to be covered in the seminar include: Ptolemy’s Geography; world maps (mappa mundi) and cosmographical diagrams; mapping and geographic exploration; the development of world atlases; the invention of true city plans; warfare, state building and mapmaking; mapping as a tool of empire; surveying and land ownership; Geographic Information Systems (GIS) and spatial analysis; and experimental maps in contemporary art. Cross-listed with Wagner as UPADM-GP 281.\n\n      less description for AHSEM-UA  174 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 175",
            "course_name": "",
            "description": "AHSEM-UA  175\n\n   Ancient Egyptian Funerary Literature & The Book of the Dead\n\nThis seminar gives an overview on the religion of Pharaonic Egypt, on the basis of the numerous textual and iconographical sources decorating tombs, coffins, papyri and other funerary objects. In particular, the focus will be on the so-called Book of the Dead, a collection of illustrated magical spells that were in use in Egypt from about 1500 BCE until the Greco-Roman period. The students will read a selection of spells (in translation) from the Book of the Dead and analyze the illustrations related to these texts, and will discuss aspects of the ancient Egyptian beliefs in death and the neth...\n\n      more description for AHSEM-UA  175 »\n\n      \n\n\n\nThis seminar gives an overview on the religion of Pharaonic Egypt, on the basis of the numerous textual and iconographical sources decorating tombs, coffins, papyri and other funerary objects. In particular, the focus will be on the so-called Book of the Dead, a collection of illustrated magical spells that were in use in Egypt from about 1500 BCE until the Greco-Roman period. The students will read a selection of spells (in translation) from the Book of the Dead and analyze the illustrations related to these texts, and will discuss aspects of the ancient Egyptian beliefs in death and the netherworld. The ancient Egyptian pantheon of the gods occurring in the sources will be presented and the complex relationship among official religion, creation myths, personal piety and everyday magical practices will be outlined and discussed in the light of the most recent studies on the mortuary and magical literature of ancient Egypt.\n\n      less description for AHSEM-UA  175 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 176",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "8186",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 409",
                    "time": "Tue 2.00 PM - 4.30 PM",
                    "open": true,
                    "professor": "Siskin, Clifford"
                }
            ],
            "course_name": "The NYU Mediation Lab:Startups at the Frontiers of Knowledge Edition",
            "description": "AHSEM-UA  176 The NYU Mediation Lab:Startups at the Frontiers of Knowledge Edition \nMIT has its famous Media Lab (media.mit.edu) to ask “the questions not yet asked – questions whose answers could radically improve the way people live, learn, work, and play.” We share that goal at NYU, but we go beyond the “media” to “mediations” of every kind – to every strategy for turning the present into a better future. The NYU Mediation Lab is thus open to all disciplines in FAS and to all students who wish to put their majors to work in the world.",
            "offering": true
        },
        {
            "course_id": "AHSEM-UA 177",
            "course_name": "",
            "description": "AHSEM-UA  177\n\n   Seminar in Irish History:\n\nThe Great Famine of 1845-1851 was an immediate and long-term catastrophe for the Irish people and was the catalyst for substantial changes—positive and negative—in Irish society and culture; it also provoked a long history of debates about the causes and solutions to global hunger that continue to resonate today. This course explores the relationship between politics, power and famine, with particular reference to the influence of political cultures and institutions on decision making in the modern world, through a number of case studies over the past two centuries. It analyses the debates on ...\n\n      more description for AHSEM-UA  177 »\n\n      \n\n\n\nThe Great Famine of 1845-1851 was an immediate and long-term catastrophe for the Irish people and was the catalyst for substantial changes—positive and negative—in Irish society and culture; it also provoked a long history of debates about the causes and solutions to global hunger that continue to resonate today. This course explores the relationship between politics, power and famine, with particular reference to the influence of political cultures and institutions on decision making in the modern world, through a number of case studies over the past two centuries. It analyses the debates on the Amartya Sen thesis, that famines in the modern world are due less to the failure of food-supply as such, and more to the failure of non-democratic political systems. We will explore a series of case–studies of specific famines, including Ireland (1845-52), Finland (1868), Bengal (1943-44, 1974-75) Russia /USSR (1893, 1920-1, 1932-4), China (1964), and Ethiopia (1983-5). Cross-listed with Irish Studies as IRISH-UA 185, and with History as HIST-UA 799. Please note that this course does not satisfy the advanced research seminar requirement for the history major.\n\n      less description for AHSEM-UA  177 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 178",
            "course_name": "",
            "description": "AHSEM-UA  178\n\n   Country & City In Modern Chinese Literature & Film\n\nChina’s rapid metamorphosis from a sleepy rural giant to the “workshop of the world” is examined through the prism of modern Chinese fiction and film. The story of Modern China is an intense drama of social change, moral conflict, cultural diversity, and emotional strain. In literature and film, it’s a story about an organic member of an intimate social setting (say the family or the village) who becomes an enlightened, independent but lonely and alienated “individual” amidst the crowd of strangers in the modern city. Or, conversely, it is about this cosmopolitan intellectual or professional’s...\n\n      more description for AHSEM-UA  178 »\n\n      \n\n\n\nChina’s rapid metamorphosis from a sleepy rural giant to the “workshop of the world” is examined through the prism of modern Chinese fiction and film. The story of Modern China is an intense drama of social change, moral conflict, cultural diversity, and emotional strain. In literature and film, it’s a story about an organic member of an intimate social setting (say the family or the village) who becomes an enlightened, independent but lonely and alienated “individual” amidst the crowd of strangers in the modern city. Or, conversely, it is about this cosmopolitan intellectual or professional’s uneasy return to the hometown, to the countryside, about his or her confrontation with an embarrassing past, which can be disengaged rationally but not emotionally. This tension and mutual dependency between the country and the city offers us an excellent opportunity to examine and rethink the epic experience of modern China as exemplary of the human experience of modernity.\n\n      less description for AHSEM-UA  178 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 179",
            "course_name": "",
            "description": "AHSEM-UA  179\n\n   Love, Prop & Mad in Arabic Lit & Islamic Cult 7th-16th Century\n\nIn this course we will consider the important role that conceptions of love, prophecy and madness have played in religion, literature and culture in the Muslim world and its neighbors from the 7th-16th century. We will first consider earlier Ancient Near Eastern conceptions of the triad found in the Hebrew Bible, Ancient Greek thought (Plato, Aristotle, and later commentators).  We will then address major works of Arabic literature and Islamic, Christian, and Jewish thought from the 7th-15th centuries, including the following topics/texts:  Pre-Islamic Poetry; Qur'anic conceptions of prophecy/...\n\n      more description for AHSEM-UA  179 »\n\n      \n\n\n\nIn this course we will consider the important role that conceptions of love, prophecy and madness have played in religion, literature and culture in the Muslim world and its neighbors from the 7th-16th century. We will first consider earlier Ancient Near Eastern conceptions of the triad found in the Hebrew Bible, Ancient Greek thought (Plato, Aristotle, and later commentators).  We will then address major works of Arabic literature and Islamic, Christian, and Jewish thought from the 7th-15th centuries, including the following topics/texts:  Pre-Islamic Poetry; Qur'anic conceptions of prophecy/poetry/madness;  Ibn Isḥāq's \"Life of the Prophet\";  the themes of lovesickness and madness in early Arabic Love Poetry (Ghazal); stories of early wise fools and sufi mystics;  the Maqāmāt of al-Hamadhānī (11th century); the Arabian Nights; the Hebrew Poet Ibn Gabriol; the Persian Romance, Layli and Majnun_(madman); and Troubador Poetry. We will also read accounts of these themes in the works of the Muslim physicians, philosophers, and theologians (al-Fārābī, Ibn Sīnā and al-Ghazālī), and discuss the ways in which concepts of Love, Madness and Prophecy were received in the Medieval West and during the Renaissance and beyond.\n\n      less description for AHSEM-UA  179 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 180",
            "course_name": "",
            "description": "AHSEM-UA  180\n\n   Diplomacy in the 21st Century: Contemporary Chalenges to an Ancient Profession\n\nDiplomacy, one of the prime methods by which mankind manages relations between politically organized groups, has undergone a profound transformation in recent decades due (among other factors) to the information revolution, globalization, and the increased relevance of new non-state actors in international affairs. How do diplomats and governments react to these changes? Does traditional diplomacy still matter in today’s world?  What skills are required to be a competent diplomat in the 21st century? This seminar aims to answer these questions by exploring the many dimensions of contemporary d...\n\n      more description for AHSEM-UA  180 »\n\n      \n\n\n\nDiplomacy, one of the prime methods by which mankind manages relations between politically organized groups, has undergone a profound transformation in recent decades due (among other factors) to the information revolution, globalization, and the increased relevance of new non-state actors in international affairs. How do diplomats and governments react to these changes? Does traditional diplomacy still matter in today’s world?  What skills are required to be a competent diplomat in the 21st century? This seminar aims to answer these questions by exploring the many dimensions of contemporary diplomacy. We will begin with an historical perspective and then explore the different types of diplomatic activities, such as political, commercial, cultural, and scientific; bilateral and multilateral; soft and hard; secret, discreet, and public. We will also focus on current challenges facing diplomacy. Topics will be addressed through selected readings, discussions with the instructor, guest speakers, and visits to diplomatic missions in New York.\n\n      less description for AHSEM-UA  180 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 181",
            "course_name": "",
            "description": "AHSEM-UA  181\n\n   History Of Medicine and Dentistry\n\n“Adqui consilium futuri ex praeterito venit.” We gain advice for the future from the past, said Seneca in 69 A.D. Understanding the history of major medical and dental discoveries leads to a better appreciation of what we have today. This seminar deals with important topics in the history of medicine and dentistry, with an emphasis on the last 500 years. Topics include: the origins of “an eye for an eye” and “a tooth for a tooth”; the real DaVinci Code; three weasels, a coat-of-arms, and the rise of anatomy; how the dark secret of the Sun King changed surgeons forever; how laughing gas is no l...\n\n      more description for AHSEM-UA  181 »\n\n      \n\n\n\n“Adqui consilium futuri ex praeterito venit.” We gain advice for the future from the past, said Seneca in 69 A.D. Understanding the history of major medical and dental discoveries leads to a better appreciation of what we have today. This seminar deals with important topics in the history of medicine and dentistry, with an emphasis on the last 500 years. Topics include: the origins of “an eye for an eye” and “a tooth for a tooth”; the real DaVinci Code; three weasels, a coat-of-arms, and the rise of anatomy; how the dark secret of the Sun King changed surgeons forever; how laughing gas is no laughing matter in medicine; and the stories of Jenner, Pasteur and Koch, and other giants in the field of medicine. Additionally, the course explores the history of the modern dental and medical professions. Assignments include a short, in-class context presentation, active class participation and a final class video project that links the major medical discoveries across centuries and their dependence on each other.\n\n      less description for AHSEM-UA  181 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 182",
            "course_name": "",
            "description": "AHSEM-UA  182\n\n   The Consolation of Philosophy: Boethius & Boethian Literature in Middle Ages\n\nWhy do bad things happen to good people?  Why is Fortune so cruel?  Is our fate predetermined?  If so, is there any point in exercising our free will?  How can we ever be happy?  Can philosophy help us get through difficult times?  These are questions raised in The Consolation of Philosophy, a dialogue written by the Roman philosopher Boethius (c.480-524/6), while staying in prison and waiting for King Theodoric’s order for his execution.  Boethius’s Consolation touched the hearts of many readers in the Middle Ages (and beyond) and influenced the work of numerous writers and philosophers from ...\n\n      more description for AHSEM-UA  182 »\n\n      \n\n\n\nWhy do bad things happen to good people?  Why is Fortune so cruel?  Is our fate predetermined?  If so, is there any point in exercising our free will?  How can we ever be happy?  Can philosophy help us get through difficult times?  These are questions raised in The Consolation of Philosophy, a dialogue written by the Roman philosopher Boethius (c.480-524/6), while staying in prison and waiting for King Theodoric’s order for his execution.  Boethius’s Consolation touched the hearts of many readers in the Middle Ages (and beyond) and influenced the work of numerous writers and philosophers from this period.  In the Divine Comedy, for example, Dante places Boethius in the Fifth Heaven.  His Consolation was translated by, among others, King Alfred (848/9–899), Chaucer (c.1340–1400), and Queen Elizabeth I (1533–1603).  In our course, we will consider many of questions raised by Boethius by reading The Consolation of Philosophy and (mostly) medieval adaptations of and responses to Boethius and Boethian themes, including Chaucer’s Troilus and Criseyde, the Death of King Arthur; and The Seafarer and other Old English elegies.  We will also consult philosophical works that influenced Boethius: e.g. Plato, Aristotle, and St. Augustine. This course will count as a pre-1800 course towards the English major.\n\n      less description for AHSEM-UA  182 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 183",
            "course_name": "",
            "description": "AHSEM-UA  183\n\n   Civil Rights & Civil Wrongs: The Fight for Equality in the United States\n\nShortly after graduating from Oberlin College in 1847, abolitionist and women’s rights advocate Lucy Stone remarked, “I expect to plead not for the slave only, but for suffering humanity everywhere. Especially do I mean to labor for the elevation of my sex.” Three years later, 1850 found her on a national stage at a conference on women’s rights that included noted abolitionists. Stone understood the necessity of a fight that brings rights to all peoples. There were those who felt she and some of the other women present were dupes of the abolitionists. History would unfortunately prove this cor...\n\n      more description for AHSEM-UA  183 »\n\n      \n\n\n\nShortly after graduating from Oberlin College in 1847, abolitionist and women’s rights advocate Lucy Stone remarked, “I expect to plead not for the slave only, but for suffering humanity everywhere. Especially do I mean to labor for the elevation of my sex.” Three years later, 1850 found her on a national stage at a conference on women’s rights that included noted abolitionists. Stone understood the necessity of a fight that brings rights to all peoples. There were those who felt she and some of the other women present were dupes of the abolitionists. History would unfortunately prove this correct, for when African-American men were given the vote through the 15th Amendment, the abolitionists felt their work was done. It would take another 50 years before women would be granted the right to vote. Recognizing, as Lucy Stone did, that the fight for human rights does not exist in a vacuum, this course will look at the intersection of the three major American movements for African-American rights, women’s rights, and gay rights. Looking back over 160 years of history, we will compare and contrast the three movements. We will also examine how events in the United States and around the world informed and changed the dialogue on civil rights as so many fight even today to keep the conversation alive. Please note that this course does not satisfy the advanced research seminar requirement for the history major.\n\n      less description for AHSEM-UA  183 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 184",
            "course_name": "",
            "description": "AHSEM-UA  184\n\n   The Medieval Indian Ocean World: Mobility and Encounters\n\nIn recent years, the Indian Ocean has become an exciting field of historical scholarship, contributing to new understandings of world history and demonstrating some of the limits to traditional land-centered and single-region studies. In this course, we will be reading about and discussing various forms of mobility and exchange—including trade and travel, conquest and religious conversion, different diaspora communities and migrations—across a large area that extends from East Africa to the islands of Southeast Asia, from Yemen and Arabia to the Indian subcontinent. Our temporal focus will be ...\n\n      more description for AHSEM-UA  184 »\n\n      \n\n\n\nIn recent years, the Indian Ocean has become an exciting field of historical scholarship, contributing to new understandings of world history and demonstrating some of the limits to traditional land-centered and single-region studies. In this course, we will be reading about and discussing various forms of mobility and exchange—including trade and travel, conquest and religious conversion, different diaspora communities and migrations—across a large area that extends from East Africa to the islands of Southeast Asia, from Yemen and Arabia to the Indian subcontinent. Our temporal focus will be the Middle Ages; we conclude with the beginnings of the ‘Age of Discovery’ (16th century) and discuss how significant changes in technology, politics, and conquest challenged older patterns of mercantile mobility and cultural exchange. The purpose of this seminar will be to understand this complex and integrated commercial and cultural system, by considering the movements of goods and peoples across the Indian Ocean world. This course will count as either a history or topics course towards the MEIS major.\n\n      less description for AHSEM-UA  184 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 185",
            "course_name": "",
            "description": "AHSEM-UA  185\n\n   Enlightenment and Ideology:\n\nThis course will investigate the problems of difference, progress and development that confronted those who sought to improve the condition of Ireland through the application of new ideas that gained currency in the 18th century Enlightenment.  Although an integral part of the British Empire, Ireland was notoriously economically under-developed, culturally distinct, socially turbulent and religiously diverse.  Consequently Ireland was the subject of a vast literary and political debate about how the society should be transformed, how its culture should evolve, its language adapt, and its peopl...\n\n      more description for AHSEM-UA  185 »\n\n      \n\n\n\nThis course will investigate the problems of difference, progress and development that confronted those who sought to improve the condition of Ireland through the application of new ideas that gained currency in the 18th century Enlightenment.  Although an integral part of the British Empire, Ireland was notoriously economically under-developed, culturally distinct, socially turbulent and religiously diverse.  Consequently Ireland was the subject of a vast literary and political debate about how the society should be transformed, how its culture should evolve, its language adapt, and its people change their ways.  At the end of the 18th century, the movement of the United Irishmen attempted to put in practice a vision of Enlightenment philosophy, first through cultural politics, then through revolutionary activity, finally through a failed military rebellion.  To put these events in context, we will attempt to chart the history of ideas about society as they were applied to Ireland through two distinct approaches.  We will read signal works of British and Irish Enlightenment philosophy and applied social analysis, by famous writers including Jonathan Swift, Adam Smith, Bishop Berkeley, Edmund Burke, and Maria Edgeworth, as well as works by lesser known writers who sought earnestly to solve what was known as the Irish Problem.  Alongside this reading, we will conduct an experimental Digital analysis of a large corpus of works written about Ireland in the period.  The course will be conducted as a research seminar with a weekly Digital Laboratory component in which students will work to contribute to the corpus of digitized books, as well as to the effort to analyze the corpus through custom-designed analytical tools.\n\n      less description for AHSEM-UA  185 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 186",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17787",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL142",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Peixoto, Marta"
                }
            ],
            "course_name": "",
            "description": "AHSEM-UA  186\n\n   Narrating Poverty in Brazilian Literature and Film\n\nThis course, CONDUCTED IN ENGLISH, examines literary works in various genres (novels, autobiography, short stories), and Brazilian films (Cinema Novo and after, including documentaries), that attempt to narrate the experience of poverty.  We will discuss texts by Graciliano Ramos, Carolina Maria de Jesus, Clarice Lispector, Rubem Fonseca, and Patricia Melo and view films (Barren Lives, The Scavengers, The Hour of the Star, Pixote, Bus 174 and City of God, Babilônia 2000 and Black Orpheus), in light of key questions.  How do these texts reflect on the nature of representation and on the investm...\n\n      more description for AHSEM-UA  186 »\n\n      \n\n\n\nThis course, CONDUCTED IN ENGLISH, examines literary works in various genres (novels, autobiography, short stories), and Brazilian films (Cinema Novo and after, including documentaries), that attempt to narrate the experience of poverty.  We will discuss texts by Graciliano Ramos, Carolina Maria de Jesus, Clarice Lispector, Rubem Fonseca, and Patricia Melo and view films (Barren Lives, The Scavengers, The Hour of the Star, Pixote, Bus 174 and City of God, Babilônia 2000 and Black Orpheus), in light of key questions.  How do these texts reflect on the nature of representation and on the investments of author and reader in images of deprivation?  How do they present the connections of poverty with violence, stigmatization, and citizenship rights?  How do they frame the ethical responsibilities of the writer or film-maker, as well as of readers and spectators?  What are the patterns of consumption and circulation of these texts?\n\n      less description for AHSEM-UA  186 «",
            "offering": true
        },
        {
            "course_id": "AHSEM-UA 187",
            "classes": [],
            "course_name": "",
            "description": "AHSEM-UA  187\n\n   What is Memory\n\nThe questions “What is memory?” and “What is forgetting?” have intrigued thinkers for millennia. Thanks to the written records that serve as our cultural memory, we know that memory has been a topic of inquiry at least since those records began. Today’s philosophers, psychologists, and literary scholars are continuing to hone the concept of the self as it was understood by John Locke, David Hume, and Ralph Waldo Emerson among others, as a dynamic tension between memory and consciousness. Together this work pursues such questions as how is memory embodied? How and why do we forget? What is the ...\n\n      more description for AHSEM-UA  187 »\n\n      \n\n\n\nThe questions “What is memory?” and “What is forgetting?” have intrigued thinkers for millennia. Thanks to the written records that serve as our cultural memory, we know that memory has been a topic of inquiry at least since those records began. Today’s philosophers, psychologists, and literary scholars are continuing to hone the concept of the self as it was understood by John Locke, David Hume, and Ralph Waldo Emerson among others, as a dynamic tension between memory and consciousness. Together this work pursues such questions as how is memory embodied? How and why do we forget? What is the connection between memory and the self—and with language and story-telling—and with moral and ethical reasoning? What events are best forgotten and how do we go about forgetting them? The proliferation of memorials of war and conflict today has led some cultural critics to wonder if so much remembering gums up the salve of forgetting so necessary for the healing process of forgiving. The course is structured around six units: Life Memories, The Idea of Memory, The Science of Memory, The Art of Memory, Cultural Memory, and Forgetting. Readings represent the full spectrum of western thinking about memory, from Plato to the Pew Research Center’s report on memory and the internet. It is hoped that in addition to learning a great deal about memory and forgetting as academic topics, students come away from the course having gained new insights into the workings of their own memories and having developed a personal practice of memory that serves their growth as individuals long after their memories of the course itself have dimmed.\n\n      less description for AHSEM-UA  187 «",
            "offering": true
        },
        {
            "course_id": "AHSEM-UA 188",
            "course_name": "",
            "description": "AHSEM-UA  188\n\n   The Largest Irish City in the World: New York City/1880, a geographical & spatial analysis\n\nIn the year 1880, following over a century of robust migration between Ireland and the eastern seaboard of the U.S., three-quarters of a million residents of New York City could claim Irish ancestry, with a third of these first-generation immigrants. More Irish and their descendants were living in New York than in Dublin in that year, and it is this population that will serve as the basis for a semester-long research investigation of the demographic, social, and cultural variables of these residents as revealed in the 1880 U.S. census. The course will be built around student acquisition of a s...\n\n      more description for AHSEM-UA  188 »\n\n      \n\n\n\nIn the year 1880, following over a century of robust migration between Ireland and the eastern seaboard of the U.S., three-quarters of a million residents of New York City could claim Irish ancestry, with a third of these first-generation immigrants. More Irish and their descendants were living in New York than in Dublin in that year, and it is this population that will serve as the basis for a semester-long research investigation of the demographic, social, and cultural variables of these residents as revealed in the 1880 U.S. census. The course will be built around student acquisition of a set of analytical techniques, including statistical sampling, demographic data analysis, and database construction, as well as student application of SPSS and ArcGIS software. Among the digital and statistical skills imparted in this class will be understanding demographic dataset structures and design, learning approaches to regularizing and “cleaning” rough data for effective analysis, user training in IPUMS-USA data resources, and use of ArcGIS to organize and manage geographically variant historic data within an urban setting using georeferencing. In addition, the course will impart firm historical knowledge of the time period with readings and discussion on the material culture, social characteristics, and living conditions of Irish populations in nineteenth century New York and Ireland.\n\n      less description for AHSEM-UA  188 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 189",
            "course_name": "",
            "description": "AHSEM-UA  189\n\n   Schism\n\nThis is an exploration of the type of conflict that results not simply from the clash of incompatible interests but from the shattering of a shared vision--even if that vision may come to seem deluded.  Can we find some connections between the type of concept that unites people, and the type of conflict that divides them?  Can we distinguish between what people say about these things and deeper or truer realities?  Do people sometimes act as though they have a concept that governs their union, even if they are not aware of it?  How strong are the analogies between voluntary associations, where...\n\n      more description for AHSEM-UA  189 »\n\n      \n\n\n\nThis is an exploration of the type of conflict that results not simply from the clash of incompatible interests but from the shattering of a shared vision--even if that vision may come to seem deluded.  Can we find some connections between the type of concept that unites people, and the type of conflict that divides them?  Can we distinguish between what people say about these things and deeper or truer realities?  Do people sometimes act as though they have a concept that governs their union, even if they are not aware of it?  How strong are the analogies between voluntary associations, where the unifying concept may be clearly codified and affirmed, and political associations?  Is the knowledge system that informs these concepts and provides ancillary support a historic artifact?  Do conceptual unions based on indoctrination face special challenges? We will explore these and other questions using a wide mix of materials from Greek tragedy to political theory to divorce narratives.  One aim will be to draw on the diverse disciplinary perspectives that students bring to the table.  The final project may, accordingly, take various forms, from a work of fiction, to sustained philosophical or literary analysis, to historical research.\n\n      less description for AHSEM-UA  189 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 190",
            "course_name": "",
            "description": "AHSEM-UA  190\n\n   Art and the Brain\n\nWhat makes us creative? What is the brain basis of our creativity? This class will explore the intersection of creative art in a wide range of formats on the one hand and neuroscience on the other. Guests artists will include: Julie Burstein, best-selling author, journalist and expert on creativity; Craig D’Amico, actor and acting coach; Baba Brinkman, science rapper; Patrick Terry, magician; Matthew Wilson, professional clown; Erika Shannon, dancer and dance instructor; and Jody Oberfelder, choreographer. Students will first explore each of these different art forms through direct participati...\n\n      more description for AHSEM-UA  190 »\n\n      \n\n\n\nWhat makes us creative? What is the brain basis of our creativity? This class will explore the intersection of creative art in a wide range of formats on the one hand and neuroscience on the other. Guests artists will include: Julie Burstein, best-selling author, journalist and expert on creativity; Craig D’Amico, actor and acting coach; Baba Brinkman, science rapper; Patrick Terry, magician; Matthew Wilson, professional clown; Erika Shannon, dancer and dance instructor; and Jody Oberfelder, choreographer. Students will first explore each of these different art forms through direct participation (i.e., all students should be ready to dance, act, rap etc.). We will then discuss the latest neuroscience and cognitive psychology underlying the each of these unique creative arts. Small teams of students will then research and present questions and discussion topics related to the topic. Strong collaboration, participation, and interaction as well as little sweat are all requirements for class sessions.\n\n      less description for AHSEM-UA  190 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 191",
            "course_name": "",
            "description": "AHSEM-UA  191\n\n   Sport and Empire since 1800\n\nAfter about 1800, the impact of empires, above all the British, transformed the role of organized sport over much of the globe.  But there were wide variations in the responses of both indigenous and settler cultures to the opportunities offered, and the challenges, or even threats, to indigenous identities, posed by the spread of sporting activity.  A host of questions arise, requiring analysis of the ideological, military, political, religious, social and cultural factors influencing the wide variety of responses.  How closely are sporting identities/cultures woven into the texture of the na...\n\n      more description for AHSEM-UA  191 »\n\n      \n\n\n\nAfter about 1800, the impact of empires, above all the British, transformed the role of organized sport over much of the globe.  But there were wide variations in the responses of both indigenous and settler cultures to the opportunities offered, and the challenges, or even threats, to indigenous identities, posed by the spread of sporting activity.  A host of questions arise, requiring analysis of the ideological, military, political, religious, social and cultural factors influencing the wide variety of responses.  How closely are sporting identities/cultures woven into the texture of the national identities/cultures of their countries? How close is the connection between sporting identity and other identities like race, class and gender, themselves also undergoing processes of change?  We will also explore the decline of the major European empires on sporting and cultural identities at global level.\n\n      less description for AHSEM-UA  191 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 192",
            "course_name": "",
            "description": "AHSEM-UA  192\n\n   The Future of Normal\n\n“The Future of Normal” explores historical and current notions of normalcy and non-normalcy as they influence and determine what is or is not visible—what is or is not embodied—in live theatrical representation. While the course focuses on the theatricalization of “non-normative” bodies in staged representation, it also queries the absence, or invisibility of other non-normative bodies. A significant goal of the course is to explore the relationship between non-normativity and invisibility on the U.S. stage. Through the study of drama, performance, and a variety of theoretical texts from diffe...\n\n      more description for AHSEM-UA  192 »\n\n      \n\n\n\n“The Future of Normal” explores historical and current notions of normalcy and non-normalcy as they influence and determine what is or is not visible—what is or is not embodied—in live theatrical representation. While the course focuses on the theatricalization of “non-normative” bodies in staged representation, it also queries the absence, or invisibility of other non-normative bodies. A significant goal of the course is to explore the relationship between non-normativity and invisibility on the U.S. stage. Through the study of drama, performance, and a variety of theoretical texts from different disciplines, “The Future of Normal” surveys the kinds of theatre (originating in western cultures) that focus on the material body that challenges “normative” ideologies, practices, conditions, and technologies of sexuality and gender as they relate to staged corporeality. We acknowledge the foundations of gender-bending in, for instance, the works of Euripides, Shakespeare, and Jonson and explore more recent solo works by Kate Bornstein (M to F), Ron Athey (live body piercing and branding) and Greg Wallace (born with cerebral palsy). Intentionally, ‘The Future of Normal” explores the complicated relationships that exist among bodies, identities, culture, science, and technology--both on- and offstage--with special attention paid to a glaringly invisible community from U.S. stage representation: the intersexed.\n\n      less description for AHSEM-UA  192 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 193",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "9118",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "9118",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "AHSEM-UA  193\n\n   Making Art in the Anthropocene: Project on Ecology, Species and Vibrant Matter\n\n“Either stop writing, or write like a rat!” In one of the most provocative texts in contemporary animal philosophy, the French philosophers Gilles Deleuze and Felix Guattari famously propose “becoming animal” as a liberating artistic practice. This workshop-cum-seminar will engage with key themes in recent “post-humanist” discourse by applying and testing them in our own creative practice. We will read recent theories of species, ecology, and matter (by writers like Jacques Derrida, Donna Haraway, Elizabeth Grosz, Jane Bennett, and Timothy Morton) and we will study a variety of literary, cinem...\n\n      more description for AHSEM-UA  193 »\n\n      \n\n\n\n“Either stop writing, or write like a rat!” In one of the most provocative texts in contemporary animal philosophy, the French philosophers Gilles Deleuze and Felix Guattari famously propose “becoming animal” as a liberating artistic practice. This workshop-cum-seminar will engage with key themes in recent “post-humanist” discourse by applying and testing them in our own creative practice. We will read recent theories of species, ecology, and matter (by writers like Jacques Derrida, Donna Haraway, Elizabeth Grosz, Jane Bennett, and Timothy Morton) and we will study a variety of literary, cinematic and visual art works that seem to resonate with key themes of that discourse (works like Wallace Shawn’s Grasses of a Thousand Colors, Cesar Aira’s An Episode in the Life of a Landscape Painter, Marina Zurkow’s “Slurb,” Marian Engel’s Bear, and Robinson Devor’s Zoo). Our seminar-style investigations of these texts and artworks will regularly be applied in workshop sessions where we will use space, objects, movement, sound, imagery, and writing to explore the aesthetic implications of these theoretical ideas. A main interest of this course is to experiment with “creative research,” a way of doing intellectual work in which art-making is regarded as—and systematically used as—a mode of knowledge and inquiry, and in which ideas are developed by doing and making as well as by thinking/writing/speaking. Prior artistic training/practice is welcomed but not required; however, all students must be willing to and interested in exploring their \"inner artist.\"\n\n      less description for AHSEM-UA  193 «",
            "offering": true
        },
        {
            "course_id": "AHSEM-UA 194",
            "course_name": "",
            "description": "AHSEM-UA  194\n\n   Approaching African History through Literature\n\nThis course focuses on the history of Africa by means of the literature of the continent, acquainting students with the major issues and questions relating to Africa’s development from early to contemporary times, spanning the whole of the continent.  Questions concerning the relationship of the production of literature to centers of power, the meaning of literature in societies espousing orality, the problems of sustaining both content and intent upon the conversion of oral literature into written form, the specific and at times parochial uses of literature, the interplay of gender and voice,...\n\n      more description for AHSEM-UA  194 »\n\n      \n\n\n\nThis course focuses on the history of Africa by means of the literature of the continent, acquainting students with the major issues and questions relating to Africa’s development from early to contemporary times, spanning the whole of the continent.  Questions concerning the relationship of the production of literature to centers of power, the meaning of literature in societies espousing orality, the problems of sustaining both content and intent upon the conversion of oral literature into written form, the specific and at times parochial uses of literature, the interplay of gender and voice, the politics of translation into European modalities, and assorted other queries will all be examined regionally and over time.\n\n      less description for AHSEM-UA  194 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 195",
            "course_name": "",
            "description": "AHSEM-UA  195\n\n   Realism and How to Get Rid of It\n\nRealism (with a capital r) was a nineteenth-century school in literature, theater, and art that sought to portray reality as objectively as possible. The twentieth century saw various reactions against Realism, such as the stream-of-consciousness novel, surrealism, Brechtian epic theater, theater of the absurd, the first-person singular narrative, postmodernism, and abstract expressionism. Though they were very different from each other, all had more subjective, idiosyncratic ways of understanding and representing reality. We start with icons of Realism (e.g., Balzac, James, Ibsen) and continu...\n\n      more description for AHSEM-UA  195 »\n\n      \n\n\n\nRealism (with a capital r) was a nineteenth-century school in literature, theater, and art that sought to portray reality as objectively as possible. The twentieth century saw various reactions against Realism, such as the stream-of-consciousness novel, surrealism, Brechtian epic theater, theater of the absurd, the first-person singular narrative, postmodernism, and abstract expressionism. Though they were very different from each other, all had more subjective, idiosyncratic ways of understanding and representing reality. We start with icons of Realism (e.g., Balzac, James, Ibsen) and continue through twentieth-century masterpieces of anti-realism, from novels by Camus, Robbe-Grillet and Paul Auster, to plays by Pirandello, Brecht, Ionesco, Beckett and Pinter, concentrating on form, language, and conventions, and the relationship of the work to the reader or spectator. In addition to literature, we contrast “traditional” narrative cinema with nonlinear cinema, and Realism in painting with contemporary non-realistic art. Throughout, we examine critical texts related aesthetics of Realism and anti-realism.\n\n      less description for AHSEM-UA  195 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 196",
            "course_name": "",
            "description": "AHSEM-UA  196\n\n   Staging the Self: Biography, Anthropology and Performance\n\nIn this course we examine the representation of personal experience in its biographical and autobiographical forms in the arts, with a focus on performance. Particular attention is paid to the ways in which personhood is aesthetically, psychologically, and politically theorized in different contexts. What does an individual’s experience represent in specific works of art? How is the relationship of individual experience to collective experience reconstructed in different works? Can individual experience portray collective historical reality? Should we understand an artist’s oeuvre in relation ...\n\n      more description for AHSEM-UA  196 »\n\n      \n\n\n\nIn this course we examine the representation of personal experience in its biographical and autobiographical forms in the arts, with a focus on performance. Particular attention is paid to the ways in which personhood is aesthetically, psychologically, and politically theorized in different contexts. What does an individual’s experience represent in specific works of art? How is the relationship of individual experience to collective experience reconstructed in different works? Can individual experience portray collective historical reality? Should we understand an artist’s oeuvre in relation to his or her personal life? In what ways do individual works bestow human experience with specific epistemologies and with social and historical realities? Are Irving Goffman’s ideas about the performance of self in everyday life relevant to the personal identities represented in museums, in documentary film, in architecture, and on theatrical stages? Can the individual lives represented in art accurately represent abstract social relations? Texts for the course include works by Irving Goffman, Errol Morris, Erik Erikson, Joseph Roach, Freddie Rokem, Deirdre Heddon, and selected plays, films and museum displays.\n\n      less description for AHSEM-UA  196 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 197",
            "course_name": "",
            "description": "AHSEM-UA  197\n\n   The Brain-Mind Continuum\n\nThis course examines the central themes of Professor Llinas’s pathbreaking work, I of the Vortex. This text and the seminar present an original view of the evolution and nature of mind. At the start of it all, the \"mindness state\" evolved to allow predictive interactions between mobile creatures and their environment. This course follows the early evolution of mind as exemplified by the primitive sea squirt. The specific themes we examine include: prediction as the ultimate function of the brain, motricity, nerve cells and their “personalities,” the evolution of the eye, fixed action patterns ...\n\n      more description for AHSEM-UA  197 »\n\n      \n\n\n\nThis course examines the central themes of Professor Llinas’s pathbreaking work, I of the Vortex. This text and the seminar present an original view of the evolution and nature of mind. At the start of it all, the \"mindness state\" evolved to allow predictive interactions between mobile creatures and their environment. This course follows the early evolution of mind as exemplified by the primitive sea squirt. The specific themes we examine include: prediction as the ultimate function of the brain, motricity, nerve cells and their “personalities,” the evolution of the eye, fixed action patterns (FAPs), qualia from a neuronal point of view, learning and memory, language and abstract thought, and the collective mind. Students must actively participate in class discussions and write a term paper.\n\n      less description for AHSEM-UA  197 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 198",
            "course_name": "Seeing the City",
            "description": "AHSEM-UA  198 Seeing the City \nThis seminar explores how the buildings, streets, and public spaces of a city relate to its economic, social, and political life. The seminar thus bridges visual studies and the social sciences. The seminar is pro-active. In addition to classroom readings and discussions, you will work in small teams to photograph and film particular conditions in the city. Your term project will take you into one of the Marron Institute's urban design projects. The course aims to sensitize you to the urban environment, as well as introduce you to the skills urbanists use in their work.",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 199",
            "course_name": "",
            "description": "AHSEM-UA  199\n\n   Jews and Other Minorities in Nazi Germany\n\nThe destruction of European Jewry has been a central focus in studying Nazi extermination policies. This course will look at Nazi policies towards the Jewish people and examine how the “racial state” (or racist state) dealt with those it deemed “racially unfit” to belong to the German Volk. It will analyze the ways in which the Nazis sought to create a nation based on blood and race. By studying policies towards the so-called “enemies” of the Third Reich -- including Jews, Sinti and Roma (Gypsies), the physically and mentally disabled, homosexuals, Afro-Germans, “asocials,” etc. -- the course ...\n\n      more description for AHSEM-UA  199 »\n\n      \n\n\n\nThe destruction of European Jewry has been a central focus in studying Nazi extermination policies. This course will look at Nazi policies towards the Jewish people and examine how the “racial state” (or racist state) dealt with those it deemed “racially unfit” to belong to the German Volk. It will analyze the ways in which the Nazis sought to create a nation based on blood and race. By studying policies towards the so-called “enemies” of the Third Reich -- including Jews, Sinti and Roma (Gypsies), the physically and mentally disabled, homosexuals, Afro-Germans, “asocials,” etc. -- the course will also highlight how these policies interacted with each other. It will examine measures that the government enacted to delegitimize, isolate, rob, incarcerate, sterilize, and/or murder many of these minorities as well as measures intended to increase the “Aryan” population. The course will also look at theories as to why many German perpetrators and bystanders participated in or allowed discrimination or murder to occur.\n\n      less description for AHSEM-UA  199 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 200",
            "course_name": "",
            "description": "AHSEM-UA  200\n\n   Music and Masquerade\n\nThis course focuses on two specific cultural contexts – Brazil and Trinidad and Tobago – examining the work of artists who have integrated avant-garde and popular modes of expression. We will explore in close relation to each other the tropicália music movement of Brazil of the 1960’s and 1970’s and the artistry of Trinidadian carnival. Themes to be discussed include: the relationships that these cultural products have had with their publics; the merging of experimentalism and mass consumption; the sustained attack on the opposition of high and low culture; and the sociopolitical background to...\n\n      more description for AHSEM-UA  200 »\n\n      \n\n\n\nThis course focuses on two specific cultural contexts – Brazil and Trinidad and Tobago – examining the work of artists who have integrated avant-garde and popular modes of expression. We will explore in close relation to each other the tropicália music movement of Brazil of the 1960’s and 1970’s and the artistry of Trinidadian carnival. Themes to be discussed include: the relationships that these cultural products have had with their publics; the merging of experimentalism and mass consumption; the sustained attack on the opposition of high and low culture; and the sociopolitical background to the works. Using the category of “avant-pop,” we will analyze the challenges that music and masquerade as expressive forms have posed to social conventions and to racial and cultural essentialisms.\n\n      less description for AHSEM-UA  200 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 201",
            "course_name": "",
            "description": "AHSEM-UA  201\n\n   Food, Land and Power\n\nThis course explores settler colonial power within the context of Empire. As a comparative survey in Indigenous studies, this course highlights movements around sustainability, cultural regeneration, and food sovereignty that oppose and seek to replace industries founded upon resource extraction, a military industrial complex and genetically modified crops. Using both historical and contemporary case studies, we will examine Indigenous movements that offer alternative economies as a means of producing alternative futures. That is to say, this course highlights the ways in which many Indigenous...\n\n      more description for AHSEM-UA  201 »\n\n      \n\n\n\nThis course explores settler colonial power within the context of Empire. As a comparative survey in Indigenous studies, this course highlights movements around sustainability, cultural regeneration, and food sovereignty that oppose and seek to replace industries founded upon resource extraction, a military industrial complex and genetically modified crops. Using both historical and contemporary case studies, we will examine Indigenous movements that offer alternative economies as a means of producing alternative futures. That is to say, this course highlights the ways in which many Indigenous movements articulate their aims as liberation from the state itself rather than liberating the state from corruption.\n\n      less description for AHSEM-UA  201 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 202",
            "course_name": "Picturing Place: Images and Urban Change",
            "description": "AHSEM-UA  202 Picturing Place: Images and Urban Change \nThis seminar explores the roles that visual languages have in the production of the built environment and the interactive relationships between images and cities. We will look at how images of cities - like plans, maps, and digital renderings - and images in cities – such as billboards and community murals - influence urban change and perceptions of place. Exploring methods of visual analysis and debates in the history of urban planning and design, we will ask how images created in the studio and encountered on the street connect to larger power struggles over the future of the city.",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 203",
            "course_name": "",
            "description": "AHSEM-UA  203\n\n   Saloon Keepers, Seamstresses, and Servant Girls: A Social Survey of Irish New York in 1880\n\nIn 1880, following over a century of robust migration from Ireland, 750,000 residents of New York City could claim Irish ancestry, with a third of these first-generation immigrants. More Irish and their descendants were living in New York than in Dublin in that year, and it is this population that will serve as the basis for a semester-long research investigation of the demographic, social, and cultural dynamics of these residents as revealed in the 1880 U.S. census.\nThe course will be built around the acquisition and deployment of digital analysis techniques for historical census data, focusi...\n\n      more description for AHSEM-UA  203 »\n\n      \n\n\n\nIn 1880, following over a century of robust migration from Ireland, 750,000 residents of New York City could claim Irish ancestry, with a third of these first-generation immigrants. More Irish and their descendants were living in New York than in Dublin in that year, and it is this population that will serve as the basis for a semester-long research investigation of the demographic, social, and cultural dynamics of these residents as revealed in the 1880 U.S. census.\nThe course will be built around the acquisition and deployment of digital analysis techniques for historical census data, focusing on the population of New York City. Skills emphasized will be collecting and organizing demographic data, statistical analysis of historical sources, and conveying research findings using today's digital mapping and chart-production programs. No prior knowledge in digital tools is required, although the aim will be for students to acquire digital analytical skills useful for a broad range of research.\n\n      less description for AHSEM-UA  203 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 204",
            "course_name": "",
            "description": "AHSEM-UA  204\n\n   Making History: Culture and Politics in the Caribbean\n\nIn this seminar we will study the culture and politics of the Caribbean. The class is organized around key moments of Caribbean history: “Discovery;” slavery and the struggles against it; colonialism and independence movements; U.S. occupations, dictatorships and revolutionary movements; the massive growth of a Caribbean diaspora; and the transformation of the Caribbean islands into so many tourist destinations. While the Spanish-speaking islands (Cuba, Puerto Rico, Dominican Republic) are at the center, the French and English-speaking Caribbean (and questions that concern the Caribbean as a r...\n\n      more description for AHSEM-UA  204 »\n\n      \n\n\n\nIn this seminar we will study the culture and politics of the Caribbean. The class is organized around key moments of Caribbean history: “Discovery;” slavery and the struggles against it; colonialism and independence movements; U.S. occupations, dictatorships and revolutionary movements; the massive growth of a Caribbean diaspora; and the transformation of the Caribbean islands into so many tourist destinations. While the Spanish-speaking islands (Cuba, Puerto Rico, Dominican Republic) are at the center, the French and English-speaking Caribbean (and questions that concern the Caribbean as a region), will be part of the discussion. Readings are drawn from primary sources (slave testimonies, declarations of independence, revolutionary discourses), literary texts, film, and important essays in cultural studies/critical theory, anthropology, and history. The class will be taught in English. Reading of texts in the original language is encouraged.\n\n      less description for AHSEM-UA  204 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 205",
            "course_name": "",
            "description": "AHSEM-UA  205\n\n   Understanding Modern War Culture\n\nWhat impact has war had on literature and culture? How have writers, intellectuals and citizens struggled to find a voice during wartime in the face of censorship, propaganda, trauma and the technologies of violence? What does it mean to live in a culture of war? This course explores these questions in a range of British, American and postcolonial novels, poems, and films. Beginning with some foundational representations of war cultures by Homer, Shakespeare and Tolstoy, we will chart the transformations and mutations of modern war culture from the era of colonial warfare, total warfare during...\n\n      more description for AHSEM-UA  205 »\n\n      \n\n\n\nWhat impact has war had on literature and culture? How have writers, intellectuals and citizens struggled to find a voice during wartime in the face of censorship, propaganda, trauma and the technologies of violence? What does it mean to live in a culture of war? This course explores these questions in a range of British, American and postcolonial novels, poems, and films. Beginning with some foundational representations of war cultures by Homer, Shakespeare and Tolstoy, we will chart the transformations and mutations of modern war culture from the era of colonial warfare, total warfare during the First World War, and imperial air power. We will explore the ways that writers, artists and film-makers have represented more recent conflicts like the “People’s War” of World War Two, the apocalyptic imaginary of Cold War, guerilla warfare and counterinsurgency, to the mythology of “high tech warfare” and the wars in Iraq and Afghanistan. Focusing in particular on questions of gender, imperialism and resistance, we will read novels, poetry, memoirs, military writings and theoretical texts. Readings may be drawn from the work of: Homer, Shakespeare, Tolstoy, W.B. Yeats, Siegfried Sassoon and Wilfred Owen, Ernst Junger, Ernest Hemingway, Rebecca West, Virginia Woolf, George Orwell, W.H. Auden, Elizabeth Bowen, Graham Greene, Tim O’Brien, Martin Amis, Michael Ondaatje, Anthony Swofford, and Riverbend. The course will also include discussions of a wide variety of films and popular culture.\n\n      less description for AHSEM-UA  205 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 206",
            "course_name": "",
            "description": "AHSEM-UA  206\n\n   Fictions of the Self\n\nIn two radically different ways, this course investigates  the various fictions by which we invent a “self:”  first through the study of memoirs, autobiographies, first person narratives,  solo performances and  case histories  in which a “self” and an “other” are constructed; and  second through the imitation of these forms. Student writing will be split between analytical essays on writers like Turgenev, Peter Handke, Maxine Hong Kingston, Faulkner, Kafka, Freud and Toibin and Friel and the production of original work using the forms and constraints these writers employed as objects of imita...\n\n      more description for AHSEM-UA  206 »\n\n      \n\n\n\nIn two radically different ways, this course investigates  the various fictions by which we invent a “self:”  first through the study of memoirs, autobiographies, first person narratives,  solo performances and  case histories  in which a “self” and an “other” are constructed; and  second through the imitation of these forms. Student writing will be split between analytical essays on writers like Turgenev, Peter Handke, Maxine Hong Kingston, Faulkner, Kafka, Freud and Toibin and Friel and the production of original work using the forms and constraints these writers employed as objects of imitation. Such forms include the letter, the case history, the mystery, stream-of-consciousness and the invocation of biblical or classical material. In addition to exploring different genres as methods of creating a self, the course will examine the use of different subjects through which a “self” is imagined: mothers (Peter Handke, Maxine Hong Kingston, Colm Toibin), fathers (Kafka), siblings (Benjy’s section of The Sound and The Fury) and early love (Turgenev). We will also examine the process by which narratives constructed for the page are re-shaped as productions for the stage (comparison of Mark Haddon’s Curious Incident of the Dog in the Night to the current London production) and to the use of multiple sustained monologues in plays like Faith Healer. This is a course specially designed for students with an interest in producing autobiographical work, work in the first person that “poses” as autobiography, or work that draws on the deliberate constraints of a form (letter, case history, mystery) as a way to illuminate autobiographical material.\n\n      less description for AHSEM-UA  206 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 207",
            "course_name": "",
            "description": "AHSEM-UA  207\n\n   The Crusades & Their Legacy\n\nThe Crusades form one of the most important chapters in the history of the interactions among Christianity, Islam, and Judaism.  They began at the end of the 11th century as religious wars to recover the holy places venerated by Christians in the city of Jerusalem. The unexpected result of the First Crusade was the conquest of lands in the Middle East known as the Latin Kingdom. For two hundred years, against all odds, the Crusaders managed to keep some of their newly won lands. They lost more of them with every passing decade, however, until at last the Muslims triumphed and the kingdom in th...\n\n      more description for AHSEM-UA  207 »\n\n      \n\n\n\nThe Crusades form one of the most important chapters in the history of the interactions among Christianity, Islam, and Judaism.  They began at the end of the 11th century as religious wars to recover the holy places venerated by Christians in the city of Jerusalem. The unexpected result of the First Crusade was the conquest of lands in the Middle East known as the Latin Kingdom. For two hundred years, against all odds, the Crusaders managed to keep some of their newly won lands. They lost more of them with every passing decade, however, until at last the Muslims triumphed and the kingdom in the Middle East was lost to Western Christendom. \nWe live in a time when the memory and the rhetoric about the crusades, for good or ill, permeate the Western World and the Islamic World, especially in the Middle East. This seminar addresses the many aspects of the crusading fervor which inform beliefs and politics to this day, such the nature of a Christian holy war and the nature of jihad; the question of whether the Crusades were the first manifestation of European imperialism in the Middle East; and the relations among the three great religious groups and how it came about that they all claim Jerusalem for their own.\n\n      less description for AHSEM-UA  207 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 208",
            "course_name": "",
            "description": "AHSEM-UA  208\n\n   Exploring the Archive: New York City & Beyond\n\nThis seminar is designed for juniors and seniors working on advanced research projects in the humanities. It will serve as an introduction to archival research while addressing the scholarly issues raised by the students’ projects. Presentations are thus to be organized with students’ projects in mind, and designed to enable archival research in a range of topics, periods of specialization, and languages. In addition to on-site workshops utilizing NYU’s Fales Library and Special Collections, the course introduces students to the vast array of archival resources offered by New York City; an ove...\n\n      more description for AHSEM-UA  208 »\n\n      \n\n\n\nThis seminar is designed for juniors and seniors working on advanced research projects in the humanities. It will serve as an introduction to archival research while addressing the scholarly issues raised by the students’ projects. Presentations are thus to be organized with students’ projects in mind, and designed to enable archival research in a range of topics, periods of specialization, and languages. In addition to on-site workshops utilizing NYU’s Fales Library and Special Collections, the course introduces students to the vast array of archival resources offered by New York City; an overnight trip to a distant archive (perhaps the Library of Congress or the Beinecke Library, both of which offer junior-level research fellowships that may be of interest) and information sessions on the construction and use of internet archives broaden the experience beyond city limits. In many humanities courses, students learn about a subject through reading secondary materials. Their research, however, is rarely significant in terms of discovering new knowledge or generating new perspectives. Working with primary materials in special collections, students in this class have an opportunity to work on materials and ideas that have not previously been considered. Participants will be guided as to how they might contribute original and truly ‘new’ discoveries to their fields of interest.\n\n      less description for AHSEM-UA  208 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 209",
            "course_name": "",
            "description": "AHSEM-UA  209\n\n   Latinos, Im/migration and Race\n\nThis course examines Latino immigration to, and integration in the United States. It will cover broad themes like why people migrate and what accounts for their integration into society, and the future of the U.S. racial hierarchy. More specifically it will trace the history of Latin American and Caribbean immigration, their distinct trajectories in the United States along a series of indicators and the impact of Latinos on U.S. society. The course will include, for example, investigations of Mexican and Dominican immigration to the United States as well as Puerto Rican migration from the isla...\n\n      more description for AHSEM-UA  209 »\n\n      \n\n\n\nThis course examines Latino immigration to, and integration in the United States. It will cover broad themes like why people migrate and what accounts for their integration into society, and the future of the U.S. racial hierarchy. More specifically it will trace the history of Latin American and Caribbean immigration, their distinct trajectories in the United States along a series of indicators and the impact of Latinos on U.S. society. The course will include, for example, investigations of Mexican and Dominican immigration to the United States as well as Puerto Rican migration from the island to the mainland. We will also examine important topics such as racialization processes, citizenship, and transnationalism. Through their engagement with course materials, assignments, and in discussions with their peers, students will bridge the academic literature on immigration with ongoing debates.\n\n      less description for AHSEM-UA  209 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 210",
            "course_name": "",
            "description": "AHSEM-UA  210\n\n   Politics of Resistance: Latin American Cultures in Neoliberal Times\n\nFrom the “Chilean September 11th” in 1973 to the recent massive mobilizations in Brazil in defense of public spaces threatened by privatizations, the last four decades of Latin American social life have revolved around the effects of neoliberalism. Dominant in the aftermath of the defeat of revolutionary movements in the 1970’s, neoliberalism was imposed with unique force by its defenders as the region's only chance to develop modernizing economies and modern democracies. Since then, both at the heights of its influence in the 1980’s and 1990’s, and persistently contested after the 2000’s, the...\n\n      more description for AHSEM-UA  210 »\n\n      \n\n\n\nFrom the “Chilean September 11th” in 1973 to the recent massive mobilizations in Brazil in defense of public spaces threatened by privatizations, the last four decades of Latin American social life have revolved around the effects of neoliberalism. Dominant in the aftermath of the defeat of revolutionary movements in the 1970’s, neoliberalism was imposed with unique force by its defenders as the region's only chance to develop modernizing economies and modern democracies. Since then, both at the heights of its influence in the 1980’s and 1990’s, and persistently contested after the 2000’s, the “neoliberal era” shaped the destiny of most Latin American nations. \nIn this context, Latin America will become a laboratory of creative interventions that explore new formats and new audiences, as in the emergence of the cartoneras publishing houses, the interface between technology and collective mobilization, and the networks between art collectives and social movements. Analyzing literary and cinematographic works by figures such Lucrecia Martel, Eduardo Coutinho and Roberto Bolaño, installations by Teresa Margolles, together with diverse experiences of cultural collectives, this course will explore the ways in which culture produces not only critical insights about neoliberal society but also alternatives to its most pervasive effects.\n\n      less description for AHSEM-UA  210 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 211",
            "course_name": "",
            "description": "AHSEM-UA  211\n\n   Nationalism and Global History\n\nNationalism is a major political, social, and cultural phenomenon of the modern world. This course explores the emergence and circulation of ideas of nationhood and national belonging in diverse yet interlinked regions, including present day Latin America and the Caribbean, South Asia and South-East Asia, and Europe. The course opens with a set of general readings that help establish the larger historical and analytical issues at stake. The central questions and themes of the course include: How did ideas of nationhood and national belonging emerge within and across regions? What was the relat...\n\n      more description for AHSEM-UA  211 »\n\n      \n\n\n\nNationalism is a major political, social, and cultural phenomenon of the modern world. This course explores the emergence and circulation of ideas of nationhood and national belonging in diverse yet interlinked regions, including present day Latin America and the Caribbean, South Asia and South-East Asia, and Europe. The course opens with a set of general readings that help establish the larger historical and analytical issues at stake. The central questions and themes of the course include: How did ideas of nationhood and national belonging emerge within and across regions? What was the relation between empire and nation? Did nationalist movements alter the meaning and significance of collective identities based on religion, gender, or class? How were concepts of nation, territory, and economy placed together in different nationalist movements? Does contemporary globalization signal the fading of nationalisms and nation-states? Secondary readings (historical and anthropological works) will be read alongside primary materials (novels, pamphlets, and archival documents) to address the historical and conceptual issues raised by nationalism as a global phenomenon.\n\n      less description for AHSEM-UA  211 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 212",
            "course_name": "",
            "description": "AHSEM-UA  212\n\n   Implications of Moral Diversity\n\nThis seminar focuses on a set of questions that arise from the recognition that there are diverse moral outlooks that involve incompatible moral judgments. How much diversity is there and how deep does it go? What makes an outlook and judgment moral? How recent is this recognition: does it arise from our increasingly multicultural societies and from the ever more prevalent discourse of human rights across the world? To what extent is that discourse ethnocentric—a kind of moral imperialism? Are there non-Western (e.g. East Asian) cultures, which offer a challenge and alternative to talk of huma...\n\n      more description for AHSEM-UA  212 »\n\n      \n\n\n\nThis seminar focuses on a set of questions that arise from the recognition that there are diverse moral outlooks that involve incompatible moral judgments. How much diversity is there and how deep does it go? What makes an outlook and judgment moral? How recent is this recognition: does it arise from our increasingly multicultural societies and from the ever more prevalent discourse of human rights across the world? To what extent is that discourse ethnocentric—a kind of moral imperialism? Are there non-Western (e.g. East Asian) cultures, which offer a challenge and alternative to talk of human rights? Do different moralities correlate with cultural differences? Are we witnessing a ‘clash of civilizations’? How should we respond to the claims of cultural relativism?\n\nWe will read some classical texts—such as Michel de Montaigne’s Essays on custom and on cannibalism and Ruth Benedict on patterns of culture, and also contemporary work by sociologists, moral philosophers and others that discusses multiculturalism, moral and cultural relativism and the theory and practice of human rights.\n\n      less description for AHSEM-UA  212 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 213",
            "course_name": "",
            "description": "AHSEM-UA  213\n\n   Crowds and Collective Action\n\nThe word \"crowd\" today tends to suggest attendees of a sports or music event, and so if you google \"crowd control\" you will initially find security firms offering \"stanchions, barriers and accessories\" to help you manage your event--as though contemporary populations have been domesticated to the level of cattle. Though the Arab Spring, the Indignados movement and Occupy Wall Street have reminded everyone that crowds of a different sort are still capable of engaging in collective action, it is possible that contemporary mass demonstrations do not behave much like any of the various types of cr...\n\n      more description for AHSEM-UA  213 »\n\n      \n\n\n\nThe word \"crowd\" today tends to suggest attendees of a sports or music event, and so if you google \"crowd control\" you will initially find security firms offering \"stanchions, barriers and accessories\" to help you manage your event--as though contemporary populations have been domesticated to the level of cattle. Though the Arab Spring, the Indignados movement and Occupy Wall Street have reminded everyone that crowds of a different sort are still capable of engaging in collective action, it is possible that contemporary mass demonstrations do not behave much like any of the various types of crowds of the past. Cities may have been designed and have certainly been policed to prevent spontaneous crowd formation; social media have changed the way crowds are organized and articulate themselves; and other media may have contributed to shifts in attitudes towards crowds. Yet at the same time, increasingly dysfunctional \"normal\" politics in the West, along with rising levels of displaced, dispossessed and persecuted people everywhere, are calling forth a resurgence of crowd activity, from the camp to the public square. \n\nThis course offers a survey of the classic literature on crowds, (Le Bon, Freud, Cannetti, Rudé) as well as more recent contributions (Hardt and Negri's Multitudes) in order to open a discussion about what has happened in the past and what is happening today in direct collective action.\n\n      less description for AHSEM-UA  213 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 214",
            "course_name": "",
            "description": "AHSEM-UA  214\n\n   Language and Empire in the Americas\n\nEmpires by definition are multilingual regimes that bring languages into contact in highly charged, dynamic relations of power that continue to unfold after empires themselves dissolve. To translate is to enter but also empower the other’s language. To be bilingual is to inhabit two worlds and be unfaithful to both. This course studies the unfolding drama of language and empire at two main sites: 1) the United States, where English only ideologies persist alongside a permanently renewed multilingualism, and 2) Spanish America, in the encounter between the Spanish imperialism and the Aztec and ...\n\n      more description for AHSEM-UA  214 »\n\n      \n\n\n\nEmpires by definition are multilingual regimes that bring languages into contact in highly charged, dynamic relations of power that continue to unfold after empires themselves dissolve. To translate is to enter but also empower the other’s language. To be bilingual is to inhabit two worlds and be unfaithful to both. This course studies the unfolding drama of language and empire at two main sites: 1) the United States, where English only ideologies persist alongside a permanently renewed multilingualism, and 2) Spanish America, in the encounter between the Spanish imperialism and the Aztec and Inca empires, still resonating today. No background in linguistics is required, but linguistics students are welcome. Taught in English.\n\n      less description for AHSEM-UA  214 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 215",
            "course_name": "",
            "description": "AHSEM-UA  215\n\n   Medieval Spain in Modern Fiction\n\nIn recent years, the idea of “the three cultures” of medieval Spain — Christianity, Islam and Judaism — has become a popular ideal and model for modernity among a wide variety of thinkers and writers; and both utopian and distopian visions of Sefarad and Andalus (the Hebrew and Arabic terms that refer to the Iberian Peninsula) permeate discourses on politics, religion and even education. This course will examine the ways in which that nostalgia for a lost Andalus or Sefarad is both explored as a theme and used as a device in a wide variety of modern novels and short stories (as well as some po...\n\n      more description for AHSEM-UA  215 »\n\n      \n\n\n\nIn recent years, the idea of “the three cultures” of medieval Spain — Christianity, Islam and Judaism — has become a popular ideal and model for modernity among a wide variety of thinkers and writers; and both utopian and distopian visions of Sefarad and Andalus (the Hebrew and Arabic terms that refer to the Iberian Peninsula) permeate discourses on politics, religion and even education. This course will examine the ways in which that nostalgia for a lost Andalus or Sefarad is both explored as a theme and used as a device in a wide variety of modern novels and short stories (as well as some poetry), and the ways in which modern authors deploy this trope to comment on the worlds they inhabit. Reading medieval Spanish texts alongside the writing they inspired in modernity will provide a diachronic framework for better understanding medieval Iberian literature and will also raise questions about the salience of the past for the present. Modern readings will include The Moor's Last Sigh (Salman Rushdie), Averroes' Search (Jorge Luis Borges), the Tamarit Diwan (Federico Garcia Lorca), and others.\n\n      less description for AHSEM-UA  215 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 216",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "8981",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "AHSEM-UA  216\n\n   East/West? Politics of Cultural Representation and the Middle East\n\nScholars have argued that since the “fall” of Byzantine Constantinople to the Ottomans in the 15th century, Western European intellectuals started framing cultural difference in terms of the “East” and the “West.” Renaissance humanists, for example, resorted to ancient and medieval texts to create a religiously and culturally defined “other”—the “Ottoman Turks.” Their writings then spread around Europe and generated conceptualizations of what the West “ought to be,” as different from the East.\n\nThis course will examine a wide variety of cultural representations pertaining to the modern Middle ...\n\n      more description for AHSEM-UA  216 »\n\n      \n\n\n\nScholars have argued that since the “fall” of Byzantine Constantinople to the Ottomans in the 15th century, Western European intellectuals started framing cultural difference in terms of the “East” and the “West.” Renaissance humanists, for example, resorted to ancient and medieval texts to create a religiously and culturally defined “other”—the “Ottoman Turks.” Their writings then spread around Europe and generated conceptualizations of what the West “ought to be,” as different from the East.\n\nThis course will examine a wide variety of cultural representations pertaining to the modern Middle East that have contributed to the configuration of \"East/West\" divides, such as: the World Exhibitions of the 19th and early 20th centuries; novels; discourses and institutions of humanitarianism; and the contemporary human rights regime. We will explore politics of cultural representation over the last two centuries and how they lend themselves to problematic interpretations of the East/West in general, and the Middle East in particular. Sources to be examined include historical pamphlets, old newspapers, film, travel accounts, and fictional works by authors such as Hanif Kureishi, Tayeb Salih, or Orhan Pamuk.\n\n      less description for AHSEM-UA  216 «",
            "offering": true
        },
        {
            "course_id": "AHSEM-UA 217",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "9183",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "AHSEM-UA  217\n\n   The New Documentary Film in Brazil\n\nHow does documentary film represent reality? Is it a transparent window? Or is it a more complex form that may include elements of staging and fiction? In Brazil (as elsewhere) the last twenty years have seen a surge in documentary filmmaking and critical thinking about this kind of film. The increased production of documentary film is part of the Retomada or Renewal of Brazilian cinema of all kinds since the 1990s, made possible by favorable government policies. This course, CONDUCTED IN ENGLISH, will examine a selection of these Brazilian films from the 1990s to the present (with brief retro...\n\n      more description for AHSEM-UA  217 »\n\n      \n\n\n\nHow does documentary film represent reality? Is it a transparent window? Or is it a more complex form that may include elements of staging and fiction? In Brazil (as elsewhere) the last twenty years have seen a surge in documentary filmmaking and critical thinking about this kind of film. The increased production of documentary film is part of the Retomada or Renewal of Brazilian cinema of all kinds since the 1990s, made possible by favorable government policies. This course, CONDUCTED IN ENGLISH, will examine a selection of these Brazilian films from the 1990s to the present (with brief retrospectives to earlier films) and explore issues such as: the uses of fact and fiction and the multiple ways in which documentary film may go beyond offering realistic versions of preexisting realities; the scope of its political impact; ethical concerns about the respectful use of other people's images and words; and the construction of layered and complex images of Brazil.\n\n      less description for AHSEM-UA  217 «",
            "offering": true
        },
        {
            "course_id": "AHSEM-UA 218",
            "course_name": "",
            "description": "AHSEM-UA  218\n\n   Italy and the Mediterranean: Empire, Politics and Culture\n\nThis course studies the critically neglected history of Italian imperialism, examining how it shaped internal politics, legitimizing Italy’s Fascist regime, and how it impacted the culture, identity and sovereign borders of the regions it colonized. North Africa (Tunisia, Libya and Egypt), the Levant and east Africa became the pillars in a fantasy about reuniting the Mediterranean under Italian rule in the 1930s. The course studies the origins of this fantasy in an earlier phase of Italy’s nation building and how it was transformed through experiences of emigration, crypto-colonialism (the ‘So...\n\n      more description for AHSEM-UA  218 »\n\n      \n\n\n\nThis course studies the critically neglected history of Italian imperialism, examining how it shaped internal politics, legitimizing Italy’s Fascist regime, and how it impacted the culture, identity and sovereign borders of the regions it colonized. North Africa (Tunisia, Libya and Egypt), the Levant and east Africa became the pillars in a fantasy about reuniting the Mediterranean under Italian rule in the 1930s. The course studies the origins of this fantasy in an earlier phase of Italy’s nation building and how it was transformed through experiences of emigration, crypto-colonialism (the ‘Southern Question’) and World Wars I and II. The tension between identity and alterity; the relationship between colonialism, race and citizenship; and the Mediterranean as a duplicitous space—both hermetic and porous, a site of shared histories but also fierce, sectarian rivalries—are our primary themes. Texts include photography, film, novels and scholarly articles; the class will also make a field trip to the UN. We conclude by analyzing contemporary debates about migration in the Mediterranean.\n\n      less description for AHSEM-UA  218 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 219",
            "course_name": "",
            "description": "AHSEM-UA  219\n\n   Jewish Women in Modern History\n\nThis course will approach Jewish women’s history from the perspective of social history. After an introduction to the normative role of women in Judaism, the body of the course will focus on Jewish women in Modern Europe and America, analyzing their history in a variety of countries from the American and French Revolutions, through the bourgeois 19th century, World War I, the interwar era, the Nazi era, and postwar Europe and the United States. Students will read secondary sources but we will pay particular attention to memoirs, diaries, and letters. Students will learn about the prescriptive ...\n\n      more description for AHSEM-UA  219 »\n\n      \n\n\n\nThis course will approach Jewish women’s history from the perspective of social history. After an introduction to the normative role of women in Judaism, the body of the course will focus on Jewish women in Modern Europe and America, analyzing their history in a variety of countries from the American and French Revolutions, through the bourgeois 19th century, World War I, the interwar era, the Nazi era, and postwar Europe and the United States. Students will read secondary sources but we will pay particular attention to memoirs, diaries, and letters. Students will learn about the prescriptive roles of Jewish women in the home, family, religion, and worlds of work and social life. They will focus, however, on the actual activities of Jewish women, what they did, rather than what they were supposed to do. They will investigate the rich variety of responsibilities and tasks that women performed in the (often intersecting) private and public spheres of life, how they both preserved religion in the modern era and also mediated non-Jewish culture for their families. They will further note that women both kept the Jewish family and community together and reached out to non-Jews, joining in secular women’s organizations, local community projects, and the field of social work and teaching. They will discover that women’s roles were often contested and always crucial to the Jewish community.\n\n      less description for AHSEM-UA  219 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 220",
            "course_name": "",
            "description": "AHSEM-UA  220\n\n   Anthropology in the Horror Film\n\nAnthropologists have appeared as protagonists and key characters in many horror films. Films like The Serpent and the Rainbow (1988), Ganja and Hess (1973), Candyman (1992) and Cannibal Holocaust (1980), have pitted the anthropologist against powerful spirits and demons, accursed artifacts, mutant beasts, malevolent sorcerers and ferocious cannibals. This course is a critical examination of the anthropologist and anthropological research as conventions of the horror film. Through weekly screenings, reading and discussions, we will examine filmic representations of the anthropologist as a limin...\n\n      more description for AHSEM-UA  220 »\n\n      \n\n\n\nAnthropologists have appeared as protagonists and key characters in many horror films. Films like The Serpent and the Rainbow (1988), Ganja and Hess (1973), Candyman (1992) and Cannibal Holocaust (1980), have pitted the anthropologist against powerful spirits and demons, accursed artifacts, mutant beasts, malevolent sorcerers and ferocious cannibals. This course is a critical examination of the anthropologist and anthropological research as conventions of the horror film. Through weekly screenings, reading and discussions, we will examine filmic representations of the anthropologist as a liminal figure – a hapless intermediary between science and superstition, between modernity and arcane tradition – who grapples methodologically with both rationalist and non-rationalist epistemes. We will also examine cinematic depictions of fieldwork as a terrifying, ill-advised crossing of social, cultural, geographic, and temporal boundaries.\n\nThese films will be used as a basis to consider the major disciplinary problems, anxieties and even phobias arising out of anthropology’s troubled place in the history of the West. We will look at the often complimentary roles played by anthropological science and the horror genre in constructing, popularizing and sometimes challenging Western notions of race, ethnicity, class, gender, sexuality and citizenship.\n\n      less description for AHSEM-UA  220 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 221",
            "course_name": "",
            "description": "AHSEM-UA  221\n\n   Migration, Citizenship and Belonging\n\nNew modalities of economic organization and relationships, innovations in technology and communication, and the sheer rate of growth of Latin American migration to U.S. cities has impacted the modes and practices of identity, community and membership in U.S. Latino communities. This course examines the normative and political dilemmas around issues of citizenship, belonging, and national identity amongst U.S. Latinos- brought about by immigration, transnationalism, neoliberalism, and globalization. These dilemmas revolve around themes national identity and sovereignty, democratic citizenship, ...\n\n      more description for AHSEM-UA  221 »\n\n      \n\n\n\nNew modalities of economic organization and relationships, innovations in technology and communication, and the sheer rate of growth of Latin American migration to U.S. cities has impacted the modes and practices of identity, community and membership in U.S. Latino communities. This course examines the normative and political dilemmas around issues of citizenship, belonging, and national identity amongst U.S. Latinos- brought about by immigration, transnationalism, neoliberalism, and globalization. These dilemmas revolve around themes national identity and sovereignty, democratic citizenship, and the rights of immigrants. The class will draw from a wide array of readings in political and legal theory, sociology, anthropology, and U.S. Latino studies. By the end of the class, students will be able to articulate and understand political theories of nation-state citizenship, including its historical, sociological, and legal underpinnings. Importantly, students will have a deep understanding of how citizenship is transformed as both a legal status and a set of practices that constitute contemporary political and social membership.\n\n      less description for AHSEM-UA  221 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 222",
            "course_name": "",
            "description": "AHSEM-UA  222\n\n   Empire and Decolonization\n\nThis class examines the global history of empire and decolonization, focusing on the case studies of the Spanish Empire from the nineteenth century and the British Empire in the twentieth century. These two great empires – the first running from the 15th to the 19th centuries, the second from the 18th to the 20th – are often contrasted as opposites: where the Spanish Empire is seen as the great bastion of medieval Catholicism, the British Empire is taken as Protestant and liberal. Where the first is thought of as founded through conquest and war, the second is often described as taking place t...\n\n      more description for AHSEM-UA  222 »\n\n      \n\n\n\nThis class examines the global history of empire and decolonization, focusing on the case studies of the Spanish Empire from the nineteenth century and the British Empire in the twentieth century. These two great empires – the first running from the 15th to the 19th centuries, the second from the 18th to the 20th – are often contrasted as opposites: where the Spanish Empire is seen as the great bastion of medieval Catholicism, the British Empire is taken as Protestant and liberal. Where the first is thought of as founded through conquest and war, the second is often described as taking place through settlement and commerce. This course will question these oppositions, examining how both colonial projects of rule, and the nationalist movements that emerged against them, helped create the ideas and institutions associated with liberalism and democracy.\n\n      less description for AHSEM-UA  222 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 223",
            "course_name": "",
            "description": "AHSEM-UA  223\n\n   Rival Monarchies: Old Regime Spain and France\n\nIn the memory of the history of Western Europe, the 16th century was Spanish, the 17th French, and the 18th British. The aim of this seminar is to tell the story of a 200 year duel between two archenemies: France and Spain from the Late Middle Ages to the eve of the Enlightenment. Both powers alternatively dominated during these 200 years. At the end of the period, Spain was still the most powerful European colonial empire and France the most threatening continental power upon the European soil. This is a story of wars, conquest and frontiers. The seminar will provide students with a dynamic o...\n\n      more description for AHSEM-UA  223 »\n\n      \n\n\n\nIn the memory of the history of Western Europe, the 16th century was Spanish, the 17th French, and the 18th British. The aim of this seminar is to tell the story of a 200 year duel between two archenemies: France and Spain from the Late Middle Ages to the eve of the Enlightenment. Both powers alternatively dominated during these 200 years. At the end of the period, Spain was still the most powerful European colonial empire and France the most threatening continental power upon the European soil. This is a story of wars, conquest and frontiers. The seminar will provide students with a dynamic overview of the rivalry of the two most powerful European monarchies and empires in the Early Modern Times, before the rising of the British power.\n\n      less description for AHSEM-UA  223 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 224",
            "course_name": "",
            "description": "AHSEM-UA  224\n\n   20th Century Music: Studies in Contemporary Opera\n\nThis course will explore operas of the 20th and 21st centuries, beginning with works emerging from the classical tradition such as Richard Strauss’ comedy Der Rosenkavalier, and continuing with the groundbreaking operas of Berg, Bartok, Britten, Stravinsky and others. The second half of the course will explore such recent innovative works as John Adam’s Nixon in China, Kaija Saariaho’s L’amour de loin, Helmut Lachenmann’s Das Mädchen mit den Schwefelhölzern, and Gyorgy Ligeti’s Le Grande Macabre. The course will focus on the interrelation of music and text, and consider subject matter as it re...\n\n      more description for AHSEM-UA  224 »\n\n      \n\n\n\nThis course will explore operas of the 20th and 21st centuries, beginning with works emerging from the classical tradition such as Richard Strauss’ comedy Der Rosenkavalier, and continuing with the groundbreaking operas of Berg, Bartok, Britten, Stravinsky and others. The second half of the course will explore such recent innovative works as John Adam’s Nixon in China, Kaija Saariaho’s L’amour de loin, Helmut Lachenmann’s Das Mädchen mit den Schwefelhölzern, and Gyorgy Ligeti’s Le Grande Macabre. The course will focus on the interrelation of music and text, and consider subject matter as it reflects the cultural milieu of the times.\n\n      less description for AHSEM-UA  224 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 225",
            "course_name": "",
            "description": "AHSEM-UA  225\n\n   The Search for Authenticity\n\nHow should human beings sound? This is a question that has linked ideas about music to ideas about ethics for 100 years or more. The social and ethical dilemmas of two world wars and the global spread of industrial modernity created a challenge: how can we maintain our true humanity in the face of these traumas and disruptions? In this course we will explore three areas of musical life: folk music revivals, ethnomusicology, and historical performance movements. By attending to links between them, we will attempt to address questions about the role of “authenticity” in musical and ethical disco...\n\n      more description for AHSEM-UA  225 »\n\n      \n\n\n\nHow should human beings sound? This is a question that has linked ideas about music to ideas about ethics for 100 years or more. The social and ethical dilemmas of two world wars and the global spread of industrial modernity created a challenge: how can we maintain our true humanity in the face of these traumas and disruptions? In this course we will explore three areas of musical life: folk music revivals, ethnomusicology, and historical performance movements. By attending to links between them, we will attempt to address questions about the role of “authenticity” in musical and ethical discourse; how concerns about authenticity have colored critical responses to various musical styles and performers; and whether, in the end, authenticity is really what people have been worried about at all.\n\n      less description for AHSEM-UA  225 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 226",
            "course_name": "",
            "description": "AHSEM-UA  226\n\n   Literature and Machines\n\nMachine metaphors play an important role in modern literature, conveying beliefs, anxieties, shifts, and reflections on key topics, including the nature of consciousness and creativity; the dynamics of desire and gratification; gender roles; the organization of society; the meaning of \"nature\"; and the function of technology. This course explores different manifestations of the machine theme, broadly clustered around the following categories: imaginary machines constituting the centerpiece of narrative plots; machine aesthetic as modernist ideal; and mechanization of the inventive process (tex...\n\n      more description for AHSEM-UA  226 »\n\n      \n\n\n\nMachine metaphors play an important role in modern literature, conveying beliefs, anxieties, shifts, and reflections on key topics, including the nature of consciousness and creativity; the dynamics of desire and gratification; gender roles; the organization of society; the meaning of \"nature\"; and the function of technology. This course explores different manifestations of the machine theme, broadly clustered around the following categories: imaginary machines constituting the centerpiece of narrative plots; machine aesthetic as modernist ideal; and mechanization of the inventive process (text-generating machines). Students read and discuss a selection of works from different cultural contexts, primarily from the late 19th and 20th century (e.g., Belle Époque, Futurist, and postwar), representing a wide spectrum of attitudes toward the machine, from dreamy immersion in virtual realities to enlightened machine-assisted awakening, from the fear of dehumanization to the desire for man-machine fusion.\n\n      less description for AHSEM-UA  226 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 227",
            "course_name": "",
            "description": "AHSEM-UA  227\n\n   Iberian Cultures and the Experimental Filmic Imagination\n\nThe social and political imaginaries of Francoist Spain created a singular instance of temporal dislocation in the filmic avant-garde of the 1960s and 70s. At the same time, and in the context of Salazar’s authoritarian regime, Portuguese novo cinema, animated by António Reis’s pedagogical project, also called for a reformulation of ‘national art cinema.’\n\nThis course proposes an examination of the political, historical, and aesthetic conjunctures that allowed both the emergence and survival of an often clandestine, experimentalism in the Iberian Peninsula. The commitment to avant-garde practi...\n\n      more description for AHSEM-UA  227 »\n\n      \n\n\n\nThe social and political imaginaries of Francoist Spain created a singular instance of temporal dislocation in the filmic avant-garde of the 1960s and 70s. At the same time, and in the context of Salazar’s authoritarian regime, Portuguese novo cinema, animated by António Reis’s pedagogical project, also called for a reformulation of ‘national art cinema.’\n\nThis course proposes an examination of the political, historical, and aesthetic conjunctures that allowed both the emergence and survival of an often clandestine, experimentalism in the Iberian Peninsula. The commitment to avant-garde practices pushed the envelope of political possibility by establishing an elective affinity and an affective transfer between the political and the aesthetic. By addressing this productive double enunciation through a transnational lens, this course seeks to shed new light on European peripheral cinematic avant-gardes through the reading of classic film theory. We will pay special attention to questions of anachronism, generic impurity, complex representations of word and image, and filmic ontology—all of which were addressed by early film scholars and have remained central to the Iberian tradition of experimentalism. In this way, we will establish a narrative of continuity between the first and second film avant-gardes that bespeaks the complex temporality of peripheral cultures. We will also examine the lessons and the legacies of Iberian experimentalism in recent examples of contemporary films, which are often framed in terms of singularity and exceptionality. The class is taught in English, as are the primary texts, but some knowledge of Spanish, Catalan, or Portuguese would be helpful.\n\n      less description for AHSEM-UA  227 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 228",
            "course_name": "Mining the Archives",
            "description": "AHSEM-UA  228 Mining the Archives \nThis course will introduce young scholars to the rich treasure trove of archival documents deposited in New York City and beyond. These include NYU's Bobst Library, the New York Historical Society, the New York Public Library, the Schomburg Center for Research in Black Culture, as well as online and at churches, museums and other cultural institutions. Scholars will embark on a research project that makes use of primary documents.",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 229",
            "course_name": "",
            "description": "AHSEM-UA  229\n\n   Latin America's 1968\n\nIn Latin America, the year 1968 marked a turning point in the social, political, and cultural transformations that had had been unfolding in the wake of the Cuban Revolution of 1959. For Latin America, as for the rest of the world, the sixties were shaped by the geopolitics of the Cold War and of anti-colonial struggles across the globe. Yet they are most remembered by those who lived them as a time when ordinary people felt, like never before and perhaps never after, that they could change the course of history. Millions of youth in student movements, advocates for indigenous rights, workers,...\n\n      more description for AHSEM-UA  229 »\n\n      \n\n\n\nIn Latin America, the year 1968 marked a turning point in the social, political, and cultural transformations that had had been unfolding in the wake of the Cuban Revolution of 1959. For Latin America, as for the rest of the world, the sixties were shaped by the geopolitics of the Cold War and of anti-colonial struggles across the globe. Yet they are most remembered by those who lived them as a time when ordinary people felt, like never before and perhaps never after, that they could change the course of history. Millions of youth in student movements, advocates for indigenous rights, workers, campesinos, educators, intellectuals, and artists, along with guerrillas and other armed insurgents, were self-aware actors in world-historical projects of radical social, political, economic, and cultural change. In these years, the personal became political, politics became theatrical, theatre became a weapon, and the lines between self, art, and politics were forever changed. In this course we study the complex relations between revolution, counterculture, and authoritarian rule as they emerged in Latin America’s 1968: the emergence of Brazil’s Cinema Novo, Cuba’s imperfect cinema, and militant documentary across the region; the rise of rock and activist nueva canción; and the apogee of student activism and the counterculture in Brazil, Mexico, and Argentina. We encounter 1968 through art, music, film, fiction, journalism and news coverage, along with other primary documents from the period. No knowledge of Spanish or Portuguese is needed for this course; students with these languages may read texts in the original.\n\n      less description for AHSEM-UA  229 «",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 230",
            "course_name": "Global Jewish Communities",
            "description": "AHSEM-UA  230 Global Jewish Communities \nJews have been over the ages a highly mobile people. Contemporary Jews are spread all across the Western world, with major centers in the United States and the State of Israel and lesser centers across Europe and the Americas. This course will trace the historic patterns and stages of Jewish migration and it will eventually focus on two sites of contemporary Jewish population—the United States and Italy. It is anticipated that the course will be taken at the same time by a group of students at NYU Florence.",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 231",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17804",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 507",
                    "time": "Mon 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Noel, Tomas"
                }
            ],
            "course_name": "",
            "description": "AHSEM-UA  231\n\n   U.S. Latin@s in the Age of Social Media\n\nThis seminar examines twenty-first century U.S. Latina/o culture and identity through the lens of social media. The rise of Latin@s as a demographic and political force over the past fifteen years coincides with the rise of social networks, and the Internet has been a crucial yet underexamined space for the negotiation of contemporary Latinidad. In this course we will explore how artists, activists, governments, and corporations are using social media to reshape Latina/o identity from above and from below. While engaging with various social networking sites (including Twitter, YouTube, Faceboo...\n\n      more description for AHSEM-UA  231 »\n\n      \n\n\n\nThis seminar examines twenty-first century U.S. Latina/o culture and identity through the lens of social media. The rise of Latin@s as a demographic and political force over the past fifteen years coincides with the rise of social networks, and the Internet has been a crucial yet underexamined space for the negotiation of contemporary Latinidad. In this course we will explore how artists, activists, governments, and corporations are using social media to reshape Latina/o identity from above and from below. While engaging with various social networking sites (including Twitter, YouTube, Facebook, and Instagram), we will also consider a range of related phenomena: internet memes, data-mining and hacking, new-media activism around issues such as immigration and gentrification, the politics of hashtagging, social movements in the age of digital libertarianism, and the intersections between technology and race/gender/sexuality/class. Assignments may include a visual essay, a group blog, a mapping exercise, and a social-media project. (No background in media and digital studies is assumed or required.)\n\n      less description for AHSEM-UA  231 «",
            "offering": true
        },
        {
            "course_id": "AHSEM-UA 9501",
            "course_name": "Builders of Britain",
            "description": "AHSEM-UA 9501 Builders of Britain",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 9502",
            "course_name": "Collegiate Seminar:",
            "description": "AHSEM-UA 9502 Collegiate Seminar:",
            "offering": false
        },
        {
            "course_id": "AHSEM-UA 9503",
            "course_name": "Politics of Eastern Europe",
            "description": "AHSEM-UA 9503 Politics of Eastern Europe",
            "offering": false
        }
    ]
}