{
    "major_id": "ART-SHU",
    "file": "./2015-2016/Art_(ART-SHU).html",
    "courses": [
        {
            "course_id": "ART-SHU 110",
            "course_name": "",
            "description": "ART-SHU  110\n\n   English Language Seminar: Intercultural Communication\n\nThis short course will provide students with the opportunity to practice their academic English by learning about intercultural communication and etiquette. Students will be engaged to think about ‘intercultural variables’ and ‘communication styles’ that involve both verbal and non-verbal communication. Much of the course will include reflection on short case studies of intercultural contact between Chinese and Americans (other cultures may also be considered). Students will be encouraged to question assumptions they have about “normal” communication. They will also be prompted to develop thei...\n\n      more description for ART-SHU  110 »\n\n      \n\n\n\nThis short course will provide students with the opportunity to practice their academic English by learning about intercultural communication and etiquette. Students will be engaged to think about ‘intercultural variables’ and ‘communication styles’ that involve both verbal and non-verbal communication. Much of the course will include reflection on short case studies of intercultural contact between Chinese and Americans (other cultures may also be considered). Students will be encouraged to question assumptions they have about “normal” communication. They will also be prompted to develop their own set of intercultural values in light of what they have learned. The course will include focused practice in the use of all four language modalities: speaking, listening, writing, and reading.\n\n      less description for ART-SHU  110 «",
            "offering": false
        },
        {
            "course_id": "ART-SHU 120",
            "course_name": "",
            "description": "ART-SHU  120\n\n   English Language Seminar: British Literature, 18th Century to the Present\n\nThis course will offer a survey of British literature from the eighteenth century to the present, beginning with the Romantic period and ending with postcolonial literature. Students will study the process of canon formation and the writing of literary history, the growing division between popular and high literature, and the representation of imperialism and postcolonialism. Students will develop critical thinking skills and practice English reading and writing skills through class discussion, essay writing, and short weekly writing assignments. Authors will include Jane Austen, William Words...\n\n      more description for ART-SHU  120 »\n\n      \n\n\n\nThis course will offer a survey of British literature from the eighteenth century to the present, beginning with the Romantic period and ending with postcolonial literature. Students will study the process of canon formation and the writing of literary history, the growing division between popular and high literature, and the representation of imperialism and postcolonialism. Students will develop critical thinking skills and practice English reading and writing skills through class discussion, essay writing, and short weekly writing assignments. Authors will include Jane Austen, William Wordsworth, Lord Alfred Tennyson, Virginia Woolf, and others.\n\n      less description for ART-SHU  120 «",
            "offering": false
        },
        {
            "course_id": "ART-SHU 210",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "19062",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Edelstein-Zhang, Barbara; Zhang, Jian",
                    "time": "Wed 5.00 PM - 8.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "ART-SHU  210\n\n   Introduction to Studio Art - Chinese Traditional Methods in Contemporary Art\n\nThis course will be an introduction to studio art for students who want to learn traditional Chinese art forms with contemporary expression, to traverse both cultural and temporal barriers of visual arts. These include calligraphy and ink painting as seen from a modern perspective.\n\nStudents will examine the content of artwork, including ideas in contemporary and traditional art, both Chinese and international, and build various skills to translate ideas into reality. \n\nThe course includes a study of ancient Chinese paintings, drawings of still-lifes, as well as visits to local artists, galler...\n\n      more description for ART-SHU  210 »\n\n      \n\n\n\nThis course will be an introduction to studio art for students who want to learn traditional Chinese art forms with contemporary expression, to traverse both cultural and temporal barriers of visual arts. These include calligraphy and ink painting as seen from a modern perspective.\n\nStudents will examine the content of artwork, including ideas in contemporary and traditional art, both Chinese and international, and build various skills to translate ideas into reality. \n\nThe course includes a study of ancient Chinese paintings, drawings of still-lifes, as well as visits to local artists, galleries, and museums. Class time will be devoted to individual projects and critiques, lectures, and group discussions.  \n\nThis course is open to all students with or without an art background.\n\n      less description for ART-SHU  210 «",
            "offering": true
        },
        {
            "course_id": "ART-SHU 301",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "13203",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Edelstein-Zhang, Barbara; Zhang, Jian",
                    "time": "Tue 1.45 PM - 4.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "ART-SHU  301\n\n   Introduction to Photography I\n\nThis course will be an introduction to the use of photography as a medium of documentation and art expression. The student will use photography to witness and create images to begin to understand their experience in Shanghai, and understand photography as an art medium. \n\nBasic digital photography techniques will be taught, including use of a digital camera and Photoshop. Lectures, technical demonstrations, and group critiques, as well as presentations by guest photographers will be included. Assignments on individual photographers and artists will be required.\n\nThis course is for beginning ph...\n\n      more description for ART-SHU  301 »\n\n      \n\n\n\nThis course will be an introduction to the use of photography as a medium of documentation and art expression. The student will use photography to witness and create images to begin to understand their experience in Shanghai, and understand photography as an art medium. \n\nBasic digital photography techniques will be taught, including use of a digital camera and Photoshop. Lectures, technical demonstrations, and group critiques, as well as presentations by guest photographers will be included. Assignments on individual photographers and artists will be required.\n\nThis course is for beginning photography students with minor or no experience with photography. \n\nStudents will provide their own cameras. \n\nThis course is open to all students with or without an art background.\n\n      less description for ART-SHU  301 «",
            "offering": true
        },
        {
            "course_id": "ART-SHU 380",
            "course_name": "",
            "description": "ART-SHU  380\n\n   Projects in Photography\n\nIn 1836, Talbot, the English inventor, thought of photography as a “drawing which makes itself.”  In contemporary times, photography is not only a recording of the real world; it transforms the concepts of the artist into reality.\n\nThis class provides an introduction to photography and ink impression as dual lenses to study contemporary Chinese society.  \n\nShanghai’s sprawling metropolis and interspersing antiquity offer a unique opportunity to document and create personal reflections of a foreign and fast-changing society.  \n\nAs a modern tool, photography has been the traditional medium that ...\n\n      more description for ART-SHU  380 »\n\n      \n\n\n\nIn 1836, Talbot, the English inventor, thought of photography as a “drawing which makes itself.”  In contemporary times, photography is not only a recording of the real world; it transforms the concepts of the artist into reality.\n\nThis class provides an introduction to photography and ink impression as dual lenses to study contemporary Chinese society.  \n\nShanghai’s sprawling metropolis and interspersing antiquity offer a unique opportunity to document and create personal reflections of a foreign and fast-changing society.  \n\nAs a modern tool, photography has been the traditional medium that captures moment-to-moment insights, and will be heavily studied as an art form.  \n\nLess known as a documentary tool, but no less powerful than photography, is the technique of ink impression. This traditional Chinese art form provides a new way of capturing the city by using Chinese ink to create impressions of solid objects.\n\nIn the studio, students are required to critique the works of peers, works of their own, and images sourced from current exhibitions of contemporary photography.  \n\nOutside the studio, the group will examine major historical movements in contemporary photography. The works of iconic photographers who explored the city as reality and idea are selected to provide framework and vocabulary to articulate students’ own photographic investigations.  \n\nStudents will take on personal projects using photography, ink impression, or a combination of both media.\n\nThis course leads students to use photography as an art tool to explore cultures and individual expression, emphasizing concepts of art while touching on some technical aspects of photography.\n\nThis unit is subject to adjustments depending on the availability of guest speakers and other factors.\n\n      less description for ART-SHU  380 «",
            "offering": false
        },
        {
            "course_id": "ART-SHU 1910",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "13272",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Edelstein-Zhang, Barbara; Zhang, Jian",
                    "time": "Wed 1.15 PM - 4.15 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "ART-SHU 1910\n\n   Projects in Studio Art - Chinese Traditional Methods in Contemporary Art\n\nThis course is designed for studio artists who want to create a succinct body of artwork while studying in Shanghai. Students will create contemporary artworks using traditional Chinese art forms to traverse both cultural and temporal barriers of expression, creating a unique integrated style of work. Students of traditional Western methods of art making, including drawing, painting, sculpture, and printmaking, are going to be asked to work out of traditional Chinese art methods, including calligraphy and ink painting. Also, students will have the opportunity to combine Western and Chinese met...\n\n      more description for ART-SHU 1910 »\n\n      \n\n\n\nThis course is designed for studio artists who want to create a succinct body of artwork while studying in Shanghai. Students will create contemporary artworks using traditional Chinese art forms to traverse both cultural and temporal barriers of expression, creating a unique integrated style of work. Students of traditional Western methods of art making, including drawing, painting, sculpture, and printmaking, are going to be asked to work out of traditional Chinese art methods, including calligraphy and ink painting. Also, students will have the opportunity to combine Western and Chinese methods of art making.\n\nStudents will examine the content of artwork, including ideas in contemporary and traditional art, both Chinese and international, and build various skills to translate ideas into reality. \n\nThe course includes a study of ancient Chinese paintings, drawings of still-lifes and live models, as well as visits to local artists, galleries, and museums. Class time will be devoted to individual projects and critiques, lectures, and group discussions.  \n\nAs a final project, students will integrate their living experiences in Shanghai with personal experience and/or the societal landscape, to create a substantial body of artwork for a group exhibition.\n\nThis course is open to students who have an art background and upon the approval of the professors.\n\n      less description for ART-SHU 1910 «",
            "offering": true
        },
        {
            "course_id": "ART-SHU 9077",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19840",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Tarocco, Francesca",
                    "time": "Wed 1.15 PM - 4.15 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "ART-SHU 9077\n\n   Contemporary Art & New Media\n\nOver the past three decades, the contemporary art scene in China has\nexpanded fast. The massive political, economic, and social changes the\ncountry has undergone since the end of the Cultural Revolution in 1976\nhave dramatically altered its cultural landscape. The course will survey the main development areas in Chinese\ncontemporary art. Dedicated to responding to the new textures of\nChina’s metropolitan culture, it will look at the relationship between\nvisual arts, new media, architecture and performance in the mega-city\nof Shanghai, often regarded as the cradle of Chinese modernity.  The\ncla...\n\n      more description for ART-SHU 9077 »\n\n      \n\n\n\nOver the past three decades, the contemporary art scene in China has\nexpanded fast. The massive political, economic, and social changes the\ncountry has undergone since the end of the Cultural Revolution in 1976\nhave dramatically altered its cultural landscape. The course will survey the main development areas in Chinese\ncontemporary art. Dedicated to responding to the new textures of\nChina’s metropolitan culture, it will look at the relationship between\nvisual arts, new media, architecture and performance in the mega-city\nof Shanghai, often regarded as the cradle of Chinese modernity.  The\nclass will be complemented by guest lectures and visits to public\nmuseums, galleries and artists’ studios in and around Shanghai.\nStudents will have the opportunity to meet leading figures from the\nart world in China as well as the international art community,\nincluding artists, museum directors, curators, art critics, and art\ndealers.\n\n      less description for ART-SHU 9077 «",
            "offering": true
        },
        {
            "course_id": "ART-SHU 9210",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "19827",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Edelstein-Zhang, Barbara; Zhang, Jian",
                    "time": "Wed 5.00 PM - 8.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Introduction to Studio Art - Chinese Traditional Methods in Contemporary Art",
            "description": "ART-SHU 9210 Introduction to Studio Art - Chinese Traditional Methods in Contemporary Art \nThis course will be an introduction to studio art for students who want to learn traditional Chinese art forms with contemporary expression, to traverse both cultural and temporal barriers of visual arts. These include calligraphy and ink painting as seen from a modern perspective.",
            "offering": true
        },
        {
            "course_id": "ART-SHU 9301",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "19828",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Edelstein-Zhang, Barbara; Zhang, Jian",
                    "time": "Tue 1.45 PM - 4.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "ART-SHU 9301\n\n   Introduction to Photography I\n\nThis course will be an introduction to the use of photography as a medium of documentation and art expression. The student will use photography to witness and create images to begin to understand their experience in Shanghai, and understand photography as an art medium. \n\nBasic digital photography techniques will be taught, including use of a digital camera and Photoshop. Lectures, technical demonstrations, and group critiques, as well as presentations by guest photographers will be included. Assignments on individual photographers and artists will be required.\n\nThis course is for beginning ph...\n\n      more description for ART-SHU 9301 »\n\n      \n\n\n\nThis course will be an introduction to the use of photography as a medium of documentation and art expression. The student will use photography to witness and create images to begin to understand their experience in Shanghai, and understand photography as an art medium. \n\nBasic digital photography techniques will be taught, including use of a digital camera and Photoshop. Lectures, technical demonstrations, and group critiques, as well as presentations by guest photographers will be included. Assignments on individual photographers and artists will be required.\n\nThis course is for beginning photography students with minor or no experience with photography. \n\nStudents will provide their own cameras. \n\nThis course is open to all students with or without an art background.\n\n      less description for ART-SHU 9301 «",
            "offering": true
        }
    ]
}