{
    "major_id": "ARTH1-UC",
    "file": "./2015-2016/Art_History_(ARTH1-UC).html",
    "courses": [
        {
            "course_id": "ARTH1-UC 5404",
            "course_name": "Seminar in Art History",
            "description": "ARTH1-UC 5404 Seminar in Art History \nThis seminar provides the opportunity for intensive study of a narrowly focused topic. The course schedule for the semester indicates the specific subject, which is chosen from the previous year's art history course topics.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5406",
            "course_name": "",
            "description": "ARTH1-UC 5406\n\n   Italian Renaissance Art & Architecture\n\nThe years between 1300 and 1550 saw the political and social reorganization of Italian life, including new ways of representing the image of that society in the visual arts. The sum of these changes constituted a cultural revolution described as \"the Renaissance,\" the tenets of which have dominated Western culture until the early twentieth century. This course takes a critical look at the dynamic interplay between the social, cultural, and political institutions and the art and architecture produced in this period. The material is organized around a roughly chronological sequence and concentra...\n\n      more description for ARTH1-UC 5406 »\n\n      \n\n\n\nThe years between 1300 and 1550 saw the political and social reorganization of Italian life, including new ways of representing the image of that society in the visual arts. The sum of these changes constituted a cultural revolution described as \"the Renaissance,\" the tenets of which have dominated Western culture until the early twentieth century. This course takes a critical look at the dynamic interplay between the social, cultural, and political institutions and the art and architecture produced in this period. The material is organized around a roughly chronological sequence and concentrates on the centers of Florence, Rome, Venice and the north Italian courts. One goal of the course will be to understand Italian Renaissance art in its larger social and intellectual context.\n\n      less description for ARTH1-UC 5406 «",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5407",
            "course_name": "",
            "description": "ARTH1-UC 5407\n\n   Northern Renaissance Art & Architecture\n\nThis course focuses on developments in the northern Europe from approximately the 14th to the 16th century through examining how its visual culture helped to define and was influenced by its cultural environment. Course material is organized geographically - the Netherlands first, then Germany - reflecting the preeminence of Dutch art during the 15th century, and the dramatic emergence of the arts in Germany in the 16th century. Within this framework, the course examines a number of themes such as devotional practices and popular piety, the art market, artists' guilds, systems of patronage, th...\n\n      more description for ARTH1-UC 5407 »\n\n      \n\n\n\nThis course focuses on developments in the northern Europe from approximately the 14th to the 16th century through examining how its visual culture helped to define and was influenced by its cultural environment. Course material is organized geographically - the Netherlands first, then Germany - reflecting the preeminence of Dutch art during the 15th century, and the dramatic emergence of the arts in Germany in the 16th century. Within this framework, the course examines a number of themes such as devotional practices and popular piety, the art market, artists' guilds, systems of patronage, the development of genres such as portraiture and landscape; and the new technology of printmaking.\n\n      less description for ARTH1-UC 5407 «",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5410",
            "course_name": "The Arts of Africa",
            "description": "ARTH1-UC 5410 The Arts of Africa \nFrom the Nubians in the Nile Valley to the Yoruba people in Nigeria, this course studies the style and iconography of the African peoples and nations. Primarily a study of sculpture, the course seeks to relate this art form to the people who created it, their history, myths, and rites.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5412",
            "course_name": "The Art of China and Japan",
            "description": "ARTH1-UC 5412 The Art of China and Japan \nFrom the Nubians in the Nile Valley to the Yoruba people in Nigeria, this course studies the style and iconography of the African peoples and nations. Primarily a study of sculpture, the course seeks to relate this art form to the people who created it, their history, myths, and rites.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5413",
            "course_name": "Islamic Art and Architecture",
            "description": "ARTH1-UC 5413 Islamic Art and Architecture \nBetween the middle of the 7th and 19th centuries, Islamic art developed in an expansive geographic area stretching from Spain in Europe to India and beyond in Asia, and from West Africa in the south to Central Asia in the north. This course surveys the chronological development of Islamic arts and explores the variations of regional styles. Architecture, the arts of the book, and decorative arts are discussed in their social contexts.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5414",
            "course_name": "Art of the Americas",
            "description": "ARTH1-UC 5414 Art of the Americas \nThis course explores the recurring themes in Latin American and Native American Art. The course provides an historical overview as well as an exploration of the vibrant world of contemporary art of this region. Emphasis is placed on analyzing the ways in which these varied visual expressions reflect and influence culture both past and present.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5415",
            "course_name": "Romanesque & Gothic Art & Architecture",
            "description": "ARTH1-UC 5415 Romanesque & Gothic Art & Architecture \nMuch of what people think of as \"Western culture\" was, in fact, formulated and codified in the period known today as the Middle Ages. This course is designed to introduce the art of what is sometimes referred to as the \"High Middle Ages,\" - Romanesque and Gothic, approximately the years 1100-1500.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5416",
            "course_name": "Early Medieval Art & Architecture",
            "description": "ARTH1-UC 5416 Early Medieval Art & Architecture \nThis course explores the art and architecture of Western Europe's diverse and transforming cultural, social, and political contexts from approximately the fourth to the eleventh century, a time inaugurated by both the legitimization of the powerful new religion of Christianity and the disintegration of the power structure of the Roman Empire.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5419",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17082",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "BOBS LL149 with Prokop, Ellen09/12/2015 - 11/07/2015 Sat 10.00 AM - 12.30 PM at OFFC ",
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Prokop, Ellen"
                }
            ],
            "course_name": "Museum as Cultural History",
            "description": "ARTH1-UC 5419 Museum as Cultural History",
            "offering": true
        },
        {
            "course_id": "ARTH1-UC 5421",
            "course_name": "History of Photography",
            "description": "ARTH1-UC 5421 History of Photography \nThe course studies the history of photography in Europe and the U.S. through an exploration of the work of the great photographers, including Daguerre, Brady, Cameron, Steiglitz, Cartier-Bresson, Arbus, Penn, and Avedon. Emphasis is on understanding photography as a creative medium within the context of various modern art movements and the history of the period.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5422",
            "course_name": "New York City Architecture",
            "description": "ARTH1-UC 5422 New York City Architecture \nThis course focuses on the architectural history of New York and its unique mix of public and private buildings. Field trips, walking tours, and museum visits are included.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5423",
            "course_name": "The Manhattan Skyline",
            "description": "ARTH1-UC 5423 The Manhattan Skyline \nDesigned to develop a visual appreciation of the special character of New York City¹s architectural landscape, this course focuses on the iconic structures of New York¹s skyscrapers. Field trips as well as in-class lecture and discussion form the structure of the course.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5425",
            "course_name": "Public Art in New York",
            "description": "ARTH1-UC 5425 Public Art in New York \nThis course examines the creation, purpose, and controversy surrounding the City's Public sculptures, murals and installations. The course includes field trips and discussions with artists who create public art.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5426",
            "course_name": "",
            "description": "ARTH1-UC 5426\n\n   The Art and History of Advertising and Graphic\n\nAdvertising and graphic designs are everywhere, from\nbusiness cards to billboards, from voting ballots to fashion magazines and\nPC screens-wherever words and images are needed for identification,\ncommunication, or persuasion. Yet the arts and psychological devices of ads\nand graphics are hiding in plain sight for most of us-unless they shock or\namuse-and though hundreds of them bombard us every day. Advertising and\ndesign have been vital to consumer culture since the Industrial Revolution.\nAnd they've only gained power and market penetration since the digital era\nput the tools of opini...\n\n      more description for ARTH1-UC 5426 »\n\n      \n\n\n\nAdvertising and graphic designs are everywhere, from\nbusiness cards to billboards, from voting ballots to fashion magazines and\nPC screens-wherever words and images are needed for identification,\ncommunication, or persuasion. Yet the arts and psychological devices of ads\nand graphics are hiding in plain sight for most of us-unless they shock or\namuse-and though hundreds of them bombard us every day. Advertising and\ndesign have been vital to consumer culture since the Industrial Revolution.\nAnd they've only gained power and market penetration since the digital era\nput the tools of opinion-making in our middle-class hands. In 2000 an\nestimated $247 billion was spent on US advertising.\n\n \n\nHow have print ads and graphics pulled from high art and popular culture\nsince the early 19th century to influence our purchases, our votes, our\nself-images, and our concepts of our country and the world? How does\nadvertising work? What is \"good\" graphic design? This chronologically\norganized course answers by focusing on game-changing individuals-designers,\nartists, photographers, entrepreneurs-and successful campaigns and the ideas\ngenerating them from c.1800 to the present.\n\n      less description for ARTH1-UC 5426 «",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5427",
            "course_name": "",
            "description": "ARTH1-UC 5427\n\n   The History of Interior Design\n\nDescription: The aim of this course is to provide a historical overview\nof the styles and social movements which preceded and laid the foundation\nfor the contemporary practice of interior design. It includes an examination\nof related areas and explores a range of scales from micro to macro-that is,\nfrom furniture, lighting and decorative arts to architecture, landscape\ndesign and city planning. \n\n \n\nWe will discuss some of the discipline's most significant examples as we\nexamine the relationship of the interior built environment to technological\nand economic development, as well as ...\n\n      more description for ARTH1-UC 5427 »\n\n      \n\n\n\nDescription: The aim of this course is to provide a historical overview\nof the styles and social movements which preceded and laid the foundation\nfor the contemporary practice of interior design. It includes an examination\nof related areas and explores a range of scales from micro to macro-that is,\nfrom furniture, lighting and decorative arts to architecture, landscape\ndesign and city planning. \n\n \n\nWe will discuss some of the discipline's most significant examples as we\nexamine the relationship of the interior built environment to technological\nand economic development, as well as changes in allied fields of decorative\narts and architecture. Projects will be located in the rich contexts of\nculture, politics, and history, allowing us to examine the intentions of\ndesigners and patrons. Class sessions will be a combination of lecture,\ndiscussion, and field trips.\n\n      less description for ARTH1-UC 5427 «",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5429",
            "course_name": "Modern Art and Architecture",
            "description": "ARTH1-UC 5429 Modern Art and Architecture \nThis course focuses on the European avant-gardes of the 20th century and the modern art they created. This course studies the increasing abstraction in modern art, not as a single stylistic and aesthetic development, but as a series of heterogeneous experiments by distinct groups of artists, the avant-gardes. The course covers both the works of art and the wider cultural context in which they were created.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5430",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9754",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "BOBS LL149",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Shaffer, Jenny"
                }
            ],
            "course_name": "History of Art I: Earliest to Middle Ages",
            "description": "ARTH1-UC 5430 History of Art I: Earliest to Middle Ages \nThis course is designed as an introduction to the art of Western culture - in reality European culture - from cave art through the medieval times. Within this considerable span of time, students examine examples of architecture, sculpture, and painting, focusing on their relationship to specific historical and cultural realities.",
            "offering": true
        },
        {
            "course_id": "ARTH1-UC 5431",
            "course_name": "History of Art II: Renaissance to Modern",
            "description": "ARTH1-UC 5431 History of Art II: Renaissance to Modern \nThis course is designed as an introduction the art of Western culture - in reality European culture - from the Renaissance through modernism of the 20th century. Within this considerable span of time, students examine examples of architecture, sculpture, and painting, focusing on their relationship to specific historical and cultural realities.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5441",
            "course_name": "History of Architecture",
            "description": "ARTH1-UC 5441 History of Architecture \nThis course is an introduction to the architecture of the western tradition from prehistory to the present day.  The course discusses key works with attention not only to the issues of function, structure, and style, but also to the role and impact of these works within their diverse cultural, social, and political contexts.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5442",
            "course_name": "Art & Architecture of Paris",
            "description": "ARTH1-UC 5442 Art & Architecture of Paris",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5443",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9904",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "BOBS LL149",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Brooks, Leronn"
                },
                {
                    "format": "Lecture",
                    "class_id": "9905",
                    "section": "002",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "GODD B02",
                    "time": "Thu 12.30 PM - 3.00 PM",
                    "open": true,
                    "professor": "Shaffer, Jenny"
                }
            ],
            "course_name": "",
            "description": "ARTH1-UC 5443\n\n   Visual Expressions in Society\n\nImages are everywhere in contemporary society. In such an environment, they often become mere background noise and are rarely viewed critically. What purpose do these images serve? How does the style of their presentation affect their meaning? This course employs a wide range of imagery to address these questions, including painting, sculpture, architecture, public monuments, photography, film, and graphic design. This course aims to develop a visual literacy by teaching the student how to read and decipher the social and cultural messages of images that lie hidden beneath their aesthetic surf...\n\n      more description for ARTH1-UC 5443 »\n\n      \n\n\n\nImages are everywhere in contemporary society. In such an environment, they often become mere background noise and are rarely viewed critically. What purpose do these images serve? How does the style of their presentation affect their meaning? This course employs a wide range of imagery to address these questions, including painting, sculpture, architecture, public monuments, photography, film, and graphic design. This course aims to develop a visual literacy by teaching the student how to read and decipher the social and cultural messages of images that lie hidden beneath their aesthetic surfaces.\n\n      less description for ARTH1-UC 5443 «",
            "offering": true
        },
        {
            "course_id": "ARTH1-UC 5444",
            "course_name": "Ancient Art & Architecture",
            "description": "ARTH1-UC 5444 Ancient Art & Architecture \nIn this course, the art and architecture of ancient Greece and Rome are studied from the Minoan period through the Age of Constantine. Formal development, technical innovation, and social context are emphasized in this survey of the foundations of Western art.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5449",
            "course_name": "Baroque & Rococo Art & Architecture",
            "description": "ARTH1-UC 5449 Baroque & Rococo Art & Architecture \nThis course focuses on seventeenth-century art in Italy, France, Spain, and northern Europe. Among the major artists studied are Rembrandt, Hals, Rubens, Poussin, and Bernini, whose works are considered in the context of the political, religious, and social issues of the era.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5451",
            "course_name": "Art as Political Express",
            "description": "ARTH1-UC 5451 Art as Political Express",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5452",
            "course_name": "Gender Studies in Art History",
            "description": "ARTH1-UC 5452 Gender Studies in Art History \nExamines the fate and achievement of women artists and some of the controversial questions surrounding them, from the Middle Ages and Renaissance to the 20th century, from Artemisia Gentileschi and Properzia de'Rossi to Mary Cassatt and Georgia O'Keeffe.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5453",
            "course_name": "Contemporary Art and Architecture",
            "description": "ARTH1-UC 5453 Contemporary Art and Architecture \nThis course provides an examination of major postwar artists and movements, including pop art, minimalism, conceptual art, photorealism, pattern and decoration, neo-expressionism, and appropriation. The course considers the transition from high modernism to postmodernism and the role of art criticism in relation to these art movements.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5454",
            "course_name": "American Art & Architecture",
            "description": "ARTH1-UC 5454 American Art & Architecture \nThe course explores artistic production in America from the 18th to 20th centuries. Portraiture, landscape, genre, and architecture are shown to relate to history, geography, and society so that the artworks can be considered in the context in which they were produced.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5456",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17083",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "GCASL 365",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Hoy, Anne"
                }
            ],
            "course_name": "19th Century Art & Architecture",
            "description": "ARTH1-UC 5456 19th Century Art & Architecture \nThis course will investigate the art of the 19th century – a period of profound political and social transformation – as it developed in Europe and America. As with every historical period, the 19th century felt a need to create narratives that would help to explain and rationalize its own contemporary history. The dramatic break with the past that occurred in this period encouraged just such mythic creations, helping to shape what we recognize today as the modern world.",
            "offering": true
        },
        {
            "course_id": "ARTH1-UC 5457",
            "course_name": "",
            "description": "ARTH1-UC 5457\n\n   Oppositional Dress: A Subtext of Fashion\n\nDescription:  This course will explore how dress, both in terms of\npersonal self fashioning and looks connected to subcultural or\ncountercultural groups has served to communicate oppositional statements in\nthe twentieth century. Questions concerning the definitions of subculture\nwill be addressed, in addition to expanding on how particular looks have\ninformed the fashion industry and what this has meant to the history of\nfashion studies. Drawing from examples in the Unites States and Britain\nprimarily we will focus on distinctive styles, and explore what these looks\nsignified at the ti...\n\n      more description for ARTH1-UC 5457 »\n\n      \n\n\n\nDescription:  This course will explore how dress, both in terms of\npersonal self fashioning and looks connected to subcultural or\ncountercultural groups has served to communicate oppositional statements in\nthe twentieth century. Questions concerning the definitions of subculture\nwill be addressed, in addition to expanding on how particular looks have\ninformed the fashion industry and what this has meant to the history of\nfashion studies. Drawing from examples in the Unites States and Britain\nprimarily we will focus on distinctive styles, and explore what these looks\nsignified at the time of their inception and how they have come to be read\nas iconic today. A variety of sources including photography, film and\nmusical performances will be considered using an interdisciplinary approach\ndrawing from Subculture studies, Fashion Theory, Sociology, and Cultural\nStudies.  An examination of how specific elements of dress, such as zoot\nsuits, bell-bottoms, or safety pinned T-shirts inform the study of fashion\nas material culture but also how they have been interpreted in scholarship\nand the popular media\n\n      less description for ARTH1-UC 5457 «",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5458",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17172",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "WAVE 435",
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Abrego, Sonya"
                }
            ],
            "course_name": "",
            "description": "ARTH1-UC 5458\n\n   History of Modern Fashion, 1900- Present\n\nThis class is a historical survey of fashion through the\ntwentieth and twenty-first centuries. It will incorporate critical readings,\nfilm, images and primary sources with the aim of understanding significant\nchanges in dress and how clothing functions in culture. We will look at\ncouture, ready to wear, along with subculture and counterculture styles in\nEurope and the United States with an emphasis on how they fit into the\nvisual culture and social environment of the period. Upon completing this\nclass students should be able to identify clothing within the periods\ncovered, understand t...\n\n      more description for ARTH1-UC 5458 »\n\n      \n\n\n\nThis class is a historical survey of fashion through the\ntwentieth and twenty-first centuries. It will incorporate critical readings,\nfilm, images and primary sources with the aim of understanding significant\nchanges in dress and how clothing functions in culture. We will look at\ncouture, ready to wear, along with subculture and counterculture styles in\nEurope and the United States with an emphasis on how they fit into the\nvisual culture and social environment of the period. Upon completing this\nclass students should be able to identify clothing within the periods\ncovered, understand the terminology, and recognize the application of\nhistoric styles in contemporary fashion design.\n\n      less description for ARTH1-UC 5458 «",
            "offering": true
        },
        {
            "course_id": "ARTH1-UC 5471",
            "course_name": "Art Theory & Criticism",
            "description": "ARTH1-UC 5471 Art Theory & Criticism \nThrough an exploration of art historical approaches and methodologies, this course introduces and familiarizes students with the discipline of art history and its various and changing goals over time. Students become familiar with many of the important foundational and contemporary contributors to the discipline of art history, and become comfortable analyzing and manipulating theoretical ideas.",
            "offering": false
        },
        {
            "course_id": "ARTH1-UC 5490",
            "course_name": "Spc Tpcs in Art History",
            "description": "ARTH1-UC 5490 Spc Tpcs in Art History \nThe course provides the opportunity for intensive study of specific topics in art history. The specific topic is listed in the semester's course schedule.",
            "offering": false
        }
    ]
}