{
    "major_id": "ARTS-UG",
    "file": "./2015-2016/Arts_Workshops_(ARTS-UG).html",
    "courses": [
        {
            "course_id": "ARTS-UG 1001",
            "course_name": "",
            "description": "ARTS-UG 1001\n\n   First-Year Arts Workshop: Adaptation, Performance and Analysis\n\nIn this course students will learn methods for making imaginative and engaging performances from a variety of literary sources. Through a journey of text analysis we will create performances inspired by a variety of sources including short stories, poems, newspaper articles, interviews, and essays. This course will introduce students to the basic tools of literary and performance analysis, adaptation, and devised theater techniques. Readings may include texts by Italo Calvino, Jorge Luis Borges, Philip K. Dick, T.S. Eliot, Madeline L’Engle, George Orwell, as well as excerpts from newspaper art...\n\n      more description for ARTS-UG 1001 »\n\n      \n\n\n\nIn this course students will learn methods for making imaginative and engaging performances from a variety of literary sources. Through a journey of text analysis we will create performances inspired by a variety of sources including short stories, poems, newspaper articles, interviews, and essays. This course will introduce students to the basic tools of literary and performance analysis, adaptation, and devised theater techniques. Readings may include texts by Italo Calvino, Jorge Luis Borges, Philip K. Dick, T.S. Eliot, Madeline L’Engle, George Orwell, as well as excerpts from newspaper articles or scientific journals. Techniques for the creation of solo performance as well as small and large group collaboration will also be introduced. Students with an interest in a variety of arts practices (theater, dance, music, visual arts, media arts, etc.) are encouraged to participate; no previous experience necessary.\n\n      less description for ARTS-UG 1001 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1005",
            "course_name": "Elements of Performance",
            "description": "ARTS-UG 1005 Elements of Performance",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1008",
            "course_name": "Writing The Articles Autobiography",
            "description": "ARTS-UG 1008 Writing The Articles Autobiography",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1009",
            "course_name": "",
            "description": "ARTS-UG 1009\n\n   Voicing the Text\n\nIn this class we study vocal and performance technique, as well as the art of rhetoric and persuasive communication. We will put these two studies together to practice and investigate how to communicate thought and evoke pathos, understanding and action from our audiences. Students will discuss, analyze and perform texts from classic and modern plays and poetry, as well as ancient and contemporary political texts. This course will ask questions such as: What is the difference between texts that are intended to be heard versus texts that are intended to be read? How do the musical qualities of ...\n\n      more description for ARTS-UG 1009 »\n\n      \n\n\n\nIn this class we study vocal and performance technique, as well as the art of rhetoric and persuasive communication. We will put these two studies together to practice and investigate how to communicate thought and evoke pathos, understanding and action from our audiences. Students will discuss, analyze and perform texts from classic and modern plays and poetry, as well as ancient and contemporary political texts. This course will ask questions such as: What is the difference between texts that are intended to be heard versus texts that are intended to be read? How do the musical qualities of the voice (such as tone, timbre and inflection) affect the content and reception of the message? How does a performer give voice to a playwright's words? How do our vocal habits affect our ability to communicate clearly? How can we each use our natural voice to its best and most profound effect?\n\n      less description for ARTS-UG 1009 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1010",
            "course_name": "Drama",
            "description": "ARTS-UG 1010 Drama",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1011",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "16918",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Austrian, Jessie"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1011\n\n   Voicing the Text\n\nIn this class we study vocal and performance technique, as well as the art of rhetoric and persuasive communication. We will put these two studies together to practice and investigate how to communicate thought and evoke pathos, understanding and action from our audiences. Students will discuss, analyze and perform texts from classic and modern plays and poetry, as well as ancient and contemporary political texts. This course will ask questions such as: What is the difference between texts that are intended to be heard versus texts that are intended to be read? How do the musical qualities of ...\n\n      more description for ARTS-UG 1011 »\n\n      \n\n\n\nIn this class we study vocal and performance technique, as well as the art of rhetoric and persuasive communication. We will put these two studies together to practice and investigate how to communicate thought and evoke pathos, understanding and action from our audiences. Students will discuss, analyze and perform texts from classic and modern plays and poetry, as well as ancient and contemporary political texts. This course will ask questions such as: What is the difference between texts that are intended to be heard versus texts that are intended to be read? How do the musical qualities of the voice (such as tone, timbre and inflection) affect the content and reception of the message? How does a performer give voice to a playwright's words? How do our vocal habits affect our ability to communicate clearly? How can we each use our natural voice to its best and most profound effect?\n\n      less description for ARTS-UG 1011 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1012",
            "course_name": "",
            "description": "ARTS-UG 1012\n\n   Acting: Rehearsing The Play\n\nThis class will approach acting from the belief that an actor's job is learning how to rehearse. During the semester we will investigate what makes for joyful, effective, and exciting rehearsal, striving to develop a process that is as powerful as any performance.  How do we make the events of the play happen \"in the room?\"  How do we take responsibility for what our character says and does from the first read-through?  How do we connect with poetic or complicated language?  How do we speak and listen from the same \"place?\"   What is the purpose of \"table work?\"   How do we make authentic phys...\n\n      more description for ARTS-UG 1012 »\n\n      \n\n\n\nThis class will approach acting from the belief that an actor's job is learning how to rehearse. During the semester we will investigate what makes for joyful, effective, and exciting rehearsal, striving to develop a process that is as powerful as any performance.  How do we make the events of the play happen \"in the room?\"  How do we take responsibility for what our character says and does from the first read-through?  How do we connect with poetic or complicated language?  How do we speak and listen from the same \"place?\"   What is the purpose of \"table work?\"   How do we make authentic physical choices?  As we pursue these questions, we will engage with several of the actor's technical and artistic challenges and focus on developing the acting instrument through voice and speech, physicality, and style work.  We will begin with Shakespearean monologues to build a common vocabulary, and move to modern and contemporary scene work that will culminate in a public presentation—giving each student the chance to share his/her work with an audience.  Students must wear appropriate rehearsal clothes and will be asked to rehearse outside of class time.\n\n      less description for ARTS-UG 1012 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1013",
            "course_name": "",
            "description": "ARTS-UG 1013\n\n   Acting: Rehearsing the Play\n\nThis class approaches acting from the belief that an actor's job is learning how to rehearse. During the semester we investigate what makes for joyful, effective, and exciting rehearsal, striving to develop a process that is as powerful as any performance. How do we make the events of the play happen \"in the room?\" How do we take responsibility for what our character says and does from the first read-through? How do we connect with poetic or complicated language? How do we speak and listen from the same \"place?\" What is the purpose of \"table work?\" How do we make authentic physical choices? As...\n\n      more description for ARTS-UG 1013 »\n\n      \n\n\n\nThis class approaches acting from the belief that an actor's job is learning how to rehearse. During the semester we investigate what makes for joyful, effective, and exciting rehearsal, striving to develop a process that is as powerful as any performance. How do we make the events of the play happen \"in the room?\" How do we take responsibility for what our character says and does from the first read-through? How do we connect with poetic or complicated language? How do we speak and listen from the same \"place?\" What is the purpose of \"table work?\" How do we make authentic physical choices? As we pursue these questions, we engage with several of the actor's technical and artistic challenges and focus on developing the acting instrument through voice and speech, physicality, and style work. We begin with Shakespearean monologues to build a common vocabulary, and move to modern and contemporary scene work that culminates in a public presentation—giving each student the chance to share his/her work with an audience. Students must wear appropriate rehearsal clothes and will be asked to rehearse outside of class time.\n\n      less description for ARTS-UG 1013 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1014",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12533",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Mon 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Steinfeld, Benjamin"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1014\n\n   Something to Sing About: Acting in Musical Theatre\n\nThe “American Musical” as it has evolved over the last century has become a remarkable model of interdisciplinary practice. From its early iterations and influences in burlesque, vaudeville, and operetta to the complex contemporary amalgams of book, music, lyrics, and dance, the American musical has proven a rich crucible for the exploration of identity and culture, form and content, and ideas and emotions. This arts workshop will offer actors a technical foundation for acting in musical theater. We will deal broadly with the history of musical theater in context by exploring both the process ...\n\n      more description for ARTS-UG 1014 »\n\n      \n\n\n\nThe “American Musical” as it has evolved over the last century has become a remarkable model of interdisciplinary practice. From its early iterations and influences in burlesque, vaudeville, and operetta to the complex contemporary amalgams of book, music, lyrics, and dance, the American musical has proven a rich crucible for the exploration of identity and culture, form and content, and ideas and emotions. This arts workshop will offer actors a technical foundation for acting in musical theater. We will deal broadly with the history of musical theater in context by exploring both the process by which actors engage with musical material and the development and aesthetics of the form. Participants will work on songs and scenes taken from the giants of musical theater including: Rodgers & Hammerstein, Kander & Ebb, Stephen Sondheim, and more. How do we merge the receiving nature of acting with the giving nature of singing? How do we “justify” the decision to sing at all? Our survey of the evolution of musical theater will ask: What does the history of the American musical tell us about our cultural history? What do musicals teach us about the interdisciplinary nature of living in the arts? All students in this course must be comfortable and confident singing actors. Everyone will be required to rehearse outside of class time, complete written and analytical assignments, and commit to a public presentation at the end of the semester. In order to be accepted into this course, attendance at the first class is mandatory for all, including registered students.\n\n      less description for ARTS-UG 1014 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1015",
            "course_name": "Shakespeare",
            "description": "ARTS-UG 1015 Shakespeare",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1016",
            "course_name": "Shakespeare in Perf and Theory",
            "description": "ARTS-UG 1016 Shakespeare in Perf and Theory",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1017",
            "course_name": "\"No Holds Bard!\"-Vocal & Physical Shakespeare",
            "description": "ARTS-UG 1017 \"No Holds Bard!\"-Vocal & Physical Shakespeare",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1018",
            "course_name": "Big, Bold Bard: Shakespeare Acting Inten",
            "description": "ARTS-UG 1018 Big, Bold Bard: Shakespeare Acting Inten",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1019",
            "course_name": "",
            "description": "ARTS-UG 1019\n\n   His Advice to Players: Shakespeare in Perform.\n\n“Speak the speech, I pray you, as I pronounced it to you, trippingly on the tongue. But if you mouth it, as many of our players do, I had as lief the town crier spoke my lines.” – Hamlet, (III.ii) Taking our cue from Shakespeare himself, this course will introduce students to methods of approaching the text from an actor’s perspective. We will investigate several interpretive techniques that help the performer make the connections between the text, mind, and body. Special focus will be given to the development of a strong vocal instrument and bold interpretive choices that embrace the muscular...\n\n      more description for ARTS-UG 1019 »\n\n      \n\n\n\n“Speak the speech, I pray you, as I pronounced it to you, trippingly on the tongue. But if you mouth it, as many of our players do, I had as lief the town crier spoke my lines.” – Hamlet, (III.ii) Taking our cue from Shakespeare himself, this course will introduce students to methods of approaching the text from an actor’s perspective. We will investigate several interpretive techniques that help the performer make the connections between the text, mind, and body. Special focus will be given to the development of a strong vocal instrument and bold interpretive choices that embrace the muscularity of the language. We will explore the structure of the language and how the structure helps the performer make sense of the complexities within the text as well as specific choices related to character and action. The course will also feature a screening component where we examine the range of interpretation of the plays as demonstrated in the work of actors and directors by viewing contrasting versions of the same scene from video and film. Students will work on speeches and scenes from the canon and present their work in class. Students will also keep a journal and attend performances of a Shakespearean play in New York City.\n\n      less description for ARTS-UG 1019 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1020",
            "course_name": "",
            "description": "ARTS-UG 1020\n\n   Character Creation for Performance\n\nCharacter portrayals in theatre and film allow the audience to see the world through the eyes of both the familiar and the unfamiliar. This workshop will focus on the craft and technique of character acting for performance using a variety of acting and improvisational theatre exercises to hone and polish full-bodied, multi-dimensional character portrayals. Voice and movement techniques help ground and center the body so actors can find the physical gestures needed to transform themselves to perform characters as well as to find the ways to develop character voices. The connection between body ...\n\n      more description for ARTS-UG 1020 »\n\n      \n\n\n\nCharacter portrayals in theatre and film allow the audience to see the world through the eyes of both the familiar and the unfamiliar. This workshop will focus on the craft and technique of character acting for performance using a variety of acting and improvisational theatre exercises to hone and polish full-bodied, multi-dimensional character portrayals. Voice and movement techniques help ground and center the body so actors can find the physical gestures needed to transform themselves to perform characters as well as to find the ways to develop character voices. The connection between body and voice is explored in the experiential practice in this workshop as well as specific training in comedic timing. Readings of plays and monologues with a focus on characters will include works by documentary theatre artists, playwrights and solo performers such as Jean Giraudoux, Anna Deveare Smith, Eric Bogosian, Eve Ensler, Moises Kaufman, and Dale Orlander-Smith. Research projects look at several twentieth-century characters?performers, humorists, writers and monologists?including but not limited to Phillip Seymour Hoffman, Ruth Gordon, Danitra Vance, Lily Taylor, Lord Buckley, Eddie Izzard, Richard Pryor, Judy Holiday, Quentin Crisp, Lily Tomlin. Previous study in one or more of the following is helpful: acting, movement theatre, improvisation, comedy or voice. Loose comfortable clothing is a must.\n\n      less description for ARTS-UG 1020 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1021",
            "course_name": "Advanced Character Acting for Performance",
            "description": "ARTS-UG 1021 Advanced Character Acting for Performance",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1022",
            "course_name": "One: On Stage",
            "description": "ARTS-UG 1022 One: On Stage",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1023",
            "course_name": "",
            "description": "ARTS-UG 1023\n\n   Advanced Shakespeare Scene Study: Roman Tragedies\n\nIn this course we will continue to build on the basic foundation of text analysis for actors through in-depth scene study of Shakespeare’s Roman tragedies. Students will work on a variety of scenes in addition to speeches and soliloquies. We will also consider the works in their historical and political context. The course will culminate in a workshop presentation of scenes and speeches from the plays. This course is intended for students with a prior background in acting and Shakespeare; it assumes a basic knowledge of Shakespearean text analysis from an actor’s point of view (an understandin...\n\n      more description for ARTS-UG 1023 »\n\n      \n\n\n\nIn this course we will continue to build on the basic foundation of text analysis for actors through in-depth scene study of Shakespeare’s Roman tragedies. Students will work on a variety of scenes in addition to speeches and soliloquies. We will also consider the works in their historical and political context. The course will culminate in a workshop presentation of scenes and speeches from the plays. This course is intended for students with a prior background in acting and Shakespeare; it assumes a basic knowledge of Shakespearean text analysis from an actor’s point of view (an understanding of how rhythm, scansion, punctuation, operative words, etc. inform the possibilities of meaning). Readings include Julius Caesar, Coriolanus, Antony and Cleopatra,Titus Andronicus.\n\n      less description for ARTS-UG 1023 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1024",
            "course_name": "",
            "description": "ARTS-UG 1024\n\n   Summer Classical Theater Intensive:  Shakespeare in Performance\n\nWorking with Fiasco Theater, this intensive class has two principal goals: to give students training in a variety of acting and performance techniques for the classic stage, and to mobilize those skills towards the interpretation and performance of a Shakespeare play.  Each morning will be divided into  workshops, which will focus on such topics as: voice and speech, stage combat, clowning, working with verse, physical metaphor, writing and adapting songs for Shakespearean performance, and ensemble games. The afternoon will involve collective rehearsal of the Shakespeare play to be performed o...\n\n      more description for ARTS-UG 1024 »\n\n      \n\n\n\nWorking with Fiasco Theater, this intensive class has two principal goals: to give students training in a variety of acting and performance techniques for the classic stage, and to mobilize those skills towards the interpretation and performance of a Shakespeare play.  Each morning will be divided into  workshops, which will focus on such topics as: voice and speech, stage combat, clowning, working with verse, physical metaphor, writing and adapting songs for Shakespearean performance, and ensemble games. The afternoon will involve collective rehearsal of the Shakespeare play to be performed on the last day. This intensive will be appropriate for all students interested in the performance of Shakespeare, and attention will be paid to providing opportunities for those most interested in directing or designing as well as acting.  All students will participate in all activities, but the focus of each student can include a diversity of roles.\n\n      less description for ARTS-UG 1024 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1025",
            "course_name": "Solo Performance",
            "description": "ARTS-UG 1025 Solo Performance",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1026",
            "course_name": "Somatic Performance",
            "description": "ARTS-UG 1026 Somatic Performance",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1027",
            "course_name": "",
            "description": "ARTS-UG 1027\n\n   Performing The Self in Society\n\nThis is a class in solo performance composition primarily for performers, dancers and for students interested in performance art and its histories. Participants will develop a solo performance through a series of exercises using memory, movement and written and visual imagery, and will explore the associative strategies of collage and pastiche as methodologies for structuring material. The solos will emerge from a process involving improvisation (movement and text), composing, and revision of material. Readings include performance texts by prominent artists, essays on performance, and video vi...\n\n      more description for ARTS-UG 1027 »\n\n      \n\n\n\nThis is a class in solo performance composition primarily for performers, dancers and for students interested in performance art and its histories. Participants will develop a solo performance through a series of exercises using memory, movement and written and visual imagery, and will explore the associative strategies of collage and pastiche as methodologies for structuring material. The solos will emerge from a process involving improvisation (movement and text), composing, and revision of material. Readings include performance texts by prominent artists, essays on performance, and video viewings, which foreground the tendency in performance to explore subjectivity and identity in light of social and political critique.  Required texts include Jo Bonney’s Extreme Exposure, C. Carr's On Edge: Performance at the End of the Twentieth Century, and Lenora Champagne’s Out from Under: Texts by Women Performance Artists.  Additional readings include Colin Counsell, \"Postmodernism and Performance Art,\" Roselee Goldberg, \"Performance: A Hidden History,\" Jonathan Kalb, \"Documentary Solo Performance: The Politics of the Mirrored Self,\" and an essay by Coco Fusco.  Assignments include a solo performance created from the material developed in class (rather than \"polishing\" an already created piece), along with a written analysis of two live solo performances, and an oral presentation. Strategies learned in this class are also useful for composing group work.\n\n      less description for ARTS-UG 1027 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1028",
            "course_name": "Directing: Theory and Practice",
            "description": "ARTS-UG 1028 Directing: Theory and Practice",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1029",
            "course_name": "",
            "description": "ARTS-UG 1029\n\n   Creating Drama from Character, in Collaboration with The New Group\n\nFor 20 years, renowned Off-Broadway theatre company The New Group has been premiering and producing character-driven, ensemble-based work. This course will immerse students in the company's approach, which emphasizes character and intimate, visceral ensemble work. Students will jointly develop new performance work through group improvisation and playwriting, while also studying the process and theory of developing a new ensemble-based theatrical work for performance. The course, led by Associate Artistic Director Ian Morgan, will feature master classes from New Group artists, including Artisti...\n\n      more description for ARTS-UG 1029 »\n\n      \n\n\n\nFor 20 years, renowned Off-Broadway theatre company The New Group has been premiering and producing character-driven, ensemble-based work. This course will immerse students in the company's approach, which emphasizes character and intimate, visceral ensemble work. Students will jointly develop new performance work through group improvisation and playwriting, while also studying the process and theory of developing a new ensemble-based theatrical work for performance. The course, led by Associate Artistic Director Ian Morgan, will feature master classes from New Group artists, including Artistic Director Scott Elliott.\n\n      less description for ARTS-UG 1029 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1030",
            "course_name": "20th Century European Styels of Acting/Direct",
            "description": "ARTS-UG 1030 20th Century European Styels of Acting/Direct",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1031",
            "course_name": "",
            "description": "ARTS-UG 1031\n\n   Scenic Design in the Performing Arts: Theatre,Dance, Film and Television\n\nThis course is an introduction to the principles and practice of theatrical scenic design. The vocabulary of visual imagery is woven into a history of theater, décor, and architecture and is developed through the practice of graphic communication—the disciplines of drawing, painting and model-building necessary for the expression of visual ideas in architecture, set, and lighting design. We will explore how theatrical texts communicate in three-dimensional spaces and designs that respond to the author, director, and musical form (musical theater and opera). Students will be expected to complet...\n\n      more description for ARTS-UG 1031 »\n\n      \n\n\n\nThis course is an introduction to the principles and practice of theatrical scenic design. The vocabulary of visual imagery is woven into a history of theater, décor, and architecture and is developed through the practice of graphic communication—the disciplines of drawing, painting and model-building necessary for the expression of visual ideas in architecture, set, and lighting design. We will explore how theatrical texts communicate in three-dimensional spaces and designs that respond to the author, director, and musical form (musical theater and opera). Students will be expected to complete a series of scenic designs in models and two-dimensional presentations. Exercises will integrate the principles of composition, value, color pattern, geometric form, and rhythm in the creation of three-dimensional shapes within a theatrical space—as in the sequence of acts or scenes in a drama. We will deal in depth with the discipline of design skills, drafting and presentation craft as well as the reality of shop fabrication and load-in at the studio or theater. Although this is not a course in art direction for film and /or television, we will discuss the differences in design for theater, film, and television.\n\n      less description for ARTS-UG 1031 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1032",
            "course_name": "",
            "description": "ARTS-UG 1032\n\n   Directing for the Twenty-first Century\n\nWith the advent of emerging technologies and a new population of generative artists entering the field, the artistic landscape of the American theater is rapidly changing. What are the implications concerning the role of the director? This course examines the origin of the stage director and how the craft has evolved since the last century. We will begin with several hands-on components that explore the fundamentals of stage directing including text analysis, theatrical composition, the development and presentation of a production concept, collaboration with actors and designers, and the art o...\n\n      more description for ARTS-UG 1032 »\n\n      \n\n\n\nWith the advent of emerging technologies and a new population of generative artists entering the field, the artistic landscape of the American theater is rapidly changing. What are the implications concerning the role of the director? This course examines the origin of the stage director and how the craft has evolved since the last century. We will begin with several hands-on components that explore the fundamentals of stage directing including text analysis, theatrical composition, the development and presentation of a production concept, collaboration with actors and designers, and the art of public presentation. We will then investigate various methods for collaborating and generating new work with artists from various disciplines. Throughout the course particular attention will be given to the relationship between form and content, modes of spectatorship, and the political and philosophical implications of staging choices. Students will attend and analyze productions in New York City, develop and present production concepts, direct scenes from plays, and keep a journal responding to readings.\n\n      less description for ARTS-UG 1032 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1033",
            "course_name": "The Independent Producer & The Broadway Musical",
            "description": "ARTS-UG 1033 The Independent Producer & The Broadway Musical",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1034",
            "course_name": "The Art and Business of Making Movies",
            "description": "ARTS-UG 1034 The Art and Business of Making Movies",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1035",
            "course_name": "Performing Greek Tragedy",
            "description": "ARTS-UG 1035 Performing Greek Tragedy",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1036",
            "course_name": "Dionysian Ritual",
            "description": "ARTS-UG 1036 Dionysian Ritual",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1037",
            "course_name": "",
            "description": "ARTS-UG 1037\n\n   The Open Voice\n\nIn this arts workshop we will study vocal technique for performance and public speaking in a truly interdisciplinary manner using the physical practices of vinyasa yoga and qigong, the voice techniques of Cicely Berry, Chuck Jones and FM Alexander, and readings from ancient and contemporary philosophers and poets. Every class will fully engage the body, voice and mind, ultimately seeking to unify these three components of the self so that each student can use his or her unique instrument most efficiently and effectively. This course will ask questions such as: What does it means to “be present...\n\n      more description for ARTS-UG 1037 »\n\n      \n\n\n\nIn this arts workshop we will study vocal technique for performance and public speaking in a truly interdisciplinary manner using the physical practices of vinyasa yoga and qigong, the voice techniques of Cicely Berry, Chuck Jones and FM Alexander, and readings from ancient and contemporary philosophers and poets. Every class will fully engage the body, voice and mind, ultimately seeking to unify these three components of the self so that each student can use his or her unique instrument most efficiently and effectively. This course will ask questions such as: What does it means to “be present” as performers, creators, public speakers and citizens? How can a performer use his/her vocal instrument in the most open and free manner? How do we listen on stage? How can we each be at the center of our own rehearsal process? How do individuals form a collective ensemble? What is mindfulness? Students will explore these questions both intellectually and physically throughout the semester. Students must attend the first class in order to stay enrolled, and are required to wear movement clothes and bring a yoga mat to the first and every class. This is a physical course; students need not have any previous experience with yoga or performance but must be willing and able to be physically active.\n\n      less description for ARTS-UG 1037 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1040",
            "course_name": "How Does a Story Mean",
            "description": "ARTS-UG 1040 How Does a Story Mean",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1042",
            "course_name": "",
            "description": "ARTS-UG 1042\n\n   Summer Classical Theater Intensive: Shakespeare in Peformance\n\nWorking with Fiasco Theater, this intensive class has two principal goals: to give students training in a variety of acting and performance techniques for the classic stage, and to mobilize those skills towards the interpretation and performance of a Shakespeare play.  Each morning will be divided into  workshops, which will focus on such topics as: voice and speech, stage combat, clowning, working with verse, physical metaphor, writing and adapting songs for Shakespearean performance, and ensemble games. The afternoon will involve collective rehearsal of the Shakespeare play to be performed o...\n\n      more description for ARTS-UG 1042 »\n\n      \n\n\n\nWorking with Fiasco Theater, this intensive class has two principal goals: to give students training in a variety of acting and performance techniques for the classic stage, and to mobilize those skills towards the interpretation and performance of a Shakespeare play.  Each morning will be divided into  workshops, which will focus on such topics as: voice and speech, stage combat, clowning, working with verse, physical metaphor, writing and adapting songs for Shakespearean performance, and ensemble games. The afternoon will involve collective rehearsal of the Shakespeare play to be performed on the last day. This intensive will be appropriate for all students interested in the performance of Shakespeare, and attention will be paid to providing opportunities for those most interested in directing or designing as well as acting.  All students will participate in all activities, but the focus of each student can include a diversity of roles.\n\n      less description for ARTS-UG 1042 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1044",
            "course_name": "Title TBA",
            "description": "ARTS-UG 1044 Title TBA",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1045",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12305",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Sloan, Judith"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1045\n\n   Oral History, Cultural Identity and The Arts\n\nOral history is a complex process in the creation of artistic projects across the disciplines: documentary film, theatre, book arts, exhibitions, interactive websites, public radio, etc. This course offers training in interviewing and editing techniques, and looks at the impact of “truth-telling” on the people we interview, their families and friends, ourselves and the culture at large. Research explores the ways artistic projects informed by oral history have impacted popular culture. Readings, listening to public radio documentaries, and viewing films will be used to address the balance in a...\n\n      more description for ARTS-UG 1045 »\n\n      \n\n\n\nOral history is a complex process in the creation of artistic projects across the disciplines: documentary film, theatre, book arts, exhibitions, interactive websites, public radio, etc. This course offers training in interviewing and editing techniques, and looks at the impact of “truth-telling” on the people we interview, their families and friends, ourselves and the culture at large. Research explores the ways artistic projects informed by oral history have impacted popular culture. Readings, listening to public radio documentaries, and viewing films will be used to address the balance in accurately reflecting the realities and integrity of the people represented while staying true to the vision of the artist. Readings include (but are not limited to): Art Spiegelman’s Maus I & II; works by Studs Terkel including Working; Greg Halpern’s Harvard Works Because We Do, listening to audio and reading slave narratives from Remembering Slavery project, Smithsonian; Crossing the BLVD, Lehrer/Sloan; Anna Deveare Smith, and Dave Isay. For final projects students create collaborative or solo work in the discipline of their own training; theatre, artist books, photography, poetry, music, radio, audio art, film or video.\n\n      less description for ARTS-UG 1045 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1048",
            "course_name": "Artist/Ethnographer Expeditions",
            "description": "ARTS-UG 1048 Artist/Ethnographer Expeditions",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1049",
            "course_name": "Domestic Chanes: Social Action Through Perf",
            "description": "ARTS-UG 1049 Domestic Chanes: Social Action Through Perf",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1050",
            "course_name": "",
            "description": "ARTS-UG 1050\n\n   Performing Stories: East Meets West\n\nIn this course we will create characters inspired by history, memory, dreams and world lore through challenging exercises that fuse Eastern contemplative traditions and Western theatrical improvisation.  Students will learn how to access different aspects of themselves to enhance their own creative process and create a uniquely authentic theatre.  Each session will begin with vocal exercises and physical warm ups, based on Taoist exercises and Western dance techniques. Our character work starts with meditations and visualizations employing the Buddhist tradition of \"mindfulness/awareness\" prac...\n\n      more description for ARTS-UG 1050 »\n\n      \n\n\n\nIn this course we will create characters inspired by history, memory, dreams and world lore through challenging exercises that fuse Eastern contemplative traditions and Western theatrical improvisation.  Students will learn how to access different aspects of themselves to enhance their own creative process and create a uniquely authentic theatre.  Each session will begin with vocal exercises and physical warm ups, based on Taoist exercises and Western dance techniques. Our character work starts with meditations and visualizations employing the Buddhist tradition of \"mindfulness/awareness\" practice, in which we place ourselves totally in the present moment.  We will work in solos, duos and groups, gradually adding costumes, props and music.  Open to theater students, dancers, musicians, visual artists, writers, techies—all those interested in discovering their own source of deep invention.  Readings will include Chögyam Trungpa's Shambhala: The Sacred Path of the Warrior and Dharma Art (now titled True Perception), Louise Steinman's The Knowing Body, Ethan Nichtern's One City and John Welwood'sOrdinary Magic.\n\n      less description for ARTS-UG 1050 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1051",
            "course_name": "Cross-Cultural Dialogue Through The Arts",
            "description": "ARTS-UG 1051 Cross-Cultural Dialogue Through The Arts",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1052",
            "course_name": "",
            "description": "ARTS-UG 1052\n\n   Native American Traditions and Arts\n\nNative Americans have been villainized and romanticized, studied and collected for five hundred years, yet they appear as mysterious and elusive to the modern world as they did to Christopher Columbus.  Who are these people who have been the original inhabitants of the Western Hemisphere for over forty thousand years and yet continue to be the most misrepresented and misunderstood Americans?  We will compare and contrast the perceptions of Native and Non-Native people and study the effects that they had on one another through sharing our own cultural experiences through our music, art, poetry,...\n\n      more description for ARTS-UG 1052 »\n\n      \n\n\n\nNative Americans have been villainized and romanticized, studied and collected for five hundred years, yet they appear as mysterious and elusive to the modern world as they did to Christopher Columbus.  Who are these people who have been the original inhabitants of the Western Hemisphere for over forty thousand years and yet continue to be the most misrepresented and misunderstood Americans?  We will compare and contrast the perceptions of Native and Non-Native people and study the effects that they had on one another through sharing our own cultural experiences through our music, art, poetry, and humor.  We will learn about the intricate tapestry of American history and culture that we take for granted and perhaps in the process learn more about who we are.  Readings include Indian Givers, Jack Weatherford; Custer Died for Your Sins, Vine Deloria, Jr.; Genocide of the Mind, Marilo Moore, ed.; Sacred Objects and Sacred Places, Andrew Gulliford and Last Standing Woman, La Duke.\n\n      less description for ARTS-UG 1052 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1055",
            "course_name": "Assemblage: Collage in Two & Three Dimensions",
            "description": "ARTS-UG 1055 Assemblage: Collage in Two & Three Dimensions",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1060",
            "course_name": "Asian Theatre Practice and Performace",
            "description": "ARTS-UG 1060 Asian Theatre Practice and Performace",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1065",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12640",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Gregory, Matthew Aaron"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1065\n\n   Performing Comedy\n\nThis course explores the practices, principles and aesthetics of comedic performance. Questions examined include: What makes something funny? Why do audiences laugh? What is the relationship between performer and audience in comedy? How does a performer get the laugh without ‘asking’ for it? How is humor specific to certain cultures, historical periods, genders or age groups? Are any elements of humor universal? Does the nature of performing comedy change from medium to medium? The course investigates these questions through readings, lectures, discussion and experiential exercises. Students a...\n\n      more description for ARTS-UG 1065 »\n\n      \n\n\n\nThis course explores the practices, principles and aesthetics of comedic performance. Questions examined include: What makes something funny? Why do audiences laugh? What is the relationship between performer and audience in comedy? How does a performer get the laugh without ‘asking’ for it? How is humor specific to certain cultures, historical periods, genders or age groups? Are any elements of humor universal? Does the nature of performing comedy change from medium to medium? The course investigates these questions through readings, lectures, discussion and experiential exercises. Students are challenged to synthesize theory, historical traditions, and practical application into viable comedic performances. Students will experiment with this synthesis through discussing, analyzing, rehearsing and performing scenes/monologues drawn from major comic traditions including: masked forms (such as Greek Old Comedy and Commedia dell’Arte), high comedy (like the comedies of Shakespeare and Moliere), low comedy (such as the slapstick of Charlie Chaplin, Mel Brooks, as well as modern sketch, improv and stand-up comedy) and that which defies easy categorization (such as Monty Python or Sacha Baron Cohen). The course will culminate in a public presentation, allowing students to share select comedic performances with an audience. Students are expected to rehearse outside of class time.\n\n      less description for ARTS-UG 1065 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1070",
            "course_name": "",
            "description": "ARTS-UG 1070\n\n   Equal Exchange: Arts Based Collb W/Immgnt Yth\n\nCourse meets Mondays on-site in Brooklyn; students interested in this course should not schedule anything after 2:30 on Mondays. First 2 Monday classes are training and orientation sessions and will be held at NYU; all Wednesday classes will be held at NYU.  This course looks at the intersection of art, culture and identity by bringing together NYU students and immigrant high school students to collaborate on the creation of original, inter-disciplinary performance work. Students will work on-site at the Brooklyn International High School (BIHS) which has a student body from 43 different count...\n\n      more description for ARTS-UG 1070 »\n\n      \n\n\n\nCourse meets Mondays on-site in Brooklyn; students interested in this course should not schedule anything after 2:30 on Mondays. First 2 Monday classes are training and orientation sessions and will be held at NYU; all Wednesday classes will be held at NYU.  This course looks at the intersection of art, culture and identity by bringing together NYU students and immigrant high school students to collaborate on the creation of original, inter-disciplinary performance work. Students will work on-site at the Brooklyn International High School (BIHS) which has a student body from 43 different countries. The course will focus on the development of arts-based techniques using movement, creative writing, oral history, music, and theatre to create an open dialogue in a multi-cultural setting. NYU students will learn how to transmute this dialogue into theatrical forms as we work toward  final performance. Wednesday classes will be spent discussing readings and planning our work with students at BIHS. We will think and talk about how culture and identity are both influencing and influenced by the matrix of social forces operating in society. Readings will focus on the role of artists in mediating community interactions, community arts pra ctices and the use of the arts for social change. Readings may include Games for Actors and Non-Actors (Boal), Local Acts (Cohen-Cruz), essays on the Community Arts Network and We Are All Suspects Now, (Nguyen). Prior experience and interest in the performing arts, media and/or writing is helpful. Students who wish to take this course but do not have prior experience in the above should contact the instructor before registering.\n\n      less description for ARTS-UG 1070 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1080",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12306",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "ARC_ LL02",
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Bowers, Martha"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1080\n\n   Site-Specific Performance: Art, Activism & Public Space\n\nThis course looks at the development of site-specific performance with a special emphasis on projects that engage with social issues and include activist agendas. “Site-specific” is a term frequently associated with the visual arts but since the Happenings of the ’60s and ’70s, a body of work termed “site-specific performance” has evolved as highly structured works of art that are designed around, for or because of place and associated communities. As site artists confront the matrix of social forces and overlapping communities that relate to a given site, their aesthetics, creative process an...\n\n      more description for ARTS-UG 1080 »\n\n      \n\n\n\nThis course looks at the development of site-specific performance with a special emphasis on projects that engage with social issues and include activist agendas. “Site-specific” is a term frequently associated with the visual arts but since the Happenings of the ’60s and ’70s, a body of work termed “site-specific performance” has evolved as highly structured works of art that are designed around, for or because of place and associated communities. As site artists confront the matrix of social forces and overlapping communities that relate to a given site, their aesthetics, creative process and goals have shifted. How are they blurring the lines between art and activism, art and urban renewal, art and real life? This arts workshop will emphasize making site work by completing a progressive series of studies, using various artistic mediums. We will also be reading about and viewing site work by seminal artists in this field. This course is recommended to adventurous students with interests and some training in at least one of the following mediums: dance, theatre, spoken word poetry, media, photography and/or visual art. Readings include texts by Suzanne Lacy; Jan Cohen Cruz; Bertie Ferdman, among others.\n\n      less description for ARTS-UG 1080 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1105",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12576",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Tue 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Powell, J"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1105\n\n   Integrating Mind and Body\n\nThis experiential workshop explores the theory and practice of The  Alexander Technique, The Feldenkrais Method, Kinetic Awareness, and its predecessors. The developers of these methods recognize that the ability to notice sensations, feelings, differences, and changes in the body lead to better integration of the mind and body and can effect profound changes in functioning. These techniques are valuable for anyone who wants to gain more freedom of expression, range of motion, comfort, concentration and presence in their work, art and daily lives. By using focused attention to sense your body ...\n\n      more description for ARTS-UG 1105 »\n\n      \n\n\n\nThis experiential workshop explores the theory and practice of The  Alexander Technique, The Feldenkrais Method, Kinetic Awareness, and its predecessors. The developers of these methods recognize that the ability to notice sensations, feelings, differences, and changes in the body lead to better integration of the mind and body and can effect profound changes in functioning. These techniques are valuable for anyone who wants to gain more freedom of expression, range of motion, comfort, concentration and presence in their work, art and daily lives. By using focused attention to sense your body in motion and at rest muscular tension and poor body habits can be released. The course is designed for the student who is ready to commit to an in-depth investigation of their body and is ready to make physical and mental changes through quiet focused attention. Each class will be divided between lecture, discussion, and experiential material. Students will keep a journal relating to their experience in and out of class and weekly readings. A final project will reflect personal interest and include class experience and readings.  Readings include Mirka Knaster's The Knowing Body and articles on the various methods.\n\n      less description for ARTS-UG 1105 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1106",
            "course_name": "",
            "description": "ARTS-UG 1106\n\n   Awareness Techniques for Performers\n\nMind/body awareness techniques increase one's ability to strip away any physical and mental interferences which often appear as stiff, held muscles, poor body habits and impaired concentration. These methods are vital to the creative process and help students to honor inner knowledge. In this workshop, performance will be viewed in terms of posture, breath, tension/effort, energy/presence, concentration, body behaviors/habits, and mind/body integration. Students must be prepared to perform  a solo piece of their chosing (or an activity to be observed) by the third week of class and work on it ...\n\n      more description for ARTS-UG 1106 »\n\n      \n\n\n\nMind/body awareness techniques increase one's ability to strip away any physical and mental interferences which often appear as stiff, held muscles, poor body habits and impaired concentration. These methods are vital to the creative process and help students to honor inner knowledge. In this workshop, performance will be viewed in terms of posture, breath, tension/effort, energy/presence, concentration, body behaviors/habits, and mind/body integration. Students must be prepared to perform  a solo piece of their chosing (or an activity to be observed) by the third week of class and work on it throughout the semester.  Kinetic Awareness, the Alexander Technique, meditation, visualization, and energy work will be learned and applied to the student's performance piece. Open to performing arts students who wish to deepen their relationship to their bodies, increase awareness, and draw on inner reserves. Readings will include Knaster's Discovering the Body's Wisdom, Steinman's The Knowing Body, Crow's The Alexander Technique as a Basic Approach to Theatrical Training, and Kohnlein's Listening from the Physical Body.\n\n      less description for ARTS-UG 1106 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1107",
            "course_name": "",
            "description": "ARTS-UG 1107\n\n   Body Wisdom for Performers\n\nPerforming artists have a special need to understand the body’s full capacity. Enhanced kinesthesic awareness of our muscles and bones allows us to move and perform with more confidence, safety, and expression. This body awareness course uses Kinetic Awareness to gain greater knowledge of your bones and muscles in motion and at rest. You will integrate kinesthetic experience with factual and visual information, focused attention, movement, and touch. Each week you will focus on one area of the body. You will use directed attention, move the part in all directions, release any held tension, app...\n\n      more description for ARTS-UG 1107 »\n\n      \n\n\n\nPerforming artists have a special need to understand the body’s full capacity. Enhanced kinesthesic awareness of our muscles and bones allows us to move and perform with more confidence, safety, and expression. This body awareness course uses Kinetic Awareness to gain greater knowledge of your bones and muscles in motion and at rest. You will integrate kinesthetic experience with factual and visual information, focused attention, movement, and touch. Each week you will focus on one area of the body. You will use directed attention, move the part in all directions, release any held tension, apply strengthening exercises and study the bones and major muscles of that area. Olsen’s Body Stories: A Guide to Experiential Anatomy and Irene Dowd's Taking Root to Fly are required reading along with selections from Sieg and Adams’s Illustrated Essentials of Musculoskeletal Anatomy.\n\n      less description for ARTS-UG 1107 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12307",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Hodermarska, Maria"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1110\n\n   The Art of Play\n\nWe know that for children play is more than just fun; it is the work through which they develop. But what about when adults play? Through play we find our freedom, spontaneity, and our aesthetic. What is there in human beings that enables us to play? Why is play considered an innate capacity of people from the beginning of recorded history? What qualifies as play? When does play become art? In this course, everyone plays and in doing so examines the historic and contemporary uses of play as a universal impulse of humans, across generations and time. Play’s capacity to mitigate the grosser aspe...\n\n      more description for ARTS-UG 1110 »\n\n      \n\n\n\nWe know that for children play is more than just fun; it is the work through which they develop. But what about when adults play? Through play we find our freedom, spontaneity, and our aesthetic. What is there in human beings that enables us to play? Why is play considered an innate capacity of people from the beginning of recorded history? What qualifies as play? When does play become art? In this course, everyone plays and in doing so examines the historic and contemporary uses of play as a universal impulse of humans, across generations and time. Play’s capacity to mitigate the grosser aspects of life will be considered. We will examine play as it is reflected through theories of child development, dramatic improvisation, fine art, politics, technology, spirituality, the symbolism of fairy tales, and projectives. Students will examine the necessity of play in their own child and adult lives—the creative spirit, the adventurer, the empathic connection with humanity, and laughter, too. Books may include: Nachmanovitch’s Free Play, Bettelheim’s The Uses of Enchantment, Huizinga’s Homo Ludens, and selected readings from Lorca, Nietzche, Piaget, Postman, Solomon.\n\n      less description for ARTS-UG 1110 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1115",
            "course_name": "",
            "description": "ARTS-UG 1115\n\n   Creative Arts in The Helping Professions\n\nThis workshop explores the uses of drama, dance, visual arts, music and poetry within the health care professions, serving children to geriatric populations.  Against a theoretical background of the psychological needs of mentally and physically ill individuals, the creative processes of the arts are experienced as they can humanize, sensitize, ameliorate, and liberate expressive capacities.  Activities drawn from each art form are tried out, sometimes blended, and adapted for diverse age groups and needs.  The workshop provides substantial background for artists, artist-educators, leisure stu...\n\n      more description for ARTS-UG 1115 »\n\n      \n\n\n\nThis workshop explores the uses of drama, dance, visual arts, music and poetry within the health care professions, serving children to geriatric populations.  Against a theoretical background of the psychological needs of mentally and physically ill individuals, the creative processes of the arts are experienced as they can humanize, sensitize, ameliorate, and liberate expressive capacities.  Activities drawn from each art form are tried out, sometimes blended, and adapted for diverse age groups and needs.  The workshop provides substantial background for artists, artist-educators, leisure studies majors, as well as others interested in exploring an ancillary or major career in the arts therapies.  Employment possibilities are discussed, as well as professional organizations and registry requirements for further in-depth training.  The workshop also includes selected books and visits by working arts therapists.\n\n      less description for ARTS-UG 1115 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1125",
            "course_name": "Creative Methods:",
            "description": "ARTS-UG 1125 Creative Methods:",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1204",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17142",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Wed 11.00 AM - 1.45 PM",
                    "open": true,
                    "professor": "Satin, Leslie"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1204\n\n   Everyday Dance: Creating a Practice\n\nIn this workshop, focused on dance and choreography, students will discover what it means to have a dance practice: to approach dancing with commitment, attention, devotion, curiosity, energy, and rigor. As movers and scholars, we will investigate questions invigorating contemporary experimental dance, body/mind integration, and Movement Research; we will explore the epistemology of the body. This workshop assumes a double notion of the “everyday”: the opportunity to work not only with technical dance lexicons but also with pedestrian movement—to explore those actions we perform in our “real l...\n\n      more description for ARTS-UG 1204 »\n\n      \n\n\n\nIn this workshop, focused on dance and choreography, students will discover what it means to have a dance practice: to approach dancing with commitment, attention, devotion, curiosity, energy, and rigor. As movers and scholars, we will investigate questions invigorating contemporary experimental dance, body/mind integration, and Movement Research; we will explore the epistemology of the body. This workshop assumes a double notion of the “everyday”: the opportunity to work not only with technical dance lexicons but also with pedestrian movement—to explore those actions we perform in our “real lives” and reconsider them as material for choreography; and the idea of Daily Dance, in which we commit to dancing every day, locating and developing our individual dance and movement vocabularies, creating choreography from those movements and the experience of moving. Guided by structured improvisation, we will experiment with finding movement that feels authentic to us, and we will consider what that authenticity involves or implies. We will explore what, if anything, is “natural” about dance movement; and we will examine the cultural underpinnings of our movement choices. We will dance alone and with others—as witnesses, collaborators, partners. We will make scores, studies, dances, interarts performances. We will bring language into the mix.  We will be supported in our studio practice by critical, theoretical, reflective, and historical writings emerging from multiple disciplines: dance, performance, theater, music; visual art; literature; autobiography; architecture; philosophy/phenomenology/Buddhism; creativity theory; neuroscience; technology. Sources may include John Cage, Merce Cunningham, Anna Halprin, Laurence Halprin,  Allan Kaprow, Daniel Levitin, Linda Montano, Georges Perec, Yvonne Rainer, Anne Truitt, Marcia Tucker.\n\n      less description for ARTS-UG 1204 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1205",
            "course_name": "Creating Dance:",
            "description": "ARTS-UG 1205 Creating Dance:",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1206",
            "course_name": "The Dance of Everyday Movement",
            "description": "ARTS-UG 1206 The Dance of Everyday Movement",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1207",
            "course_name": "",
            "description": "ARTS-UG 1207\n\n   Post Modern Dance: Contemporary Experimental Choregraphy\n\nIn this workshop, we will depart from traditional dance composition courses by focusing on the concepts, strategies, and actions that occupy contemporary experimental—“downtown,” if you will—choreographers. We’ll spend most of our time in the studio, moving through physical warm-ups structured to prepare ourselves for developing dance material informed by live performances, videos, guest appearances, and readings by and about dance-makers, from the first post-modernists of the 1960s through those continuing their lineage and those exploring completely different paths. We’ll consider dance as a...\n\n      more description for ARTS-UG 1207 »\n\n      \n\n\n\nIn this workshop, we will depart from traditional dance composition courses by focusing on the concepts, strategies, and actions that occupy contemporary experimental—“downtown,” if you will—choreographers. We’ll spend most of our time in the studio, moving through physical warm-ups structured to prepare ourselves for developing dance material informed by live performances, videos, guest appearances, and readings by and about dance-makers, from the first post-modernists of the 1960s through those continuing their lineage and those exploring completely different paths. We’ll consider dance as a factor in interarts performance, work grounded in the intersection of dance and technology, site-specific choreography, and improvisation as an autonomous movement practice and as a way to generate movement for choreography. We’ll borrow, of course, from what students bring to the workshop: their individual dance histories as well as their interests and desires. Readings may include essays by Steve Paxton, Yvonne Rainer, John Cage, Merce Cunningham, Simone Forti, Ramsey Burt, Allan Kaprow, Susan Leigh Foster, and Nancy Stark Smith.\n\n      less description for ARTS-UG 1207 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1208",
            "course_name": "",
            "description": "ARTS-UG 1208\n\n   Making Dances in The 21St Century\n\nDance composition is, simply, the process through which an artist selects and organizes movements. Less simply, it encompasses not only the interaction with other art forms but the expression of and resistance to cherished, or at least familiar, personal and cultural beliefs about how the body makes meaning.  What is ?the body?? What are the relationships of our movements, our experiences, our philosophies, our aesthetic frameworks and choices? In this workshop, we will grapple with these questions in the archive and the studio. We?ll read works by and about twentieth? and twenty-first?century...\n\n      more description for ARTS-UG 1208 »\n\n      \n\n\n\nDance composition is, simply, the process through which an artist selects and organizes movements. Less simply, it encompasses not only the interaction with other art forms but the expression of and resistance to cherished, or at least familiar, personal and cultural beliefs about how the body makes meaning.  What is ?the body?? What are the relationships of our movements, our experiences, our philosophies, our aesthetic frameworks and choices? In this workshop, we will grapple with these questions in the archive and the studio. We?ll read works by and about twentieth? and twenty-first?century choreographers and make dances that take off from their concepts, strategies, and actions. We?ll welcome students? explorations of principles outside Western concert tradition; we?ll welcome however they wish to move, however they wish to move us. Readings may include essays by Lawrence Halprin, John Cage, Merce Cunningham, Yvonne Rainer, Robert Dunn, Elena Alexander, and others.\n\n      less description for ARTS-UG 1208 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1209",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12308",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 430",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Posin, Kathryn"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1209\n\n   The Art of Choreography\n\nIt was the modern dance choreographer Martha Graham who said, “We are all born with genius. It’s just that most people lose it in the first five minutes.” This class helps the student get back his or her original choreographic ability. We will study the elements of dance—time, space and energy—and, each week, explore a different aspect of the choreographic process. The students, through improvisations and short movement studies, will discover their movement vocabulary. Each dancemaker will find their own individual choreographic voice while being introduced to some of the major twentieth centu...\n\n      more description for ARTS-UG 1209 »\n\n      \n\n\n\nIt was the modern dance choreographer Martha Graham who said, “We are all born with genius. It’s just that most people lose it in the first five minutes.” This class helps the student get back his or her original choreographic ability. We will study the elements of dance—time, space and energy—and, each week, explore a different aspect of the choreographic process. The students, through improvisations and short movement studies, will discover their movement vocabulary. Each dancemaker will find their own individual choreographic voice while being introduced to some of the major twentieth century choreographers. By nature we are all dancers, with or without years of training. Choreographic process, whether one wishes to be a choreographer or not, is a superb model for thinking, assembling and creating. A digital media component teaches students to incorporate video into their work. The final performance is in a theatrical setting with lights, simple costume and possibly video. Readings will include What is Dance? by Roger Copeland and Marshall Cohen (eds.), The Art of Making Dances by Doris Humphrey, The Intimate Act of Choreography by Blom and Chaplin, and Space Harmony by Rudolph Laban. To view a clip of the final performance from last year, visit YouTube, The Art of Choreography.\n\n      less description for ARTS-UG 1209 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1210",
            "course_name": "Scores and Structures for Dance",
            "description": "ARTS-UG 1210 Scores and Structures for Dance",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1211",
            "course_name": "",
            "description": "ARTS-UG 1211\n\n   Making Dance: Space, Place and Technology\n\nIn this workshop, students will explore the possibilities of dancing across spatial categories, making dances in \"real\" and digital space. Taking our cues from contemporary experimental and primarily post-modern choreographers, we will examine how our arts practices and beliefs about bodies and space are linked to evolving ideas and cultural systems; we will ask questions that tug at the assumptions of what dance is, what bodies are, what space is, and how these elements are significant as components of choreography and of our dance experiences. We will make and watch dances ranging from low-t...\n\n      more description for ARTS-UG 1211 »\n\n      \n\n\n\nIn this workshop, students will explore the possibilities of dancing across spatial categories, making dances in \"real\" and digital space. Taking our cues from contemporary experimental and primarily post-modern choreographers, we will examine how our arts practices and beliefs about bodies and space are linked to evolving ideas and cultural systems; we will ask questions that tug at the assumptions of what dance is, what bodies are, what space is, and how these elements are significant as components of choreography and of our dance experiences. We will make and watch dances ranging from low-tech works to high-tech virtual partnerships; most excitingly, we will collaborate on performance with a group of dancers in a locale outside of NYU. In addition to making dances, we will read about contemporary dance, technology, and other practices and disciplines (i.e., architecture, philosophy, neuroscience), view performances of choreographers and visual artists, and meet with practitioners engaged in the questions and practices of our study. Readings might include work by Gaston Bachelard, Matthew Frederick, Merce Cunningham, Kent DeSpain, Andrew Gurian, Ivar Hagendoorn, Yi-Fu Tuan, and other artists and scholars. The course is open to all students: anyone interested in dance and/or technology is welcome. Note: all workshop members will be expected to participate as movers!\n\n      less description for ARTS-UG 1211 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1212",
            "course_name": "",
            "description": "ARTS-UG 1212\n\n   World Dance\n\nDance reflects cultural heritage and is a key to understanding diverse societies. In this arts workshop, students will explore dance as it appears on several continents. Dance can be seen as encoded forms of a society's religious, artistic, political, economic, and familial values. Readings cover issues of globalization, fusion and authenticity. Migration, missionaries, trade routes and the diaspora have led to the creation of new dance forms like \"Bollywood\" and \"Tribal\" that are a synthesis of earlier forms. Students will be introduced to different dance forms through selected readings, rich...\n\n      more description for ARTS-UG 1212 »\n\n      \n\n\n\nDance reflects cultural heritage and is a key to understanding diverse societies. In this arts workshop, students will explore dance as it appears on several continents. Dance can be seen as encoded forms of a society's religious, artistic, political, economic, and familial values. Readings cover issues of globalization, fusion and authenticity. Migration, missionaries, trade routes and the diaspora have led to the creation of new dance forms like \"Bollywood\" and \"Tribal\" that are a synthesis of earlier forms. Students will be introduced to different dance forms through selected readings, rich collection of video footage and studio practice often lead by various guest artists. After a brief warm-up, the class will learn simple steps, floor plans and rhythms from the music and dance cultures being studied. Students will chose a dance form as their project and themselves become researchers, performers and creators of new forms.\n\n      less description for ARTS-UG 1212 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1215",
            "course_name": "Dancing Autobiography",
            "description": "ARTS-UG 1215 Dancing Autobiography",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1225",
            "course_name": "",
            "description": "ARTS-UG 1225\n\n   Creating a Performande from The Ground Up\n\nIn this workshop, students will work together on making a performance, from conception through production. We will take an original piece through all its stages and elements?such as planning, writing, composing, designing, choreographing, rehearsing?in a process that will culminate in public performance(s) at the end of the term. The members of the workshop will do some initial readings to ground them in the historical and contemporary practices of interarts performance and performance art and in some of the theoretical as well as practical approaches to this work. Then, guided by the understa...\n\n      more description for ARTS-UG 1225 »\n\n      \n\n\n\nIn this workshop, students will work together on making a performance, from conception through production. We will take an original piece through all its stages and elements?such as planning, writing, composing, designing, choreographing, rehearsing?in a process that will culminate in public performance(s) at the end of the term. The members of the workshop will do some initial readings to ground them in the historical and contemporary practices of interarts performance and performance art and in some of the theoretical as well as practical approaches to this work. Then, guided by the understanding of performance-making as a kind of research-in-motion, they will plunge into the work itself, guided by their ideas, skills, desires, and willingness to work with familiar and unfamiliar art forms, collaborate with new colleagues, and generally reconsider the possibilities of performance for both practitioners and viewers. Students at all levels of arts experience and with considerable reserves of energy and enthusiasm for working on a group project are welcome to participate.  Readings will include Lawrence Halprin?s The RSVP Cycles; selections from In the Spirit of Fluxus (edited by Armstrong and Rothfuss), Deborah Jowitt?s Time and the Dancing Image and Sally Banes?s Greenwich Village.\n\n      less description for ARTS-UG 1225 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1250",
            "course_name": "Interarts Collaboration",
            "description": "ARTS-UG 1250 Interarts Collaboration",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1268",
            "course_name": "Extreme Performance: from Ancient Africa",
            "description": "ARTS-UG 1268 Extreme Performance: from Ancient Africa",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1305",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12310",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Castellano, John",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Contemporary Music Performance I",
            "description": "ARTS-UG 1305 Contemporary Music Performance I \nThis course is designed to help students develop a better understanding of music by presenting the opportunity to experience music as a performing musician. Students learn basic music theory, develop rudimentary musicianship skills, and use that experience to compose, rehearse and perform original student compositions. The workshop meets in a professional music rehearsal studio where students have access to a wide variety of musical instruments and other resources. The culmination of the course is a public recital of works written and performed by students.",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1306",
            "course_name": "",
            "description": "ARTS-UG 1306\n\n   Advanced Contemporary Musicianship\n\nThis course is designed for those who want to learn how to make music together with others.  The course work combines a study of contemporary popular music in terms of form, style, and instrumentation, with a review of practical music theory and the development of musicianship skills.  Students have the opportunity to apply their skills by performing in class on their own compositions as well as on compositions written by their classmates and the course instructor.  In addition, each student is assigned an individual course project based on the student’s particular area of musical interest.  T...\n\n      more description for ARTS-UG 1306 »\n\n      \n\n\n\nThis course is designed for those who want to learn how to make music together with others.  The course work combines a study of contemporary popular music in terms of form, style, and instrumentation, with a review of practical music theory and the development of musicianship skills.  Students have the opportunity to apply their skills by performing in class on their own compositions as well as on compositions written by their classmates and the course instructor.  In addition, each student is assigned an individual course project based on the student’s particular area of musical interest.  This course is appropriate for any student interested in furthering their understanding of music in general and contemporary popular music specifically.  Access to a keyboard or guitar is recommended.\n\n      less description for ARTS-UG 1306 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1315",
            "course_name": "Understanding Jazz",
            "description": "ARTS-UG 1315 Understanding Jazz",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1316",
            "course_name": "",
            "description": "ARTS-UG 1316\n\n   Playing Jazz\n\nThis workshop is designed for student musicians with the knowledge and skills of basic musicianship who want to learn to play jazz or extend their present ability to play jazz. Students will learn the fundamentals of improvisation: scale and chord structures, modes, chord progressions, rhythmic applications, song forms and options for organizing an improvisation such as creating a melody out of melodic fragments, scale fragments, and sequences. We will listen to great jazz performers to hear examples of good improvisation, proper phrasing and jazz styles. Students attending the workshop will g...\n\n      more description for ARTS-UG 1316 »\n\n      \n\n\n\nThis workshop is designed for student musicians with the knowledge and skills of basic musicianship who want to learn to play jazz or extend their present ability to play jazz. Students will learn the fundamentals of improvisation: scale and chord structures, modes, chord progressions, rhythmic applications, song forms and options for organizing an improvisation such as creating a melody out of melodic fragments, scale fragments, and sequences. We will listen to great jazz performers to hear examples of good improvisation, proper phrasing and jazz styles. Students attending the workshop will gain a working musical vocabulary in the language of mainstream jazz. This workshop will offer students a solid starting point, whether they want to play professionally, for personal enjoyment or simply to broaden their knowledge of what it takes to play jazz.\n\n      less description for ARTS-UG 1316 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1325",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12311",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Rayner, William",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1325\n\n   Songwriting\n\nSong is the oldest musical form established in all eras and cultures. Ancient Greek and African musicians used song for recreation, to preserve communal memory and to link the visible world with the invisible. Music making was rooted in mythology, legends and folklore and was associated with gods, ancestors and heroes. The musician, through his/her technique, had to be able to combine sounds and images through the use of voice, gesture, dance, and instruments to form a musical reminiscence. In this workshop, songwriting will be explored as both a musical and cultural practice. Each student wil...\n\n      more description for ARTS-UG 1325 »\n\n      \n\n\n\nSong is the oldest musical form established in all eras and cultures. Ancient Greek and African musicians used song for recreation, to preserve communal memory and to link the visible world with the invisible. Music making was rooted in mythology, legends and folklore and was associated with gods, ancestors and heroes. The musician, through his/her technique, had to be able to combine sounds and images through the use of voice, gesture, dance, and instruments to form a musical reminiscence. In this workshop, songwriting will be explored as both a musical and cultural practice. Each student will develop songwriting techniques through the study of historical, cultural and musical aspects of songwriting.\n\n      less description for ARTS-UG 1325 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1350",
            "course_name": "The Transformation of Music ina Century of Electronica",
            "description": "ARTS-UG 1350 The Transformation of Music ina Century of Electronica",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1375",
            "course_name": "",
            "description": "ARTS-UG 1375\n\n   Microphone Fiends:  Hip Hop and Spoken Word\n\nFrom Gil Scott-Heron, Sonia Sanchez and the Last Poets to Slick Rick, Queen Latifah and Public Enemy.  Amiri Baraka and Nikki Giovanni to Biggie Smalls and Nicki Minaj.  Whether you prefer the blues of Hughes and Gibson, or the beats of Ginsberg, Fresh and Rahzel.  If you root for battle raps from the likes of BDP, Lauryn Hill and Immortal Technique or the slam poetics of Beau Sia, Patricia Smith and Saul Williams -- you know Poets won’t stop building new worlds with the Word.  Workshop verse for the page and the stage.  Research, write, record, produce and perform original work and the verse ...\n\n      more description for ARTS-UG 1375 »\n\n      \n\n\n\nFrom Gil Scott-Heron, Sonia Sanchez and the Last Poets to Slick Rick, Queen Latifah and Public Enemy.  Amiri Baraka and Nikki Giovanni to Biggie Smalls and Nicki Minaj.  Whether you prefer the blues of Hughes and Gibson, or the beats of Ginsberg, Fresh and Rahzel.  If you root for battle raps from the likes of BDP, Lauryn Hill and Immortal Technique or the slam poetics of Beau Sia, Patricia Smith and Saul Williams -- you know Poets won’t stop building new worlds with the Word.  Workshop verse for the page and the stage.  Research, write, record, produce and perform original work and the verse of inspiring underground wordsmiths, while critically examining texts by and about legends from the Harlem Renaissance, the Black Arts Movement and the Hip Hop Generation we are shaping here and now.\n\n      less description for ARTS-UG 1375 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1405",
            "course_name": "Drawing and Painting",
            "description": "ARTS-UG 1405 Drawing and Painting \nThis workshop is designed to provide both beginning and advanced students with studio experience in drawing and painting. A variety of media will be used, including acrylic paint. The problem of visual conversion will be addressed as will the distinction between “what is seen and what is known” (Picasso). In addition, by way of critiques, discussions and gallery visits, the student will explore the problem of visual “form” and aesthetic judgment. Selected works produced during the semester will be shown in the Gallatin arts studio on the 4th floor of 1 Washington Place.",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1406",
            "course_name": "",
            "description": "ARTS-UG 1406\n\n   Drawing in the Expanded Field\n\nDrawing has long been considered a foundational element in the study of art. In the 20th century, drawing has also become a medium that exists front and center in the practice of many contemporary artists. While previously it was understood as a preparatory tool, now it is seen as a final destination. The very question of what constitutes drawing has been redefined by artists who have pushed the bounds of the term. This course will consider activities in our everyday life that touch on aspects of drawing (writing, diagrammatic language, notation, mapping). We will also think about the ways dra...\n\n      more description for ARTS-UG 1406 »\n\n      \n\n\n\nDrawing has long been considered a foundational element in the study of art. In the 20th century, drawing has also become a medium that exists front and center in the practice of many contemporary artists. While previously it was understood as a preparatory tool, now it is seen as a final destination. The very question of what constitutes drawing has been redefined by artists who have pushed the bounds of the term. This course will consider activities in our everyday life that touch on aspects of drawing (writing, diagrammatic language, notation, mapping). We will also think about the ways drawing has been taught traditionally, and to consider what associations the medium carries today from this history. The question of what constitutes drawing will be approached through process and concept much more than as defined by medium, and the course focuses on an expanded, experimental approach to drawing. Assignments will often be a response to a wide variety of artistic mediums where there exist resonant  relationships (dance, installation, land art, architecture, sculpture, and performance, among others). Students will work in conventional drawing media (pencil, paper, eraser, ink) but will also explore how other media can expand the idea of what \"drawing\" might mean. Although this is a studio course, there is a rigorous reading/research component as well. Texts are assigned for discussion regularly and students will do individual presentations to the class based on focused research topics.\n\n      less description for ARTS-UG 1406 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1407",
            "course_name": "Introduction to Painting I",
            "description": "ARTS-UG 1407 Introduction to Painting I \nBasic technical and conceptual principles of painting through in-the-studio practice. The relationship between form and content (technique and concept) is informed by art history and theory. Therefore, such processes as palette orientation, paint manipulation, and canvas preparation are determined by their appropriate use according to chosen time.",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1408",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "16920",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 432",
                    "time": "Tue 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Mokgosi, Meleko"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1408\n\n   Drawing: Body and Narrative\n\nThe aim of this course is to examine and challenge representations of the body and how the body is used in constructing narratives through the medium of drawing.  Students who are interested in making art that either tells stories or works against the narrative form, will have the opportunity to develop their ideas and skills in a challenging studio class. In addition to rigorous projects and reading assignments, we will look at and discuss the work of artists such as William Kentridge, David Shrigley, Charles Gaines, Charles White, Kara Walker, Robin Rhode, Ida Applebroog, Raymond Pettibon, a...\n\n      more description for ARTS-UG 1408 »\n\n      \n\n\n\nThe aim of this course is to examine and challenge representations of the body and how the body is used in constructing narratives through the medium of drawing.  Students who are interested in making art that either tells stories or works against the narrative form, will have the opportunity to develop their ideas and skills in a challenging studio class. In addition to rigorous projects and reading assignments, we will look at and discuss the work of artists such as William Kentridge, David Shrigley, Charles Gaines, Charles White, Kara Walker, Robin Rhode, Ida Applebroog, Raymond Pettibon, and Kathe Kollwitz.   In this course, students will work on both proposed projects and in-class drawing workshops dedicated to life drawing, using a variety of wet and dry media on various surfaces.  In exploring the relation between bodies and narrative, we will ask: what is the relation between mimesis and narrative, and how is the narrative form used to produce history?  Is it possible to create artwork outside of narrative? What is the role of a ‘narrator’ in the visual arts and how can this role be complicated?  What are we to make of the ways that the revealing of one narrative may obscure others?  Readings include essays by Michel Foucault, Fredric Jameson, Hayden White, Kara Walker, Jeff Wall, and William Kentridge.\n\n      less description for ARTS-UG 1408 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1409",
            "course_name": "Topics in Painting",
            "description": "ARTS-UG 1409 Topics in Painting \nIn this workshop, students expand the skills and techniques initiated in Introduction to Painting. This course will focus on realism and figuration, with emphasis on representation and the effects of the human figure in various settings and narratives. Additionally, contemporary ideas and practices will be incorporated into the class along with group and individual critiques.",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1410",
            "course_name": "",
            "description": "ARTS-UG 1410\n\n   Outdoor Painting and Drawing\n\nBy combining drawing and painting outdoors, in a variety of sites around New York,  with the study of art making theory in the studio,  this course provides a firm base not only for making art, but  for understanding complex art movements like cubism, abstract  expressionism and pop art, among others.  The use of several sites within New York City as the subject matter  for our creative work  outdoors and in the studio provides us with significant options to produce unmatched, highly original and inventive imagery by  converting  sources into pictorial elements. Use of particular visual art me...\n\n      more description for ARTS-UG 1410 »\n\n      \n\n\n\nBy combining drawing and painting outdoors, in a variety of sites around New York,  with the study of art making theory in the studio,  this course provides a firm base not only for making art, but  for understanding complex art movements like cubism, abstract  expressionism and pop art, among others.  The use of several sites within New York City as the subject matter  for our creative work  outdoors and in the studio provides us with significant options to produce unmatched, highly original and inventive imagery by  converting  sources into pictorial elements. Use of particular visual art media outdoors  facilitates  convenient, rapid use of  sources.  Other art materials are more suitable for work in the art studio.  The most important component of art making, how sources can  trigger  conversion into visual art form, is an intrinsic part of this course.\n\n      less description for ARTS-UG 1410 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1415",
            "course_name": "",
            "description": "ARTS-UG 1415\n\n   Advanced Drawing\n\nThe class will focus on advanced techniques in drawing. Through workshops and individual assignments, students will be able to build upon their skills in the technical aspects of drawing, such as line, gesture, tone, etc.; develop conceptual strategies and learning how to revise and improve on their ideas; study, looking at, and discussing the work of established artists to gain an understanding of the contemporary world of creativity in the visual realm and to place their own ideas in a context; and speaking about and responding to (or critiquing) each other’s work. Responding to and raising ...\n\n      more description for ARTS-UG 1415 »\n\n      \n\n\n\nThe class will focus on advanced techniques in drawing. Through workshops and individual assignments, students will be able to build upon their skills in the technical aspects of drawing, such as line, gesture, tone, etc.; develop conceptual strategies and learning how to revise and improve on their ideas; study, looking at, and discussing the work of established artists to gain an understanding of the contemporary world of creativity in the visual realm and to place their own ideas in a context; and speaking about and responding to (or critiquing) each other’s work. Responding to and raising questions and concerns in a productive manner about whatever topic we tackle. In addition, there will be reading assignments throughout the term.\n\n      less description for ARTS-UG 1415 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1420",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12312",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 432",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Ruhe, Barnaby"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1420\n\n   Rites of Passage into Contemporary Art Practice\n\nModern art has been a balancing act between control and letting go. This course focuses on the psychological interface between the two, the “liminal” zone. We will survey modern artists’ techniques for tapping sources of creativity, including Dada collagists’ free-associations; Surrealists’ automatic writing, doodles, and “cadavres exquises”; and Abstract Expressionists’ embrace of chaos. We will engage in simple exercises: doodling, speed drawing, painting an abstract mural as a group, keeping a liminal journal, collaging, and exploring ritualistic techniques. We will follow up with discussio...\n\n      more description for ARTS-UG 1420 »\n\n      \n\n\n\nModern art has been a balancing act between control and letting go. This course focuses on the psychological interface between the two, the “liminal” zone. We will survey modern artists’ techniques for tapping sources of creativity, including Dada collagists’ free-associations; Surrealists’ automatic writing, doodles, and “cadavres exquises”; and Abstract Expressionists’ embrace of chaos. We will engage in simple exercises: doodling, speed drawing, painting an abstract mural as a group, keeping a liminal journal, collaging, and exploring ritualistic techniques. We will follow up with discussions, take a trip to the Met, and conclude the course reexamining modern art in light of the inner journey each of us has taken during the course. Readings include van Gennep's Rites of Passage, Chipp's Theories of Modern Art, R.D. Laing, Federico Garcia Lorca on duende, Victor Turner on liminal, Mircea Eliade, James Elkins on alchemy and art, and Frida Kahlo's journal.\n\n      less description for ARTS-UG 1420 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1425",
            "course_name": "",
            "description": "ARTS-UG 1425\n\n   Discovering Manhattan: Painting and Drawing\n\nThis workshop explores images of New York City as envisioned by various schools of modern art, including Ashcan, Bauhaus, Futurist, Dadaist, Pop, and High Tech, and by the artists of the modern period, including Sloan, Mondrian, Hopper, Marin, Brancusi, O'Keefe, Duchamp, Grooms, and Koons. In response to studying these visions of New York, students create their own art works—sketching in Times Square with the garrulous attitude of Reginald Marsh, drawing a skyscraper in an ecstatic John Marin breath, creating a collage by rifling through bins with Arman and Duchamp. The workshop concludes with...\n\n      more description for ARTS-UG 1425 »\n\n      \n\n\n\nThis workshop explores images of New York City as envisioned by various schools of modern art, including Ashcan, Bauhaus, Futurist, Dadaist, Pop, and High Tech, and by the artists of the modern period, including Sloan, Mondrian, Hopper, Marin, Brancusi, O'Keefe, Duchamp, Grooms, and Koons. In response to studying these visions of New York, students create their own art works—sketching in Times Square with the garrulous attitude of Reginald Marsh, drawing a skyscraper in an ecstatic John Marin breath, creating a collage by rifling through bins with Arman and Duchamp. The workshop concludes with a collaborative mural project and a final paper analyzing various strategies of expression whereby modern artists discovered the meaning of Manhattan. Through a process of appropriation, imitation, and parody, students are thus encouraged to re-enact the process of \"discovering Manhattan,\" to engage in a dialogue with the city, and thereby to discover their own artistic voices. Readings include E.B. White's ineffable \"Here is New York,\" Alan Ginsberg's outrageous \"Howl,\" Robert Henri's Art Spirit, as well as excerpts from Natalie Edgar's \"The Club\" which met at the Cedar Tavern on 13th and University, a few blocks from here, then Harold Rosenberg, Irving Sandler, and Federico Garcia Lorca's \"Duende\" from his Poeta en Nueva York lecture.\n\n      less description for ARTS-UG 1425 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1430",
            "course_name": "NYC Art Gallery Scene",
            "description": "ARTS-UG 1430 NYC Art Gallery Scene",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1431",
            "course_name": "",
            "description": "ARTS-UG 1431\n\n   Art-Making and Mythology of Mexico\n\nA rich landscape of art and culture flourished in Mexico for thousands of years beginning with the Olmec civilization at around the second millennium before Christ. With the arrival of the Spaniards in 1519, a new hybrid culture resulted from the fusion of two different worlds, the Iberian and the Native American: a fusion which continues to exist and grow to the present day. This interdisciplinary workshop will closely examine the art, culture and mythology of Mexico, both before and after the conquest, and combines our study of it with hands on art making. The course will begin with a brief ...\n\n      more description for ARTS-UG 1431 »\n\n      \n\n\n\nA rich landscape of art and culture flourished in Mexico for thousands of years beginning with the Olmec civilization at around the second millennium before Christ. With the arrival of the Spaniards in 1519, a new hybrid culture resulted from the fusion of two different worlds, the Iberian and the Native American: a fusion which continues to exist and grow to the present day. This interdisciplinary workshop will closely examine the art, culture and mythology of Mexico, both before and after the conquest, and combines our study of it with hands on art making. The course will begin with a brief overview of the major Mexican muralists, Rivera, Orozco, and Siquieros, and American artists who were influenced by them such as Guston, O'keefe, and Pollock. It will then move chronologically from the Olmec culture occurring 4,000 years ago; Teotihuacan, or the City of the Gods; the Toltecs of Tula, from which emerged Quetzalcoatl the \"Feathered Serpent,\" a figure that inspired art for centuries; the hyper-religious Aztecs; the large and complex Mayan culture; and lastly, the new hybrid art formed by the synthesis of Spanish and Native American cultures. Topics to be covered will include: astrology/astronomy; religion and shamanism; mythology; and human sacrifice. Museum trips, slide shows, videos, and the reading of rare texts such as the Popul Vuh will also be scheduled.\n\n      less description for ARTS-UG 1431 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1435",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "16921",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 432",
                    "time": "Wed 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Mokgosi, Meleko"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1435\n\n   Artists' Books\n\nAs an alternative to the politics and limitations of studio practices, artists’ books since William Blake’s Songs of Innocence and of Experience have allowed artists to experiment with conceptual ideas, visual and literary materials, as well as production practices. This course will begin with the precedent that Blake set, and investigate the numerous manifestations of the artist’s book. Course material will consider exhibitions and special libraries, and will look at the work of artists and collectives such as Ed Rucha, Cobra, Guy Debord, Fluxus, and Andy Warhol, to name a few. In responding ...\n\n      more description for ARTS-UG 1435 »\n\n      \n\n\n\nAs an alternative to the politics and limitations of studio practices, artists’ books since William Blake’s Songs of Innocence and of Experience have allowed artists to experiment with conceptual ideas, visual and literary materials, as well as production practices. This course will begin with the precedent that Blake set, and investigate the numerous manifestations of the artist’s book. Course material will consider exhibitions and special libraries, and will look at the work of artists and collectives such as Ed Rucha, Cobra, Guy Debord, Fluxus, and Andy Warhol, to name a few. In responding to this material, students will also work on a final project and produce their own artist’s book.\n\n      less description for ARTS-UG 1435 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1440",
            "course_name": "",
            "description": "ARTS-UG 1440\n\n   Technology Art and Public Space\n\nThis course explores the relationship of art, technology, and public space through the study of historical and contemporary examples, and through our own direct experience of creating and installing a work of public art. Special emphasis will be placed on the impact of recent technological developments on public art, but in turn, we use public art to reflect on emergent cultural and social transformations in New York City. The course will focus especially on the evolution of both Times Square and Union Square in New York City, to understand how art, commerce, politics, and public life have com...\n\n      more description for ARTS-UG 1440 »\n\n      \n\n\n\nThis course explores the relationship of art, technology, and public space through the study of historical and contemporary examples, and through our own direct experience of creating and installing a work of public art. Special emphasis will be placed on the impact of recent technological developments on public art, but in turn, we use public art to reflect on emergent cultural and social transformations in New York City. The course will focus especially on the evolution of both Times Square and Union Square in New York City, to understand how art, commerce, politics, and public life have competed and converged to influence social and political change over the years. But the experiential component of the course is a technology-based public art project (most likely involving large-scale digital media) that students will plan and execute. The project will most likely utilize large-scale digital media, and the instructor will secure the necessary funds to carry it out. Students will keep a journal for the duration of the project, which will be used to evaluate the project and to connect it to other coursework. Readings for the course will be drawn from a number of sources, including: Gaston Bachelard, The Poetics of Space; Rosalyn Deutsche, Evictions: Art and Spatial Politics; Barbara Goldstein, Public Art By The Book; Hayden, Dolores. The Power of Place: Urban Landscapes as Public History; Bruno Latour (Editor), Making Things Public: Atmospheres of Democracy; Malcolm Miles, Art, Space, and the City: Public Art and Urban Futures; Jacques Rancier, The Future of the Image.\n\n      less description for ARTS-UG 1440 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1445",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12527",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 432",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Culver, Terence"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1445\n\n   Walls of Power: Public Art\n\nThis workshop will explore how visual art, performance art, and activist art in the public sphere contribute to political dialogue and community building. The course will integrate the hands-on practice of public art making with the study of politics, community building, culture, and social issues as they relate to public art, with a special focus on New York City. A major component of the course will be a public art project that students will plan and execute during the semester. Selected readings will include: Bachelard, The Poetics of Space; Deutsche, Evictions: Art and Spatial Politics; La...\n\n      more description for ARTS-UG 1445 »\n\n      \n\n\n\nThis workshop will explore how visual art, performance art, and activist art in the public sphere contribute to political dialogue and community building. The course will integrate the hands-on practice of public art making with the study of politics, community building, culture, and social issues as they relate to public art, with a special focus on New York City. A major component of the course will be a public art project that students will plan and execute during the semester. Selected readings will include: Bachelard, The Poetics of Space; Deutsche, Evictions: Art and Spatial Politics; Lacy, ed., Mapping the Terrain: New Genre Public Art; Malraux, Museum Without Walls; Raven, Art in the Public Interest; Rochfort, Mexican Muralists: Orozco, Rivera, Siqueiros.\n\n      less description for ARTS-UG 1445 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1450",
            "course_name": "",
            "description": "ARTS-UG 1450\n\n   On Display: Museums and Visual Culture in Ny\n\nAs the Museum capital of the world, New York City offers students a unique opportunity to explore the roles and cultural meanings of ?the museum.?  In this course, students will investigate the historical, philosophical, theoretical, and practical aspects of the collection and exhibition of art and artifacts in museums. Using some of the leading museum/art institutions in New York as examples, this course will begin with a survey of the history of the museum, followed by topics such as audience and community outreach, curatorial strategies for exhibition and collection development, conservatio...\n\n      more description for ARTS-UG 1450 »\n\n      \n\n\n\nAs the Museum capital of the world, New York City offers students a unique opportunity to explore the roles and cultural meanings of ?the museum.?  In this course, students will investigate the historical, philosophical, theoretical, and practical aspects of the collection and exhibition of art and artifacts in museums. Using some of the leading museum/art institutions in New York as examples, this course will begin with a survey of the history of the museum, followed by topics such as audience and community outreach, curatorial strategies for exhibition and collection development, conservation issues, and museum architecture.  Course readings will include such works as Introduction to Museum Work by G. Ellis Burcaw; Museum Skepticism: A History of the Display of Art in Public Galleries by David Carrier; and Reinventing the Museum: Historical and Contemporary Perspectives on the Paradigm Shift edited by Gail Anderson.   There will be two museum visits and one gallery visit scheduled outside of class time as well as an in-class presentation by each student.\n\n      less description for ARTS-UG 1450 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1460",
            "course_name": "",
            "description": "ARTS-UG 1460\n\n   Visual Arts in Theory to Practice\n\nThis course is open to students actively engaged in art practice (photographic, painterly, sculptural, videographic, or otherwise) and interested in developing a theoretical framework for their work.  We will begin by developing a common vocabulary.  Then through texts, museum, gallery and studio visits as well as studio practice, students will be challenged to define what they believe to be the place of art in contemporary society and, more specifically, where they believe their work fits within this context.  Ultimately, the goal of the class will be the development of a work  or a body of w...\n\n      more description for ARTS-UG 1460 »\n\n      \n\n\n\nThis course is open to students actively engaged in art practice (photographic, painterly, sculptural, videographic, or otherwise) and interested in developing a theoretical framework for their work.  We will begin by developing a common vocabulary.  Then through texts, museum, gallery and studio visits as well as studio practice, students will be challenged to define what they believe to be the place of art in contemporary society and, more specifically, where they believe their work fits within this context.  Ultimately, the goal of the class will be the development of a work  or a body of work that will be critiqued in group discussion and individually, and will be addressed on theoretical, formal, and technical grounds.\n\n      less description for ARTS-UG 1460 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1470",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12313",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 432",
                    "time": "Mon 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Wyatt, Gregory"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1470\n\n   The Public Square: From Concepts--to Models--to Monuments\n\nThis  workshop focuses on the nature of creativity for the public space and the “model to monument” design and bronze casting. We will explores the process by which a concept becomes a three dimensional model and consequently a public monument. We will also investigate how ideas, or concepts in history have influenced individual artist in making public monuments. Some examples of this type of didactic art that we will explore are: Perikles’ Athenian building program after the Persian wars, Michelangelo’s David, the Columbia University “Alma Mater” in the middle of Columbia’s campus, the Peace ...\n\n      more description for ARTS-UG 1470 »\n\n      \n\n\n\nThis  workshop focuses on the nature of creativity for the public space and the “model to monument” design and bronze casting. We will explores the process by which a concept becomes a three dimensional model and consequently a public monument. We will also investigate how ideas, or concepts in history have influenced individual artist in making public monuments. Some examples of this type of didactic art that we will explore are: Perikles’ Athenian building program after the Persian wars, Michelangelo’s David, the Columbia University “Alma Mater” in the middle of Columbia’s campus, the Peace Fountain next to St. John the Divine,  Ghandi’s bronze on Union Square, Grand Army Plaza, “Sherman Memorial,”  Avenue of Americas “Liberators Monuments,” Central Park “Literary Walk-Shakespeare” and “Angel of the Waters” and other  sculptures and architectural sights in New York City. In addition to visiting most of the above New York City’s public monuments, each student in the class will adopt-a-monument that is in a decaying state and develop plans to restore it or  study the possibilities to prevent it from further decay. Some sessions of this workshop will be conducted at the Art Students League with visits to the Queens Modern Art Foundry.  Readings may include Plato’s Timaeus, Benvenuto Cellini’s Autobiography, Cezanne’s Letters, Delacroix’s Jounal, as well as Goethe and Leonardo on painting.\n\n      less description for ARTS-UG 1470 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1480",
            "course_name": "",
            "description": "ARTS-UG 1480\n\n   Photograph New York, Create Your Vision\n\nBy giving us a sense of place, the city we inhabit recreates us.  This documentary photography course explores New York City as the ever-changing environment in which we are involved. Embarking on a photographic project of their design, students will depict a highly visible urban space (viewed as a world financial, cultural, artistic capital) through their own relationship to it: their ways of interacting, acting, and being moved.  Classes prepare students to work on their position as photographers: as they make pictures in the streets of New York, they will determine their own perception (van...\n\n      more description for ARTS-UG 1480 »\n\n      \n\n\n\nBy giving us a sense of place, the city we inhabit recreates us.  This documentary photography course explores New York City as the ever-changing environment in which we are involved. Embarking on a photographic project of their design, students will depict a highly visible urban space (viewed as a world financial, cultural, artistic capital) through their own relationship to it: their ways of interacting, acting, and being moved.  Classes prepare students to work on their position as photographers: as they make pictures in the streets of New York, they will determine their own perception (vantage point, angle, point of view, framing) and establish a particular relationship with the audience (through scale, rhythm sequence, position, color).  Exploring the boundaries between public and private space, feeling space and scale with the body (and not only with one's eyes) and creating a personal color palette will be strongly encouraged. Students will also explore a photographer's power to change audience perception, for example, through large scale installations inciting viewers to inhabit particular vantage points.  Though documentary imagery is traditionally considered to establish a transparent relation to 'reality,' this course challenges students to recognize its created character and to recreate the city by influencing with their photographic intervention the ways it is perceived.  Classes will offer technical instruction, critiques of student work, debates on street photography, visual analysis and discussions with invited artists, and will be highly collaborative. Open to highly motivated students with or without experience in documentary photography; digital or film cameras welcome.\n\n      less description for ARTS-UG 1480 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1481",
            "course_name": "",
            "description": "ARTS-UG 1481\n\n   Photograph New York Coastal\n\nDown by the water’s edge we find the color contrast delineating wet and dry to the rhythm of nature’s tidal flux.  The ebb relinquishes 12 hours of  waterborne mystery; the flow’s 12 hours blanket refreshes the shore’s human impositions.  New York City’s 578 coastal miles inspire this photographic documentary workshop to explore ongoing changes in commercial development, social recreation and environmental climate.  The gradual cleansing of New York City waterways has encouraged neighborhood communities to revive their historical, artistic, and literary traditions along shorelines once occupie...\n\n      more description for ARTS-UG 1481 »\n\n      \n\n\n\nDown by the water’s edge we find the color contrast delineating wet and dry to the rhythm of nature’s tidal flux.  The ebb relinquishes 12 hours of  waterborne mystery; the flow’s 12 hours blanket refreshes the shore’s human impositions.  New York City’s 578 coastal miles inspire this photographic documentary workshop to explore ongoing changes in commercial development, social recreation and environmental climate.  The gradual cleansing of New York City waterways has encouraged neighborhood communities to revive their historical, artistic, and literary traditions along shorelines once occupied by industry.  Now attracting vibrant cultural, educational and tourist activity, New York City coastal communities are again looking at the water, seeking inspiration in its beauty.  Embarking on a photographic project of their design, students will develop their own personal viewpoint on society’s relationship to New York waterlines, determine their own perception (vantage point, angle, point of view, framing) and establish a unique relationship with the audience (through scale, rhythm sequence, position, color).  Classes will offer technical instruction, critiques of student work, and visual analysis. Open to highly motivated students with or without experience in documentary photography; digital or film cameras welcome.\n\n      less description for ARTS-UG 1481 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1485",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12528",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 501",
                    "time": "Tue 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Day, Jeff"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1485\n\n   Beyond Picture Perfect: Personal Choice in a Digital World\n\nBeyond Picture Perfect explores the many choices available to today’s image makers. New technology combined with traditional photographic techniques will be addressed, enabling the students to realize their distinctive image-making vocabulary. Weekly discussions include understanding hardware mechanics, choosing a personal color palette, and recognizing “your” unique composition key. We will debate the many analog and digital tools available to photographers vital to their artistic expression. These concepts will be supported by weekly assignments and class critiques culminating in a final pro...\n\n      more description for ARTS-UG 1485 »\n\n      \n\n\n\nBeyond Picture Perfect explores the many choices available to today’s image makers. New technology combined with traditional photographic techniques will be addressed, enabling the students to realize their distinctive image-making vocabulary. Weekly discussions include understanding hardware mechanics, choosing a personal color palette, and recognizing “your” unique composition key. We will debate the many analog and digital tools available to photographers vital to their artistic expression. These concepts will be supported by weekly assignments and class critiques culminating in a final project portfolio. Students with interest in analog or digital formats will be encouraged to develop an understanding of their medium and form an original visual strategy. Museum/ gallery visits and field trips for on-location photographing will inspire students to create their own way of seeing. Readings may include selections from: Robert Adams, Why People Photograph; London and Upton, Photography.\n\n      less description for ARTS-UG 1485 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1490",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12552",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "12WV L114",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Katchadourian, Nina"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1490\n\n   Sound Art\n\nWe generally assume art to be an engagement with the visual. How does our experience and understanding change when our engagement is primarily through our ears? This arts workshop investigates sound as it comes into play in contemporary visual art practice, installation art, experimental music, and various confluences of these. We will study historical examples of early recording technologies, and explore experimental sound works that provide the intellectual and conceptual antecedents for sound art today. We will also think analytically and historically about the concepts of “noise” and “sile...\n\n      more description for ARTS-UG 1490 »\n\n      \n\n\n\nWe generally assume art to be an engagement with the visual. How does our experience and understanding change when our engagement is primarily through our ears? This arts workshop investigates sound as it comes into play in contemporary visual art practice, installation art, experimental music, and various confluences of these. We will study historical examples of early recording technologies, and explore experimental sound works that provide the intellectual and conceptual antecedents for sound art today. We will also think analytically and historically about the concepts of “noise” and “silence.” Students will explore the potential of sound as an artistic medium by creating sound-based works as well as studying the work of other artists (John Cage, Pierre Schaeffer, Max Neuhaus, Pauline Oliveros and Iannis Xenakis are some historical touchpoints; Marina Rosenfeld, Christian Marclay, Steven Vitiello, Christina Kubisch, and Susan Philipsz are some contemporary examples). This is not a music or composition class, and the emphasis of this class falls strongly on expanding conceptual skills rather than on technical development. Although experience editing sound is helpful, it is not required. Production assignments are assigned in tandem with with readings of contemporary and historical writing, critical essays and artist’s statements. There will be a strong emphasis placed on discussion, group critique, and student presentations. Guest speakers are a regular part of the course and include artists, curators/critics, and producers of sound who engage the subject from a variety of viewpoints. Ultimately, students in this course will arrive at an enhanced experience of listening such that their knowledge, awareness, and creative engagement with sound is significantly altered.\n\n      less description for ARTS-UG 1490 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1525",
            "course_name": "",
            "description": "ARTS-UG 1525\n\n   Writing for The Ear: Broadcast News\n\nListen to the news on the radio or watch it on TV and it will become apparent that the most engaging reports?like the best told stories?are those that insist you use your imagination. In this course, we will study the difference between writing for the ear and writing for the eye by comparing broadcast and print reports of the same news events in a variety of media. We?ll also consider how news, in spite of the ideal of objectivity, is inevitably a product of a ?Rashomon? effect: where the same story is told differently, depending upon the relationship of the storyteller to the event. We will ...\n\n      more description for ARTS-UG 1525 »\n\n      \n\n\n\nListen to the news on the radio or watch it on TV and it will become apparent that the most engaging reports?like the best told stories?are those that insist you use your imagination. In this course, we will study the difference between writing for the ear and writing for the eye by comparing broadcast and print reports of the same news events in a variety of media. We?ll also consider how news, in spite of the ideal of objectivity, is inevitably a product of a ?Rashomon? effect: where the same story is told differently, depending upon the relationship of the storyteller to the event. We will explore the nexus of truth and news by studying the evolution of a news story?from event to source to air. Students will research, write and record their own radio news reports and the class will discuss the effectiveness of the storytelling and compare the relative objectivity of the reports. Possible texts include Rashomon by Ryunosuke Akutagawa,The Complete Short Stories of Ernest Hemingway, How to Watch TV News by Neil Postman and Steve Powers, and Naked in Baghdad by NPR reporter Ann Garrels.\n\n      less description for ARTS-UG 1525 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1530",
            "course_name": "Mystory: Creating The Audio Narrative",
            "description": "ARTS-UG 1530 Mystory: Creating The Audio Narrative",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1560",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19729",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 601",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Holnes, Darrel"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1560\n\n   Introduction to Dramatic Writing: The Short Play\n\nIn this arts workshop we will learn the basics of playwriting by examining the work of Aristotle as well as plays by major writers including Anton Chekov, Oscar Wilde, and others. Our goal will be to develop and revise a short play through a variety of writing exercises and techniques and the study of plays in 24 Favorite One-Act Plays and the Best 10-Minute Plays of 2014. This course will also feature guest lectures by a diverse group of working playwrights and theater professionals and the viewing of a Broadway and Off-Broadway show. Upon completing this course you will have a working body o...\n\n      more description for ARTS-UG 1560 »\n\n      \n\n\n\nIn this arts workshop we will learn the basics of playwriting by examining the work of Aristotle as well as plays by major writers including Anton Chekov, Oscar Wilde, and others. Our goal will be to develop and revise a short play through a variety of writing exercises and techniques and the study of plays in 24 Favorite One-Act Plays and the Best 10-Minute Plays of 2014. This course will also feature guest lectures by a diverse group of working playwrights and theater professionals and the viewing of a Broadway and Off-Broadway show. Upon completing this course you will have a working body of short dramatic writing and learn how to submit your work to student and professional festivals and contests worldwide.\n\n      less description for ARTS-UG 1560 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1565",
            "course_name": "Playwriting",
            "description": "ARTS-UG 1565 Playwriting \nThis writer’s workshop explores the symbiotic nature of playwriting. Through a series of exercises, we will discover how environment and experience influence identity, how plot is built on desire and need, and why perception and cultural context dictate the form or structure of a play. By examining classical paradigms and their influence on modern theatre, we can determine how to use or break these rules to find our own voices. And as we mine our souls and surroundings for the seeds of creation, we will write a one-act play. Some readings include Fornes, Fugard, Satre, Korder and Chekov.",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1566",
            "course_name": "Advanced Playwriting",
            "description": "ARTS-UG 1566 Advanced Playwriting",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1570",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12315",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 501",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Thompson, Selma"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1570\n\n   Writing for Screen I\n\nThis workshop is for writers ready and willing to make the time commitment necessary to produce a well-structured outline and at least the first act of a feature-length screenplay (although students will be supported/encouraged to write a complete first draft, if possible). We will hone our craft through writing exercises, and through screenings of film scenes that illustrate aspects of dramatic writing. Attention will be paid to the fundamentals of drama, including dialogue, subtext, motivation and character-revealing action. The majority of our time will be spent presenting work and giving/r...\n\n      more description for ARTS-UG 1570 »\n\n      \n\n\n\nThis workshop is for writers ready and willing to make the time commitment necessary to produce a well-structured outline and at least the first act of a feature-length screenplay (although students will be supported/encouraged to write a complete first draft, if possible). We will hone our craft through writing exercises, and through screenings of film scenes that illustrate aspects of dramatic writing. Attention will be paid to the fundamentals of drama, including dialogue, subtext, motivation and character-revealing action. The majority of our time will be spent presenting work and giving/receiving feedback; the ability to engage in collaborative discussion, and offer useful commentary, is an essential professional skill. Additionally, we will read/analyze recently produced screenplays to understand structure and how to make the story exciting \"on the page\". Students should come to the class with some scriptwriting experience and/or a background in acting or film.\n\n      less description for ARTS-UG 1570 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1571",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12316",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 501",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Douglas, Imani"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1571\n\n   Writing for Television I\n\nThis workshop will explore the process of turning an idea into a teleplay. Prior to delving into the world of television, we will take a peek into writing for stage and film. The differences and similarities of these mediums will be investigated, via such works as Neil Simon’s The Odd Couple, successful in all forms—stage, film, and TV sitcom. Structure, function and form will be examined via the reading of scripts and viewing of films and classic TV. Students will spend ten weeks of the semester creating, developing, and writing a sitcom episode of a classic television series, such as I Love ...\n\n      more description for ARTS-UG 1571 »\n\n      \n\n\n\nThis workshop will explore the process of turning an idea into a teleplay. Prior to delving into the world of television, we will take a peek into writing for stage and film. The differences and similarities of these mediums will be investigated, via such works as Neil Simon’s The Odd Couple, successful in all forms—stage, film, and TV sitcom. Structure, function and form will be examined via the reading of scripts and viewing of films and classic TV. Students will spend ten weeks of the semester creating, developing, and writing a sitcom episode of a classic television series, such as I Love Lucy. Students will learn first-hand what it takes to complete a writing assignment from pitch, to beat sheet, outline, first draft, rewrite, to table draft, under the direct supervision and guidance of an executive producer. In this way, students will learn the business of the TV writer and what it takes to be successful in “the room” of a Hollywood TV show. Readings may include Writing for Television by Madeline DiMaggio and Laughs, Luck and Lucy! by Jess and Gregg Oppenheimer. This course is open to students with a serious interest in the craft of writing for television. This writing-intensive workshop is modeled on the industry, requiring strict adherence to deadlines and mandatory attendance.\n\n      less description for ARTS-UG 1571 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1572",
            "course_name": "",
            "description": "ARTS-UG 1572\n\n   Writing for Television II\n\nThis workshop focuses on the writer as an individual in the often daunting, sometimes humbling \"collaborative\" world of TV writing.  In this workshop, we will work on capturing the voices, rhythm, and style of varied classic TV hits, while executing class writing assignments.  Students will test their discipline, motivation, and ingenuity as they complete their very own \"spec script\" of a show of their choice, presently on the air.  Readings may include How to Write For Television by Madeline Dimaggio, The Sitcom Career Book by Mary Lou Belli and Phil Ramuno, and selections from Story by Rober...\n\n      more description for ARTS-UG 1572 »\n\n      \n\n\n\nThis workshop focuses on the writer as an individual in the often daunting, sometimes humbling \"collaborative\" world of TV writing.  In this workshop, we will work on capturing the voices, rhythm, and style of varied classic TV hits, while executing class writing assignments.  Students will test their discipline, motivation, and ingenuity as they complete their very own \"spec script\" of a show of their choice, presently on the air.  Readings may include How to Write For Television by Madeline Dimaggio, The Sitcom Career Book by Mary Lou Belli and Phil Ramuno, and selections from Story by Robert McKee and How to Write a Movie in 21 Days by Viki King.  Students will be required to work in Final Draft software for class projects.\n\n      less description for ARTS-UG 1572 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1573",
            "course_name": "",
            "description": "ARTS-UG 1573\n\n   Writing for The Screen II\n\nWriting for the Screen II provides a structured workshop environment in which students who have already completed a first draft of a feature-length screenplay can assess their work and take their writing to the next level by completing a second draft and a polish. Can the script be edited to improve pace and structure? Can the story be made more active and visual? Can more be done with character choices and setting? Are there ideas, themes, and/or jokes to further explore? Are there issues of story logic or continuity yet to be worked out? Is the story presented professionally, creatively usin...\n\n      more description for ARTS-UG 1573 »\n\n      \n\n\n\nWriting for the Screen II provides a structured workshop environment in which students who have already completed a first draft of a feature-length screenplay can assess their work and take their writing to the next level by completing a second draft and a polish. Can the script be edited to improve pace and structure? Can the story be made more active and visual? Can more be done with character choices and setting? Are there ideas, themes, and/or jokes to further explore? Are there issues of story logic or continuity yet to be worked out? Is the story presented professionally, creatively using screenplay format to engage the reader? What elements make the script commercially viable and how might it be pitched? Writing a second draft is a creative adventure, a chance to see how far you can take your initial idea as your story grows richer and your characters start to come alive on the page. Texts will include Russin and Downs, Writing the Picture; Mamet, Bambi vs. Godzilla: The Nature, Purpose, and Practice of the Movie Business; Goldman, Adventures in the Screen Trade; Lowenstein, My First Movie: 20 Celebrated Directors Talk about Their First Film; and the screenplays for Chinatown and Ordinary People.\n\n      less description for ARTS-UG 1573 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1574",
            "course_name": "Guerilla Screenwriting",
            "description": "ARTS-UG 1574 Guerilla Screenwriting",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1575",
            "course_name": "Dramatizing History I",
            "description": "ARTS-UG 1575 Dramatizing History I",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1576",
            "course_name": "Dramatizing History II",
            "description": "ARTS-UG 1576 Dramatizing History II",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1580",
            "course_name": "Adapting Lit for Performance",
            "description": "ARTS-UG 1580 Adapting Lit for Performance",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1585",
            "course_name": "The Spoken Word",
            "description": "ARTS-UG 1585 The Spoken Word",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1590",
            "course_name": "Sound Writing/ Text as Score",
            "description": "ARTS-UG 1590 Sound Writing/ Text as Score",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1603",
            "course_name": "",
            "description": "ARTS-UG 1603\n\n   Mapping as a Spatial, Political, and Environmental Practice\n\nThis arts workshop engages the practice of mapping as a cultural project with its attendant socio-political and environmental implications. The course looks critically at visual documentation of information, focusing on how our understanding of the environment is shaped by different maps and map-making protocols. All maps are tools and they all shape and challenge our understanding of space, place, and events. This arts workshop is conceived as a laboratory for the study and creation of maps. We will review the history of maps and map-making; create maps and diagrams for real-time events, whic...\n\n      more description for ARTS-UG 1603 »\n\n      \n\n\n\nThis arts workshop engages the practice of mapping as a cultural project with its attendant socio-political and environmental implications. The course looks critically at visual documentation of information, focusing on how our understanding of the environment is shaped by different maps and map-making protocols. All maps are tools and they all shape and challenge our understanding of space, place, and events. This arts workshop is conceived as a laboratory for the study and creation of maps. We will review the history of maps and map-making; create maps and diagrams for real-time events, which may include natural resource management, population migration, epidemics, weather, and public festivals. Authors may include Denis Cosgrove, Mark Monmonier, Michel de Certeau, James Corner, Peter Hall, Edward Tufte, Ginger Strand, Ingrid Gould Ellen, Nicholas Felton, and Matt Ridley. In a workshop format, this class will ask students to create graphic and written responses to the weekly readings. Digital design experience (familiarity with the Adobe Suite) is strongly suggested, but not required.\n\n      less description for ARTS-UG 1603 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1604",
            "course_name": "",
            "description": "ARTS-UG 1604\n\n   Indigenous Cinemas of Americas: Performing Self Representation Through Media\n\nThis course will study the ways that Indigenous peoples and independent Native artists in the Americas have turned to film, video, and digital arts to dispute ethnographic and Hollywood imagery, and create their own audiovisual media “from within.” We will explore notions of Third and Fourth cinema, self-representation and collective authorship, through specific authors and by developing our own media projects. We will discuss the roles of the cultural institutions that present this work through exhibitions, events, festivals, and publications. The course features guest lecturers and requires ...\n\n      more description for ARTS-UG 1604 »\n\n      \n\n\n\nThis course will study the ways that Indigenous peoples and independent Native artists in the Americas have turned to film, video, and digital arts to dispute ethnographic and Hollywood imagery, and create their own audiovisual media “from within.” We will explore notions of Third and Fourth cinema, self-representation and collective authorship, through specific authors and by developing our own media projects. We will discuss the roles of the cultural institutions that present this work through exhibitions, events, festivals, and publications. The course features guest lecturers and requires class viewing of films and videos that are otherwise unavailable on the market. Central readings may include Through Navajo Eyes: An Exploration in Film and Communication and Anthropology by Sol Worth and John Adair, Wiping the War Paint Off the Lens: Native American Film and Video by Beverly Singer, and Global Indigenous Media: Cultures, Poetics and Politics edited by Pamela Wilson and Michelle Stewart. Films will include works by Victor Masayesva, Jr. (Hopi), Dante Cerano (Purepecha), Zacharias Kunuk (Inuit), and works from the Video in the Villages project in Brazil.\n\n      less description for ARTS-UG 1604 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1605",
            "course_name": "Visionary Concepts in Film",
            "description": "ARTS-UG 1605 Visionary Concepts in Film",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1606",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17143",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 303 with Cristiani, Pedro09/02/2015 - 12/15/2015 Thu 6.20 PM - 7.35 PM at 194M 303",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Cristiani, Pedro"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1606\n\n   The Search for Cinematic Storytelling Identity\n\nThis arts workshop explores the question of identity through the cinematic expressions of different cultures, while guiding the participants to create and develop their own visual storytelling journey. Students will be introduced to the practical stages of an independent digital production, and will generate, as a final project for the course, a one-minute short film that represents their unique storytelling identity, translating their personal point of view into a coherent narrative experience. These narrative tools will emerge from the first part of the course, which focuses on the analysis ...\n\n      more description for ARTS-UG 1606 »\n\n      \n\n\n\nThis arts workshop explores the question of identity through the cinematic expressions of different cultures, while guiding the participants to create and develop their own visual storytelling journey. Students will be introduced to the practical stages of an independent digital production, and will generate, as a final project for the course, a one-minute short film that represents their unique storytelling identity, translating their personal point of view into a coherent narrative experience. These narrative tools will emerge from the first part of the course, which focuses on the analysis of short and feature film productions from Asian, European, and Latin American directors. In considering these global examples, we will study the approach to storytelling through the influences of texts of faith, and social and cultural identities. In-class screenings will include In the Mood for Love [2000, Wong Kar Wai, Honk Kong], Padre Padrone [1977, Paolo e Vittorio Taviani, Italy] , Wings of Desire [1987, Wim Wenders, Germany], Moebius [1997, Gustavo Mosquera, Argentina], Amores Perros [2000, Alejandro Iñarritú, Mexico], Talk to Her [2002, Pedro Almodóvar, Spain], Le fabuleux destin d'Amélie Poulain [2001, Jean-Pierre Jeunet, France], The Descendants [2011, Alexander Payne, USA], and Stoker [2013, Chan-Wook Park, USA].\n\n      less description for ARTS-UG 1606 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1607",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17337",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC7",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Cordova, Amalia"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1607\n\n   Indigenous Media Arts:  Who has the Right to Tell Whose Stories?\n\nHow do indigenous filmmakers challenge the politics of representation? Who has the right to tell whose stories? What is the role of curators and exhibition spaces in engaging with and presenting these voices and visions?  This course will study the ways that independent and Indigenous artist collectives in the Americas have turned to media arts to dispute ethnographic and Hollywood imagery, and create their own audiovisual media “from within.” We will explore notions of “imperfect” cinema, visual sovereignty and “video indígena” (Indigenous video) through specific authors and by developing our...\n\n      more description for ARTS-UG 1607 »\n\n      \n\n\n\nHow do indigenous filmmakers challenge the politics of representation? Who has the right to tell whose stories? What is the role of curators and exhibition spaces in engaging with and presenting these voices and visions?  This course will study the ways that independent and Indigenous artist collectives in the Americas have turned to media arts to dispute ethnographic and Hollywood imagery, and create their own audiovisual media “from within.” We will explore notions of “imperfect” cinema, visual sovereignty and “video indígena” (Indigenous video) through specific authors and by developing our own media projects. We will also discuss the roles of the cultural institutions that present this work through exhibitions, and festivals, including events taking place right in New York City.  The course features guest lecturers and requires class viewing of videos that are otherwise unavailable on the market. Central readings include Wiping the War Paint Off the Lens: Native American Film and Video by Beverly Singer, and Global Indigenous Media: Cultures, Poetics and Politics, edited by Pamela Wilson and Michelle Stewart. Films will include Reel Injun by Cree director Neil Diamond, Atanarjuat/The Fast Runner, by Zacharias Kunuk (Inuit), and works from the Video in the Villages project in Brazil.\n\n      less description for ARTS-UG 1607 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1608",
            "course_name": "",
            "description": "ARTS-UG 1608\n\n   Write! Shoot! Edit!\n\nIn this arts workshop, the class will work collaboratively to conceive and execute a short film from start to finish. The class focuses on the language of film, storytelling and production as well as the needs for collaboration, multi-tasking and creative problem solving inherent in the filmmaking process. Each student will take on multiple roles in each phase of the production. \nThe course will be broken up into three parts. The first section begins with a brainstorming session in which the themes and storylines of the movie are conceived. The script is then written, scenes workshopped and th...\n\n      more description for ARTS-UG 1608 »\n\n      \n\n\n\nIn this arts workshop, the class will work collaboratively to conceive and execute a short film from start to finish. The class focuses on the language of film, storytelling and production as well as the needs for collaboration, multi-tasking and creative problem solving inherent in the filmmaking process. Each student will take on multiple roles in each phase of the production. \nThe course will be broken up into three parts. The first section begins with a brainstorming session in which the themes and storylines of the movie are conceived. The script is then written, scenes workshopped and the group prepares to shoot. The second section is the shoot, with roles divided between camera, direction, acting, producing, art direction, and the rest. The final section is the edit and post-production. This will include score, sound design, titles and graphics. On the path to the final movie skills such as writing, acting, cinematography, producing, editing, title design, score, will all be utilized according the needs of the movie and the demands of the group.\n\n      less description for ARTS-UG 1608 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1609",
            "course_name": "",
            "description": "ARTS-UG 1609\n\n   Video: History, Theory, Practice\n\nThis course investigates video as an artistic medium, a tool of surveillant culture, and a means for everyday witnessing, watching, documenting, remembering, and giving oneself to be seen. We will begin by tracing the invention of the medium from the mid-1950s, and the subsequent effect on both artists and non-artists as video technology became more commonplace and affordable in the 1970s. We will consider the history of video art, from William Wegman, Vito Acconci, Gary Hill, and Linda Benglis, to Bill Viola, Eija-Liisa Ahtila, and Walid Raad, among many others. Examining the history of video...\n\n      more description for ARTS-UG 1609 »\n\n      \n\n\n\nThis course investigates video as an artistic medium, a tool of surveillant culture, and a means for everyday witnessing, watching, documenting, remembering, and giving oneself to be seen. We will begin by tracing the invention of the medium from the mid-1950s, and the subsequent effect on both artists and non-artists as video technology became more commonplace and affordable in the 1970s. We will consider the history of video art, from William Wegman, Vito Acconci, Gary Hill, and Linda Benglis, to Bill Viola, Eija-Liisa Ahtila, and Walid Raad, among many others. Examining the history of video as an art form will require that we make sense of the interaction between artistic and non-artistic uses of the medium, as well as the ways in which artists do the work of representing important aspects of life in the visual field as such technological innovations as video have transformed that experience. What does video offer as a mode of representation that other mediums do not? Are there things that video does particularly well? Conversely, what are the blind spots of the medium? While all students will write critical papers as well as produce short video projects, students are asked to elect to enroll in one of two course code options; Option 1 (Video as Interdisciplinary Seminar, wherein major work completed is of the written type) or Option 2 (Video as Arts Workshop, wherein major work completed is artwork/ video projects). All students meet together regardless of Option elected, and all students are also required to attend weekly screenings of videos in addition to regular course meeting hours.\n\n      less description for ARTS-UG 1609 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1610",
            "course_name": "Video Production: First person,  present tense",
            "description": "ARTS-UG 1610 Video Production: First person,  present tense",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1612",
            "course_name": "",
            "description": "ARTS-UG 1612\n\n   Video Production: First Person, Present Tense\n\nThis arts workshop focuses on video production at the intersection of narrative fiction and documentary, memoir, and experimental film.  The class will challenge the students to mine their own surroundings and experiences to find stories that move and challenge them or those around them and then create a visual document that expresses the issues of personal interest within it. Once the theme has been chosen the following challenge will be to find the most appropriate end for the work: internet, film festival, art gallery, iPhone or public space, for example.  As part of the class, instruction ...\n\n      more description for ARTS-UG 1612 »\n\n      \n\n\n\nThis arts workshop focuses on video production at the intersection of narrative fiction and documentary, memoir, and experimental film.  The class will challenge the students to mine their own surroundings and experiences to find stories that move and challenge them or those around them and then create a visual document that expresses the issues of personal interest within it. Once the theme has been chosen the following challenge will be to find the most appropriate end for the work: internet, film festival, art gallery, iPhone or public space, for example.  As part of the class, instruction will be given on editing software and basic issues with sound and the camera. The participants will also be challenged to work with the people, budgets and means at their immediate disposal: camera phone, web cam, surveillance tape, etc.\n\n      less description for ARTS-UG 1612 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1613",
            "course_name": "",
            "description": "ARTS-UG 1613\n\n   Design and Visual Ecology\n\nDesign & Visual Ecology introduces students to the vocabulary and process of two-dimensional design, and themes of visual communication as framed through environmental history, rhetoric, and representation. The class structure, combining a seminar and a digital design lab, includes short lectures, discussions, design workshops, and student-led presentations. Topics to be covered in seminar include romantic landscape painting, nature photography, ecology illustration, eco campaign graphics, politics of image, diagramming and information graphics. In the design lab, students will gain fluency wi...\n\n      more description for ARTS-UG 1613 »\n\n      \n\n\n\nDesign & Visual Ecology introduces students to the vocabulary and process of two-dimensional design, and themes of visual communication as framed through environmental history, rhetoric, and representation. The class structure, combining a seminar and a digital design lab, includes short lectures, discussions, design workshops, and student-led presentations. Topics to be covered in seminar include romantic landscape painting, nature photography, ecology illustration, eco campaign graphics, politics of image, diagramming and information graphics. In the design lab, students will gain fluency with Adobe Creative Suite programs, including Photoshop and Illustrator, and have hands-on work with elements and principles of design, including line, shape, value, color, and type, organizational systems of composition, hierarchy, and layout. Students will learn to identify and articulate the principles of design in their work and the work of others. Ultimately, the course serves as a practical study of visual ideas through the lens of environmental studies. Previous digital design experience is helpful but not required.\n\n      less description for ARTS-UG 1613 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1614",
            "course_name": "",
            "description": "ARTS-UG 1614\n\n   Architecture and Urban Design Lab II\n\nThis advanced architectural design lab engages students in the research and design processes most often found in architecture and urban design studio classes. The lab looks broadly at contemporary challenges, including resource management, human and non-human habitation, as well as political and social pressures on the environment. As a project-based course, students work individually and in teams and combine original research to create relevant and compelling design proposals. Introductory design exercises prepare students for an intense focus on a current problem in an established or emergin...\n\n      more description for ARTS-UG 1614 »\n\n      \n\n\n\nThis advanced architectural design lab engages students in the research and design processes most often found in architecture and urban design studio classes. The lab looks broadly at contemporary challenges, including resource management, human and non-human habitation, as well as political and social pressures on the environment. As a project-based course, students work individually and in teams and combine original research to create relevant and compelling design proposals. Introductory design exercises prepare students for an intense focus on a current problem in an established or emerging urban environment. Students are expected to present their ideas through the use of diagrams, scale models, video, animations, and other forms of imaging. Thus, as they create and develop original design proposals, students experiment with a variety of techniques and forms of representation. Research skills and visual literacy will be prioritized. Authors may include Stephen Johnson, William McDonough, Richard Sennett, Geoff Manaugh, Ricky Burdett, Eric Klinenberg, James Corner, Peder Anker, Tyler Volk and others. Proficiency in the AdobeSuite CS5 or CS6 is required.\n\n      less description for ARTS-UG 1614 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1615",
            "course_name": "Designing for Stage & Screen",
            "description": "ARTS-UG 1615 Designing for Stage & Screen",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1616",
            "course_name": "",
            "description": "ARTS-UG 1616\n\n   Green Design\n\nThis workshop aims to impart skills and theories essential to intelligent green design, an environmentally sensitive practice applicable to all products, materials, and buildings.  Students will complete a sequence of assignments starting with a survey of ecological methods that will lead to the discovery of significant intentions in eco-design. Each student will generate a journal of diagrams, schemes, and ideas to investigate fundamental considerations such as food, water, air, waste, technology, ecology, energy, form, context, and light.  A subsequent workshop project will be the design of ...\n\n      more description for ARTS-UG 1616 »\n\n      \n\n\n\nThis workshop aims to impart skills and theories essential to intelligent green design, an environmentally sensitive practice applicable to all products, materials, and buildings.  Students will complete a sequence of assignments starting with a survey of ecological methods that will lead to the discovery of significant intentions in eco-design. Each student will generate a journal of diagrams, schemes, and ideas to investigate fundamental considerations such as food, water, air, waste, technology, ecology, energy, form, context, and light.  A subsequent workshop project will be the design of an environmental entity or scheme for the near future based on a predefined anti-anthropocentric agenda and the students’ own green conceptual framework. Class reviews will discuss intricate propositions such as eco-effectiveness, social value, meaning of nature, life-cycle, function, economy, and policy. Other design/communication issues will be analyzed as well, including balance, aesthetics, modularity, assembly, and fabrication. Students will be expected to present their ideas in mock-ups, scaled models, schematics, lifestyle drawings, and other forms of imaging. Thus, as they create and develop their own original design proposals, students will experiment with a variety of techniques and forms of representation including collage, sketches, advertisements, film, prints, signage, photography, or other pictorial aids. The final project will be individually based on each student’s abilities and scholarly pursuit.  Prior knowledge of computer design tools is suggested, but not required.\n\n      less description for ARTS-UG 1616 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1617",
            "course_name": "",
            "description": "ARTS-UG 1617\n\n   Architecture and Urban Design Lab I & II\n\nThis workshop and design lab aims to impart skills and theories essential to intelligent green design, an socio-ecological practice applicable to all materials, buildings, and infrastructure systems.  The course will look broadly at types of inhabitation, including hives, webs, nests, and lodges; houses, housing, cities, and regions; and extreme environments including emergency shelters and outer-space habitats. Our objectives are grounded in understanding the architectural consequences of socially responsible and community based endeavors in urban areas.  As a project-based course, students w...\n\n      more description for ARTS-UG 1617 »\n\n      \n\n\n\nThis workshop and design lab aims to impart skills and theories essential to intelligent green design, an socio-ecological practice applicable to all materials, buildings, and infrastructure systems.  The course will look broadly at types of inhabitation, including hives, webs, nests, and lodges; houses, housing, cities, and regions; and extreme environments including emergency shelters and outer-space habitats. Our objectives are grounded in understanding the architectural consequences of socially responsible and community based endeavors in urban areas.  As a project-based course, students will work individually and in teams and will combine original research with design proposals. Intellectual design exercises in the beginning of the semester will prepare students for an intense focus on a current  problem facing New York City.  Students will be expected to present their ideas in mock-ups, scaled models, schematics, lifestyle drawings, and other forms of imaging. Thus, as they create and develop their own original design proposals, students will experiment with a variety of techniques and forms of representation. Authors may include Stephen Johnson, William McDonough, Witold Rybczinksi, Constance Adams, Ricky Burdett, Keller Easterling, Peter Hall, William Mitchell, Keith Critchlow, Ernst Haeckl, James Corner, Victor Papanek, Stan Allen, Kate Orff and others.  Students must partake in both courses (Architecture and Urban Design Lab I and II) during the Spring semester.\n\n      less description for ARTS-UG 1617 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1618",
            "course_name": "Cinematic Environments",
            "description": "ARTS-UG 1618 Cinematic Environments",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1619",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12554",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 432 with Joachim, Mitchell W09/02/2015 - 12/15/2015 Mon 3.30 PM - 4.45 PM at 1WP 432",
                    "time": "Mon 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Joachim, Mitchell W"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1619\n\n   Architecture and Urban Design Lab I\n\nThis workshop and design lab aims to impart skills and theories essential to intelligent green design, an socio-ecological practice applicable to all materials, buildings, and infrastructure systems. The course will look broadly at types of inhabitation, including hives, webs, nests, and lodges; houses, housing, cities, and regions; and extreme environments including emergency shelters and outer-space habitats. Our objectives are grounded in understanding the architectural consequences of socially responsible and community based endeavors in urban areas. As a project-based course, students wil...\n\n      more description for ARTS-UG 1619 »\n\n      \n\n\n\nThis workshop and design lab aims to impart skills and theories essential to intelligent green design, an socio-ecological practice applicable to all materials, buildings, and infrastructure systems. The course will look broadly at types of inhabitation, including hives, webs, nests, and lodges; houses, housing, cities, and regions; and extreme environments including emergency shelters and outer-space habitats. Our objectives are grounded in understanding the architectural consequences of socially responsible and community based endeavors in urban areas. As a project-based course, students will work individually and in teams and will combine original research with design proposals. Intellectual design exercises in the beginning of the semester will prepare students for an intense focus on a current problem facing New York City. Students will be expected to present their ideas in mock-ups, scaled models, schematics, lifestyle drawings, and other forms of imaging. Thus, as they create and develop their own original design proposals, students will experiment with a variety of techniques and forms of representation. Authors may include William J. Mitchell, Mohsen Mostafavi, Alex Krieger, Elizabeth Diller, Michelle Addington, William McDonough, Ricky Burdett, Sanford Kwinter, Ernst Haeckl, James Corner, Victor Papanek, Stan Allen, Charles Waldheim and others.\n\n      less description for ARTS-UG 1619 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1620",
            "course_name": "",
            "description": "ARTS-UG 1620\n\n   Designing Future City\n\nThe 20th century city was transformed by several technological eras. The Machine Age, Automobile Age, Space Age, and Information Age were among the most important trends. Each innovation inspired new urban visions, such as Howard’s Garden City, Wright’s Broadacre City, Archigram’s Instant City, and Fuller’s Domed Manhattan. Films like Blade Runner and Metropolis provided critical visions of culture and environment.  Though none of these designs produced real roadmaps for the future, each contained interesting ideas. In the 21st century, architects and planners entered a new Environmental Era t...\n\n      more description for ARTS-UG 1620 »\n\n      \n\n\n\nThe 20th century city was transformed by several technological eras. The Machine Age, Automobile Age, Space Age, and Information Age were among the most important trends. Each innovation inspired new urban visions, such as Howard’s Garden City, Wright’s Broadacre City, Archigram’s Instant City, and Fuller’s Domed Manhattan. Films like Blade Runner and Metropolis provided critical visions of culture and environment.  Though none of these designs produced real roadmaps for the future, each contained interesting ideas. In the 21st century, architects and planners entered a new Environmental Era that introduced concepts like green design and planning, recycling and alternative energy to support sustainable development. This workshop explores new techniques of green architecture and planning through films, readings and lectures on cities worldwide.  Using New York as a prototype, it also examines the evolution of urban transportation, land use, and social and environmental planning. Students develop several types of projects, such as the design of a green structure, the planning analysis of a park or neighborhood in maps and diagrams, and a photographic essay on an urban issue. No experience is necessary, but students will need drawing tools and a camera.\n\n      less description for ARTS-UG 1620 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1621",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12553",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 432",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Goodman, Donna"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1621\n\n   Architectural Design and Drawing\n\nThis workshop introduces the basic process of creating an architectural design. It begins with an analysis of a building by an established architect. Through diagrams and drawings, issues of form, function, concept, and environment are presented. Visual systems of axis and proportions are also explored, as well as the use of light, color, materials, structure, and historical references. Students learn the visual language of architecture by drafting plans, sections, elevations, and renderings. In the second project, students design a loft space. They begin by creating a concept and program. Pla...\n\n      more description for ARTS-UG 1621 »\n\n      \n\n\n\nThis workshop introduces the basic process of creating an architectural design. It begins with an analysis of a building by an established architect. Through diagrams and drawings, issues of form, function, concept, and environment are presented. Visual systems of axis and proportions are also explored, as well as the use of light, color, materials, structure, and historical references. Students learn the visual language of architecture by drafting plans, sections, elevations, and renderings. In the second project, students design a loft space. They begin by creating a concept and program. Planning issues, such as function, circulation and spatial organization are discussed, as well as methods for evaluating a project. Designs are developed through perspectives and isometric images made in Sketchup or hand drawings. Films, lectures, and texts on design theory provide additional insights. Drafting experience is useful, but not required.\n\n      less description for ARTS-UG 1621 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1622",
            "course_name": "Environmental Thinking: Green Architecture",
            "description": "ARTS-UG 1622 Environmental Thinking: Green Architecture",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1623",
            "course_name": "",
            "description": "ARTS-UG 1623\n\n   Green Design and Planning\n\nIn recent decades, architects and planners have faced a new set of challenges. The world population has tripled in less than a century. Demand for food, water, housing, energy, products, and services has grown at an even faster pace. In response to these issues, the design professions have created new concepts for green architecture, sustainable cities, alternative infrastructure and products. They've also introduced new laws and environmental standards. This course presents green design and planning concepts through readings, discussions, lectures, films, and projects. Students write a short ...\n\n      more description for ARTS-UG 1623 »\n\n      \n\n\n\nIn recent decades, architects and planners have faced a new set of challenges. The world population has tripled in less than a century. Demand for food, water, housing, energy, products, and services has grown at an even faster pace. In response to these issues, the design professions have created new concepts for green architecture, sustainable cities, alternative infrastructure and products. They've also introduced new laws and environmental standards. This course presents green design and planning concepts through readings, discussions, lectures, films, and projects. Students write a short paper and create three design projects. The papers examine issues such as energy, transportation, recycling, planning, and design. The projects include design of a recycled product, planning of a roof terrace or small green building, and analysis of an urban park or neighborhood. The projects are developed through maps, photographs, computer diagrams, and architectural drawings.\n\n      less description for ARTS-UG 1623 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1624",
            "course_name": "Advanced Architectural Design and Drawing",
            "description": "ARTS-UG 1624 Advanced Architectural Design and Drawing",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1625",
            "course_name": "",
            "description": "ARTS-UG 1625\n\n   Electronic Arts\n\nDigital media and new methods of visual communication affect how we work, play, see our environment and ourselves. With digital media we can build images and edit graphics easily and effectively. Painting and imaging programs form flexible and powerful tools for constructing imagery that lead to new ways of creating work, new design criteria, and new aesthetics. When computer imaging is combined with interactivity, and distribution such as CD, DVD, and the Internet, the result is interactive multimedia. This project based studio course, designed for beginning to intermediate students, explores...\n\n      more description for ARTS-UG 1625 »\n\n      \n\n\n\nDigital media and new methods of visual communication affect how we work, play, see our environment and ourselves. With digital media we can build images and edit graphics easily and effectively. Painting and imaging programs form flexible and powerful tools for constructing imagery that lead to new ways of creating work, new design criteria, and new aesthetics. When computer imaging is combined with interactivity, and distribution such as CD, DVD, and the Internet, the result is interactive multimedia. This project based studio course, designed for beginning to intermediate students, explores ways of constructing images and interactivity. In the computer lab, we focus on methods of creating digital media and art, including painting programs, digital image editing, authoring interactivity and time-based work. Critiques of individual student work, readings, and discussion will examine the evolving formal criteria, aesthetics and social implications of this work. Readings include selections from Paul Klee?s Pedagogical Sketchbook. We will visit exhibits of digital work, on-line and at New York City's art spaces.\n\n      less description for ARTS-UG 1625 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1626",
            "course_name": "",
            "description": "ARTS-UG 1626\n\n   Good Design: Scale\n\nThe principles of what is considered “good design” are unique to each design discipline. And yet, by territorializing the design professions, we fail to provide a shared dialogue to engage a wider discussion that extends to the public realm. The Museum of Modern Art in New York institutionalized its support for mid-century design artifacts, through its curated Good Design shows in the early 1950s. Through those shows and the newly developed \"gift shops,\" American consumers came to appreciate contemporary design of furniture, cheese slicers, textiles, and \"branded\" storage containers, like Tupp...\n\n      more description for ARTS-UG 1626 »\n\n      \n\n\n\nThe principles of what is considered “good design” are unique to each design discipline. And yet, by territorializing the design professions, we fail to provide a shared dialogue to engage a wider discussion that extends to the public realm. The Museum of Modern Art in New York institutionalized its support for mid-century design artifacts, through its curated Good Design shows in the early 1950s. Through those shows and the newly developed \"gift shops,\" American consumers came to appreciate contemporary design of furniture, cheese slicers, textiles, and \"branded\" storage containers, like Tupperware. But, by focusing on domestic objects and consumption, it can be argued that the opportunity for a larger discourse on the value of good design for towns, cities, and regions was lost. This workshop engages and evaluates the tools and processes that are used to design objects as well as buildings and landscapes. Projects increase in scale throughout the term, as students design a thing they can hold (an object), something that can hold them (clothing, furniture), and a space they might inhabit (a room, a house). As a project-based course, students will work individually and in teams. Digital design experience is helpful but not required.\n\n      less description for ARTS-UG 1626 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1627",
            "course_name": "Good Design: Habitation",
            "description": "ARTS-UG 1627 Good Design: Habitation",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1628",
            "course_name": "Pixels and Bits",
            "description": "ARTS-UG 1628 Pixels and Bits",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1629",
            "course_name": "Interfaces",
            "description": "ARTS-UG 1629 Interfaces",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1630",
            "course_name": "Visual Intermedia",
            "description": "ARTS-UG 1630 Visual Intermedia",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1631",
            "course_name": "",
            "description": "ARTS-UG 1631\n\n   Sustainable New York\n\nNew York is one of the most prominent cities in the world, and yet, like most major cities, it’s struggling with the challenge of creating systems capable of sustaining 21st century growth. In recent years, the city has improved its infrastructure, public transportation, recycling programs, architecture, parks, and public spaces, but there are still many social and environmental services that are unable to meet the demand.  Using New York as a prototype, this workshop explores the evolution of urban environmental planning concepts and the issues that remain a challenge for the future. The cour...\n\n      more description for ARTS-UG 1631 »\n\n      \n\n\n\nNew York is one of the most prominent cities in the world, and yet, like most major cities, it’s struggling with the challenge of creating systems capable of sustaining 21st century growth. In recent years, the city has improved its infrastructure, public transportation, recycling programs, architecture, parks, and public spaces, but there are still many social and environmental services that are unable to meet the demand.  Using New York as a prototype, this workshop explores the evolution of urban environmental planning concepts and the issues that remain a challenge for the future. The course begins with a history of 19th and 20th century transitions, and then examines current strategies and concepts for the future. Through films, readings, lectures, and projects, students are introduced to the design and planning process. Assignments include such projects as: design of a recycled product; planning analysis of a public site, and design of a small green building. No design experience is necessary, but students will need drawing tools, a laptop, and a camera.\n\n      less description for ARTS-UG 1631 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1635",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12317",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 501",
                    "time": "Fri 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Allen, Cynthia"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1635\n\n   Digital Art and New Media\n\nThis workshop seeks to bring students from varying backgrounds together to engage in evaluating and developing digital new media for the Internet and other new media art installations. The Internet makes possible a powerful new kind of student-centered, constructivist learning by collecting at a single site a phenomenal array of learning and creative resources that can be explored with simple point-and-click skills: photos, text, animation, audio and film materials. Emerging new media technologies allow cross-development and implementation to the Internet. Each student brings to the class a se...\n\n      more description for ARTS-UG 1635 »\n\n      \n\n\n\nThis workshop seeks to bring students from varying backgrounds together to engage in evaluating and developing digital new media for the Internet and other new media art installations. The Internet makes possible a powerful new kind of student-centered, constructivist learning by collecting at a single site a phenomenal array of learning and creative resources that can be explored with simple point-and-click skills: photos, text, animation, audio and film materials. Emerging new media technologies allow cross-development and implementation to the Internet. Each student brings to the class a set of experiences and skills, such as research, writing, design, film, music, photography, computer gaming, performance, illustration, computer literacy, software knowledge or Internet experience. Through lectures, including a survey of digital new media currently on the Internet, group discussions, field trips and workshops, focusing on their personal skills, students will develop individual projects. The workshop will deconstruct innovative new media instillations, inventions, computer games, film, that use digital new media, as well as discuss concepts, content strategies, and frameworks that bridge theory and practice. Class projects, readings, writings, and Blog journal-keeping are essential components of this course. Students are encouraged to supply their own media.\n\n      less description for ARTS-UG 1635 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1640",
            "course_name": "Ecological Art",
            "description": "ARTS-UG 1640 Ecological Art",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1645",
            "course_name": "",
            "description": "ARTS-UG 1645\n\n   Actvating Art\n\nA gorilla suit that promotes feminist discourse, textiles that raise awareness about the disappeared in Chile, superheroes that fight for immigration rights – these are just some of the tactics used by artists to directly change society. Activating Art explores the political potential of aesthetic production, offering students a history of the diverse methodologies used to fuse symbolic imaginaries to social and ethical struggles.  The role of the artist in society is critically interrogated and examined in local and global contexts from the late twentieth century through the contemporary peri...\n\n      more description for ARTS-UG 1645 »\n\n      \n\n\n\nA gorilla suit that promotes feminist discourse, textiles that raise awareness about the disappeared in Chile, superheroes that fight for immigration rights – these are just some of the tactics used by artists to directly change society. Activating Art explores the political potential of aesthetic production, offering students a history of the diverse methodologies used to fuse symbolic imaginaries to social and ethical struggles.  The role of the artist in society is critically interrogated and examined in local and global contexts from the late twentieth century through the contemporary period.  Diverse social movements and struggles will be explored in relation to their accompanying aesthetics, theories and tactics of resistance.  Key concepts include cultural agency, social sculpture, participatory dissent, interventionism, and political performance.  In 2012 we will dedicate a special section of the course to the creation of an activist forum for critical “border-thinking,” what Gloria Anzaldúa has called a means of “changing the way we perceive reality, the way we see ourselves, and the ways we behave,”  using an interdisciplinary framework that amply explores the politics of border-making, border-enforcement, and border-trespassing. Class requirements include comprehensive research projects and may include field trips to relevant sites/exhibitions. Studio assignments encourage individual and group experimentation across diverse media, with projects in creative writing, performance, and new media. Operating as a workshop in praxis, students are asked to critically engage history, theory and research as they brainstorm and attempt to change the world.  Some artists and theorists explored in this class include: Gloria Anzaldúa, Donna Haraway, Chela Sandoval, Guillermo Gómez Peña, Nicholas de Genova, Sandy Stone, Regina José Galindo, Dr. Lakra, Arjun Appadurai, Superbarrio Gomez, Rosalinda Fregoso, Cherrie Moraga, Eva Hayward.\n\n      less description for ARTS-UG 1645 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1646",
            "course_name": "",
            "description": "ARTS-UG 1646\n\n   Storytelling, Digital, Games\n\nVisual storytelling is not new, with sophisticated communication through imagery pre-dating written language based on alphabets. We create pictures with words and construct associative narratives with images. Music and sound affect our emotions, trigger memories, provoke thought. Performative works immerse us in multisensory experience that evokes and affects our memories, concepts, actions. At their best, digital games and interactive media incorporate elements of all of these.  The course proposes to explore the relationship among narratives, digital media, and games, including critical revi...\n\n      more description for ARTS-UG 1646 »\n\n      \n\n\n\nVisual storytelling is not new, with sophisticated communication through imagery pre-dating written language based on alphabets. We create pictures with words and construct associative narratives with images. Music and sound affect our emotions, trigger memories, provoke thought. Performative works immerse us in multisensory experience that evokes and affects our memories, concepts, actions. At their best, digital games and interactive media incorporate elements of all of these.  The course proposes to explore the relationship among narratives, digital media, and games, including critical review of examples from popular culture and the arts, exploration of theory, and the development of practice. Students will create digital projects incorporating narrative elements using digital media and games technology.  These will draw upon a range of digital narratives (web-based stories, interactive stories, hypertext, and narrative computer games) and visual storytelling (film, video, drawing/painting, graphics, cartoons, and interactive video games). The focus will be on artistic and narrative elements rather than commercial aspects of interactive gaming, paying particular attention to the participants’ exploration and experience of the work.\n\n      less description for ARTS-UG 1646 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1647",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12565",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "LSTC MACLB",
                    "time": "Wed 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Skelton, Carl"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1647\n\n   Making Virtual Sense: 3D Graphic Studio for Critically-Driven Creative Applications\n\nUntil recently, the creation of interactive 3D graphics was only possible for large and capital-intensive uses: the armed forces, large-scale architectural/engineering work, mass entertainment. Now, open-source applications and powerful personal and portable computers are making it practical for individuals and small groups to independently build and share alternative visions. Whether you are interested in exploring new ways to construct complex networks of ideas in the present, or to imagine physical spaces to reflect and support new ways of life, this arts workshop provides a blend of critic...\n\n      more description for ARTS-UG 1647 »\n\n      \n\n\n\nUntil recently, the creation of interactive 3D graphics was only possible for large and capital-intensive uses: the armed forces, large-scale architectural/engineering work, mass entertainment. Now, open-source applications and powerful personal and portable computers are making it practical for individuals and small groups to independently build and share alternative visions. Whether you are interested in exploring new ways to construct complex networks of ideas in the present, or to imagine physical spaces to reflect and support new ways of life, this arts workshop provides a blend of critical orientation and hands-on experience. In this open project studio, the majority of course time and work will be taken up with the development of student-built individual or small team concepts, to be developed as 3D graphic \"fly-through\" models. Theoretical discussions will be initiated with a mix of relevant writings and media. Here is a representative sampling of sources: Douglas Engelbart, Eric Raymond, William Gibson, Zaha Hadid, Judith Donath, the Athenian Acropolis, the Kalachakra mandala, Salisbury Cathedral, the Schindler house, Artigas gardens, the 1958 World's fair Philips pavilion, the Seagram's building, Grant Theft Auto IV, the monastery of La Tourette, the Mangin plan, compendium.org, Betaville.\n\n      less description for ARTS-UG 1647 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1648",
            "course_name": "Interdisciplinary Undergraduate Proj in Studio Art: Building an activist Knowledgebase",
            "description": "ARTS-UG 1648 Interdisciplinary Undergraduate Proj in Studio Art: Building an activist Knowledgebase",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1650",
            "course_name": "Performance On The Page",
            "description": "ARTS-UG 1650 Performance On The Page",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1652",
            "course_name": "",
            "description": "ARTS-UG 1652\n\n   Creating a Magazine: From Inspiration to Prototype\n\nA crazy-quilt of high and low culture, magazines—whether printed or rendered digitally—are one of our most potent forms of cultural commerce, a striking mix of content and form, covering everything from politics, fashion, and celebrity to performing and visual arts, technology, crafts, and the environment. No matter the topic, design has become an increasingly crucial editorial element. It sets one publication apart from the next, and at its best unifies the content and instantly telegraphs to the reader where it figures in the media landscape. In this workshop we will explore this rapidly cha...\n\n      more description for ARTS-UG 1652 »\n\n      \n\n\n\nA crazy-quilt of high and low culture, magazines—whether printed or rendered digitally—are one of our most potent forms of cultural commerce, a striking mix of content and form, covering everything from politics, fashion, and celebrity to performing and visual arts, technology, crafts, and the environment. No matter the topic, design has become an increasingly crucial editorial element. It sets one publication apart from the next, and at its best unifies the content and instantly telegraphs to the reader where it figures in the media landscape. In this workshop we will explore this rapidly changing world. We will discuss notions of good vs. bad design, engaging vs. dull content. And, through the development of in-class publications, will put into practice the many aspects that contribute to a magazine's creation, from initial concept to the realization of a prototype. Directed readings (including \"I Wonder\" and \"The Best American Magazine Writing 2011\"), fieldtrips, and visits from magazine professionals will contribute to our discussion.\n\n      less description for ARTS-UG 1652 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1653",
            "course_name": "",
            "description": "ARTS-UG 1653\n\n   Creating a Magazine: A Multimedia Approach\n\nThis pair of collaborative courses will enact Gallatin’s multidisciplinary, self-directed approach to learning, as students explore the potential of magazines as catalysts, cultural barometers, alternative communities, and forums for debate and new ideas. Through the discussion of critical texts about the history of publication, the analysis of various historical and contemporary magazines, and the development of new publications, students will learn to communicate ideas through design, editorial, and medium-specific approaches; analyze and question the features of the codex, the page, and the...\n\n      more description for ARTS-UG 1653 »\n\n      \n\n\n\nThis pair of collaborative courses will enact Gallatin’s multidisciplinary, self-directed approach to learning, as students explore the potential of magazines as catalysts, cultural barometers, alternative communities, and forums for debate and new ideas. Through the discussion of critical texts about the history of publication, the analysis of various historical and contemporary magazines, and the development of new publications, students will learn to communicate ideas through design, editorial, and medium-specific approaches; analyze and question the features of the codex, the page, and the screen; and play with how these features affect how we read and perceive art. In the advanced writing course, students will concentrate on writing and editing for multiple platforms. In the arts workshop, students will focus on print media and design. In addition, students in both classes will have the opportunity to commission and edit both written text and art works from one another. Each class will meet two times a week: once with its designated professor, and once as a collaborative lab with both classes and both professors. The lab will be devoted to the conception, development, and production of publications that will each include a 32-page print prototype and new media elements. Lab days will also enable students to meet with guest speakers from the worlds of publishing and design; and go on field trips to the offices of contemporary experimental magazines and relevant institutions and archives.\n\n      less description for ARTS-UG 1653 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1655",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12641",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 601",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Friedman, Lise"
                }
            ],
            "course_name": "",
            "description": "ARTS-UG 1655\n\n   Innovations in Arts Publications\n\nThe ever-inventive world of arts publications encompasses a dazzling range of subjects, mediums, and materials: from ancient illuminated manuscripts, political manifestos, and one-of-a-kind artists books to handmade zines, high-end glossies, poster and print multiples, CD and DVD covers, and the infinitely reproducible pages of the internet. This workshop will introduce and explore many of these forms through guest lecturers, field trips to specialized collections and museums, directed readings, and hands-on work, which will culminate in final group and individual projects. Readings may includ...\n\n      more description for ARTS-UG 1655 »\n\n      \n\n\n\nThe ever-inventive world of arts publications encompasses a dazzling range of subjects, mediums, and materials: from ancient illuminated manuscripts, political manifestos, and one-of-a-kind artists books to handmade zines, high-end glossies, poster and print multiples, CD and DVD covers, and the infinitely reproducible pages of the internet. This workshop will introduce and explore many of these forms through guest lecturers, field trips to specialized collections and museums, directed readings, and hands-on work, which will culminate in final group and individual projects. Readings may include New Master's of Poster Design: Poster Design for the Next Century, A History of Illuminated Manuscripts, Stylepedia: A Guide to Graphic Design Mannerisms, Quirks, and Conceits, and The Printed Picture.\n\n      less description for ARTS-UG 1655 «",
            "offering": true
        },
        {
            "course_id": "ARTS-UG 1656",
            "course_name": "",
            "description": "ARTS-UG 1656\n\n   Ideas in Action:Advanced Projects in Art Pub.\n\nWhat happens between the first inkling of an idea and its final outcome in published form? And how does what happens along the way affect the look and tone of the finished work? No matter the medium—it might be a CD cover, design for a matchbook, poster, theater program, artist’s book, shopping bag, or a continuously evolving new media platform—every sort of publication goes through a number of essential steps, each building and expanding upon the last until the desired results are achieved. Students in this advanced arts workshop will explore and apply critical thinking to each of these steps...\n\n      more description for ARTS-UG 1656 »\n\n      \n\n\n\nWhat happens between the first inkling of an idea and its final outcome in published form? And how does what happens along the way affect the look and tone of the finished work? No matter the medium—it might be a CD cover, design for a matchbook, poster, theater program, artist’s book, shopping bag, or a continuously evolving new media platform—every sort of publication goes through a number of essential steps, each building and expanding upon the last until the desired results are achieved. Students in this advanced arts workshop will explore and apply critical thinking to each of these steps through a combination of short-term and in-depth, semester-long projects (one of which will be to create a visual journal), guest lecturers, directed readings, and field trips, and in the process discover some of the many ways in which concepts might be investigated, clarified, and ultimately realized. Readings may include Sagmeister: Made You Look, Looking Closer 5, and Stop, Think, Go, Do: How Typography and Graphic Design Influence Behavior.\n\n      less description for ARTS-UG 1656 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1660",
            "course_name": "",
            "description": "ARTS-UG 1660\n\n   Magazine Dreams\n\nMagazines are a tantalizing mix of tradition and the new—exquisitely tuned reflections of where we are at a given moment (and frequently harbingers of what’s yet to occur) expressed through a mode of communication that took root in the eighteenth century. It’s this balance of convention and innovation that guarantees their endurance, whether manifested in print, online, or through an artful combination of the two.  In this arts workshop students will work together at an accelerated pace to conceive and produce an in-class magazine that reflects the students' interests and exposes them to the p...\n\n      more description for ARTS-UG 1660 »\n\n      \n\n\n\nMagazines are a tantalizing mix of tradition and the new—exquisitely tuned reflections of where we are at a given moment (and frequently harbingers of what’s yet to occur) expressed through a mode of communication that took root in the eighteenth century. It’s this balance of convention and innovation that guarantees their endurance, whether manifested in print, online, or through an artful combination of the two.  In this arts workshop students will work together at an accelerated pace to conceive and produce an in-class magazine that reflects the students' interests and exposes them to the process such an endeavor entails. The first part of the workshop will be devoted to brainstorming and roughing out themes and design and editorial ideas, the second to their execution, and the final to the actual production of the publication itself.\n\n      less description for ARTS-UG 1660 «",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1742",
            "course_name": "The Politics of Aid: Haiti, NGOs and the Developing World",
            "description": "ARTS-UG 1742 The Politics of Aid: Haiti, NGOs and the Developing World",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 1999",
            "course_name": "Creative Arts Team Drama in Education Prac",
            "description": "ARTS-UG 1999 Creative Arts Team Drama in Education Prac",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 2440",
            "course_name": "Public Atrs & Technology",
            "description": "ARTS-UG 2440 Public Atrs & Technology",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 9001",
            "course_name": "Architectural Design:Art Installation in Florence",
            "description": "ARTS-UG 9001 Architectural Design:Art Installation in Florence",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 9002",
            "course_name": "Exploring Space in Renaissance Florence",
            "description": "ARTS-UG 9002 Exploring Space in Renaissance Florence",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 9201",
            "course_name": "Twenty-First Century Theatremakers",
            "description": "ARTS-UG 9201 Twenty-First Century Theatremakers",
            "offering": false
        },
        {
            "course_id": "ARTS-UG 9202",
            "course_name": "Theater Production",
            "description": "ARTS-UG 9202 Theater Production",
            "offering": false
        }
    ]
}