{
    "major_id": "ARTS1-UC",
    "file": "./2015-2016/Arts_(ARTS1-UC).html",
    "courses": [
        {
            "course_id": "ARTS1-UC 5406",
            "course_name": "The Arts: Opera",
            "description": "ARTS1-UC 5406 The Arts: Opera \nAn introduction to the appreciation of opera, this course focuses on examples of the Italian, French and German operatic repertoire, and their culture function in their historical period. Students become familiar with the musical terminology, voice categories, general history, and visual production aspects particular to this art form.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5411",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17084",
                    "section": "001",
                    "period": "09/08/2015 - 11/03/2015",
                    "location": "SILV 620",
                    "time": "Tue 6.20 PM - 8.45 PM",
                    "open": true,
                    "professor": "Eisenstadt, Harris"
                }
            ],
            "course_name": "",
            "description": "ARTS1-UC 5411\n\n   The Arts: Jazz\n\nThis course fosters familiarity with the character, methods, objectives, major stylists, and cultural significance of jazz music as well as enhances the student's listening abilities and critical thinking skills. Renowned instrumentalists provide in-class demonstration. The course includes directed listening and viewing of jazz videos and attendance at jazz performances. Readings of current criticism and past reportage inform seminar-style classroom discussions of the aesthetic, musicological, socioeconomic, and political implications of jazz as well as the history and development of America's...\n\n      more description for ARTS1-UC 5411 »\n\n      \n\n\n\nThis course fosters familiarity with the character, methods, objectives, major stylists, and cultural significance of jazz music as well as enhances the student's listening abilities and critical thinking skills. Renowned instrumentalists provide in-class demonstration. The course includes directed listening and viewing of jazz videos and attendance at jazz performances. Readings of current criticism and past reportage inform seminar-style classroom discussions of the aesthetic, musicological, socioeconomic, and political implications of jazz as well as the history and development of America's indigenous modern art form. No previous experience with jazz is necessary, though students with advanced knowledge are also encouraged to register.\n\n      less description for ARTS1-UC 5411 «",
            "offering": true
        },
        {
            "course_id": "ARTS1-UC 5414",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9753",
                    "section": "001",
                    "period": "09/02/2015 - 11/04/2015",
                    "location": "12WV L114",
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Marshall, Karen"
                }
            ],
            "course_name": "The Arts:  Photography:  The World Through the Lens",
            "description": "ARTS1-UC 5414 The Arts:  Photography:  The World Through the Lens \nThis non-darkroom class explores the photograph's ability to convey ideas and tell stories. Weekly assignments enable students to become proficient image makers, developing a relationship to the world through the lens of their camera and becoming more visually aware. Students learn what makes a successful photograph by discussing and implementing aesthetic, technical, and editorial concepts.",
            "offering": true
        },
        {
            "course_id": "ARTS1-UC 5417",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9962",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "GCASL 274",
                    "time": "Tue 6.20 PM - 8.00 PM",
                    "open": true,
                    "professor": "Zwerling, Lisa"
                }
            ],
            "course_name": "The Arts: Drawing",
            "description": "ARTS1-UC 5417 The Arts: Drawing \nThis studio art course introduces students to a variety of drawing techniques involving pencil, ink, charcoal, and other drawing materials. Students also are encouraged to think about ways of seeing, and to consider how works of art can be used to express different forms of vision.",
            "offering": true
        },
        {
            "course_id": "ARTS1-UC 5418",
            "course_name": "The Arts: Landscape Drawing",
            "description": "ARTS1-UC 5418 The Arts: Landscape Drawing \nThis studio art course teaches students how to appreciate and draw the natural and man-made landscape of New York City. It places particular emphasis on the dynamic tensions between architecture and the city’s parks and open spaces.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5419",
            "course_name": "The Arts: The Nude",
            "description": "ARTS1-UC 5419 The Arts: The Nude",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5420",
            "course_name": "The Arts:  Writing About the Arts",
            "description": "ARTS1-UC 5420 The Arts:  Writing About the Arts \nArt, in every instance and every form, instigates response. Seeing a play, film, video, painting or sculpture, hearing music or story, reading a poem or novel we naturally reflect on what we've taken in, want to express our thoughts and/or test our analysis. Writing about the Arts is an overview and exploration of how to address in analytic and critical media what it is about a work of art, of fixed form or live performance, that one personally sees, hears, understands and reacts to, with reference to a heritage of arts criticism and contemporary practices in print and on the web.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5421",
            "course_name": "The Arts:  Roots of American Music",
            "description": "ARTS1-UC 5421 The Arts:  Roots of American Music \nThis course explores the historical and aesthetic bases of music styles established and developed in the United States. Topics range from Native American ritual to African-American music and from the Americanization of European classical music to the Jazz Age and the early recording industry.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5426",
            "course_name": "The Romantic Symphony",
            "description": "ARTS1-UC 5426 The Romantic Symphony",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5427",
            "course_name": "Midtown Architectural Landmarks",
            "description": "ARTS1-UC 5427 Midtown Architectural Landmarks \nThis course develops the student's visual understanding and appreciation of the special character of the architecture of New York City. The primary focus is on the past and current architectural styles found between Central Park South and 34th Street. Commercial, residential, and cultural landmarks are highlighted and discussed in depth.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5429",
            "course_name": "Portrait Drawing",
            "description": "ARTS1-UC 5429 Portrait Drawing",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5432",
            "course_name": "The Arts: Collage & Mixed Media",
            "description": "ARTS1-UC 5432 The Arts: Collage & Mixed Media \nThis studio art course teaches students how to appreciate the technical aspects of various media. It offers the student a hands-on approach to the study of artistic production. It covers the history and conceptualization of collage. No previous studio experience necessary.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5434",
            "course_name": "The Arts: Drawing, Expression,Space & Form",
            "description": "ARTS1-UC 5434 The Arts: Drawing, Expression,Space & Form \nThis course explores ways to articulate and build visual space through various conceptual uses of drawing. Techniques range from drawing the still life to abstraction.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5435",
            "course_name": "",
            "description": "ARTS1-UC 5435\n\n   The Arts: Fundamentals of Painting & Design\n\nThe focus of this course is to approach painting (pastel, watercolor, or acrylic) as individual expression, exploring personal style to enhance creativity and artistic expression. It explores fundamentals of painting and design, including subject matter, decision making, composition, color, and materials. The course discusses both realistic and abstract approaches through individual critique. Students may work from still life, photographs, or imagination in various media, such as charcoal, colored pencils, conte crayons, pastels, watercolor, and acrylic. The student is responsible for the choi...\n\n      more description for ARTS1-UC 5435 »\n\n      \n\n\n\nThe focus of this course is to approach painting (pastel, watercolor, or acrylic) as individual expression, exploring personal style to enhance creativity and artistic expression. It explores fundamentals of painting and design, including subject matter, decision making, composition, color, and materials. The course discusses both realistic and abstract approaches through individual critique. Students may work from still life, photographs, or imagination in various media, such as charcoal, colored pencils, conte crayons, pastels, watercolor, and acrylic. The student is responsible for the choice and handling of subject matter, project, and interpretation after individual consultation with the instructor. No prior art training necessary.\n\n      less description for ARTS1-UC 5435 «",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5438",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9755",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "SILV 620",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "King, John"
                }
            ],
            "course_name": "History of Music",
            "description": "ARTS1-UC 5438 History of Music \nThis course examines approximately 1000 years of Western music history, starting in medieval Europe and culminating in New York City today. Students learn to identify, articulate, and describe what they hear in genres ranging from chants to madrigals, opera to pop music.",
            "offering": true
        },
        {
            "course_id": "ARTS1-UC 5439",
            "course_name": "",
            "description": "ARTS1-UC 5439\n\n   The Arts:  The Blues\n\nThe course fosters familiarity with the character, methods, objectives, major stylists and culture significance of the blues as well as enhances listening abilities and critical thinking. There is directed listening and viewing of blues videos and attendance of blues performances. Students read current criticisms, reportage and oral histories to inform seminar-style classroom discussions of the aesthetic, musicological, socioeconomic and political implications, history, and development of America's bedrock folk form. No previous experience with the blues is required, though students with advan...\n\n      more description for ARTS1-UC 5439 »\n\n      \n\n\n\nThe course fosters familiarity with the character, methods, objectives, major stylists and culture significance of the blues as well as enhances listening abilities and critical thinking. There is directed listening and viewing of blues videos and attendance of blues performances. Students read current criticisms, reportage and oral histories to inform seminar-style classroom discussions of the aesthetic, musicological, socioeconomic and political implications, history, and development of America's bedrock folk form. No previous experience with the blues is required, though students with advanced knowledge are welcomed.\n\n      less description for ARTS1-UC 5439 «",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5440",
            "course_name": "",
            "description": "ARTS1-UC 5440\n\n   The Arts:  Rock, Soul, Salsa 1950-1980\n\nThe course provides an overview of and inquiry into American popular music as it evolved over 30 years of rapid change in all aspects of national and international artistic/political/economic culture, from the end of World War II to the \"new day\" promised by the presidency of Ronald Reagan. The focus on three inter-connected but distinctly defined vernacular and commercial genres affords perspectives to study links between personal expression/musical art in the United States and societal developments such as age, race and education-based demographics; national prosperity, stability, influence,...\n\n      more description for ARTS1-UC 5440 »\n\n      \n\n\n\nThe course provides an overview of and inquiry into American popular music as it evolved over 30 years of rapid change in all aspects of national and international artistic/political/economic culture, from the end of World War II to the \"new day\" promised by the presidency of Ronald Reagan. The focus on three inter-connected but distinctly defined vernacular and commercial genres affords perspectives to study links between personal expression/musical art in the United States and societal developments such as age, race and education-based demographics; national prosperity, stability, influence, upheaval and results, global communications, transportation, war and peace.\n\n      less description for ARTS1-UC 5440 «",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5445",
            "course_name": "The Arts:  Art Studio Techniques and Practices",
            "description": "ARTS1-UC 5445 The Arts:  Art Studio Techniques and Practices \nThe course involves students with the ideas, problems, and materials that form the artist's working milieu, exposing students to various art-making techniques that artists have employed in the past. Students experience the evolution of a work of art, as every artist encounters unexpected challenges: even the best planning cannot eliminate what some see as problems and others see as revelations.",
            "offering": false
        },
        {
            "course_id": "ARTS1-UC 5450",
            "course_name": "",
            "description": "ARTS1-UC 5450\n\n   The Arts: World Music\n\nThis course introduces students to world music concepts, highlighting both similarities and differences in the character, methods, objectives, major stylists, and functional significance of music in diverse cultures. Coursework enhances listening abilities and critical thinking. The course includes directed listening, video viewing, and performance attendance. Selected readings and in-class demonstrations by expert musicians inform seminar-style discussions of the aesthetic, musicological, socioeconomic and political implications, history, and development of music originating outside North Ame...\n\n      more description for ARTS1-UC 5450 »\n\n      \n\n\n\nThis course introduces students to world music concepts, highlighting both similarities and differences in the character, methods, objectives, major stylists, and functional significance of music in diverse cultures. Coursework enhances listening abilities and critical thinking. The course includes directed listening, video viewing, and performance attendance. Selected readings and in-class demonstrations by expert musicians inform seminar-style discussions of the aesthetic, musicological, socioeconomic and political implications, history, and development of music originating outside North America as well as their  manifestations in the U.S. No previous experience with music is required, though students with advanced knowledge are welcomed.\n\n      less description for ARTS1-UC 5450 «",
            "offering": false
        }
    ]
}