{
    "major_id": "AHUM-GE",
    "file": "./2015-2016/Arts_&_Humanities_Education_(AHUM-GE).html",
    "courses": [
        {
            "course_id": "AHUM-GE 2015",
            "course_name": "Response Theory & Arts",
            "description": "AHUM-GE 2015 Response Theory & Arts \nAn exploration of the various theoretical formulations of the reader-viewer?s role in the construction of meaning, including those of Rosenblatt, Fish, Culler, Eco, & Iser. This course also invites participants to respond to selected works of literature & art & to come to understand their own critical assumptions & processes.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2016",
            "course_name": "Problems in Critical Theory",
            "description": "AHUM-GE 2016 Problems in Critical Theory \nAn examination of critical practices, principles, & problems in the various arts, as reflected in major theoretical texts & in representative works drawn from literature, film, the visual arts, music, & dance. Topics explored include the roles of criticism; the challenge of evaluation; art as moral educator; art & sexual politics; canonical criticism & the problem of popularity; the multiculturalism & its discontents.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2033",
            "course_name": "Growth Through Response to Lit & Arts",
            "description": "AHUM-GE 2033 Growth Through Response to Lit & Arts \nExamines how direct experience with literature & the other arts contributes to the learner's growth & insight into self, the present world, & the past world out of which the present has evolved. The nature of the arts as communication processes is the focus of attention throughout.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2043",
            "course_name": "Evaluating Learning in The Humanities",
            "description": "AHUM-GE 2043 Evaluating Learning in The Humanities",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2093",
            "course_name": "Values in Lit and Arts",
            "description": "AHUM-GE 2093 Values in Lit and Arts \nA culture's value system is regarding as superior by that culture's members because it is rarely, if ever, challenged, questioned, or even seen. Values are ways of thinking about the world, or orienting oneself to it. They are, therefore, mental programs that govern specific choices. This course concentrates on selected writers & artists whose work embody identifiable traces of particular values & their behavioral/visual manifestations.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2096",
            "course_name": "East Philosophies in Western Lit.",
            "description": "AHUM-GE 2096 East Philosophies in Western Lit. \nA study of the influences on & parallels between Eastern philosophies & selected literary texts with emphasis on the resulting ambiguities. Special attention to Buddhism, Hinduism, Confucianism, & Taoism & their influence on Yeats, Pound, Eliot, Brecht, Hesse, Forster, Goethe, & Malraux.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2124",
            "course_name": "Literature and The Arts: Existential",
            "description": "AHUM-GE 2124 Literature and The Arts: Existential \nAn investigation of the impact of Existential philosophy on French literature, music, visual arts & film in the period following World War II. Attention is paid to the relevant works of Sartre, Camus, & de Beauvoir, as well as to the plays of the Theatre of the Absurd. Music Concrete, the sculpture of Giacometti & the films of French New Ware are also explored",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2131",
            "course_name": "Lit/Arts Traditn China",
            "description": "AHUM-GE 2131 Lit/Arts Traditn China \nAn examination of the traditional literature & art in China within the context of historical development of Chinese civilization, its philosophy, & institutions. Emphasis is placed on the understanding of aesthetic concepts & forms of art which have come to constitute the Chinese tradition & on the problems inherent in our efforts to comprehend them.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2132",
            "course_name": "Lit & The Arts: Cont Cli",
            "description": "AHUM-GE 2132 Lit & The Arts: Cont Cli",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2135",
            "course_name": "Lit & Art:Exper&Response",
            "description": "AHUM-GE 2135 Lit & Art:Exper&Response \nInvites participants to respond to selected works of literature, film, music, & the visual arts. The aim is to foster insight into the nature of the aesthetic experience & to develop basic approaches, vocabulary, & techniques for its description, interpretation, & evaluation. Students are particularly encouraged to examine their own assumptions & processes & to apply various theoretical formulations of the reader?s, viewers & listener?s role to their explorations.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2144",
            "course_name": "The Arts & Culture",
            "description": "AHUM-GE 2144 The Arts & Culture \nAn examination of how the arts shape, & are shaped by, their surrounding culture. The nature of this interplay is studied not only theoretically, but with a concrete, historical focus on the culture of modernism & on select visual, cinematic, & literary works. Particular attention is given to the implications of this interplay for contemporary education.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2203",
            "course_name": "Creative Writing",
            "description": "AHUM-GE 2203 Creative Writing \nStudents are encouraged to examine creative processes through their own writing & the writing of others. The course investigates strategies & methods employed in the teaching of imaginative writing. Appropriate for students in all arts areas who are working on specific projects, including scenarios & scripts.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2248",
            "course_name": "Creative Experiences in Related Arts II",
            "description": "AHUM-GE 2248 Creative Experiences in Related Arts II",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2300",
            "course_name": "Ind Study",
            "description": "AHUM-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2391",
            "course_name": "The Film Experience",
            "description": "AHUM-GE 2391 The Film Experience \nA graduate introductory course aimed at exploring the dynamics of film art & acquainting the student with a sampling of the wide range of possible approaches currently being applied to analyze & evaluate the film experience. Stressing the role of the viewer in shaping the cinematic text, the course considers the interpretive problems posed to the viewer by the distinctive nature of the medium & its complex sign-systems, by various types & genres of films, by norms particular to various cultures, & by the techniques & underlying assumptions of selected film theories.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2392",
            "course_name": "Approaches to Int'L Film",
            "description": "AHUM-GE 2392 Approaches to Int'L Film \nConcentrating on sociological & psychological approaches to film, this course looks at some of the significant ways in which the relationships between film & society may be examined - e.g. through genre & their historical contexts; by applying the vantage point of feminism - illustrating these approaches with the screening & discussion of selected film classics.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2401",
            "course_name": "Point of View & The Arts",
            "description": "AHUM-GE 2401 Point of View & The Arts \nA comparative analysis of narrative point of view in fiction & visual perspective in painting. Fictional texts cover 19th century omniscient narration through 20th-century interior monologue; the visual component begins with French realism & moves through postimpressionism. Develops an awareness of the relationships between the writer/painter, the story/painting, & the reader/viewer.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2410",
            "course_name": "Literature & Art: Contemporary America",
            "description": "AHUM-GE 2410 Literature & Art: Contemporary America \nAn inquiry into the distinguishing characteristics of literature & the arts in contemporary America with particular emphasis on technology & its role in the creation of new aesthetic strategies & new aesthetic forms.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2411",
            "course_name": "Lit and Arts: Brazil",
            "description": "AHUM-GE 2411 Lit and Arts: Brazil \nAn investigation of the interrelationships of history, politics, & general culture with literature, film, music, dance & the visual arts during the period of military dictatorship (1964-79) - an era providing a particularly rich opportunity for exploring the impact of social upheaval & political repression on the arts. The course includes English-language lectures by distinguished Brazilian faculty, as well as field trips to museums, theaters, & other significant cultural sites, as well as screenings of seminal films of the period.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2412",
            "course_name": "Lit and Arts:Paris",
            "description": "AHUM-GE 2412 Lit and Arts:Paris",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2413",
            "course_name": "Lit and Arts:Moscow",
            "description": "AHUM-GE 2413 Lit and Arts:Moscow",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2414",
            "course_name": "",
            "description": "AHUM-GE 2414\n\n   Lit and Arts:Prague\n\nAn exploration of history, culture & the arts in Czechoslovakia during the 1960s- those years of political & aesthetic innovation which led to the Prague Spring of 1968 & the infamous Soviet invasion that followed. Readings include such ground-breaking novels as Milan Kundera's \"The Unbearable Lightness of Being\", such politically charged plays as those of Vaclav Havel, while the brilliant cinema of the Czech New Wave & selected works of musicians, painters, & photographers are also explored. The course includes English-language lectures by distinguished Czech faculty as well as field trips to...\n\n      more description for AHUM-GE 2414 »\n\n      \n\n\n\nAn exploration of history, culture & the arts in Czechoslovakia during the 1960s- those years of political & aesthetic innovation which led to the Prague Spring of 1968 & the infamous Soviet invasion that followed. Readings include such ground-breaking novels as Milan Kundera's \"The Unbearable Lightness of Being\", such politically charged plays as those of Vaclav Havel, while the brilliant cinema of the Czech New Wave & selected works of musicians, painters, & photographers are also explored. The course includes English-language lectures by distinguished Czech faculty as well as field trips to museums, theaters, & other important sites.\n\n      less description for AHUM-GE 2414 «",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2503",
            "course_name": "Writing Criticism",
            "description": "AHUM-GE 2503 Writing Criticism \nAn intensive workshop course which invites students to analyze & evaluate various art forms from a variety of critical perspectives (e.g., academic, journalistic). The aim is to have each member of the class produce a potentially publishable critical article in a field of his or her own choosing - literature, film, theater, the visual arts, music, television, dance.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2513",
            "course_name": "Illusion & Reality: Rhet. of Literature",
            "description": "AHUM-GE 2513 Illusion & Reality: Rhet. of Literature \nAn examination of the interrelationships between the reader's notion of reality & the illusory world that results from numerous rhetorical & technical resources available to the author. Special attention to the works of Edith Wharton, Willa Cather, Flannery O'Connor, Frank O'Connor, Shirley Jackson, & J. D. Salinger.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2523",
            "course_name": "Fiction and Film",
            "description": "AHUM-GE 2523 Fiction and Film \nPlacing particular emphasis on the similarities & distinctions in the transaction between reader & text on the one hand & viewer & the film on the other, this graduate level humanities course invites the student to engage in a series of comparative analyses of selected literary works & their film adaptations. Topics to be covered include: modes of storytelling (showing vs. telling; narration vs. dramatization); space & time in fiction, film, & theatre; literary & cinematic metaphor; point of view in fiction & film; style & tone in verbal & visual narrative.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2533",
            "course_name": "Point of View in The Arts",
            "description": "AHUM-GE 2533 Point of View in The Arts \nAn exploration of the ways in which various artists have documented their personal life experiences & creative processes in the literary, visual, & performing arts. Students will be guided to create an autobiographical work of their own choice., Various theoretical readings will also be included.",
            "offering": false
        },
        {
            "course_id": "AHUM-GE 2561",
            "course_name": "Tchg Lit&Arts from Political Perspective",
            "description": "AHUM-GE 2561 Tchg Lit&Arts from Political Perspective \nAn examination of the effect on literature & the arts (film, drama, painting, music) of the political awareness of both creator & responder. Some topics considered are: literature, the arts, & ideology; literature, arts the state; mass art/mass audience: the arts & propaganda. Special emphasis is given to the application of this viewpoint to teaching strategies & the development of curricula.",
            "offering": false
        }
    ]
}