{
    "major_id": "ARCS-GE",
    "file": "./2015-2016/Costume_Studies_(ARCS-GE).html",
    "courses": [
        {
            "course_id": "ARCS-GE 2012",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4073",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 508",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Deihl, Nancy"
                }
            ],
            "course_name": "Literature & Methodology of Costume Studies",
            "description": "ARCS-GE 2012 Literature & Methodology of Costume Studies \nAn introduction to the foundation literature of costume studies. Through library sessions and assignments, students are trained in research methodologies, including the interpretation of artifacts, the use of visual and literary sources, and the role of museum and gallery exhibitions in furthering scholarship in this field. The course requires written work in diverse formats as well as image based presentations that prepare students for subsequent coursework.",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2022",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4074",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 402C",
                    "time": "Mon 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Deihl, Nancy"
                }
            ],
            "course_name": "Research in Costume Studies",
            "description": "ARCS-GE 2022 Research in Costume Studies \nThis course provides guidance on theory and methodology in preparation for the thesis/final project. Students are required to define the subject of their thesis/final project research clearly, and share their work in progress in discussions and presentations. Class meetings take place every other week. By the end of the semester, students will have completed their thesis outlines.",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2047",
            "course_name": "American Decorative Arts",
            "description": "ARCS-GE 2047 American Decorative Arts \nEmphasizes formal and aesthetic developments in furniture, ceramics, metalwork, textiles and glass in the 19th and 20th centuries.  An examination of American decorative art in relation to social, political and cultural events in American and decorative arts in Europe and Asia.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2061",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4075",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 502",
                    "time": "Fri 9.30 AM - 12.00 PM",
                    "open": true,
                    "professor": "Morano, Elizabeth"
                }
            ],
            "course_name": "History of Costume 1500 - 1804",
            "description": "ARCS-GE 2061 History of Costume 1500 - 1804 \nSurvey traces the evolution of Western urban fashion from the expansion of mercantile capitalism in the 16th century through the rise of consumer culture by the end of the 18th century. Focusing on France as the undisputed leader of style, students consider a variety of topics including clothing as a signifier of status and morality; the mechanics of the clothing and textile trades and the impact of technological innovations; the influence of stylistic trends and personalities; and the politicization of dress during the French Revolution.",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2062",
            "course_name": "",
            "description": "ARCS-GE 2062\n\n   History of Costume: The 19th Century\n\nFocuses on the costume of the 19th century, a period of striking political, economic and social change. Beginning with the establishment of the Consulate of 1799 and ending with the 1900 Paris Exposition, students examine the evolving masculine and feminine silhouettes as well as the interrelationship of clothing and culture. Topics include luxury dress as part of Napoleon's imperial agenda, the dandy in England and France, the rise of the middle class and the proliferation of fashion periodicals and etiquette manuals, the establishment of the couture and the rise of the department store, dres...\n\n      more description for ARCS-GE 2062 »\n\n      \n\n\n\nFocuses on the costume of the 19th century, a period of striking political, economic and social change. Beginning with the establishment of the Consulate of 1799 and ending with the 1900 Paris Exposition, students examine the evolving masculine and feminine silhouettes as well as the interrelationship of clothing and culture. Topics include luxury dress as part of Napoleon's imperial agenda, the dandy in England and France, the rise of the middle class and the proliferation of fashion periodicals and etiquette manuals, the establishment of the couture and the rise of the department store, dress reform and aesthetic dress in England and America.\n\n      less description for ARCS-GE 2062 «",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2063",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4076",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 502",
                    "time": "Thu 10.00 AM - 12.30 PM",
                    "open": true,
                    "professor": "Cole, Daniel"
                }
            ],
            "course_name": "History of Costume: The 20th Century",
            "description": "ARCS-GE 2063 History of Costume: The 20th Century \nStudents will examine the evolution of fashionable western clothing from 1900-1988, investigating high style as well as mainstream fashion, changing materials and silhouette, and the interplay between fashion and the arts. Access to available primary materials including museum objects, periodicals, designer archives and film is emphasized, as the class explores the dynamics of dress in the international culture of the 20th Century through lectures, readings and discussion, and visits to museum collections.",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2064",
            "course_name": "History of Costume: Contemporary Dress",
            "description": "ARCS-GE 2064 History of Costume: Contemporary Dress \nBegins with a consideration of fashion at the end of the 20th century and its importance in contemporary society. Diverse issues are explored including: the fashion designed in the cult of celebrity, globalism in production and consumption, the emergence of Asia as a fashion center, the changing relationship of fashion and subculture, sustainability and anti-fashion. Using approaches evolved from material culture and visual culture studies, fashion's economic, artistic and cultural status is analyzed via the media, fashion presentations, apparel pieces, film and the fine arts.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2069",
            "course_name": "Costume Conservation and Display",
            "description": "ARCS-GE 2069 Costume Conservation and Display \nWith a focus on preparing students for professional experience. Costume Conservation offers a consideration of the place of costume in the museum environment. Special attention is devoted to the handling and display of costume, textile and related objects. The course provides an introduction to the materials and methods of conservation, storage, and interpretation, and addresses appropriate actions in the museum context.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2077",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4121",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 307",
                    "time": "Wed 2.00 PM - 4.30 PM",
                    "open": true,
                    "professor": "Deihl, Nancy"
                }
            ],
            "course_name": "",
            "description": "ARCS-GE 2077\n\n   History of Textiles Ancient World Thru 1700\n\nSignificant developments in the style, technology and function of textiles from Antiquity through the 17th century. The understanding and appreciation of fabrics, their historical significance, and their importance as indicators of status and wealth is examined through surviving evidence as well as representations in the other arts and literature. Emphasis is placed on the European context, while including the impact of cultural exchanges, primarily with the East and Asia. The main fabric categories covered are pattern-woven silks, tapestry, carpets, embroidery, lace, and printed/painted fabri...\n\n      more description for ARCS-GE 2077 »\n\n      \n\n\n\nSignificant developments in the style, technology and function of textiles from Antiquity through the 17th century. The understanding and appreciation of fabrics, their historical significance, and their importance as indicators of status and wealth is examined through surviving evidence as well as representations in the other arts and literature. Emphasis is placed on the European context, while including the impact of cultural exchanges, primarily with the East and Asia. The main fabric categories covered are pattern-woven silks, tapestry, carpets, embroidery, lace, and printed/painted fabrics.\n\n      less description for ARCS-GE 2077 «",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2078",
            "course_name": "History of Textiles: The Modern Era",
            "description": "ARCS-GE 2078 History of Textiles: The Modern Era \nExamines the style, technology and function of textiles from the eighteenth to the twentieth century. Instructor uses original examples from the textile study collections of the Metropolitan Museum of Art, as well as representations in the other arts and literature. Students will acquire identification skills and a mastery of the terminology of historic textiles and their production. Includes object examination sessions at the Ratti Textile Center at the Metropolitan Museum as well as other New York museum collections.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2080",
            "course_name": "The Care,Conservation & Restoration of Textiles",
            "description": "ARCS-GE 2080 The Care,Conservation & Restoration of Textiles \nFocuses on the skills required for the proper handling, conservation, and restoration of works of art.  Field trips.  Lectures by conservators and restorers in textiles.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2085",
            "course_name": "Costume as Art",
            "description": "ARCS-GE 2085 Costume as Art \nAssignments, critiques, and demonstrations related to the specific level on which the course is being taken,  A practical survey of the evolution of clothing forms from simple geometric shapes to more complicated constructed garments.  Both Western and nonwestern traditions are considered.  Studio course.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2100",
            "course_name": "Design and Culture: The 18th Century",
            "description": "ARCS-GE 2100 Design and Culture: The 18th Century \nExamines European and American decorative arts of the 18th century and their place in society and idealized beauty, virtue and the pursuit of happiness. The relationship to architecture, painting, sculpture and literature is explored through lectures, readings, and discussion, and during visits to significant museum and gallery exhibitions. Topics to be considered include the hierarchy of genres, The Grand Tour, the decorative arts in the eighteenth century novel, the origins and evolution of Neo-Classicism, and the roots of Romanticism.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2101",
            "course_name": "",
            "description": "ARCS-GE 2101\n\n   Design and Culture; The 19th Century\n\nExamines the history of the 19th century decorative arts emphasizing the formal and aesthetic developments in furniture, ceramics, metalwork, textiles and glass. Each of these areas will be discussed in relation to contemporary art and architecture, and interiors. Social, political and cultural events will concentrate on European and American design while exploring the influence of non-Western cultures. Discussions and lectures address the use of part styles for inspiration, the impact of the machine and changing technologies, the relationship between the decorative arts and architecture, the ...\n\n      more description for ARCS-GE 2101 »\n\n      \n\n\n\nExamines the history of the 19th century decorative arts emphasizing the formal and aesthetic developments in furniture, ceramics, metalwork, textiles and glass. Each of these areas will be discussed in relation to contemporary art and architecture, and interiors. Social, political and cultural events will concentrate on European and American design while exploring the influence of non-Western cultures. Discussions and lectures address the use of part styles for inspiration, the impact of the machine and changing technologies, the relationship between the decorative arts and architecture, the changing nature of patronage, and the quest for the 'total work of art'.\n\n      less description for ARCS-GE 2101 «",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2102",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4727",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 508",
                    "time": "Tue 4.55 PM - 6.25 PM",
                    "open": true,
                    "professor": "Marcus, Elizabeth"
                }
            ],
            "course_name": "",
            "description": "ARCS-GE 2102\n\n   Design and Culture: The 20th Century\n\nExamines the material culture of the 20th century with special emphasis on design, architecture and the decorative arts. Students address how design is shaped by politics, nationalism, idealism, and the commercial needs of community. The course also explores the machine and technology as defining forces in modern design and addresses such issues as the quest for the 'total work of art', the influence of taste makers, consultant designers and decorators on design, and the changing nature of patronage in the 20th century. The course concentrates on American, European, Russian and Scandinavian de...\n\n      more description for ARCS-GE 2102 »\n\n      \n\n\n\nExamines the material culture of the 20th century with special emphasis on design, architecture and the decorative arts. Students address how design is shaped by politics, nationalism, idealism, and the commercial needs of community. The course also explores the machine and technology as defining forces in modern design and addresses such issues as the quest for the 'total work of art', the influence of taste makers, consultant designers and decorators on design, and the changing nature of patronage in the 20th century. The course concentrates on American, European, Russian and Scandinavian design while exploring the influence of nonwestern cultures.\n\n      less description for ARCS-GE 2102 «",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2300",
            "course_name": "Independent Study",
            "description": "ARCS-GE 2300 Independent Study",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2301",
            "course_name": "Final Project in Costume Studies",
            "description": "ARCS-GE 2301 Final Project in Costume Studies \nThis course is conducted through a series of individual meetings as students complete their final project",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2302",
            "course_name": "Internship in Costume Studies",
            "description": "ARCS-GE 2302 Internship in Costume Studies \nIndividual positions with major artists, notable museums, distinguished galleries, art publishers, and art organizations. Internships should be arranged during the term before interning.",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2910",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4077",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 402",
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Jenkins, Tracy A"
                }
            ],
            "course_name": "Graduate Projects in Costume Studies",
            "description": "ARCS-GE 2910 Graduate Projects in Costume Studies \nA classroom or praxis based course, focusing on current issues in studio art or the art professions. Topics examine a broad range of art and visual culture foci, with an emphasis on new approaches to both subject material and pedagogical methods.",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2911",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4598",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BARN 502",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Marcus, Elizabeth"
                }
            ],
            "course_name": "History of Fashion Photo",
            "description": "ARCS-GE 2911 History of Fashion Photo \nTraces the development of fashion photography in relation to contemporary fashion, aesthetic influence, photographic styles and techniques, cultural customs and commercial needs. Fashion photography is more than a medium dedicated to commerce: it is a record of artistic movements, ideals of beauty, and social trends. The course begins in the early 20th century with the growth of periodicals devoted to fashion and continues through the work of the present day.",
            "offering": true
        },
        {
            "course_id": "ARCS-GE 2912",
            "course_name": "",
            "description": "ARCS-GE 2912\n\n   Contemporary Design Culture\n\nDesign permeates every aspect of contemporary life fromt he cell phones we talk on, to the chairs we sit on and the i-pods we listen to.  Virtually everything that exists is designed. Why and how does design play such an important role in society? This seminar examines the expanding role of contemporary design beginning with the post World War II era, with an emphasis on how design shapes current consumer culture and how consumer culture conversely shapes design. The course will analyze contemporary design in the context of architecture, interiors and the decorative arts, products, graphics, f...\n\n      more description for ARCS-GE 2912 »\n\n      \n\n\n\nDesign permeates every aspect of contemporary life fromt he cell phones we talk on, to the chairs we sit on and the i-pods we listen to.  Virtually everything that exists is designed. Why and how does design play such an important role in society? This seminar examines the expanding role of contemporary design beginning with the post World War II era, with an emphasis on how design shapes current consumer culture and how consumer culture conversely shapes design. The course will analyze contemporary design in the context of architecture, interiors and the decorative arts, products, graphics, fashion, and interactive media.\n\n      less description for ARCS-GE 2912 «",
            "offering": false
        },
        {
            "course_id": "ARCS-GE 2913",
            "course_name": "Dress and Textiles in World Culture",
            "description": "ARCS-GE 2913 Dress and Textiles in World Culture",
            "offering": false
        }
    ]
}