{
    "major_id": "CCCF-SHU",
    "file": "./2015-2016/Cultural_Foundations_(CCCF-SHU).html",
    "courses": [
        {
            "course_id": "CCCF-SHU 101",
            "course_name": "",
            "description": "CCCF-SHU  101\n\n   Global Perspectives on Culture I\n\nThe first of a two-semester course that examines ten problems regarding the ways in which humans imagine and represent, for themselves and for others, their relation to their worlds—the environment they inhabit, the communities they form a part of, the groups with which they communicate.  Three questions will orient students’ consideration of these problems.\n•\tWhat does it mean to “represent” something to someone?\n•\tWhat is the social function of what we represent to others?\n•\tWhy, how, and with what consequences do we interpret and respond affectively to (enjoy, detest, feel moved by, beco...\n\n      more description for CCCF-SHU  101 »\n\n      \n\n\n\nThe first of a two-semester course that examines ten problems regarding the ways in which humans imagine and represent, for themselves and for others, their relation to their worlds—the environment they inhabit, the communities they form a part of, the groups with which they communicate.  Three questions will orient students’ consideration of these problems.\n•\tWhat does it mean to “represent” something to someone?\n•\tWhat is the social function of what we represent to others?\n•\tWhy, how, and with what consequences do we interpret and respond affectively to (enjoy, detest, feel moved by, become angered at) what is represented for us, or what we represent for someone else?\n\n      less description for CCCF-SHU  101 «",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 101",
            "course_name": "W Global Perspectives on Culture - Workshop",
            "description": "CCCF-SHU  101W Global Perspectives on Culture - Workshop",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19134",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Carroll, Bruce",
                    "time": "Tue,Thu 9.45 AM - 11.00 AM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "19135",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Carroll, Bruce",
                    "time": "Tue,Thu 1.45 PM - 3.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "19136",
                    "section": "003",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Carroll, Bruce",
                    "time": "Tue,Thu 3.15 PM - 4.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "W1",
            "description": "CCCF-SHU  101W1\n\n   Perspectives on Humanities: Beyond Nature\n\nThe most recent developments in eco-criticism see a fatal flaw in our predominant conception of nature—as pure, beautiful, and grand—arguing that it alienates us from the very thing we wish to protect, and doing so, only ensures continued environmental degradation. The corrective is an expressly 21st century mode of ecological seeing and questioning that allows us to reconceive of ourselves and the world as beyond nature. But because the idea of nature remains so central to our understanding of ethics, law, human sexuality, psychology and personhood, and artistic representation, we must ask wh...\n\n      more description for CCCF-SHU  101W1 »\n\n      \n\n\n\nThe most recent developments in eco-criticism see a fatal flaw in our predominant conception of nature—as pure, beautiful, and grand—arguing that it alienates us from the very thing we wish to protect, and doing so, only ensures continued environmental degradation. The corrective is an expressly 21st century mode of ecological seeing and questioning that allows us to reconceive of ourselves and the world as beyond nature. But because the idea of nature remains so central to our understanding of ethics, law, human sexuality, psychology and personhood, and artistic representation, we must ask what implications the new ecology might have for our understanding of these features of culture. In this course we survey the positions of the new ecology, and then apply these methods of critique to examples of society, self, and art (throughout intellectual history up to the present). This application will both reveal how central nature is to our ideological understanding of culture and deconstruct our notion of the natural world.  This course will extend writing skills and concepts learned in GPS Writing Workshop, focusing on critical theory, research, and academic writing and expression in the humanities.  The primary assignments will be analytical essays and a digital expressions project.\n\n      less description for CCCF-SHU  101W1 «",
            "offering": true
        },
        {
            "course_id": "CCCF-SHU 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19139",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Chen, Lin",
                    "time": "Mon,Wed 2.45 PM - 4.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "19140",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Chen, Lin",
                    "time": "Mon,Wed 9.45 AM - 11.00 AM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "19142",
                    "section": "003",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Chen, Lin",
                    "time": "Mon,Wed 11.15 AM - 12.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "W2",
            "description": "CCCF-SHU  101W2\n\n   Perspectives on Humanities: Encounters with the Literary Hero\n\nAlthough the 19th century idea of historically significant “great men” or heroes has long fallen into disfavor, there is no denying that the idea of the heroic has been a staple component of our literary legacy, be it of the East, West, or anywhere else in the world.  In this Perspectives on Humanities course, we will explore the historical evolution--especially in the Western tradition-- of the hero both as a person of distinguished courage or ability, admired for his brave deeds and noble qualities, and as the central protagonist in a work of literature around whom the plot generally revolve...\n\n      more description for CCCF-SHU  101W2 »\n\n      \n\n\n\nAlthough the 19th century idea of historically significant “great men” or heroes has long fallen into disfavor, there is no denying that the idea of the heroic has been a staple component of our literary legacy, be it of the East, West, or anywhere else in the world.  In this Perspectives on Humanities course, we will explore the historical evolution--especially in the Western tradition-- of the hero both as a person of distinguished courage or ability, admired for his brave deeds and noble qualities, and as the central protagonist in a work of literature around whom the plot generally revolves. We will examine a great variety of literary heroes as they relate to their fictional worlds and to the literary genres they inhabit: the epic hero, the tragic hero, the Shakespearean hero, the female hero, the comic hero, the antihero, etc. In reading and discussing these primary sources, we also will discuss different critical approaches to the study of literature from traditional historical philology, comparative mythology, and psychoanalysis, to structuralism, formalism, and genre studies.  This course will extend writing skills and concepts learned in GPS Writing Workshop, focusing on critical theory, research, and academic writing and expression in the humanities.  The primary assignments will be analytical essays.\n\n      less description for CCCF-SHU  101W2 «",
            "offering": true
        },
        {
            "course_id": "CCCF-SHU 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19143",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Goldman, Amy",
                    "time": "Tue,Thu 8.15 AM - 9.30 AM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "19144",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Goldman, Amy",
                    "time": "Tue,Thu 9.45 AM - 11.00 AM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "W3",
            "description": "CCCF-SHU  101W3\n\n   Perspectives on Humanities: Tales of Gender and Power\n\nThis course will explore how human relationships are impacted by the expression, exercise, and experience of power. Special attention will be given (but not limited) to the primary family constellation, i.e. father-mother-son-daughter, and the lover-spouse alliance. Gender figures significantly in the relational dynamics among the above players--voluntarily, consciously or not—profoundly impacting the individual and groups. While our main objective is to gain a deeper, more complex understanding of the sometimes subtle yet potent play of power involved in the dynamics of gender relations, our ...\n\n      more description for CCCF-SHU  101W3 »\n\n      \n\n\n\nThis course will explore how human relationships are impacted by the expression, exercise, and experience of power. Special attention will be given (but not limited) to the primary family constellation, i.e. father-mother-son-daughter, and the lover-spouse alliance. Gender figures significantly in the relational dynamics among the above players--voluntarily, consciously or not—profoundly impacting the individual and groups. While our main objective is to gain a deeper, more complex understanding of the sometimes subtle yet potent play of power involved in the dynamics of gender relations, our examination of texts will also bring us close to other fundamental human issues, such as those relating to the “shadow” of the beast in human nature, the quest for knowledge (if not always wisdom), the uncertainties of identity and self, the creative need for love and community, the compulsive fear of/attraction to death, the longing for transformation and transcendence, among others. The course will draw on a range of literary texts (epic, novel, drama, etc.), products of visual culture, and forms of the expressive/performance arts to explore how each has chosen to articulate, animate and resolve the above human relationships. To gain perspective, we will apply a variety of critical lenses in our close readings of texts, including psychological and philosophical theorists such as Freud, Irigaray, Foucault and others.  This course will extend writing skills and concepts learned in GPS Writing Workshop, focusing on critical theory, research, and academic writing and expression in the humanities.  The primary assignments will be analytical essays and a digital expressions project.\n\n      less description for CCCF-SHU  101W3 «",
            "offering": true
        },
        {
            "course_id": "CCCF-SHU 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19145",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Rotaru, Arina",
                    "time": "Mon,Wed 9.45 AM - 11.00 AM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "19146",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Rotaru, Arina",
                    "time": "Mon,Wed 1.15 PM - 2.30 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "19147",
                    "section": "003",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Rotaru, Arina",
                    "time": "Mon,Wed 2.45 PM - 4.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "W4",
            "description": "CCCF-SHU  101W4\n\n   Perspectives on Humanities: Crossing World Boundaries\n\nHow does the experience of crossing borders and boundaries call our national identities into question? What happens to our personal identities when we cross cultural, linguistic, racial, gender, religious or ideological divides? This course prompts students to reflect on the personal, aesthetic, and political implications of crossing boundaries, build a critical vocabulary for defining modern and contemporary borders as cultural and geopolitical phenomena, and situate texts in global contexts. By applying theoretical perspectives from a wide range of disciplines, from anthropology and visual s...\n\n      more description for CCCF-SHU  101W4 »\n\n      \n\n\n\nHow does the experience of crossing borders and boundaries call our national identities into question? What happens to our personal identities when we cross cultural, linguistic, racial, gender, religious or ideological divides? This course prompts students to reflect on the personal, aesthetic, and political implications of crossing boundaries, build a critical vocabulary for defining modern and contemporary borders as cultural and geopolitical phenomena, and situate texts in global contexts. By applying theoretical perspectives from a wide range of disciplines, from anthropology and visual studies to feminism and postcolonial studies as well as critical studies of racism, we will reflect on our as well as others’ border-crossing experiences in literature, film, and other forms of expression such as social practice.   This course will extend writing skills and concepts learned in GPS Writing Workshop, focusing on critical theory, research, and academic writing and expression in the humanities.  The primary assignments will be analytical essays.\n\n      less description for CCCF-SHU  101W4 «",
            "offering": true
        },
        {
            "course_id": "CCCF-SHU 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19148",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Tomscha, Jennifer",
                    "time": "Tue,Thu 11.15 AM - 12.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "W5",
            "description": "CCCF-SHU  101W5\n\n   Perspectives On Humanities: Stories of the End Times  \n\nIn this course, we will explore the human apocalyptic imagination and its manifestations in sacred texts, in literature, and in film. We’ll read novels and watch films that portray apocalyptic devastation in methods both real and unreal. Texts may include excerpts from the sacred texts of religious traditions, McCarthy's The Road, Atwood's Oryx and Crake, Wells's The Time Machine, and Kolbert's The Sixth Extinction; films may include Kubrick's Dr. Strangelove and Park's Snowpiercer, among others. We'll consider the questions asked (and sometimes answered) by each story we examine: What are the...\n\n      more description for CCCF-SHU  101W5 »\n\n      \n\n\n\nIn this course, we will explore the human apocalyptic imagination and its manifestations in sacred texts, in literature, and in film. We’ll read novels and watch films that portray apocalyptic devastation in methods both real and unreal. Texts may include excerpts from the sacred texts of religious traditions, McCarthy's The Road, Atwood's Oryx and Crake, Wells's The Time Machine, and Kolbert's The Sixth Extinction; films may include Kubrick's Dr. Strangelove and Park's Snowpiercer, among others. We'll consider the questions asked (and sometimes answered) by each story we examine: What are their visions of human nature, historical progress, the relationship between humans and divine? What explicit or implicit assertions do these stories make about gender, race, and class? How can the apocalyptic be used as a method of persuasion? What do our stories of the end tell us about how we live now?  This course will extend writing skills and concepts learned in GPS Writing Workshop, focusing on critical theory, research, and academic writing and expression in the humanities.  The primary assignments will be analytical essays.\n\n      less description for CCCF-SHU  101W5 «",
            "offering": true
        },
        {
            "course_id": "CCCF-SHU 102",
            "course_name": "",
            "description": "CCCF-SHU  102\n\n   Global Perspectives on Culture II\n\nThe second of a two-semester course that examines ten problems regarding the ways in which humans imagine and represent, for themselves and for others, their relation to their worlds—the environment they inhabit, the communities they form a part of, the groups with which they communicate.  See CCCF-101 for the structure of the course.\n\nThe five central topics for spring are as follows:\n1.\tWhat is an animal to a human, and why?  (Comparative consideration of the boundaries different societies draw, in different media, at different times, between human animals and non-human animals; culture a...\n\n      more description for CCCF-SHU  102 »\n\n      \n\n\n\nThe second of a two-semester course that examines ten problems regarding the ways in which humans imagine and represent, for themselves and for others, their relation to their worlds—the environment they inhabit, the communities they form a part of, the groups with which they communicate.  See CCCF-101 for the structure of the course.\n\nThe five central topics for spring are as follows:\n1.\tWhat is an animal to a human, and why?  (Comparative consideration of the boundaries different societies draw, in different media, at different times, between human animals and non-human animals; culture as a vehicle for establishing human-non-human distinctions.)\n2.\tGenre, interpretation, and enjoyment: do rules travel?  (Comparative cultural analysis: what is a convention?  Epic and foundation.) \n3.\tWhat in the world is “literature”?  (Origins of the concept; literacy, representation, elites; translation: comparative early literatures.)\n4.\tWhat in the world is “visual art”?  (Origins of the concept; literacy, representation, elites; translation: comparative early visual studies.)\n5.\tThe Work of Culture in the Age of Digital Reproduction: can cultural forms make the future?\n\n      less description for CCCF-SHU  102 «",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 102",
            "course_name": "WS Global Perspectives on Culture II Workshop",
            "description": "CCCF-SHU  102WS Global Perspectives on Culture II Workshop",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 120",
            "course_name": "Chinese Art and the Modern World",
            "description": "CCCF-SHU  120 Chinese Art and the Modern World \nA thematic introduction to Chinese art from the fifteenth century to the present, with special attention to its interaction with the rest of the world. Media include architecture, painting, porcelain, print, and installations. Topics include Chinese gardens in the West, Chinese watercolors for international trade, realism and socialist realism, and ink play and abstract expressionism.",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 121",
            "course_name": "",
            "description": "CCCF-SHU  121\n\n   History of Chinese Cinemas\n\nThis course, the first segment in a two-semester survey of Chinese-language film history, traces the origins of Chinese cinema and its transformation and diversification into a multi-faceted, polycentric trans-regional phenomenon in China, Hong Kong, and Taiwan up to the 1960s.  We study a number of film cultures in Shanghai/China, Hong Kong and Taiwan, including the complex web of their historical kinship ties, and place them within the regional and global contexts of modernity, revolution, nation-building, and attendant socio-cultural transformations. To investigate these unique yet interrel...\n\n      more description for CCCF-SHU  121 »\n\n      \n\n\n\nThis course, the first segment in a two-semester survey of Chinese-language film history, traces the origins of Chinese cinema and its transformation and diversification into a multi-faceted, polycentric trans-regional phenomenon in China, Hong Kong, and Taiwan up to the 1960s.  We study a number of film cultures in Shanghai/China, Hong Kong and Taiwan, including the complex web of their historical kinship ties, and place them within the regional and global contexts of modernity, revolution, nation-building, and attendant socio-cultural transformations. To investigate these unique yet interrelated films cultures together raises the question of national cinema as a unitary object of study, while suggesting new avenues for analyzing the complex genealogy of a cluster of urban, regional, commercial or state-sponsored film industries within a larger comparative and transnational framework. Topics related to screenings and discussions include urban modernity, exhibition and spectatorship, transition to sound, stardom and propaganda, gender and ethnic identities, and genre formation and hybridization.\n\n      less description for CCCF-SHU  121 «",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 122",
            "course_name": "",
            "description": "CCCF-SHU  122\n\n   China: Cultures and Contexts\n\nMore than a great books survey, this course seeks to bring students to a critical reading of some of the foundational texts that undergird China as a cultural and moral concept.  In trying to understand and appreciate these texts, we must ask ourselves why they have commanded such a high degree of attention and respect by generations upon generations of people, who not only inherited these texts as part of their traditions, but also strove to redefine and reinvent these traditions through rigorous rereading and reinterpretation.  In what ways do these texts continue to speak to us as moderns (...\n\n      more description for CCCF-SHU  122 »\n\n      \n\n\n\nMore than a great books survey, this course seeks to bring students to a critical reading of some of the foundational texts that undergird China as a cultural and moral concept.  In trying to understand and appreciate these texts, we must ask ourselves why they have commanded such a high degree of attention and respect by generations upon generations of people, who not only inherited these texts as part of their traditions, but also strove to redefine and reinvent these traditions through rigorous rereading and reinterpretation.  In what ways do these texts continue to speak to us as moderns (or “postmoderns”), and to those outside the real or perceived Chinese world?  To what extent do these old, even ancient, texts keep informing us when we are brought to the task of thinking and rethinking what it is to be human?\n\n      less description for CCCF-SHU  122 «",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 123",
            "course_name": "Chinese Literature in the 20th Century",
            "description": "CCCF-SHU  123 Chinese Literature in the 20th Century \nA survey and critical examination of the concepts, institutions, canons, debates, experiments, and actions that gave rise to modern and contemporary Chinese literature. The course covers a variety of genres of literature in the People’s Republic of China, Taiwan, and Hong Kong. The primary goal of the course is to familiarize students as much as possible with the most representative works of 20th-century China. Students will also explore relevant topics in historical, sociological, and cultural studies of modern China, from a literary perspective.",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 124",
            "course_name": "Chinese Music from Antiquity to the Present",
            "description": "CCCF-SHU  124 Chinese Music from Antiquity to the Present \nThis course explores the development of Chinese music from antiquity and the Tang period to the present day, with a particular focus on the role that music plays in Chinese society. Genres to be studied include folk song, opera, teahouse music, temple and procession music, as well as more contemporary forms, such as avant-garde and rock music. Questions to be considered include the gendered roles of male and female performers, the relationship between rural and urban traditions, as well as both external influences on Chinese music and the influence of Chinese music outside of China.",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 125",
            "course_name": "Chinese Theatrical Traditions",
            "description": "CCCF-SHU  125 Chinese Theatrical Traditions \nThis course surveys Chinese theatrical traditions from their pre-Tang origins to the present day. It focuses on three theatrical forms: 14th- century zaju plays, 16th- and 17th-century chuanqi plays, and recent theater from China, Taiwan, and Hong Kong.",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 126",
            "course_name": "Contemporary Chinese Art in Shanghai",
            "description": "CCCF-SHU  126 Contemporary Chinese Art in Shanghai \nChina’s contemporary art scene has exploded in the past few decades. This course surveys the main developments in Chinese art since 1949. It includes guest lectures and visits to public museums, galleries and artists’ studios.",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 127",
            "course_name": "Paper Art: History and Practice",
            "description": "CCCF-SHU  127 Paper Art: History and Practice \nBeginning with the Chinese arts of Zhezhi (paper folding) and Jianzhi (paper cutting) the paper craft movement has roots on all continents. This course reviews the history of both Chinese and international traditions, in addition to examining contemporary practices. Additionally, students will have hands-on experience through weekly exercises in the fundamentals of paper engineering techniques and basic conductive materials, creating movable books and sculptures.",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 128",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19063",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Tarocco, Francesca",
                    "time": "Wed 1.15 PM - 4.15 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CCCF-SHU  128\n\n   Contemporary Art & New Media\n\nOver the past three decades, the contemporary art scene in China has\nexpanded fast. The massive political, economic, and social changes the\ncountry has undergone since the end of the Cultural Revolution in 1976\nhave dramatically altered its cultural landscape. The course will survey the main development areas in Chinese contemporary art. Dedicated to responding to the new textures of China’s metropolitan culture, it will look at the relationship between visual arts, new media, architecture and performance in the mega-city\nof Shanghai, often regarded as the cradle of Chinese modernity.  The\ncla...\n\n      more description for CCCF-SHU  128 »\n\n      \n\n\n\nOver the past three decades, the contemporary art scene in China has\nexpanded fast. The massive political, economic, and social changes the\ncountry has undergone since the end of the Cultural Revolution in 1976\nhave dramatically altered its cultural landscape. The course will survey the main development areas in Chinese contemporary art. Dedicated to responding to the new textures of China’s metropolitan culture, it will look at the relationship between visual arts, new media, architecture and performance in the mega-city\nof Shanghai, often regarded as the cradle of Chinese modernity.  The\nclass will be complemented by guest lectures and visits to public\nmuseums, galleries and artists’ studios in and around Shanghai.\nStudents will have the opportunity to meet leading figures from the\nart world in China as well as the international art community,\nincluding artists, museum directors, curators, art critics, and art\ndealers.\n\n      less description for CCCF-SHU  128 «",
            "offering": true
        },
        {
            "course_id": "CCCF-SHU 130",
            "course_name": "",
            "description": "CCCF-SHU  130\n\n   Screening Childhood\n\nChildhood is a persistent topic of countless films and other screen-based media products worldwide, with an intended audience not limited to children. The focus of this course is not children’s films per se, but “childhood” in world cinema and in popular culture, discussed from an array of historical and theoretical perspectives. The concerns and topics of the course include: the intimate relationship between early cinema and childhood (and by extension, childhood and modernity); conceptions and representations of childhood in different cinematic (and cultural) traditions and historical period...\n\n      more description for CCCF-SHU  130 »\n\n      \n\n\n\nChildhood is a persistent topic of countless films and other screen-based media products worldwide, with an intended audience not limited to children. The focus of this course is not children’s films per se, but “childhood” in world cinema and in popular culture, discussed from an array of historical and theoretical perspectives. The concerns and topics of the course include: the intimate relationship between early cinema and childhood (and by extension, childhood and modernity); conceptions and representations of childhood in different cinematic (and cultural) traditions and historical periods; ideological critiques and other theoretical models in engaging screen and media portrayals of childhood, including feminism, gender and sexuality studies, postcolonial studies, and child studies. Weekly screenings will feature early actualities, silent narrative film, musical, documentary, animation, and more. Students are expected to actively take part in discussions and presentations, and complete a final research paper.\n\n      less description for CCCF-SHU  130 «",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 131",
            "course_name": "",
            "description": "CCCF-SHU  131\n\n   History of Chinese Cinemas II\n\nThe course offers a historical survey of Chinese-language cinema from the emergence of the new waves in Hong Kong, Taiwan and Mainland China in 1970s-1980s to the more recent formations around the turn of the new century.  The distinctiveness of the three important Chinese cinemas and their increasing convergences after the Hong Kong handover in 1997, and under the impact of globalization, offer ideal laboratories for reconsidering the premises and usefulness of the concepts of national and transnational cinema.  Along the same axis, we will also probe the problematic of cultural nationalism a...\n\n      more description for CCCF-SHU  131 »\n\n      \n\n\n\nThe course offers a historical survey of Chinese-language cinema from the emergence of the new waves in Hong Kong, Taiwan and Mainland China in 1970s-1980s to the more recent formations around the turn of the new century.  The distinctiveness of the three important Chinese cinemas and their increasing convergences after the Hong Kong handover in 1997, and under the impact of globalization, offer ideal laboratories for reconsidering the premises and usefulness of the concepts of national and transnational cinema.  Along the same axis, we will also probe the problematic of cultural nationalism and neo-regionalism within the trans-Asian context, and the tension between the state's cultural policy and film industry, commercial cinema and art or independent cinema.  Given the massive transformations in media technology and industrial organization in the last two decades, we will also consider the ramifications of new media for film and screen culture, including the burgeoning documentary movement, amateur and activist film/video practices.  Screenings will include festival favorites, commercial blockbusters and DV works.\n\n      less description for CCCF-SHU  131 «",
            "offering": false
        },
        {
            "course_id": "CCCF-SHU 9101",
            "course_name": "",
            "description": "CCCF-SHU 9101\n\n   Cultural Foundations I\n\nThis course introduces the arts from their origins to the end of antiquity, as defined for these purposes by the roughly coincident dissolutions of the Gupta, Han, and Western Roman empires, focusing on how individuals and social relations are shaped in literature, the visual, plastic, and performing arts, and through music. Conceptions of the divine, the heroic, power and disenfranchisement, beauty, and love are examined within the context of the art and literature of East and South Asia, the Mediterranean world, and contiguous regions (such as Germania, Nubia, and Mesopotamia). Instructors p...\n\n      more description for CCCF-SHU 9101 »\n\n      \n\n\n\nThis course introduces the arts from their origins to the end of antiquity, as defined for these purposes by the roughly coincident dissolutions of the Gupta, Han, and Western Roman empires, focusing on how individuals and social relations are shaped in literature, the visual, plastic, and performing arts, and through music. Conceptions of the divine, the heroic, power and disenfranchisement, beauty, and love are examined within the context of the art and literature of East and South Asia, the Mediterranean world, and contiguous regions (such as Germania, Nubia, and Mesopotamia). Instructors prepare the way for Cultural Foundations II by giving some attention to the modes by which cultural transmission occurred across these regions prior to the rise of Islam.\n\n      less description for CCCF-SHU 9101 «",
            "offering": false
        }
    ]
}