{
    "major_id": "DGCM1-UC",
    "file": "./2015-2016/Digital_Communications_&_Media(DGCM1-UC).html",
    "courses": [
        {
            "course_id": "DGCM1-UC 312",
            "course_name": "",
            "description": "DGCM1-UC  312\n\n   Political Economy of Digital Media\n\nThis course provides a political economy foundation for the study of modern digital media and communications industries, including film and animation, gaming, web production, television, publishing, e-commerce, and broadband services. It combines a study of macroeconomic and microeconomic fundamentals with the inclusion of the digital media's features and challenges. It also integrates an area called media economics with the rich history of the political economy of communication. This raises such issues as the public interest, media consolidation, and the media's role in fostering a public dia...\n\n      more description for DGCM1-UC  312 »\n\n      \n\n\n\nThis course provides a political economy foundation for the study of modern digital media and communications industries, including film and animation, gaming, web production, television, publishing, e-commerce, and broadband services. It combines a study of macroeconomic and microeconomic fundamentals with the inclusion of the digital media's features and challenges. It also integrates an area called media economics with the rich history of the political economy of communication. This raises such issues as the public interest, media consolidation, and the media's role in fostering a public dialogue crucial to democratic society. It also stresses the unique characteristics of cultural production such as music and the creative work and geographical spaces that have been driving the modern economy.\n\n      less description for DGCM1-UC  312 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 1013",
            "course_name": "History of Telecomm & Media",
            "description": "DGCM1-UC 1013 History of Telecomm & Media \nA detailed chronology of communications technologies is provided including print, telegraphy, telephony, radio, television, data communications, and the Internet. Emphasis is on how these technologies were funded and shaped by commercial and financial forces, as well as by government and military support. It also endeavors to specify the linkages between communications technologies and social concerns involving culture, economics, education, and politics. Of particular interest for discussion is the notion of \"public interest.\"",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 1404",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "9738",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "Prives, Simona",
                    "time": "Thu 6.00 PM - 8.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "DGCM1-UC 1404\n\n   Media Design I:  Concepts\n\nThis course explores the fundamentals of two-dimensional design and provides students with strong visual communication skills in preparation for print, interactive, and time-based media. Basic elements of visual composition, typography, color, and image are addressed. Through research, experimentation, problem solving, and critique, students develop a strong design vocabulary, a rigorous creative process, an understanding of best practices, and a heightened awareness of the visual world. Students learn the creative skills to think conceptually, execute design methods, and critically evaluate i...\n\n      more description for DGCM1-UC 1404 »\n\n      \n\n\n\nThis course explores the fundamentals of two-dimensional design and provides students with strong visual communication skills in preparation for print, interactive, and time-based media. Basic elements of visual composition, typography, color, and image are addressed. Through research, experimentation, problem solving, and critique, students develop a strong design vocabulary, a rigorous creative process, an understanding of best practices, and a heightened awareness of the visual world. Students learn the creative skills to think conceptually, execute design methods, and critically evaluate in the context of graphic design.\n\n      less description for DGCM1-UC 1404 «",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 1971",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "9902",
                    "section": "001",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Carryl, Colin",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "DGCM1-UC 1971 Independent Study",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 2200",
            "course_name": "Sp Tpcs Dig Com & Media:",
            "description": "DGCM1-UC 2200 Sp Tpcs Dig Com & Media: \nThis is a mid- to upper-level course dedicated to new and important developments in the field. Possible themes for special topics courses include film title design, character animation, web animation, web-based games and streaming, expert lecture series, special effects, design for mobile devices, and virtual environments.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2204",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "17119",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "Walczyk, David",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "DGCM1-UC 2204\n\n   Interactive Devices\n\nAs the design of interactive media and digital interfaces move beyond desktop and laptop modes of interaction, these older modes are reconfigured and repurposed for new types of hardware. Likewise, new modes of interaction such as gesture, touch, augmented, and geolocation are now part of mainstream design. This course provides the assessment and design skills necessary for working with new and emerging modes of digital interaction. Students learn to assess the usability of modes of interaction and then design for these modes of interaction by prototyping an application.\nPrerequisites: Media ...\n\n      more description for DGCM1-UC 2204 »\n\n      \n\n\n\nAs the design of interactive media and digital interfaces move beyond desktop and laptop modes of interaction, these older modes are reconfigured and repurposed for new types of hardware. Likewise, new modes of interaction such as gesture, touch, augmented, and geolocation are now part of mainstream design. This course provides the assessment and design skills necessary for working with new and emerging modes of digital interaction. Students learn to assess the usability of modes of interaction and then design for these modes of interaction by prototyping an application.\nPrerequisites: Media Design I and Media Design II and Interactive Design I\n\n      less description for DGCM1-UC 2204 «",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 2209",
            "course_name": "Sound Design in Post- Production",
            "description": "DGCM1-UC 2209 Sound Design in Post- Production \nThis course is an intensive analytical and hands-on course that covers the aesthetics and production techniques of sound design. The techniques of award-winning sound designers will be studied and emulated using the industry-wide standard software platform ProTools. Upon completion of this course, students will be able to hear and identify sound design and post production techniques, solve common post production audio problems, understand the terminology of sound design and audio post production, and create sound design projects using ProTools.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2210",
            "course_name": "",
            "description": "DGCM1-UC 2210\n\n   Wireless Communications\n\nExtensive technologies have been developed to\nmodulate electromagnetic radiation so that it can\ncarry useful information. This course covers the\nuse of wireless communications for services such\nas mobile telephony and e-commerce. It covers the\nFCC and ITU allocations of radio spectrum and\ntechnological standards such as CDMA and\nTDMA. It also discusses second (2G) and third\n(3G) generation wireless transmission standards\nwith a specific focus on new 3G standards such as\nWML (Wireless Markup Language) and WAP\n(Wireless Application Protocol). It also covers the\nauctioning of public spectrum for ...\n\n      more description for DGCM1-UC 2210 »\n\n      \n\n\n\nExtensive technologies have been developed to\nmodulate electromagnetic radiation so that it can\ncarry useful information. This course covers the\nuse of wireless communications for services such\nas mobile telephony and e-commerce. It covers the\nFCC and ITU allocations of radio spectrum and\ntechnological standards such as CDMA and\nTDMA. It also discusses second (2G) and third\n(3G) generation wireless transmission standards\nwith a specific focus on new 3G standards such as\nWML (Wireless Markup Language) and WAP\n(Wireless Application Protocol). It also covers the\nauctioning of public spectrum for wireless services.\n\n      less description for DGCM1-UC 2210 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2220",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9975",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Walczyk, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "DGCM1-UC 2220\n\n   Digital Media Management\n\nThis course introduces students to the role of management in industries that implement, plan, and produce broadcast and interactive communications. Students learn the technological domains of the digital media industry (transmission, storage, interactivity, processing, capture, and design) and the stages of the digital content lifecycle (production, management, e-commerce, distribution, usability, and critique). Collaborative research and presentations are designed to foster teamwork as well as expertise. The course addresses major issues of concern to digital media management, such as legal, ...\n\n      more description for DGCM1-UC 2220 »\n\n      \n\n\n\nThis course introduces students to the role of management in industries that implement, plan, and produce broadcast and interactive communications. Students learn the technological domains of the digital media industry (transmission, storage, interactivity, processing, capture, and design) and the stages of the digital content lifecycle (production, management, e-commerce, distribution, usability, and critique). Collaborative research and presentations are designed to foster teamwork as well as expertise. The course addresses major issues of concern to digital media management, such as legal, security, performance measurements, and information policy issues relevant to managers working with digital media.\n\n      less description for DGCM1-UC 2220 «",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 2221",
            "course_name": "Digital Media Mgmt II",
            "description": "DGCM1-UC 2221 Digital Media Mgmt II \nDigital media management is the coordination and control of the people and processes involved in the creation, storage, transmission, and processing of digital content. This course investigates the different managerial responsibilities in the digital media industries, including analyzing media markets, managing personnel, raising capital, enhancing innovation, setting information policy, and developing appropriate measures for media consumption. The course covers phases of project management cycles such as feasibility, analysis, design, production, implementation, and evaluation.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2222",
            "course_name": "",
            "description": "DGCM1-UC 2222\n\n   Collaboratn Technologies\n\nIn today's complex global economy, group projects and teamwork take on increased significance: colleagues, clients, customers, and subcontractors are often distributed across space as well as time, requiring new ways to communicate and interact. Collaboration technologies enhance team and workplace cooperation and effectiveness through the ability to edit complex information within groups, organize thoughts and ideas, coordinate learning, and manage information for meetings, presentations, projects, proposals, research, etc. This course introduces the issues, benefits, theories, and methodolog...\n\n      more description for DGCM1-UC 2222 »\n\n      \n\n\n\nIn today's complex global economy, group projects and teamwork take on increased significance: colleagues, clients, customers, and subcontractors are often distributed across space as well as time, requiring new ways to communicate and interact. Collaboration technologies enhance team and workplace cooperation and effectiveness through the ability to edit complex information within groups, organize thoughts and ideas, coordinate learning, and manage information for meetings, presentations, projects, proposals, research, etc. This course introduces the issues, benefits, theories, and methodologies related to the collaborative technologies that are increasingly critical to the management of modern organizational settings and participation in interactive teams.\n\n      less description for DGCM1-UC 2222 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2223",
            "course_name": "Communications Technology & The Law",
            "description": "DGCM1-UC 2223 Communications Technology & The Law \nThis course discusses significant areas of law and regulation that impact the world of digital communications and media. Topics include: intellectual property law (copyright, patents, and trademarks); content regulation, telecom law, cyber torts, and contractual obligations, and related business issues; and governance over Internet-based activity and domains.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2230",
            "course_name": "",
            "description": "DGCM1-UC 2230\n\n   Computer Animation I\n\nThis studio class introduces students to the tools and the concept of 3D visual effects and animation production. As students become familiar with various tools and functions, they will create their first projects as they apply to the broadcast, commercial, and film industries. This course creates a real world post-production experience, stressing the use of the appropriate tools and professional workflow. Students focus on high level object building, photorealistic texturing and lighting, the use of the computer camera, and basic layout and scene composition. Goals and objectives include gain...\n\n      more description for DGCM1-UC 2230 »\n\n      \n\n\n\nThis studio class introduces students to the tools and the concept of 3D visual effects and animation production. As students become familiar with various tools and functions, they will create their first projects as they apply to the broadcast, commercial, and film industries. This course creates a real world post-production experience, stressing the use of the appropriate tools and professional workflow. Students focus on high level object building, photorealistic texturing and lighting, the use of the computer camera, and basic layout and scene composition. Goals and objectives include gaining a clear understanding of complex modeling and animation techniques and theory, realistic surface texturing and lighting, and Maya as a tool for visualizing creative 3D thinking.\n\n      less description for DGCM1-UC 2230 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2231",
            "course_name": "Intermediat Computer Animation",
            "description": "DGCM1-UC 2231 Intermediat Computer Animation \nThis course advances students' understanding of computer modeling, texturing, and animation in Maya. Conceptual design and modeling workflow are covered, as well as basic animation techniques. Students generate a character that can then be used as a subject for animation in the Advanced Computer Animation course. A secondary focus covers broadcast and logo animation. Class time includes critique, lecture, screenings, and hands-on work on either exercises or assignments.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2232",
            "course_name": "Advanced Computer Animation",
            "description": "DGCM1-UC 2232 Advanced Computer Animation \nThis course develops the student's ability to properly construct 3D rigs for character animation, utilizing common techniques used by industry experts and develops the student's character animation ability and understanding for motion. Students learn advanced 3D techniques and concepts, developing a sense for aesthetic content and to think creatively in 3D space and timing. Students learn the requirements of different specialized fields in 3D animation studios from industry employees.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2233",
            "course_name": "",
            "description": "DGCM1-UC 2233\n\n   Advanced Compositing & Visual Effects\n\nThis course covers fundamental and advanced techniques of object-oriented compositing. Topics covered include: how to properly combine different source footage materials (such as live-action shots) with green-screen shots and 3D graphics; understanding compositing 2D and 3D workflows; the latest techniques for compositing, keying, tracking, and manipulating footage to yield a finalized FX shot; common image and film formats, such as DV, HDV, and HD; differences between nodal-based compositing workflows and more standard motion graphic applications, such as After Effects; and the specialized fi...\n\n      more description for DGCM1-UC 2233 »\n\n      \n\n\n\nThis course covers fundamental and advanced techniques of object-oriented compositing. Topics covered include: how to properly combine different source footage materials (such as live-action shots) with green-screen shots and 3D graphics; understanding compositing 2D and 3D workflows; the latest techniques for compositing, keying, tracking, and manipulating footage to yield a finalized FX shot; common image and film formats, such as DV, HDV, and HD; differences between nodal-based compositing workflows and more standard motion graphic applications, such as After Effects; and the specialized fields in visual effects, in order to better understand studios and their hiring expectations. Shake, Nuke, or equivalent object-oriented compositor software is used.\n\n      less description for DGCM1-UC 2233 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2234",
            "course_name": "",
            "description": "DGCM1-UC 2234\n\n   Engaged and Participatory Media\n\nThis is a theoretical class with a hands-on component. It uses virtual or online platforms, such as Second Life, to address topics in aesthetics, ethics, visionary concepts, and developments. The class is divided into three modules. The first is a study of media acceptance and the changing role of art, craft, design and technology in society. It focuses on the early 20th century to research possible common structures. The second module builds on these findings and compares them to current challenges of aesthetics, technology, and economics in the digital domain. The third module, using half of...\n\n      more description for DGCM1-UC 2234 »\n\n      \n\n\n\nThis is a theoretical class with a hands-on component. It uses virtual or online platforms, such as Second Life, to address topics in aesthetics, ethics, visionary concepts, and developments. The class is divided into three modules. The first is a study of media acceptance and the changing role of art, craft, design and technology in society. It focuses on the early 20th century to research possible common structures. The second module builds on these findings and compares them to current challenges of aesthetics, technology, and economics in the digital domain. The third module, using half of the class sessions, consists of brainstorming to think ‘out-of-the-box' and arrive at a collaborative concept to be realized as the final project on an innovative platform, such as Second Life.\n\n      less description for DGCM1-UC 2234 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2235",
            "course_name": "",
            "description": "DGCM1-UC 2235\n\n   Motion Design I:  Time and Space\n\nThis course provides an overview of the fundamentals of motion graphics with consideration of broadcast, film, and multimedia applications. Using Adobe After Effects, students will be introduced to kinetic graphic design, 2D animation, and compositing. Through exercises, projects, critiques, and the viewing of a wide range of related professional work, students will develop their conceptual, technical, and aesthetic skills in motion graphic design and animation. Topics include project organization, keyframing and vector animation, stop motion animation, transitions, \"painting\" with video, laye...\n\n      more description for DGCM1-UC 2235 »\n\n      \n\n\n\nThis course provides an overview of the fundamentals of motion graphics with consideration of broadcast, film, and multimedia applications. Using Adobe After Effects, students will be introduced to kinetic graphic design, 2D animation, and compositing. Through exercises, projects, critiques, and the viewing of a wide range of related professional work, students will develop their conceptual, technical, and aesthetic skills in motion graphic design and animation. Topics include project organization, keyframing and vector animation, stop motion animation, transitions, \"painting\" with video, layering, effects, masking, alpha modes, rendering, and output. Students will create a series of small-scale animations that explore increasingly complex tools for artistic application, and will gain proficiency with Adobe After Effects as a post-production tool.\n\n      less description for DGCM1-UC 2235 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2236",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "10060",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "Schmidt Feist, Mechthild",
                    "time": "Tue 6.00 PM - 8.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Motion Design II:  Effects and Compositing",
            "description": "DGCM1-UC 2236 Motion Design II:  Effects and Compositing \nFor students who have mastered the technical basics, this course emphasizes the use of effects to support the main message with artistic decisions and design strategies. Using After Effects, students explore the complexity of life video combined with 2D animation using expressions, effects, parenting, 3-D controls, lighting, and audio. Students learn to analyze effects sequences and decipher ways to recreate them in After Effects. Projects are developed step-by-step, mirroring a real-life client-artist relationship and are intended to result in a professional piece for a demo reel.",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 2237",
            "course_name": "",
            "description": "DGCM1-UC 2237\n\n   Broadcast Design & Typography\n\nThis course is an intensive introduction to graphic design for broadcast in general and to Adobe Illustrator and Photoshop in particular, with a brief look into After Effects. Students learn to develop a concept, communicate it to a prospective client, and realize it with state-of-the-art tools. What makes broadcast typography different from design in other media? How do you achieve a distinctive look for various television genres? What does each member in a post-production team contribute? What is a studio looking for in a broadcast designer or animator? Each student develops a set of stills ...\n\n      more description for DGCM1-UC 2237 »\n\n      \n\n\n\nThis course is an intensive introduction to graphic design for broadcast in general and to Adobe Illustrator and Photoshop in particular, with a brief look into After Effects. Students learn to develop a concept, communicate it to a prospective client, and realize it with state-of-the-art tools. What makes broadcast typography different from design in other media? How do you achieve a distinctive look for various television genres? What does each member in a post-production team contribute? What is a studio looking for in a broadcast designer or animator? Each student develops a set of stills and completes a 15-second animation.\n\n      less description for DGCM1-UC 2237 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2238",
            "course_name": "",
            "description": "DGCM1-UC 2238\n\n   Media Design II:  Techniques and Convergence\n\nWhat differentiates today's media production from its recent historical predecessors? How does the use of computers in all media influence a designer's conceptual approach and clients' branding expectations? How can a design be carried from print to web to television, from 3D into a 2D composite? This fast-paced overview class will address these questions, providing students with a technical foundation that will enable them to better plan, delegate, or execute digital production. The introduction to design principles and a variety of applications will serve as a basis for the designer or anima...\n\n      more description for DGCM1-UC 2238 »\n\n      \n\n\n\nWhat differentiates today's media production from its recent historical predecessors? How does the use of computers in all media influence a designer's conceptual approach and clients' branding expectations? How can a design be carried from print to web to television, from 3D into a 2D composite? This fast-paced overview class will address these questions, providing students with a technical foundation that will enable them to better plan, delegate, or execute digital production. The introduction to design principles and a variety of applications will serve as a basis for the designer or animator from which to specialize into any of the discussed fields. The course covers still graphics, interactive graphics, and touches on 2D and 3D linear animation.\n\n      less description for DGCM1-UC 2238 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2239",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9916",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Schmidt Feist, Mechthild",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "DGCM1-UC 2239\n\n   Media History:  Art, Design, and Technology\n\nThis course provides an historical and theoretical overview of special effects from their earliest inception in theatrical, photographic, and cinematic productions to their current use in contemporary media arts. Students survey the ubiquity of special effects used as either obvious tropes in visualizing the fantastical, or as invisible amplifiers in simulating a more plausible reality. The course also examines the relationship of SFX to both narrative realism and to the fabrication of the simulacrum by tracing the semiotic use of SFX to both propel a narrative and to maintain narrative cohere...\n\n      more description for DGCM1-UC 2239 »\n\n      \n\n\n\nThis course provides an historical and theoretical overview of special effects from their earliest inception in theatrical, photographic, and cinematic productions to their current use in contemporary media arts. Students survey the ubiquity of special effects used as either obvious tropes in visualizing the fantastical, or as invisible amplifiers in simulating a more plausible reality. The course also examines the relationship of SFX to both narrative realism and to the fabrication of the simulacrum by tracing the semiotic use of SFX to both propel a narrative and to maintain narrative coherence in what might otherwise be impalpable and disjointed exaggerations. This inclusive history explores the pioneering work of the magician and filmmaker George Melies and to contemporary visual effects directors and production teams.\n\n      less description for DGCM1-UC 2239 «",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 2241",
            "course_name": "",
            "description": "DGCM1-UC 2241\n\n   Drawing for Computer Artists & Animators\n\nOne's standing as a digital artist is improved by becoming comfortable sketching out ideas in a meeting or bringing digital characters to life after deliberate study of expression and movement. In this course, students train their eye by using sketching, video, and observation for a better understanding of objects, dynamics, and movement. Students start with warm-ups, then move from perspective, light, and shadow to figurative motion sketches, character development, and storyboarding; interpret the visual impact of camera angles and composition; and use video for frame-by-frame analysis of dif...\n\n      more description for DGCM1-UC 2241 »\n\n      \n\n\n\nOne's standing as a digital artist is improved by becoming comfortable sketching out ideas in a meeting or bringing digital characters to life after deliberate study of expression and movement. In this course, students train their eye by using sketching, video, and observation for a better understanding of objects, dynamics, and movement. Students start with warm-ups, then move from perspective, light, and shadow to figurative motion sketches, character development, and storyboarding; interpret the visual impact of camera angles and composition; and use video for frame-by-frame analysis of different walk characteristics. Students create a character and walk cycle and transfer their drawings into the digital realm using various painting programs. Class time is divided into critique, discussion, lecture, and drawing.\n\n      less description for DGCM1-UC 2241 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2270",
            "course_name": "Information Design",
            "description": "DGCM1-UC 2270 Information Design \nThis course introduces students to the fundamentals of information architecture, navigation systems, and user experience. Course topics are addressed through salient examples and the development and assessment of analog and digital projects. Students are introduced to relevant technologies for the design and development of concept maps, site maps, graphic design, and web production. There are no prerequisites for this course, but students should have a basic grasp of HTML.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2271",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "9993",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "Finkel, Amy",
                    "time": "Wed 6.00 PM - 8.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "DGCM1-UC 2271\n\n   Interactive Design I: Building A Website\n\nThis course focuses on the process and practice of developing content/ideas for the web. Students explore these ideas by working with design treatments that are specific to an online setting. The class examines this process from the conceptual development through the creative and follows through to the technical execution of the design/content. While foremost a design class, in order to execute online concepts, students must learn the necessary tools. As students develop their own work and analyze others, some concerns that are kept in mind throughout the course include what message is being p...\n\n      more description for DGCM1-UC 2271 »\n\n      \n\n\n\nThis course focuses on the process and practice of developing content/ideas for the web. Students explore these ideas by working with design treatments that are specific to an online setting. The class examines this process from the conceptual development through the creative and follows through to the technical execution of the design/content. While foremost a design class, in order to execute online concepts, students must learn the necessary tools. As students develop their own work and analyze others, some concerns that are kept in mind throughout the course include what message is being presented, who the audience is, and what makes this design/execution stand out among it competition.\n\n      less description for DGCM1-UC 2271 «",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 2272",
            "course_name": "",
            "description": "DGCM1-UC 2272\n\n   Interactive Design II:  Motion\n\nPrerequisite: Interactive Design I: Building a Website\n\nInteractive Design II is a class that explores principles of design, typography, project management and how to merge effective design and code to create a dynamic, interactive user experience. We will explore various technologies to realize your ideas including JavaScript, HTML5 and CSS3 and methods such as Responsive Design. The class will focus on strategy, design and execution of your ideas. Aside from just presenting information in the online format, we will examine ways in which an online experience can differentiate itself from comp...\n\n      more description for DGCM1-UC 2272 »\n\n      \n\n\n\nPrerequisite: Interactive Design I: Building a Website\n\nInteractive Design II is a class that explores principles of design, typography, project management and how to merge effective design and code to create a dynamic, interactive user experience. We will explore various technologies to realize your ideas including JavaScript, HTML5 and CSS3 and methods such as Responsive Design. The class will focus on strategy, design and execution of your ideas. Aside from just presenting information in the online format, we will examine ways in which an online experience can differentiate itself from competitors. Projects will incorporate various methods and technologies including video, sound, and dynamic interactivity to develop compelling designs for multiple browsers and devices. You will learn how to take your idea from its conception through design and follow through to final execution.\n\n      less description for DGCM1-UC 2272 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2273",
            "course_name": "Database Design for The Web",
            "description": "DGCM1-UC 2273 Database Design for The Web \nThis course examines theories, strategies, and practices concerning interaction and experiential design. Students examine assorted web-based and digital media, employing concepts of storytelling and narrative, sequential and nonsequential structures, and user participation to assess and construct immersive environments and experiential systems. Students develop a semester-long project; personal reflection and critical analysis are important components of the course, as projects are discussed and critiqued throughout the semester.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2274",
            "course_name": "Ubiquitous Multimedia Applications",
            "description": "DGCM1-UC 2274 Ubiquitous Multimedia Applications \nThis hands-on course teaches students how to integrate animation, data, images, video, and sound into a website. Video and sound are compressed and prepared for downloading, streaming, or Web/pod-casting. It explores new developments in Internet Protocol TV (IPTV) and telephone (VOIP). The course starts with a theoretical component that analyzes the different uses, audience expectations, and business models underlying Web-based video and audio distribution. It is followed by hands-on sessions for actual compression, tests, and integration of media into a webpage.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2275",
            "course_name": "",
            "description": "DGCM1-UC 2275\n\n   Narrative & Dynamic Structures\n\nThis course examines theories, strategies, and practices concerning sequence and flow. Students explore the interactive capabilities of digital media including gaming, interactive television, and virtual reality. The goal of the course is to examine and create narrative structures, making experiential and coherent digital systems. Students are asked to look at assorted hyper-mediated and networked technologies, employing concepts of storytelling and narrative, sequential and non-sequential structures, and user participation to assess and construct immersive environments and experiential system...\n\n      more description for DGCM1-UC 2275 »\n\n      \n\n\n\nThis course examines theories, strategies, and practices concerning sequence and flow. Students explore the interactive capabilities of digital media including gaming, interactive television, and virtual reality. The goal of the course is to examine and create narrative structures, making experiential and coherent digital systems. Students are asked to look at assorted hyper-mediated and networked technologies, employing concepts of storytelling and narrative, sequential and non-sequential structures, and user participation to assess and construct immersive environments and experiential systems.\n\n      less description for DGCM1-UC 2275 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 2276",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "10061",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "Kinberg, Joshua",
                    "time": "Wed 6.00 PM - 8.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Interactive Design III:  Advanced Concepts",
            "description": "DGCM1-UC 2276 Interactive Design III:  Advanced Concepts \nTopics covered include: the aesthetic design concepts needed to design for interactivity and usability; and non-linear animation and dynamic content taking advantage of Flash Action Script, Shockwave, and JavaScript. In project-based assignments, students learn to integrate a variety of media into a website. Projects cover using enhanced Flash workflow to load text and images, create scrollable text, add music and video, produce a feedback form, and create a Flash plug-in detector. Students test, optimize, and deliver a finished product for multiple platforms.",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 2277",
            "course_name": "Internet Infrastructure & Domains",
            "description": "DGCM1-UC 2277 Internet Infrastructure & Domains \nIn this course students focus on the strategic use of web technologies for commercial and non-commercial services by developing in-depth knowledge of the Internet's technical infrastructure including .peer-to peer (P2P) networks, data farms, and the Internet's domain name system. Understanding the workings of the Internet and its protocols will help the students to understand and develop advanced web services, including interactive applications and media streams, while avoiding problems related to network congestion and cyber attacks.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 3000",
            "course_name": "",
            "description": "DGCM1-UC 3000\n\n   Fundmtnls of Interactive Multimedia\n\nThis course explores interactive multimedia's impact on traditional and emerging modes of communication and contemporary culture and how it is being shaped by new technological developments. Students examine the use of interactive technology in a wide range of environments, such as education, entertainment, culture, information services, and commerce. Students explore and evaluate interactive multimedia from a user experience and are introduced to media authoring tools. Students learn to integrate design methods for interactivity and information design into their project design. The course's e...\n\n      more description for DGCM1-UC 3000 »\n\n      \n\n\n\nThis course explores interactive multimedia's impact on traditional and emerging modes of communication and contemporary culture and how it is being shaped by new technological developments. Students examine the use of interactive technology in a wide range of environments, such as education, entertainment, culture, information services, and commerce. Students explore and evaluate interactive multimedia from a user experience and are introduced to media authoring tools. Students learn to integrate design methods for interactivity and information design into their project design. The course's emphasis is on exploring various perspectives that provide definitions and operational strategies to translate ideas into interactive multimedia, while providing criteria for assessment.\n\n      less description for DGCM1-UC 3000 «",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 5201",
            "course_name": "Narrative Theory & Screenwriting",
            "description": "DGCM1-UC 5201 Narrative Theory & Screenwriting \nThis course focuses on the study and practice of the fundamentals of narrative, visual storytelling, and dramatic writing for dramatic animation, film, and television. Narrative strategies for writing characterization, dialogue, pacing, setting, and structure are examined through exemplary films and television and screenwriting exercises. Screenwriters have the option of adapting a work in the public domain or writing an original script. Screenwriting software is a focus of analysis and instrument of production.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 7990",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "10117",
                    "section": "001",
                    "period": "09/04/2015 - 12/18/2015",
                    "location": "Schmidt Feist, Mechthild",
                    "time": "Fri 6.20 PM - 9.01 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "DGCM1-UC 7990\n\n   Senior Project:  Industry Mentoring and Portfolio\n\nThis course prepares for Senior Project: Seminar or Senior Project: Internship and begins the student's transition to his/her chosen career. The course provides the opportunity to create a portfolio and receive industry mentoring, both of which are essential for employment and success in the media industry. Through guest lecturers, students have the opportunity to establish contact with company mentors, spend a workday at the company, and use the experience to finalize their portfolios. The portfolio is preferably the student's website, but it can also be a DVD or a printed work. Students are ...\n\n      more description for DGCM1-UC 7990 »\n\n      \n\n\n\nThis course prepares for Senior Project: Seminar or Senior Project: Internship and begins the student's transition to his/her chosen career. The course provides the opportunity to create a portfolio and receive industry mentoring, both of which are essential for employment and success in the media industry. Through guest lecturers, students have the opportunity to establish contact with company mentors, spend a workday at the company, and use the experience to finalize their portfolios. The portfolio is preferably the student's website, but it can also be a DVD or a printed work. Students are encouraged to build and maintain the industry contacts that they have established for their future employment.\n\n      less description for DGCM1-UC 7990 «",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 7991",
            "course_name": "Senior Project:  Seminar",
            "description": "DGCM1-UC 7991 Senior Project:  Seminar \nThis seminar is the capstone of students' undergraduate studies. Drawing on acquired skills, students create a complete media production related to their concentrations. The resulting work will be part of a demo reel to support students' entry into their profession. After the initial approval of the topic, the student develops the project under the guidance of a faculty mentor. Students present the final project to a panel consisting of three faculty members.",
            "offering": false
        },
        {
            "course_id": "DGCM1-UC 7992",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9748",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Burns, William",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "DGCM1-UC 7992\n\n   Senior Project:  Internship\n\nThe internship provides an opportunity for students to combine knowledge gained in their major with the expertise provided by professionals in a variety of industry settings. Students must complete a minimum of 100 hours during the semester. (Students' full-time jobs cannot serve as internships.) In addition to hours at their placement, students meet regularly with the internship coordinator, maintain weekly journals, and complete a final essay summarizing the outcome of the learning experience, including samples of work completed. The student must work on specific projects (e.g. a film, TV pr...\n\n      more description for DGCM1-UC 7992 »\n\n      \n\n\n\nThe internship provides an opportunity for students to combine knowledge gained in their major with the expertise provided by professionals in a variety of industry settings. Students must complete a minimum of 100 hours during the semester. (Students' full-time jobs cannot serve as internships.) In addition to hours at their placement, students meet regularly with the internship coordinator, maintain weekly journals, and complete a final essay summarizing the outcome of the learning experience, including samples of work completed. The student must work on specific projects (e.g. a film, TV production, major commercial).\n\n      less description for DGCM1-UC 7992 «",
            "offering": true
        },
        {
            "course_id": "DGCM1-UC 7993",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "9930",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Senior Project:  Independent Study",
            "description": "DGCM1-UC 7993 Senior Project:  Independent Study",
            "offering": true
        }
    ]
}