{
    "major_id": "FILV1-UC",
    "file": "./2015-2016/Digital_Communications_&_Media(FILV1-UC).html",
    "courses": [
        {
            "course_id": "FILV1-UC 2001",
            "course_name": "Film Production I",
            "description": "FILV1-UC 2001 Film Production I \nIn this introductory course in 16mm filmmaking without sync sound, each individual has the opportunity to write, produce, direct, and shoot film, and edit using Final Cut Pro. The class works in small production crews within a rotating responsibility system in order to help fellow student's complete individual projects. In the final project, each student creates a color film with transition effects, music, and credits. Film projects are transferred to digital video and provided to the students.",
            "offering": false
        },
        {
            "course_id": "FILV1-UC 2003",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9814",
                    "section": "002",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Cinematography",
            "description": "FILV1-UC 2003 Cinematography \nThis course develops and implements professional concepts and techniques, including: the role of the cinematographer, interpreting the script, lighting, camera operation and lens selection, working with a crew and a lab, exteriors and interiors, duties of the camera assistant, film stocks and ASAs, and using exposure meters. Initial assignments are shot with student-supplied 35mm still camera, film, and processing. Final projects are shot without sound on 16mm; color negative film and processing are supplied.",
            "offering": true
        },
        {
            "course_id": "FILV1-UC 2004",
            "course_name": "Audio Recording",
            "description": "FILV1-UC 2004 Audio Recording \nThis course surveys the basic skills needed to record sound for film and digital video. The emphasis is placed on the underlying acoustic and electronic principles employed. Topics include analog and digital recording; mike designs and powering; selection of mike pick-up patterns; boom techniques; sync systems, including time code sync playback for music videos; radio mikes; sound mixing and scene matching from camera perspective; set protocol; proper slating; recording narration; and sound effects.",
            "offering": false
        },
        {
            "course_id": "FILV1-UC 2005",
            "course_name": "Lighting for Film & Digital Video",
            "description": "FILV1-UC 2005 Lighting for Film & Digital Video \nIn this workshop, students practice building and lighting sets, which are filmed and analyzed. Sessions provide experience with the methods, equipment, and special requirements for different locations. Topics include creating and communicating with light; characteristics and properties of lights and lighting styles; effective low-budget lighting for film and digital production; full-control studio lighting; mixing daylight, fluorescent, and incandescent; location lighting-interiors and exteriors; finding electrical power; and night-for-day and day-for-night.",
            "offering": false
        },
        {
            "course_id": "FILV1-UC 2008",
            "course_name": "The Language of Film",
            "description": "FILV1-UC 2008 The Language of Film \nWeekly screenings and analyses give students an understanding of the cinematic vocabulary. Topics include the shot as the basic unit of film structure, the effects of lighting and composition, editing, mise-en-scene and montage, sound and overall film techniques, and the relationship between form and content. Screenings and analyses include works by directors such as Allen, Chaplin, Coppola, Einstein, Ford, Godard, Griffith, Hawks, Hitchcock, Keaton, Lucas, Renoir, Penn, Scorsese, Spielberg, Weir, and Welles.",
            "offering": false
        },
        {
            "course_id": "FILV1-UC 2011",
            "course_name": "",
            "description": "FILV1-UC 2011\n\n   Film Production II\n\nIn this advanced class, each individual has the opportunity to write, produce, direct, and shoot a sync-sound project, and edit on digital nonlinear computer editing systems using Final Cut Pro. The class works in small production crews. Each student edits the image with dialogue, music, sound effects, and adds credits and transition effects. Projects are transferred to digital video and provided to the students. Using FilmLogic cut list software, students have the opportunity to match back a final computer edit to 16mm work print. Participants also learn the process of conforming the original...\n\n      more description for FILV1-UC 2011 »\n\n      \n\n\n\nIn this advanced class, each individual has the opportunity to write, produce, direct, and shoot a sync-sound project, and edit on digital nonlinear computer editing systems using Final Cut Pro. The class works in small production crews. Each student edits the image with dialogue, music, sound effects, and adds credits and transition effects. Projects are transferred to digital video and provided to the students. Using FilmLogic cut list software, students have the opportunity to match back a final computer edit to 16mm work print. Participants also learn the process of conforming the original color negative.\n\n      less description for FILV1-UC 2011 «",
            "offering": false
        },
        {
            "course_id": "FILV1-UC 2201",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9815",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "9998",
                    "section": "002",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Digital Filmmaking I",
            "description": "FILV1-UC 2201 Digital Filmmaking I \nThis introductory course details basic DV camcorder operations, elementary nonlinear editing with Final Cut Pro, and how to prepare a video production. In this hands-on course, students write, produce, direct, and edit individual and group projects. In a TV studio, students are introduced to multi-camera production operations. Students use Sony DV cameras and Final Cut Pro equipment provided by the school with an allotment of videotape and other supplies.",
            "offering": true
        },
        {
            "course_id": "FILV1-UC 2202",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9816",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Digital Filmmaking II",
            "description": "FILV1-UC 2202 Digital Filmmaking II \nThis advanced course is designed for students who are ready to build their creative professional future by concentrating on making one digital video project for festivals, competitions, and other forms of digital video distribution. Students are required to work in teams and to assist each other as crew while working on their own projects. Students have access to cameras and equipment after a review of technical operations. All editing is completed on Final Cut Pro, and the final version is output to digital video.",
            "offering": true
        },
        {
            "course_id": "FILV1-UC 2203",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9817",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Editing I with Final Cut Pro",
            "description": "FILV1-UC 2203 Editing I with Final Cut Pro \nUsing DV footage, students work in pairs to learn each step of digital nonlinear editing; log and capture footage, three-point editing, trimming, motion effects, audio mixing, generating and EDL, on-lining a master tape, and exporting digital file formats.  Through lectures, screenings, demonstrations, and practice, the course emphasizes the aesthetics of editing, including continuity, pacing, and dramatic structure.",
            "offering": true
        },
        {
            "course_id": "FILV1-UC 2206",
            "course_name": "Techniques & Technologies",
            "description": "FILV1-UC 2206 Techniques & Technologies \nThis introductory lecture course presents the fundamentals in the practical and creative aspects of digital filmmaking and video techniques and technology.  Through lectures, demonstrations, and assigned readings, the course demystifies complex technology principles to support future digital filmmakers, producers, artists, directors, video cinematographers, editors, and all users of the digital film and video medium.  Topics include: cameras and lenses, audio, light, analog and digital theory.",
            "offering": false
        }
    ]
}