{
    "major_id": "MPADT-GE",
    "file": "./2015-2016/Drama_Therapy_(MPADT-GE).html",
    "courses": [
        {
            "course_id": "MPADT-GE 2100",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4209",
                    "section": "001",
                    "period": "10/03/2015 - 10/04/2015",
                    "location": "PANX BSMT with Sajnani, Nisha L.10/31/2015 - 11/01/2015 Sat,Sun 9.00 AM - 6.00 PM at PANX BSMT with Sajnani, Nisha L.12/05/2015 - 12/06/2015 Sat,Sun 9.00 AM - 6.00 PM at PANX BSMT",
                    "time": "Sat,Sun 9.00 AM - 6.00 PM",
                    "open": true,
                    "professor": "Sajnani, Nisha L."
                }
            ],
            "course_name": "Introduction to Arts-Based Research",
            "description": "MPADT-GE 2100 Introduction to Arts-Based Research",
            "offering": true
        },
        {
            "course_id": "MPADT-GE 2109",
            "course_name": "",
            "description": "MPADT-GE 2109\n\n   Drama Therapy for Clinical Populations\n\nThe theory and techniques of drama therapy will be examined in relationship to the needs of individuals treated in clinical facilities such as day treatment centers and inpatient psychiatric clinics. Clinical applications will be discussed and demonstrated in class. Appropriate drama therapy theory will be discussed as it informs clinical treatment. We will visit an acute care facility and shadow a creative arts therapist. Furthermore, we will prepare and implement several workshop sessions with a chronic mentally ill adult population. We will also examine and evaluation as they related to dra...\n\n      more description for MPADT-GE 2109 »\n\n      \n\n\n\nThe theory and techniques of drama therapy will be examined in relationship to the needs of individuals treated in clinical facilities such as day treatment centers and inpatient psychiatric clinics. Clinical applications will be discussed and demonstrated in class. Appropriate drama therapy theory will be discussed as it informs clinical treatment. We will visit an acute care facility and shadow a creative arts therapist. Furthermore, we will prepare and implement several workshop sessions with a chronic mentally ill adult population. We will also examine and evaluation as they related to drama therapy with clinical populations.\n\n      less description for MPADT-GE 2109 «",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2110",
            "course_name": "Theater Aesthetics and Drama Therapy",
            "description": "MPADT-GE 2110 Theater Aesthetics and Drama Therapy",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2114",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4032",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "PANX BSMT",
                    "time": "Fri 11.00 AM - 4.00 PM",
                    "open": true,
                    "professor": "Landy, Robert"
                }
            ],
            "course_name": "Intro to Drama Therapy",
            "description": "MPADT-GE 2114 Intro to Drama Therapy \nThis course is designed to introduce students to the sources, concepts, theory, and practice of drama therapy, as well as to the ethical issues of practice and professional orientation. Part of the course is designed to facilitate a model group process and provide a means of experiencing and evaluating the effectiveness of a drama therapy group. and part of the course will introduce students to theory. Although the main thrust of our class will be on role theory and role methods, we will also look at other approaches popular in the field.",
            "offering": true
        },
        {
            "course_id": "MPADT-GE 2115",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4033",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Garcia, Antonina",
                    "time": "Mon 4.55 PM - 7.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Psychodrama & Sociometry",
            "description": "MPADT-GE 2115 Psychodrama & Sociometry \nThe practice of psychodrama and sociodrama are examined as a treatment modality for use in drama therapy.  Classroom experiences include participation in the psychodramatic process, group leadership training, and the further development of the aims and principles of drama therapy.",
            "offering": true
        },
        {
            "course_id": "MPADT-GE 2116",
            "course_name": "Advanced Practicum in Drama Therapy",
            "description": "MPADT-GE 2116 Advanced Practicum in Drama Therapy \nA practical application of the aims and principles of drama therapy to the leadership of groups.  Focus is on selected methods and theoretical frameworks.",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2117",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4034",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Haen, Craig",
                    "time": "Thu 10.00 AM - 12.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Proj Techn Drama Therapy",
            "description": "MPADT-GE 2117 Proj Techn Drama Therapy \nThe practice of selected projective techniques used frequently in drama therapy, such as puppetry, mask, make-up, and video.  Projective techniques are demonstrated in class and examined theoretically.  Applications to special and normal populations.",
            "offering": true
        },
        {
            "course_id": "MPADT-GE 2118",
            "course_name": "Adv Prac in Drama Therap",
            "description": "MPADT-GE 2118 Adv Prac in Drama Therap",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2119",
            "course_name": "Adv Theory & Research in Drama Therapy",
            "description": "MPADT-GE 2119 Adv Theory & Research in Drama Therapy \nAn examination of advanced drama therapy theory and research; new approaches that speck to the aesthetic and psychological dimensions of drama therapy.  Intended for students planning research for the M.A. thesis.",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2120",
            "course_name": "Adv Practice in Drana Therapy:With Children",
            "description": "MPADT-GE 2120 Adv Practice in Drana Therapy:With Children",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2121",
            "course_name": "Adv Prac Drama Thrpy Dev Transform/Playbk Theatre",
            "description": "MPADT-GE 2121 Adv Prac Drama Thrpy Dev Transform/Playbk Theatre \nThis course is intended to introduce students to the theory and practice of several of the major drama therapy approaches exclusive of role method and theory, the primary approach is taught as NYU. Through both an experiential and didactic process, students will learn the major concepts and practices of developmental transformations and playback theatre and/or related approaches to drama therapy.",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2125",
            "course_name": "Advanced Psychodrama and Sociometry",
            "description": "MPADT-GE 2125 Advanced Psychodrama and Sociometry \nThis course will provide students with hands-on experience facilitating action interventions in psychodrama, such as creating contracts, scene setting, training auxiliaries, the walk & talk, directing the psychodrama vignette & psychodrama with individuals.  Upon completion of Psychodrama & Sociometry & Advanced Psychodrama & Sociometry, the student will have accrued sufficient hours of training to begin psychodrama practicum.",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2130",
            "course_name": "Ethics in Drama Therapy",
            "description": "MPADT-GE 2130 Ethics in Drama Therapy",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2134",
            "course_name": "Role Theory & Methods In Drama Therapy",
            "description": "MPADT-GE 2134 Role Theory & Methods In Drama Therapy \nCourse introduces students to the theory & practice of role theory & role method in drama therapy. Course provides an overview of sociological & theatrical theory as source material for drama therapy role theory and students will study & analyze the Taxonomy of Roles. Students will be introduced to the clinical applications of role method in working with a range of challenging conditions based in mental status, cognition, socioeconomic conditions & life stressors. In addition, students will be exposed to the extant research literature on role theory & method in the field of drama therapy.",
            "offering": false
        },
        {
            "course_id": "MPADT-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4035",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hodermarska, Maria",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "MPADT-GE 2300 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "MPADT-GE 2302",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "MPADT-GE 2302\n\n   Internship in Drama Therapy\n\nThis course prepares students to engage in the process of clinical internship. In this practicum course students will synthesizes their clinical readings from the lecture portion of Internship in Drama Therapy with on-site internship experience. This processing will occur through the use of action methods like role-playing, projective techniques, and psychodramatic techniques as well as conversation/reflection to explore relevant issues in the treatment process. The internship will occur at two different clinical settings but not limit to hospitals, rehabilitation centers, nursing homes, speci...\n\n      more description for MPADT-GE 2302 »\n\n      \n\n\n\nThis course prepares students to engage in the process of clinical internship. In this practicum course students will synthesizes their clinical readings from the lecture portion of Internship in Drama Therapy with on-site internship experience. This processing will occur through the use of action methods like role-playing, projective techniques, and psychodramatic techniques as well as conversation/reflection to explore relevant issues in the treatment process. The internship will occur at two different clinical settings but not limit to hospitals, rehabilitation centers, nursing homes, special education facilities, prisons, day treatment programs, and acute care facilities. Students work with on-site supervisors with whom they meet regularly, and a classroom teacher who guides them through a range of clinical issues including transference and contrertransference, parallel process, diagnosis and evaluation, and professional orientation and ethic in the profession of drama therapy.\n\n      less description for MPADT-GE 2302 «",
            "offering": true
        },
        {
            "course_id": "MPADT-GE 2303",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4037",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Hodermarska, Maria",
                    "time": "Wed 4.55 PM - 7.40 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MPADT-GE 2303\n\n   Internship in Drama Therapy,Lecture\n\nThis course prepares students to engage in the process of clinical internship. In this lecture course students will receive an overview of issues relevant to clinical internship practice including but not limited to: OSHA, HIPAA, and NY State Child Abuse and Mandated Reporting materials; Ethics; Professional Identity; Interventions and Procedures for Suicidal and Homicidal behaviors, Alcohol and Other Substance Abuse and Dependency; Overview of theoretical and drama therapeutic interventions relating to child and adolescent development, mental illness, dementia and aging. Strategies for Termin...\n\n      more description for MPADT-GE 2303 »\n\n      \n\n\n\nThis course prepares students to engage in the process of clinical internship. In this lecture course students will receive an overview of issues relevant to clinical internship practice including but not limited to: OSHA, HIPAA, and NY State Child Abuse and Mandated Reporting materials; Ethics; Professional Identity; Interventions and Procedures for Suicidal and Homicidal behaviors, Alcohol and Other Substance Abuse and Dependency; Overview of theoretical and drama therapeutic interventions relating to child and adolescent development, mental illness, dementia and aging. Strategies for Termination.\n\n      less description for MPADT-GE 2303 «",
            "offering": true
        }
    ]
}