{
    "major_id": "ENGL-SHU",
    "file": "./2015-2016/English_(ENGL-SHU).html",
    "courses": [
        {
            "course_id": "ENGL-SHU 100",
            "course_name": "A",
            "description": "ENGL-SHU  100A\n\n   English for Academic Purposes: Seminar: Storying Science: How the Narratives of Science Have Changed\n\nThe objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. We will explore the history of scientific rhetoric by investigating two co-dependent narrative arcs in the “story” of science: the way scientists write/talk/think in scientific discourse, and the way we write/talk/think about science and scientists. For centuries, science bore little resemblance to the empirical discipline that we recognize today, yet, while modern science has clai...\n\n      more description for ENGL-SHU  100A »\n\n      \n\n\n\nThe objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. We will explore the history of scientific rhetoric by investigating two co-dependent narrative arcs in the “story” of science: the way scientists write/talk/think in scientific discourse, and the way we write/talk/think about science and scientists. For centuries, science bore little resemblance to the empirical discipline that we recognize today, yet, while modern science has claimed the language and tools of objectivity, it is wrong to believe that it is free of argument, controversy, and bias. We will consider how science emerged from philosophy, advanced, and adjusted its methodology through ages of renaissance, enlightenment, industrialization, and global expansionism, and usurped religion as the ultimate authority on the “great” questions of life along the way. We will discuss the genres of science writing, science in media and digital science, and debate questions of ethics and popularization. In parallel, we will look at the ways in which science and scientists have been portrayed in popular culture, literature and the visual arts, and equally, how a desire to appear “scientific” has influenced everything from literary theory to advertising. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  100A «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 100",
            "course_name": "B",
            "description": "ENGL-SHU  100B\n\n   English for Academic Purposes: Where do we go from here?\n\nThis freshman EAP course is designed to help develop your academic speaking, listening, reading and writing skills in English. At the same time, as a content-based EAP course, it will aim to help you better understand, discuss, and apply some key concepts from social science and philosophy.  Specifically, this course will examine a distinction many have made in the Twentieth and Twenty-first Centuries (and earlier) between two ways of knowing and living that human beings exhibit.  These two ways are summed up in the course’s title as 1) Massification (a.k.a. objectification, alienation, dehuma...\n\n      more description for ENGL-SHU  100B »\n\n      \n\n\n\nThis freshman EAP course is designed to help develop your academic speaking, listening, reading and writing skills in English. At the same time, as a content-based EAP course, it will aim to help you better understand, discuss, and apply some key concepts from social science and philosophy.  Specifically, this course will examine a distinction many have made in the Twentieth and Twenty-first Centuries (and earlier) between two ways of knowing and living that human beings exhibit.  These two ways are summed up in the course’s title as 1) Massification (a.k.a. objectification, alienation, dehumanization) and 2) Humanization (a.k.a. authenticity, critical consciousness, liberation).  To examine this theme, the course will be further divided into four parts: (1) To begin, we will explore and discuss theories regarding how human beings psychologically & socially construct knowledge/reality. (2) We will then go on to apply these concepts in order to examine a critical feature of our modern world, namely how it is shaped by consumerism/materialism. (3) This will, in turn, lead us to examine the social, environmental, psychological effects consumerism is having on our world and ourselves. (4) This will finally lead us to examine some fundamental, philosophical questions human beings have asked for ages, such as:  What is happiness and how can it be attained? How can one live a meaningful life at this time? How can we improve our society (locally, national and globally)? As you engage with this content, you will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—you will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  100B «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 100",
            "course_name": "C",
            "description": "ENGL-SHU  100C\n\n   EAP Seminar: Cities and Urban Consciousness\n\nCities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. While all four language modalities will be practiced, there is a special focus on speaking and listening. The emphasis is on sensibility and communicating sensibility, encouraging the much-neglected ‘un...\n\n      more description for ENGL-SHU  100C »\n\n      \n\n\n\nCities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. While all four language modalities will be practiced, there is a special focus on speaking and listening. The emphasis is on sensibility and communicating sensibility, encouraging the much-neglected ‘unquantifiables’ as a legitimate area of enquiry, as capable of contributing to research as any other. The course draws on and replicates the lived urban experience in the student’s learning, straddling the Humanities, Social Science and STEM. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  100C «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 100",
            "course_name": "D",
            "description": "ENGL-SHU  100D\n\n   EAP Seminar: The Corporation and the Individual\n\nIn this English for Academic Purposes seminar, we will develop speaking, listening, writing, and reading skills while exploring the relationship between the corporation, or business organization, and the individual. The root of the word “corporation” is “corps” or “body,” and this body has become a complex being in the 21st century. How is it like and not like an individual? What is its obligation to its human parts and what obligation do those human parts have to the whole? In a time of globalization, those human parts are in motion and the borders of the body itself have become more fluid, l...\n\n      more description for ENGL-SHU  100D »\n\n      \n\n\n\nIn this English for Academic Purposes seminar, we will develop speaking, listening, writing, and reading skills while exploring the relationship between the corporation, or business organization, and the individual. The root of the word “corporation” is “corps” or “body,” and this body has become a complex being in the 21st century. How is it like and not like an individual? What is its obligation to its human parts and what obligation do those human parts have to the whole? In a time of globalization, those human parts are in motion and the borders of the body itself have become more fluid, less narrowly defined. What new models of this “body” are emerging? How is it positioned (or not) to meet the demands of the developing century? Are there parallels to this “body” in nature itself? Who are traditional “insiders” and “outsiders” and how might such roles be reimagined? As we interrogate the role of innovation and creative problem-solving in a business setting, we will apply such principles to our own work in the classroom and evaluate their impact. What lessons can be learned or new models explored? As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  100D «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 100",
            "course_name": "S1",
            "description": "ENGL-SHU  100S1\n\n   EAP Seminar: Storying Science: How the narratives of science have changed - Part I\n\nPart I of two sections: The objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. We will explore the history of scientific rhetoric by investigating two co-dependent narrative arcs in the “story” of science: the way scientists write/talk/think in scientific discourse, and the way we write/talk/think about science and scientists. For centuries, science bore little resemblance to the empirical discipline that we recognize today, yet, while...\n\n      more description for ENGL-SHU  100S1 »\n\n      \n\n\n\nPart I of two sections: The objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. We will explore the history of scientific rhetoric by investigating two co-dependent narrative arcs in the “story” of science: the way scientists write/talk/think in scientific discourse, and the way we write/talk/think about science and scientists. For centuries, science bore little resemblance to the empirical discipline that we recognize today, yet, while modern science has claimed the language and tools of objectivity, it is wrong to believe that it is free of argument, controversy, and bias. We will consider how science emerged from philosophy, advanced, and adjusted its methodology through ages of renaissance, enlightenment, industrialization, and global expansionism, and usurped religion as the ultimate authority on the “great” questions of life along the way. We will discuss the genres of science writing, science in media and digital science, and debate questions of ethics and popularization. In parallel, we will look at the ways in which science and scientists have been portrayed in popular culture, literature and the visual arts, and equally, how a desire to appear “scientific” has influenced everything from literary theory to advertising. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  100S1 «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 100",
            "course_name": "S2",
            "description": "ENGL-SHU  100S2\n\n   EAP Seminar: Cities and Urban Consciousness - Part I\n\nPart I of two sections: Cities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. While all four language modalities will be practiced, there is a special focus on speaking and listening. The emphasis is on sensibility and communicating sensibility, encouragin...\n\n      more description for ENGL-SHU  100S2 »\n\n      \n\n\n\nPart I of two sections: Cities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. While all four language modalities will be practiced, there is a special focus on speaking and listening. The emphasis is on sensibility and communicating sensibility, encouraging the much-neglected ‘unquantifiables’ as a legitimate area of enquiry, as capable of contributing to research as any other. The course draws on and replicates the lived urban experience in the student’s learning, straddling the Humanities, Social Science and STEM. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  100S2 «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "A",
            "description": "ENGL-SHU  101A\n\n   English for Academic Purposes: Seminar: Storying Science - Advanced\n\nStorying Science: How the narratives of science have changed throughout history: \nThe objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level seminar. Students will be expected to facilitate seminar discussions and deliver mid-length presentatio...\n\n      more description for ENGL-SHU  101A »\n\n      \n\n\n\nStorying Science: How the narratives of science have changed throughout history: \nThe objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level seminar. Students will be expected to facilitate seminar discussions and deliver mid-length presentations. We will explore the history of scientific rhetoric by investigating two co-dependent narrative arcs in the “story” of science: the way scientists write/talk/think in scientific discourse, and the way we write/talk/think about science and scientists. For centuries, science bore little resemblance to the empirical discipline that we recognize today, yet, while modern science has claimed the language and tools of objectivity, it is wrong to believe that it is free of argument, controversy, and bias. We will consider how science emerged from philosophy, advanced, and adjusted its methodology through ages of renaissance, enlightenment, industrialization, and global expansionism, and usurped religion as the ultimate authority on the “great” questions of life along the way. We will discuss the genres of science writing, science in media and digital science, and debate questions of ethics and popularization. In parallel, we will look at the ways in which science and scientists have been portrayed in popular culture, literature and the visual arts, and equally, how a desire to appear “scientific” has influenced everything from literary theory to advertising. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  101A «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "B",
            "description": "ENGL-SHU  101B\n\n   EAP: Where do we go from here?\n\nFull course title: Where do we go from here? An exploration of Consumerism, Materialism, Alienation & How to Live a Happy and Meaningful Life in the 21st Century. \nThis freshman English for Academic Purposes (EAP) course is designed to help you develop the listening, speaking, reading, writing and critical thinking skills you need to study successfully in an English-speaking university.  Since it is a thematic, content-based EAP course, it also aims to assist you to develop and apply your understandings of certain concepts from social science and the humanities that are important to a well-rou...\n\n      more description for ENGL-SHU  101B »\n\n      \n\n\n\nFull course title: Where do we go from here? An exploration of Consumerism, Materialism, Alienation & How to Live a Happy and Meaningful Life in the 21st Century. \nThis freshman English for Academic Purposes (EAP) course is designed to help you develop the listening, speaking, reading, writing and critical thinking skills you need to study successfully in an English-speaking university.  Since it is a thematic, content-based EAP course, it also aims to assist you to develop and apply your understandings of certain concepts from social science and the humanities that are important to a well-rounded liberal arts education.  Specifically, this course will explore what some regard as an unprecedented, global crisis humanity now faces, a crisis arising from the influences of consumerism and materialism on modern society and culture.  We will further examine what it may mean to live a meaningful and happy life at this time, and what some keys to creating a happier and more sustainable future might be.\n\n      less description for ENGL-SHU  101B «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "C",
            "description": "ENGL-SHU  101C\n\n   English for Academic Purposes: Seminar: Negotiating Self and Other - Advanced\n\nThis seminar is meant to develop English for academic purposes literacy in all four language modalities (speaking, listening, reading, and writing) by exploring an interdisciplinary theme that, while grounded in the social sciences, also cuts across the humanities, especially philosophy. The “self” is a natural place to begin. The problem is that this is all-too-often simply taken for granted. What are selves? Are we what we say we are? But what about the way we appear to others? An important constraint on what we may become is our membership in various communities. Students will be presented ...\n\n      more description for ENGL-SHU  101C »\n\n      \n\n\n\nThis seminar is meant to develop English for academic purposes literacy in all four language modalities (speaking, listening, reading, and writing) by exploring an interdisciplinary theme that, while grounded in the social sciences, also cuts across the humanities, especially philosophy. The “self” is a natural place to begin. The problem is that this is all-too-often simply taken for granted. What are selves? Are we what we say we are? But what about the way we appear to others? An important constraint on what we may become is our membership in various communities. Students will be presented with a variety of texts  (written and visual, including video, audio clips, and print advertising) in order to assist them in forming their opinions about the process of negotiation between self and other in society. Moreover, the concept of ‘negotiation’ itself will be highlighted and explored in this context. Some of the subthemes that will be discussed will be self-concept and identity construction, culture and sub-culture, treatment of minority groups, gender identity development, and material and consumer identities. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  101C «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "D",
            "description": "ENGL-SHU  101D\n\n   The Corporation and the Individual\n\nIn this English for Academic Purposes seminar, we will develop speaking, listening, writing, and reading skills while exploring the relationship between the corporation, or business organization, and the individual. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level seminar. Students will be expected to facilitate seminar discussions and deliver mid-length presentations. The root of the word “corporation” is “corps” or “body,” and this body has bec...\n\n      more description for ENGL-SHU  101D »\n\n      \n\n\n\nIn this English for Academic Purposes seminar, we will develop speaking, listening, writing, and reading skills while exploring the relationship between the corporation, or business organization, and the individual. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level seminar. Students will be expected to facilitate seminar discussions and deliver mid-length presentations. The root of the word “corporation” is “corps” or “body,” and this body has become a complex being in the 21st century. How is it like and not like an individual? What is its obligation to its human parts and what obligation do those human parts have to the whole? In a time of globalization, those human parts are in motion and the borders of the body itself have become more fluid, less narrowly defined. What new models of this “body” are emerging? How is it positioned (or not) to meet the demands of the developing century? Are there parallels to this “body” in nature itself? Who are traditional “insiders” and “outsiders” and how might such roles be reimagined? As we interrogate the role of innovation and creative problem-solving in a business setting, we will apply such principles to our own work in the classroom and evaluate their impact. What lessons can be learned or new models explored? As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  101D «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "E",
            "description": "ENGL-SHU  101E\n\n   Cities and Urban Consciousness\n\nCities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level sem...\n\n      more description for ENGL-SHU  101E »\n\n      \n\n\n\nCities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level seminar. Students will be expected to facilitate seminar discussions and deliver mid-length presentations.The emphasis is on sensibility and communicating sensibility, encouraging the much-neglected ‘unquantifiables’ as a legitimate area of enquiry, as capable of contributing to research as any other. The course draws on and replicates the lived urban experience in the student’s learning, straddling the Humanities, Social Science and STEM. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  101E «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "F TBA",
            "description": "ENGL-SHU  101F TBA",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "G",
            "description": "ENGL-SHU  101G\n\n   Intercultural Communication\n\nPart of the mission of NYU-Shanghai is to enable students to ‘immerse themselves in English, the language of international communication’ as well as ‘master the skills of cross-cultural effectiveness.’ These are perhaps the most important goals that students can set for themselves in today’s global world where people from disparate cultures must come together to solve the big problems of the age. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level s...\n\n      more description for ENGL-SHU  101G »\n\n      \n\n\n\nPart of the mission of NYU-Shanghai is to enable students to ‘immerse themselves in English, the language of international communication’ as well as ‘master the skills of cross-cultural effectiveness.’ These are perhaps the most important goals that students can set for themselves in today’s global world where people from disparate cultures must come together to solve the big problems of the age. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level seminar. Students will be expected to facilitate seminar discussions and deliver mid-length presentations. In order to become effective in communicating across cultural boundaries, one must first ‘know thyself’ and the way that cultural self is perceived by others. Just as a fish in water is not aware of the water, it is difficult to see the always shifting cultural contexts in which global citizens “swim.” At the core of the course is the idea that language and culture are inseparable. Linguistic competence itself is not enough for successful communication in a diverse multicultural world. Students will be engaged to conceptualize and practice intercultural communication and etiquette that is both verbal and non-verbal, question assumptions they have about “normal” communication, and develop the ability to perceive and communicate from multiple intercultural points-of-view. They will also be prompted to develop their own set of intercultural values in light of what they have learned. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  101G «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "S1",
            "description": "ENGL-SHU  101S1\n\n   English for Academic Purposes: Seminar: Storying Science: How the Narratives of Science Have Changed\n\nThe objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. We will explore the history of scientific rhetoric by investigating two co-dependent narrative arcs in the “story” of science: the way scientists write/talk/think in scientific discourse, and the way we write/talk/think about science and scientists. For centuries, science bore little resemblance to the empirical discipline that we recognize today, yet, while modern science has clai...\n\n      more description for ENGL-SHU  101S1 »\n\n      \n\n\n\nThe objective of this seminar is for students to develop and practice academic speaking, listening, reading, and writing skills that will enable them to engage in discourse about how we view science as a discipline. We will explore the history of scientific rhetoric by investigating two co-dependent narrative arcs in the “story” of science: the way scientists write/talk/think in scientific discourse, and the way we write/talk/think about science and scientists. For centuries, science bore little resemblance to the empirical discipline that we recognize today, yet, while modern science has claimed the language and tools of objectivity, it is wrong to believe that it is free of argument, controversy, and bias. We will consider how science emerged from philosophy, advanced, and adjusted its methodology through ages of renaissance, enlightenment, industrialization, and global expansionism, and usurped religion as the ultimate authority on the “great” questions of life along the way. We will discuss the genres of science writing, science in media and digital science, and debate questions of ethics and popularization. In parallel, we will look at the ways in which science and scientists have been portrayed in popular culture, literature and the visual arts, and equally, how a desire to appear “scientific” has influenced everything from literary theory to advertising. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting, with an emphasis on speaking and listening. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  101S1 «",
            "offering": false
        },
        {
            "course_id": "ENGL-SHU 101",
            "course_name": "S2",
            "description": "ENGL-SHU  101S2\n\n   Cities and Urban Consciousness\n\nCities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level sem...\n\n      more description for ENGL-SHU  101S2 »\n\n      \n\n\n\nCities and Urban Consciousness aims to develop students’ speaking, listening, reading, and writing skills while at the same time engendering an intuitive sense of the city. Instead of lectures delivering factual knowledge, the course relies on the mutually enriching interaction between knowing, understanding, thinking and feeling to achieve as comprehensive a sense of urban reality as possible. As this is a 101-level EAP seminar, students will be expected to show greater control of academic speaking and listening and greater autonomy over the learning process than they did in the 100-level seminar. Students will be expected to facilitate seminar discussions and deliver mid-length presentations.The emphasis is on sensibility and communicating sensibility, encouraging the much-neglected ‘unquantifiables’ as a legitimate area of enquiry, as capable of contributing to research as any other. The course draws on and replicates the lived urban experience in the student’s learning, straddling the Humanities, Social Science and STEM. As students engage with this content, they will practice high-level language, communication, and discourse skills required for the university setting. The EAP Seminar is designed to model a college classroom—students will engage with the content of the course individually and in small groups; in formal and informal writing and speaking assignments; and by participating in group projects—but there will be additional emphasis on refining and expanding English language skills.\n\n      less description for ENGL-SHU  101S2 «",
            "offering": false
        }
    ]
}