{
    "major_id": "GCHN-SHU",
    "file": "./2015-2016/Global_China_Studies_(GCHN-SHU).html",
    "courses": [
        {
            "course_id": "GCHN-SHU 110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13212",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Waley-Cohen, Joanna",
                    "time": "Mon,Wed 8.15 AM - 9.30 AM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "The Concept of China",
            "description": "GCHN-SHU  110 The Concept of China \nFrom the Warring States period to the present, what have Chinese and others understood to be the meaning of “China,” and what have been the broad implications of this understanding? This course is divided into four chronological periods: Antiquity—from the period of the ‘central kingdoms’ to the formation of the early empire; Middle Period—China Among Equals; Early Modern: 1350-1910—China, Global Trade, and Imperialism; Modern: 1910-present—China Redux Prerequisite: None.",
            "offering": true
        },
        {
            "course_id": "GCHN-SHU 201",
            "course_name": "Digital Chinese Humanities",
            "description": "GCHN-SHU  201 Digital Chinese Humanities \nThis course introduces students to computational thinking with specific reference to Global China Studies, and provides a foundation for future research. Areas of focus may include the creation, enhancement, and analysis of digitized written texts, especially primary sources; methodologies for the use of the internet as a research and translation tool; the production and processing of photographs: audio recordings: video clips: and geospatial data. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 202",
            "course_name": "Archaeology in China",
            "description": "GCHN-SHU  202 Archaeology in China \nArchaeological discoveries since the early twentieth century and especially in recent years have transformed our understanding of China’s past. This courses addresses those discoveries, introduces students to the art and science of Chinese paleography, and to issues related to site preservation and the world cultural heritage. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 203",
            "course_name": "Art of War in China",
            "description": "GCHN-SHU  203 Art of War in China \nStrategic thought and military practice from Sun Zi to Mao, with attention to the relationship of representations to reality. Introduces to Chinese military history on its own terms rather than viewed through Western eyes. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 204",
            "course_name": "Ethnic Diversity in China",
            "description": "GCHN-SHU  204 Ethnic Diversity in China \nAims to dispel the image of China as monolithic and unvarying by focusing attention on the ebb and flow of in-migration and out-migration in China and on the historical role of ethnic and minority peoples and individuals in China at every level, from everyday life to scientific collaboration to religious belief to leadership. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 206",
            "course_name": "Global (Chinese) Texts",
            "description": "GCHN-SHU  206 Global (Chinese) Texts \nGlobal and local perspectives in the production and consumption of literary texts. The course will focus on a single text or the work of a single author that serves or could serve as the focal point for a cultural heritage that belongs to the entire globe. What made a text “global” in its own day; how has its afterlife transformed it into a global cultural commodity, and how do global media forms carry on its cultural legacy today? Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 207",
            "course_name": "",
            "description": "GCHN-SHU  207\n\n   20th-century Chinese Writers in Global Context\n\nThe literary scene in the 20th centuryChinese-speaking world is diverse in sound and script, vast in the scope of subject matters, and challenging for those migrant or exilic minds whose creative energy is driven by their critical insight to the world around them. Working in,outside, and between places like mainlandChina, Taiwan, Hong Kong, Malaysia, America, and France, Chinese-language writers may have in mind an imagined community of fellow countrymen when they write. Oftentimes, however, they may also ask provocative questions about nationalism, linguistic loyalty, and authenticity as Angl...\n\n      more description for GCHN-SHU  207 »\n\n      \n\n\n\nThe literary scene in the 20th centuryChinese-speaking world is diverse in sound and script, vast in the scope of subject matters, and challenging for those migrant or exilic minds whose creative energy is driven by their critical insight to the world around them. Working in,outside, and between places like mainlandChina, Taiwan, Hong Kong, Malaysia, America, and France, Chinese-language writers may have in mind an imagined community of fellow countrymen when they write. Oftentimes, however, they may also ask provocative questions about nationalism, linguistic loyalty, and authenticity as Anglophone, Francophone, or bilingual writers living in the West. From andacross multiple cultural margins, they speak to probe the nature of modernity, cultural contact, and otherness amid the global flows of labor and ideas. How do Lu Xun, Lao She, Ha Jin, Alai, and Gao Xingjian represent China on the world stage and find their place in this picture? Where in their works can we find stylistic and cultural hybridization? How do novels and stories by Zhang Ailing, Bai Xianyong, Maxine Hong Kingston, Gish Jen, and Shirley Lim cement or deconstruct the conventional ground on which we compare Eastern and Western civilizations? What kind of an alternative literary geography, and worldview, do these writers offer?  Prerequisite: None.\n\n      less description for GCHN-SHU  207 «",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 220",
            "course_name": "Chinese Science",
            "description": "GCHN-SHU  220 Chinese Science \nThis course adopts an interdisciplinary approach to the study of Chinese science and technology analyzed in their intellectual, social, and cultural and global context. We will examine the history, philosophy and anthropology of science and technology in China, including its intersection with natural philosophy, and will also assess the conclusions about culture and national power that used science and technology as the basis of comparison. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 221",
            "course_name": "Chinese Inventions in Global Context",
            "description": "GCHN-SHU  221 Chinese Inventions in Global Context \nTo what extent were the “four great inventions” for which China is known--the compass, gunpowder, printing and paper—the product of collaboration and how did they both enable China to expand its reach into the world beyond its borders and attract outsiders into China? Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 222",
            "course_name": "History of Chinese Medicine",
            "description": "GCHN-SHU  222 History of Chinese Medicine \nIntroduction to the history of Chinese medicine: its origins and transformations. We will explore the history of healing and the medical professions in China from earliest times down to the present, taking into account the interactive development of Traditional Chinese medicine and Western biomedicine, and of developments and discoveries in China and overseas. Students will become familiar with some of the canonical literature on medicine in China and will gain an understanding of the ways in which those texts and ideas have influenced medical practices. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 223",
            "course_name": "Muslim Science and China",
            "description": "GCHN-SHU  223 Muslim Science and China \nChinese-Islamic scientific exchanges across the Silk Roads, covering such areas as astronomy, anatomy, chemistry and other fields as well as the interaction of science and religion in a non-western context. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 224",
            "course_name": "Chinese Maritime History",
            "description": "GCHN-SHU  224 Chinese Maritime History \nInvestigates China’s long tradition of shipbuilding and navigational practice in terms of internal riverine communication, coastal defense, and ocean voyages; its early naval dominance; the famous Ming treasure fleets that sailed as far the Persian Gulf and the east coast of Africa; Qing shipyards; and recent developments. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 231",
            "course_name": "",
            "description": "GCHN-SHU  231\n\n   Social and Cultural Debates in 20th Century China\n\n“Our present trouble lies in our clinging to old institutions without knowing how to change,” Kang Youwei wrote in a letter to the Emperor in 1898. Kang’s concern would dominate intellectual debates over the twentieth century. In this course we will explore social and cultural debates in 20th-century China, focusing on topics such as Confucianism, social reform, nationalism, women empowerment, and art and literature. The questions that will guide this course include:\n\nWhy did scholars like Kang Youwei and Liang Qiyao advocate reform and constitutional monarchy, while others, like Sun Yat-sen a...\n\n      more description for GCHN-SHU  231 »\n\n      \n\n\n\n“Our present trouble lies in our clinging to old institutions without knowing how to change,” Kang Youwei wrote in a letter to the Emperor in 1898. Kang’s concern would dominate intellectual debates over the twentieth century. In this course we will explore social and cultural debates in 20th-century China, focusing on topics such as Confucianism, social reform, nationalism, women empowerment, and art and literature. The questions that will guide this course include:\n\nWhy did scholars like Kang Youwei and Liang Qiyao advocate reform and constitutional monarchy, while others, like Sun Yat-sen and Qiu Jin, called for revolution and the overthrow of the empire? What led to the Chinese Civil War between the Nationalists and the Communists? What was the May Fourth Movement about? Who are Mr. Science and Mr. Democracy? What did Hu Shi and Chen Duxiu mean when they declared classical language ‘dead’? What are Lu Xun’s Diary of a Madman and Ding Ling’s Miss Sophia’s Diary really about? What did Mao Zedong mean when he claimed at the Yan’an Forum, in 1942: “There is in fact no such thing as art for art's sake […] literature and art are the cogs and wheels in the whole revolutionary machine”? What is meant by the Cultural Fever of 1980s China? What made the ‘hooligan’ (流氓) author Wang Shuo a national bestseller in the 1980s? What were the main points of debate between the New Left and the neo-Liberals in the 1990s?\n\n      less description for GCHN-SHU  231 «",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 240",
            "course_name": "Modern Chinese Governance",
            "description": "GCHN-SHU  240 Modern Chinese Governance \nState structure and governance and the question of transition from single party authoritarian rule in a poor society. Considers alternative trajectories from a single party authoritarian rule in a middle income society to a democratic society like those of the formerly authoritarian East Asian societies surrounding China. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 241",
            "course_name": "Chinese Revolutions",
            "description": "GCHN-SHU  241 Chinese Revolutions \nRevolutions both successful and unsuccessful in China; foreign influences and their significance in this context. Ideology,  participation, leadership, strategies and tactics adopted by such diverse groups as the White Lotus, Taiping, and Boxers; the 1911 nationalist and 1949 communist revolutions, and their legacies. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 242",
            "course_name": "",
            "description": "GCHN-SHU  242\n\n   Mao and the Chinese Revolution\n\nThis course introduces the historical relationship established in the twentieth century between Mao Zedong, his philosophy of history and revolution, and the Chinese Revolution in global context. The course provides a thematic lens through which to view one aspect of modern Chinese and global history. The working premise is that the revolution made Mao as much as Mao made the revolution. We will investigate Mao’s thought and theories, as well as his revolutionary practice, not as biographical artifacts but as products of and contributors to the revolutionary situation in China and the world in...\n\n      more description for GCHN-SHU  242 »\n\n      \n\n\n\nThis course introduces the historical relationship established in the twentieth century between Mao Zedong, his philosophy of history and revolution, and the Chinese Revolution in global context. The course provides a thematic lens through which to view one aspect of modern Chinese and global history. The working premise is that the revolution made Mao as much as Mao made the revolution. We will investigate Mao’s thought and theories, as well as his revolutionary practice, not as biographical artifacts but as products of and contributors to the revolutionary situation in China and the world in the twentieth century. We end with Mao’s afterlives. Prerequisite: None.\n\n      less description for GCHN-SHU  242 «",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 243",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17880",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Guttman, Daniel",
                    "time": "Mon 1.15 PM - 4.15 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Chinese Environmental Studies",
            "description": "GCHN-SHU  243 Chinese Environmental Studies \nHow and why has the understanding of humans’ relationship to nature changed in China, and how effectively has the Chinese state responded to environmental challenges at the local, national and global levels? Examines changing approaches to resource exploitation and sustainable development taking into account the impact of different political frameworks. Prerequisite: None.",
            "offering": true
        },
        {
            "course_id": "GCHN-SHU 250",
            "course_name": "Chinese Geographies",
            "description": "GCHN-SHU  250 Chinese Geographies \nThis course examines questions of geography, topography, and ethnography form the early imperial period to the present with special attention to Chinese borderlands. Topics include the relation between center and periphery; cross-border relations; the changing population of residents and sojourners. Han and minorities; travel and transportation networks; and trade and material changes including the \"tributary system\". Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 252",
            "course_name": "",
            "description": "GCHN-SHU  252\n\n   20th-Century East Asia-U.S. Relations\n\nThis is a lecture course focusing on the changing relationship between East Asian countries and the United States in the 20th-century. On the basis of reviewing the early encounters between East Asia and America in the 18th and 19th centuries, this course covers  the major political, economic, military, and cultural developments, as well as the dynamics underlying them, that have shaped the confrontation and cooperation between various East Asian countries and the United States in the past 100 years. In particular, this course aims to help students develop a better understanding of how nations...\n\n      more description for GCHN-SHU  252 »\n\n      \n\n\n\nThis is a lecture course focusing on the changing relationship between East Asian countries and the United States in the 20th-century. On the basis of reviewing the early encounters between East Asia and America in the 18th and 19th centuries, this course covers  the major political, economic, military, and cultural developments, as well as the dynamics underlying them, that have shaped the confrontation and cooperation between various East Asian countries and the United States in the past 100 years. In particular, this course aims to help students develop a better understanding of how nations with different values, cultural-historical backgrounds, political institutions, and levels of economic development may coexist in today’s world.\n\n      less description for GCHN-SHU  252 «",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 260",
            "course_name": "Modern Chinese Economy",
            "description": "GCHN-SHU  260 Modern Chinese Economy \nExamines the major economic transitions (and failures to transform) in China since the establishment of the People’s Republic, and spends considerable time on the current transition from a centrally planned economy to a state-dominated market economy, considering possible future trajectories. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 261",
            "course_name": "China and the Great Depression",
            "description": "GCHN-SHU  261 China and the Great Depression \nHow a combination of global economic depression, domestic political instability, imperialist remnants, and partial occupation affected Chinese economy and society in the 1930s, paying attention to regional and urban/rural difference. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 262",
            "course_name": "China Trade in Global Context",
            "description": "GCHN-SHU  262 China Trade in Global Context \nOverview of Chinese international trade from the ancient Silk Roads to the advent of Europeans and from Chinese control of eighteenth-century intra-Asian markets to its entry into the World Trade Organization. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 263",
            "course_name": "",
            "description": "GCHN-SHU  263\n\n   Voices from the Margin: Modern Chinese and Sinophone Writers\n\nThe literary scene in the modern and contemporary Chinese-speaking world is diverse, vast, and challenging for the migrant and exilic minds whose creative energies are often driven by their poignant insights to the turbulent events around them. Working in, outside, andbetween places like mainland China, Taiwan, Hong Kong, America, and parts of Southeast Asia, Chinese-language writers ask questions about nationalism, tradition, ethno-linguistic politics, and cultural authenticity. They speak from and across multiple cultural margins to probe the nature of modernity, cross-cultural contact, and ...\n\n      more description for GCHN-SHU  263 »\n\n      \n\n\n\nThe literary scene in the modern and contemporary Chinese-speaking world is diverse, vast, and challenging for the migrant and exilic minds whose creative energies are often driven by their poignant insights to the turbulent events around them. Working in, outside, andbetween places like mainland China, Taiwan, Hong Kong, America, and parts of Southeast Asia, Chinese-language writers ask questions about nationalism, tradition, ethno-linguistic politics, and cultural authenticity. They speak from and across multiple cultural margins to probe the nature of modernity, cross-cultural contact, and otherness amid the global flows of labor and ideas.\nThis course invites students to participate in the ongoing discursive and historiographical debates over the study of “modern Chinese literature” through a fast-emerging transnational and comparative perspective. Reading stories, novels, and essays by both established and marginalized writers, we place the traditional nation-based rubric of Chinese literary studies in critical dialogues with a set of jarring historical contexts: Euro-American imperialism, Chinese emigration and their settler-colonial history, the post-1949 political split, and global decolonization movements, among others. We ask: how do writers represent China on the world stage? Where in their works can we discern stylistic and cultural hybridization? How do they variously cement or deconstruct the conventional East-West divide? What alternative literary geographies and worldviews do they offer? We begin with the satirical modernists of Republican-era China. Next, we turn to Hong Kong and Taiwan for identity debates, colonial legacies, nativism, and postmodern cultures. In light of the global migration history, we also study narratives from Chinese-speaking America, Malaysia, and Singapore to analyze how writers creatively deconstruct the notion of Chineseness. Finally, we discuss the changing terms of exclusion and inclusion of ethnic minorities in present-day Han-Chinese societies, to further expose the internal fractures within the global Sinophone cultures.\n\n      less description for GCHN-SHU  263 «",
            "offering": false
        },
        {
            "course_id": "GCHN-SHU 264",
            "course_name": "",
            "description": "GCHN-SHU  264\n\n   Chinese Migrant and Diasporic Networks\n\nThe history of Chinese emigration spans numerous centuries, continents, and islands. Equally heterogeneous, one should note, are the lived experiences of migrants and their younger generations. In recent decades, ideas like “Chinese transnationalism” and the “rise of China” have gained ground among popular and academic circles East and West; at times, they generate the nervous Exclusion-era imagination of a looming “Asiatic takeover.” Such a fervently growing imagination notwithstanding, this line of discourse and belief suggests a number of persistent problems in the studies of Chinese overse...\n\n      more description for GCHN-SHU  264 »\n\n      \n\n\n\nThe history of Chinese emigration spans numerous centuries, continents, and islands. Equally heterogeneous, one should note, are the lived experiences of migrants and their younger generations. In recent decades, ideas like “Chinese transnationalism” and the “rise of China” have gained ground among popular and academic circles East and West; at times, they generate the nervous Exclusion-era imagination of a looming “Asiatic takeover.” Such a fervently growing imagination notwithstanding, this line of discourse and belief suggests a number of persistent problems in the studies of Chinese overseas, or Chinese diaspora: for one, while recognition of a global Chinese presence has taken on renewed importance in recent years, scholarly conversations have been modest and sporadic at best, when it comes to scrutinizing the full spectrum of migrant and diasporic cultures (both in and prior to the twentieth century) beyond the re-iterations of ethnic homogeneity, nationalist sentiments, nostalgia, and cultural alienation. Among the humanists, the failure to address long-term practices of social indigenization, multiethnic networks, and the change of cultural affinities makes our current historical juncture a particularly urgent one for reconsidering the meanings of these globalizing networks and the applicability of “Chinese” to the inherently diverse diasporic articulations.\nMaterials of our study are drawn from multidisciplinary sources, including history, theory, fiction, and visual culture. Students learn toexplore the intricate conditions underlying the representations, making, and unmaking of Chinese subjectivities. Some topics of interest include Zheng He’s now legendary maritime travels on the imperial treasure fleets, the opium trade and its implication for early transnational Chinese capitalism, labor migration and exclusion in North America, socio-political and cultural indigenization of Chinese communities in Southeast Asia, and the coolie trade in the Caribbean region.\n\n      less description for GCHN-SHU  264 «",
            "offering": false
        }
    ]
}