{
    "major_id": "HEL-UA",
    "file": "./2015-2016/Hellenic_Studies_(HEL-UA).html",
    "courses": [
        {
            "course_id": "HEL-UA 103",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7073",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue,Wed,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "285M 8FL"
                }
            ],
            "course_name": "",
            "description": "HEL-UA  103\n\n   Elementary Moder Greek I\n\nOpen to students with no previous training in Greek and to others by permission of the instructor. Elementary I offered in the fall; Elementary II offered in the spring. 4 points per term. An introduction to modern Greek. Provides students with the fundamentals of grammar, syntax, oral expression, listening comprehension, reading, and composition. Students develop the skills and vocabulary necessary to read simple texts and hold basic conversations. Students are introduced to modern Greek culture, history, and society, since the ultimate goal of the course is to enrich our understanding of mul...\n\n      more description for HEL-UA  103 »\n\n      \n\n\n\nOpen to students with no previous training in Greek and to others by permission of the instructor. Elementary I offered in the fall; Elementary II offered in the spring. 4 points per term. An introduction to modern Greek. Provides students with the fundamentals of grammar, syntax, oral expression, listening comprehension, reading, and composition. Students develop the skills and vocabulary necessary to read simple texts and hold basic conversations. Students are introduced to modern Greek culture, history, and society, since the ultimate goal of the course is to enrich our understanding of multiple, living Greek realities through the language. Teaching materials include current newspaper articles, graded literary passages, songs, and various linguistic games.\n\n      less description for HEL-UA  103 «",
            "offering": true
        },
        {
            "course_id": "HEL-UA 104",
            "course_name": "Elementary Mod Greek II",
            "description": "HEL-UA  104 Elementary Mod Greek II",
            "offering": false
        },
        {
            "course_id": "HEL-UA 105",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7074",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue,Wed,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "285M 8FL"
                }
            ],
            "course_name": "",
            "description": "HEL-UA  105\n\n   Intermediate Mod Greek I\n\nDesigned for students already familiar with modern Greek. Students are expected to be acquainted with the most significant structures of grammar and syntax, and to have acquired the foundations for basic conversation in Greek. Introduces students to more complex linguistic and grammatical analysis, advanced composition, and graded reading. It also provides further practice in speaking and works to enrich the student's vocabulary. Readings and discussions of selected works of prose, poetry, and theatre serve as an introduction to aspects of modern Greek civilization and as an occasion for compr...\n\n      more description for HEL-UA  105 »\n\n      \n\n\n\nDesigned for students already familiar with modern Greek. Students are expected to be acquainted with the most significant structures of grammar and syntax, and to have acquired the foundations for basic conversation in Greek. Introduces students to more complex linguistic and grammatical analysis, advanced composition, and graded reading. It also provides further practice in speaking and works to enrich the student's vocabulary. Readings and discussions of selected works of prose, poetry, and theatre serve as an introduction to aspects of modern Greek civilization and as an occasion for comprehensive discuPrerequisite: V56.0104 for V56.0105, V56.0105 for V56.0106, or permission of the instructor. Intermediate I offered in the fall; Intermediate II offered in the spring. 4 points per term. Designed for students already familiar with modern Greek. Students are expected to be acquainted with the most significant structures of grammar and syntax, and to have acquired the foundations for basic conversation in Greek. Introduces students to more complex linguistic and grammatical analysis, advanced composition, and graded reading. It also provides further practice in speaking and works to enrich the student's vocabulary. Readings and discussions of selected works of prose, poetry, and theatre serve as an introduction to aspects of modern Greek civilization and as an occasion for comprehensive discussions of contemporary Greek society.\n\n      less description for HEL-UA  105 «",
            "offering": true
        },
        {
            "course_id": "HEL-UA 106",
            "course_name": "Intermediate Modern Greek II",
            "description": "HEL-UA  106 Intermediate Modern Greek II",
            "offering": false
        },
        {
            "course_id": "HEL-UA 107",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7075",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon,Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "285M 8FL09/02/2015 - 12/15/2015 Wed 3.30 PM - 4.45 PM at 285M 8FL"
                }
            ],
            "course_name": "",
            "description": "HEL-UA  107\n\n   Advanced Modern Greek I\n\nFocus is on advanced composition and oral practices, with the aim of refining an understanding and general facility with written and spoken Greek. Course work is designed to help students develop a comprehensive vocabulary, improve pronunciation, and increase their effectiveness, accuracy, and fluency in writing and speaking the language. Enhances and perfects reading, speaking, conversational, and writing skills through the close study of selected modern Greek literary texts, current newspaper articles and essays, films, advertisements, and comprehensive discussions of contemporary Greek soci...\n\n      more description for HEL-UA  107 »\n\n      \n\n\n\nFocus is on advanced composition and oral practices, with the aim of refining an understanding and general facility with written and spoken Greek. Course work is designed to help students develop a comprehensive vocabulary, improve pronunciation, and increase their effectiveness, accuracy, and fluency in writing and speaking the language. Enhances and perfects reading, speaking, conversational, and writing skills through the close study of selected modern Greek literary texts, current newspaper articles and essays, films, advertisements, and comprehensive discussions of contemporary Greek society. Explores major facets and phenomena of Greek culture: current social and political issues, events, and controversies in Greece; Greece's position \"in the margins of Europe\" and at the crossroads of East and West; gender politics; the educational system; the political landscape; discourses on the question of Greek identity; and topics in popular culture. Through individual projects, oral reports, class presentation, and written assignments, students are expected to pursue an in-depth \"reading\" of present-day Greece.\n\n      less description for HEL-UA  107 «",
            "offering": true
        },
        {
            "course_id": "HEL-UA 108",
            "course_name": "Advanced Modern Greek II",
            "description": "HEL-UA  108 Advanced Modern Greek II",
            "offering": false
        },
        {
            "course_id": "HEL-UA 111",
            "course_name": "Comedy",
            "description": "HEL-UA  111 Comedy",
            "offering": false
        },
        {
            "course_id": "HEL-UA 112",
            "course_name": "Byzantine Civilization",
            "description": "HEL-UA  112 Byzantine Civilization",
            "offering": false
        },
        {
            "course_id": "HEL-UA 113",
            "course_name": "The Crusades",
            "description": "HEL-UA  113 The Crusades",
            "offering": false
        },
        {
            "course_id": "HEL-UA 120",
            "course_name": "",
            "description": "HEL-UA  120\n\n   Memory, History, & Language in Modern Greek Poetry\n\nA survey of 20th-century Greek poetry in a historical and cultural context. Among the poets studied are C. P. Cavafy; the Nobel laureates George Seferis and Odysseus Elytis; the Lenin Prize winner Yannis Ritsos; the surrealists Andreas Embiricos and Nikos Engonopoulos; the postwar generation of poets, including Miltos Sahtouris, Takis Sinopoulos, and Manolis Anagnostakis; and women poets, including Matsi Hatzilazarou and Kiki Dimoula. Note: All texts are available in both Greek and English; critical texts in English only. Class discussion is conducted in English. No background specific to Gree...\n\n      more description for HEL-UA  120 »\n\n      \n\n\n\nA survey of 20th-century Greek poetry in a historical and cultural context. Among the poets studied are C. P. Cavafy; the Nobel laureates George Seferis and Odysseus Elytis; the Lenin Prize winner Yannis Ritsos; the surrealists Andreas Embiricos and Nikos Engonopoulos; the postwar generation of poets, including Miltos Sahtouris, Takis Sinopoulos, and Manolis Anagnostakis; and women poets, including Matsi Hatzilazarou and Kiki Dimoula. Note: All texts are available in both Greek and English; critical texts in English only. Class discussion is conducted in English. No background specific to Greece is required.\n\n      less description for HEL-UA  120 «",
            "offering": false
        },
        {
            "course_id": "HEL-UA 124",
            "course_name": "Topics:",
            "description": "HEL-UA  124 Topics:",
            "offering": false
        },
        {
            "course_id": "HEL-UA 130",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "16838",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 3.30 PM - 6.00 PM",
                    "open": true,
                    "professor": "285M 8FL"
                }
            ],
            "course_name": "Seminar On Modern Greek Culture",
            "description": "HEL-UA  130 Seminar On Modern Greek Culture",
            "offering": true
        },
        {
            "course_id": "HEL-UA 140",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16878",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": "285M 8FL"
                }
            ],
            "course_name": "Topics:Tpcs: Mod Greek Culture",
            "description": "HEL-UA  140 Topics:Tpcs: Mod Greek Culture",
            "offering": true
        },
        {
            "course_id": "HEL-UA 143",
            "course_name": "Greek Drama: Aeschylus Sophocles, Euripides",
            "description": "HEL-UA  143 Greek Drama: Aeschylus Sophocles, Euripides",
            "offering": false
        },
        {
            "course_id": "HEL-UA 159",
            "course_name": "Modern Greek History",
            "description": "HEL-UA  159 Modern Greek History",
            "offering": false
        },
        {
            "course_id": "HEL-UA 175",
            "course_name": "The Balkans Since 1800",
            "description": "HEL-UA  175 The Balkans Since 1800",
            "offering": false
        },
        {
            "course_id": "HEL-UA 190",
            "course_name": "",
            "description": "HEL-UA  190\n\n   Modern Greek Novel and Prose\n\nA survey of the modern Greek novel, and to a lesser extent the short story, structured around narrative technique and the claim to fact(s) and/or fiction(s) in Greece?s turbulent modern history. Readings include some of the masterpieces from this tradition as well as the work of some promising contemporary writers. Selections also suggest some recurrent perspectives on questions of language, gender, and nation in Greece. Comparative reference is made to other Balkan, Mediterranean, European, and world literatures. Note: All texts are available in both Greek and English; critical texts in Engli...\n\n      more description for HEL-UA  190 »\n\n      \n\n\n\nA survey of the modern Greek novel, and to a lesser extent the short story, structured around narrative technique and the claim to fact(s) and/or fiction(s) in Greece?s turbulent modern history. Readings include some of the masterpieces from this tradition as well as the work of some promising contemporary writers. Selections also suggest some recurrent perspectives on questions of language, gender, and nation in Greece. Comparative reference is made to other Balkan, Mediterranean, European, and world literatures. Note: All texts are available in both Greek and English; critical texts in English only. Class discussion is conducted in English. No background specific to Greece is required.\n\n      less description for HEL-UA  190 «",
            "offering": false
        },
        {
            "course_id": "HEL-UA 193",
            "course_name": "Balkans & Balkanization Thru Lit & Film",
            "description": "HEL-UA  193 Balkans & Balkanization Thru Lit & Film \nA selective study of the representation of the 20th-century Balkans through some of the most celebrated literary works and films of the region. Considers the presentation of, and contestation over, a shared historical past through common and divergent motifs, myths, and narrative devices. Also examines the region?s political and aesthetic relation to the West in this century.",
            "offering": false
        },
        {
            "course_id": "HEL-UA 229",
            "course_name": "",
            "description": "HEL-UA  229\n\n   Ritsos and The Tragic Vision\n\nHow is it that the dead speak? In what way can the past be said to survive in the present?tragically? These are the questions around which Yannis Ritsos?s The Fourth Dimension is organized. Composed of a series of dramatic monologues that move between the past and the present, the dead and the living, Ritsos?s poem demands that we think about the relations between memory, history, and language. This course traces Ritsos?s poetic strategies by reading and reconstructing the classical intertexts that inform The Fourth Dimension. In each instance, it seeks to analyze the reasons behind his approp...\n\n      more description for HEL-UA  229 »\n\n      \n\n\n\nHow is it that the dead speak? In what way can the past be said to survive in the present?tragically? These are the questions around which Yannis Ritsos?s The Fourth Dimension is organized. Composed of a series of dramatic monologues that move between the past and the present, the dead and the living, Ritsos?s poem demands that we think about the relations between memory, history, and language. This course traces Ritsos?s poetic strategies by reading and reconstructing the classical intertexts that inform The Fourth Dimension. In each instance, it seeks to analyze the reasons behind his appropriations, distortions, revisions, and translations of these classical texts.\n\n      less description for HEL-UA  229 «",
            "offering": false
        },
        {
            "course_id": "HEL-UA 242",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19731",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "CANT 101",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Kowalzig, Barbara"
                }
            ],
            "course_name": "Greek History from The Bronze Age to Alexander",
            "description": "HEL-UA  242 Greek History from The Bronze Age to Alexander",
            "offering": true
        },
        {
            "course_id": "HEL-UA 243",
            "course_name": "The Greek World: Alexander to Augustus",
            "description": "HEL-UA  243 The Greek World: Alexander to Augustus",
            "offering": false
        },
        {
            "course_id": "HEL-UA 266",
            "course_name": "Christianizing The Roman Empire& Early Mod Europe",
            "description": "HEL-UA  266 Christianizing The Roman Empire& Early Mod Europe",
            "offering": false
        },
        {
            "course_id": "HEL-UA 283",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16907",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 501",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Smyrlis, Konstantinos"
                }
            ],
            "course_name": "Topics:Byzantine History, 4th-9th Centuries",
            "description": "HEL-UA  283 Topics:Byzantine History, 4th-9th Centuries \nn/a",
            "offering": true
        },
        {
            "course_id": "HEL-UA 297",
            "course_name": "Western Europe & Greece 1700 - 1900",
            "description": "HEL-UA  297 Western Europe & Greece 1700 - 1900",
            "offering": false
        },
        {
            "course_id": "HEL-UA 320",
            "course_name": "",
            "description": "HEL-UA  320\n\n   Greek Tragedy and Modern Greece\n\nNo prerequisites.\nThis course examines the ways in which Greek Tragedy is re-imagined within the broader context of Modern Greek culture from the early twentieth century to today. It is based on the premise that the encounter with the ancient texts enables Modern Greek writers, playwrights, and directors to think through, embody, and sometimes problematize concerns about nationhood, tradition and modernity, classicism and experimentation. Greek Tragedy is approached both thematically and formally, as text and vehicle for performance. This interface between the ancients and the moderns acquires...\n\n      more description for HEL-UA  320 »\n\n      \n\n\n\nNo prerequisites.\nThis course examines the ways in which Greek Tragedy is re-imagined within the broader context of Modern Greek culture from the early twentieth century to today. It is based on the premise that the encounter with the ancient texts enables Modern Greek writers, playwrights, and directors to think through, embody, and sometimes problematize concerns about nationhood, tradition and modernity, classicism and experimentation. Greek Tragedy is approached both thematically and formally, as text and vehicle for performance. This interface between the ancients and the moderns acquires particular relevance and urgency at moments of political crisis, such as the civil war, the military dictatorship, and the contemporary crisis. This course will approach this dialogue within these specific historico-political contexts and concentrate on the modes of writing and re-writing it has helped to shape. The course will examine the classical play-texts and the ways they have been re-imagined not only on the stage, but also in Modern Greek poetry, fiction, and film.\n\n      less description for HEL-UA  320 «",
            "offering": false
        },
        {
            "course_id": "HEL-UA 333",
            "course_name": "",
            "description": "HEL-UA  333\n\n   Grk Diaspora: Odyssean Metaphor Homer-Angelpols\n\nGreek stories and myths of dispersal, settlement, and return have provided Western culture with some of its foundational fictions. This course examines how some of these structuring metaphors and foundational narratives?notions of home and exile?have informed the Greeks? own stories in a variety of geographical and historical contexts and times: (1) in the historical diaspora communities of Greeks: in Renaissance Venice; in certain European urban centers prior to nation-building in the 18th-century Enlightenment; in Alexandria and Smyrna, now Izmir, of the late 19th century and early 20th cent...\n\n      more description for HEL-UA  333 »\n\n      \n\n\n\nGreek stories and myths of dispersal, settlement, and return have provided Western culture with some of its foundational fictions. This course examines how some of these structuring metaphors and foundational narratives?notions of home and exile?have informed the Greeks? own stories in a variety of geographical and historical contexts and times: (1) in the historical diaspora communities of Greeks: in Renaissance Venice; in certain European urban centers prior to nation-building in the 18th-century Enlightenment; in Alexandria and Smyrna, now Izmir, of the late 19th century and early 20th century, and Cyprus; and (2) among the Greeks of the United States.\n\n      less description for HEL-UA  333 «",
            "offering": false
        },
        {
            "course_id": "HEL-UA 444",
            "course_name": "From Classicism to Afrocentrism",
            "description": "HEL-UA  444 From Classicism to Afrocentrism \nAn introductory, selective survey and critical interpretation of Western conceptions of the idea of Greece, the Hellenic, and the Greeks in a variety of contexts: classical humanism, classical philology, philhellenism, exoticism, orientalism, hellenophobia, hellenism as paganism, aesthetics, homosexuality, Romantic nationalism, racism, the Hellenic and the Hebraic, political correctness and political chauvinism, Afrocentrism, etc. Readings from a range of European literary, critical, and theoretical texts; as well as modern Greek appropriations of, and resistances to, such projections.",
            "offering": false
        },
        {
            "course_id": "HEL-UA 525",
            "course_name": "Modern Greek Politics",
            "description": "HEL-UA  525 Modern Greek Politics",
            "offering": false
        },
        {
            "course_id": "HEL-UA 527",
            "course_name": "Politics of Southern Europe",
            "description": "HEL-UA  527 Politics of Southern Europe",
            "offering": false
        },
        {
            "course_id": "HEL-UA 700",
            "course_name": "The Greek Thinkers",
            "description": "HEL-UA  700 The Greek Thinkers",
            "offering": false
        },
        {
            "course_id": "HEL-UA 846",
            "course_name": "Birth of The Church",
            "description": "HEL-UA  846 Birth of The Church",
            "offering": false
        },
        {
            "course_id": "HEL-UA 901",
            "course_name": "Topics:",
            "description": "HEL-UA  901 Topics:",
            "offering": false
        },
        {
            "course_id": "HEL-UA 902",
            "course_name": "Tpcs: The Mediterranean in Historical Perspec",
            "description": "HEL-UA  902 Tpcs: The Mediterranean in Historical Perspec",
            "offering": false
        },
        {
            "course_id": "HEL-UA 980",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "7077",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship",
            "description": "HEL-UA  980 Internship \nn/a",
            "offering": true
        },
        {
            "course_id": "HEL-UA 997",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "7078",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "HEL-UA  997 Independent Study \nn/a",
            "offering": true
        },
        {
            "course_id": "HEL-UA 999",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7079",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "CASA 201"
                }
            ],
            "course_name": "Senior Honors Seminar",
            "description": "HEL-UA  999 Senior Honors Seminar \nn/a",
            "offering": true
        },
        {
            "course_id": "HEL-UA 9103",
            "course_name": "Elem Modern Greek I",
            "description": "HEL-UA 9103 Elem Modern Greek I",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9104",
            "course_name": "Elem Modern Greek II",
            "description": "HEL-UA 9104 Elem Modern Greek II",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9105",
            "course_name": "Interm Modern Greek I",
            "description": "HEL-UA 9105 Interm Modern Greek I",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9106",
            "course_name": "Interm Modern Greek II",
            "description": "HEL-UA 9106 Interm Modern Greek II",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9130",
            "course_name": "The City of Athens",
            "description": "HEL-UA 9130 The City of Athens",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9143",
            "course_name": "Greek Drama",
            "description": "HEL-UA 9143 Greek Drama",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9150",
            "course_name": "A Land of Light & Shadows: Modern Greek Lit & Phtg",
            "description": "HEL-UA 9150 A Land of Light & Shadows: Modern Greek Lit & Phtg",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9159",
            "course_name": "Modern Greek History",
            "description": "HEL-UA 9159 Modern Greek History",
            "offering": false
        },
        {
            "course_id": "HEL-UA 9997",
            "course_name": "Independent Study",
            "description": "HEL-UA 9997 Independent Study",
            "offering": false
        }
    ]
}