{
    "major_id": "TCHS1-GC",
    "file": "./2015-2016/Hospitality_Management_MA-GC_(TCHS1-GC).html",
    "courses": [
        {
            "course_id": "TCHS1-GC 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2689",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC    1\n\n   Industry Orientation\n\nEvery industry has its own unique patterns of organizational behavior, distribution systems, supply analysis, and other managerial challenges. This course examines the spectrum of entities that comprise the Hospitality, Tourism, and Travel Industries through management analysis and economic impact of each tourism sector group. The class explores developing strategic partnerships, designing public-private interfaces, creating of management practices, and current hospitality and tourism trends and impacts. Use of senior-level industry experts will aid this overview of the worldwide hospitality a...\n\n      more description for TCHS1-GC    1 »\n\n      \n\n\n\nEvery industry has its own unique patterns of organizational behavior, distribution systems, supply analysis, and other managerial challenges. This course examines the spectrum of entities that comprise the Hospitality, Tourism, and Travel Industries through management analysis and economic impact of each tourism sector group. The class explores developing strategic partnerships, designing public-private interfaces, creating of management practices, and current hospitality and tourism trends and impacts. Use of senior-level industry experts will aid this overview of the worldwide hospitality and tourism industry.\n\n      less description for TCHS1-GC    1 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 2",
            "course_name": "Writing Strategies for Graduate Students",
            "description": "TCHS1-GC    2 Writing Strategies for Graduate Students",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 5",
            "course_name": "",
            "description": "TCHS1-GC    5\n\n   Industry & Business Principles\n\nThis course provides an overview of basic economic, accounting, and finance principles and concepts.  Its purpose is to set the foundation upon which in-depth economic, accounting, and finance theory rests.  Topics include basic supply and demand theory with price relationships, the concept of elasticity and market adjustments, the difference between macro and micro economics, international trade, exchange rates, the concept of a market economy, the role of the firm, business cycles, inflation, recession, basic financial mathematics, concept of leverage, debt and equity, and basic accounting a...\n\n      more description for TCHS1-GC    5 »\n\n      \n\n\n\nThis course provides an overview of basic economic, accounting, and finance principles and concepts.  Its purpose is to set the foundation upon which in-depth economic, accounting, and finance theory rests.  Topics include basic supply and demand theory with price relationships, the concept of elasticity and market adjustments, the difference between macro and micro economics, international trade, exchange rates, the concept of a market economy, the role of the firm, business cycles, inflation, recession, basic financial mathematics, concept of leverage, debt and equity, and basic accounting and financial terminology.  Also included are basic computer operations and financial calculator procedures.\n\n      less description for TCHS1-GC    5 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 8",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2691",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Critical Thinking & Communication",
            "description": "TCHS1-GC    8 Critical Thinking & Communication \nThis workshop is designed to provide students with an overview of critical thinking and communications.  The content will review the concepts of critical thinking by examining the evaluation and analytical skills in reading, writing, speaking and listening. Emphasis will be placed on the process of analyzing and organizing thinking before and during written and verbal communications.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 9",
            "course_name": "Graduate Internship",
            "description": "TCHS1-GC    9 Graduate Internship \nThe Center arranges with various hotel and tourism enterprises, internships for students who have successfully completed 15 credits of coursework. Students work a minimum of 300 hours during the period of the internship. Admission to an internship depends on availability and approval from both the program?s internship office and the cooperating employer.",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 10",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2780",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Career and Professional Development",
            "description": "TCHS1-GC   10 Career and Professional Development \nAn overview of the career process. Topics to be covered include: focusing professional skills and interests, writing effective resumes and cover letters, interviewing and networking techniques, conducting a job search, and managing career transitions.\nPrerequisites:  Completion of TCHS1-GC.0001 – Industry Orientation, Y65.0005 Industry and Business Principles, and TCHS1-GC.0008 – Critical Thinking and Communication.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17208",
                    "section": "001",
                    "period": "09/03/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS LL143"
                },
                {
                    "format": "Lecture",
                    "class_id": "17206",
                    "section": "002",
                    "period": "09/04/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 1010\n\n   Leadership & Organiztnl Behavior\n\nEffective professionals must understand modern leadership and behavior within their organizations.  The concepts of leadership versus management, the development of culture within an organization and the formation of effective contemporary leadership techniques are the focus of this course.  Issues such as managing diversity, transformational leadership and modern leadership theory will be discussed in detail.  Topics covered in this class include comparative leadership models effective communication, global leadership issues, individual and group motivational theory, team-building and managin...\n\n      more description for TCHS1-GC 1010 »\n\n      \n\n\n\nEffective professionals must understand modern leadership and behavior within their organizations.  The concepts of leadership versus management, the development of culture within an organization and the formation of effective contemporary leadership techniques are the focus of this course.  Issues such as managing diversity, transformational leadership and modern leadership theory will be discussed in detail.  Topics covered in this class include comparative leadership models effective communication, global leadership issues, individual and group motivational theory, team-building and managing change in organizational settings.\n\n      less description for TCHS1-GC 1010 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1025",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2905",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 1025\n\n   Strategy Formulation & Decision-Making\n\nThe formulation and implementation of strategy is vital to the success in today?s business world.  This course analyzes the strategy formulation process and the decision making process required for strategy implementation.  Strategy planning, formulation, translation, feedback and evaluation are explored as well as the process of making effective decisions involving the long-term success of hospitality and tourism organizations.  Topics include the principles of strategy formulation, factors effecting effective strategy implementation, criteria for success, measurement, and the tenets of effec...\n\n      more description for TCHS1-GC 1025 »\n\n      \n\n\n\nThe formulation and implementation of strategy is vital to the success in today?s business world.  This course analyzes the strategy formulation process and the decision making process required for strategy implementation.  Strategy planning, formulation, translation, feedback and evaluation are explored as well as the process of making effective decisions involving the long-term success of hospitality and tourism organizations.  Topics include the principles of strategy formulation, factors effecting effective strategy implementation, criteria for success, measurement, and the tenets of effective decision-making within hospitality and tourism service organizations.\n\n      less description for TCHS1-GC 1025 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2692",
                    "section": "001",
                    "period": "09/03/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "SILV 509"
                },
                {
                    "format": "Lecture",
                    "class_id": "17514",
                    "section": "002",
                    "period": "09/04/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.30 AM - 2.00 PM",
                    "open": true,
                    "professor": "7E12 121 (SB)"
                }
            ],
            "course_name": "Consulting Strategies",
            "description": "TCHS1-GC 1030 Consulting Strategies \nThis course examines current techniques and practices used by industry consulting professionals.  Both consulting firms and individual consultancies are explored to provide the range of possible career opportunities.  Required technical, interpersonal and consulting skills are integrated through the use of case studies and hospitality and tourism examples.  The criteria for successful consulting are outlined and discussed in detail. Topics include contracting, negotiating, diagnosing, data collecting, discovery, reporting, and project management.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1040",
            "course_name": "Tourism Planning",
            "description": "TCHS1-GC 1040 Tourism Planning",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 1050",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17371",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "TISC LC9"
                },
                {
                    "format": "Lecture",
                    "class_id": "17212",
                    "section": "002",
                    "period": "09/03/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Applied Research Methods",
            "description": "TCHS1-GC 1050 Applied Research Methods \nThis course presents a managerial as well as technical perspective to research. The research process is useful in every aspect of the hospitality and tourism industries. Quantitative and qualitative tools, techniques and methods of applied research are explored in the framework of general guidelines for empirical work. Topics will include sampling techniques, research design, data collection and problems of measurement. Statistical methods such as frequency, variability, sampling and observation will form the basis for performing applied industry research.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2694",
                    "section": "001",
                    "period": "09/14/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "GCASL 279"
                }
            ],
            "course_name": "Marketing Strategies",
            "description": "TCHS1-GC 1120 Marketing Strategies \nThis course focuses on the marketing strategies involved in developing and implementing initiatives for hospitality and tourism products.  Students examine different market strategies as they relate to single and multi-markets, with a look at the feasibility of a total market strategy.  Emphasis is placed on positioning, product and service sub-strategy, communication, distribution and pricing strategies.  The variables in marketing communication including analysis of media resources message creation, effectiveness and evaluation of promotion are explored.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2695",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3045",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Hospitality Finance",
            "description": "TCHS1-GC 1200 Hospitality Finance \nThe concepts and techniques of hospitality managerial accounting are explored in-depth.  The similarities and differences in the views of managers, creditors and owners are analyzed to provide an understanding of varying financial objectives and goals.    Analysis and interpretation of financial statements, the formation of operational and capital budgets, and the use of ratio analysis are investigated.  Additional topics include break-even analysis, pricing strategies, forecasting, and effective cash management.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1300",
            "course_name": "Economic & Statistical Analysis",
            "description": "TCHS1-GC 1300 Economic & Statistical Analysis",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 1320",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3046",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Legal Issues",
            "description": "TCHS1-GC 1320 Legal Issues \nThis course explores the legal aspects and tactics incorporated in the process of acquiring, owning, and disposing of hotel properties. The focus is on understanding hotel/guest liabilities, the sales contract, ownership models, the management agreement, the franchise and licensing agreements, and the labor and employment contracts. Issues, such as the Americans with Disabilities Act, environmental factors, and compliance with governmental regulations, are explored. The course also includes the negotiation and preparation of basic lease, purchase, and sale agreements.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 1910",
            "course_name": "Advanced Special Project",
            "description": "TCHS1-GC 1910 Advanced Special Project \nof the program; Applied Research for Hospitality and Tourism/Y65.1050. Designed to synthesize knowledge gained throughout the program of study. The Advanced Special Project is expected to combine applied research methods and theoretical knowledge to focus on a relevant topical area. Projects are to demonstrate mastery of topical areas covered in earlier master's courses.",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 1920",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2922",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "SILV 208"
                },
                {
                    "format": "Seminar",
                    "class_id": "17521",
                    "section": "002",
                    "period": "09/04/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 8.00 AM - 10.30 AM",
                    "open": true,
                    "professor": "TISC LC6"
                }
            ],
            "course_name": "Advanced Research Seminar",
            "description": "TCHS1-GC 1920 Advanced Research Seminar \nStudents examine current trends and issues that affect rapid changes and/or the evolution of the industry by conducting a group research project. Topics may cover a broad range of current industry concerns including policy, development, financing, operational issues, and management.  The evolving sophistication of the industry is discussed as it relates to the current and future models of the hospitality and tourism market. Course normally taken in student?s last semester of study.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 2000",
            "course_name": "",
            "description": "TCHS1-GC 2000\n\n   Information Systems in Hospitality & Tourism\n\nThis course provides an in depth investigation of the management of technology and eCommerce strategies used by the hospitality industry.  Creating the ?business case? for the acquisition and implementation of information technology (IT) in hospitality organizations is explored through various criteria including cost/benefit analysis and ROI models.  Effective use of eKnowledge and eProcurement systems is also examined.  Topics include IT strategy formulation and implementation; a survey of industry specific software and hardware; wireless technology; various distribution systems; cost and rev...\n\n      more description for TCHS1-GC 2000 »\n\n      \n\n\n\nThis course provides an in depth investigation of the management of technology and eCommerce strategies used by the hospitality industry.  Creating the ?business case? for the acquisition and implementation of information technology (IT) in hospitality organizations is explored through various criteria including cost/benefit analysis and ROI models.  Effective use of eKnowledge and eProcurement systems is also examined.  Topics include IT strategy formulation and implementation; a survey of industry specific software and hardware; wireless technology; various distribution systems; cost and revenue impacts; organizational and customer impacts; and projected changes for the future.\n\n      less description for TCHS1-GC 2000 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 2012",
            "course_name": "Legal Issues II",
            "description": "TCHS1-GC 2012 Legal Issues II",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 2025",
            "course_name": "Strat for Hotel Mrktg",
            "description": "TCHS1-GC 2025 Strat for Hotel Mrktg",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 2030",
            "course_name": "Re Hospitality Finance",
            "description": "TCHS1-GC 2030 Re Hospitality Finance",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 2210",
            "course_name": "International Marketing",
            "description": "TCHS1-GC 2210 International Marketing",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 2900",
            "course_name": "Advanced Special Project",
            "description": "TCHS1-GC 2900 Advanced Special Project \nof the program; Applied Research for Hospitality and Tourism/Y65.1050. Designed to synthesize knowledge gained throughout the program of study. The Advanced Special Project is expected to combine applied research methods and theoretical knowledge to focus on a relevant topical area. Projects are to demonstrate mastery of topical areas covered in earlier master's courses.",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3005",
            "course_name": "",
            "description": "TCHS1-GC 3005\n\n   Database Marketing in Hospitality\n\nThis course provides students with a knowledge of the development and use of essential data in direct marketing decision making. Emphasis is placed on strategic decision-making skills as opposed to tactical skills. The development and updating of customer databases is fundamental to the overall success of the hotel. The role of the computer is explored in relation to providing management support and maintaining customer files. The concept of list management is explored in detail from compiling to storing to retrieval to security. Students gain an understanding of selection and segmentation mar...\n\n      more description for TCHS1-GC 3005 »\n\n      \n\n\n\nThis course provides students with a knowledge of the development and use of essential data in direct marketing decision making. Emphasis is placed on strategic decision-making skills as opposed to tactical skills. The development and updating of customer databases is fundamental to the overall success of the hotel. The role of the computer is explored in relation to providing management support and maintaining customer files. The concept of list management is explored in detail from compiling to storing to retrieval to security. Students gain an understanding of selection and segmentation marketing techniques based on demographics and psychographic characteristics and predictive modeling.\n\n      less description for TCHS1-GC 3005 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3010",
            "course_name": "",
            "description": "TCHS1-GC 3010\n\n   Managing The Human Asset\n\nThis course investigates the management of the human asset in organizations by examining the implementation of the strategies, plans and programs required to attract, motivate, develop, reward and retain the right people to meet the organizational goals and operational objectives of the enterprise.  Topics include workforce/workplace value system analysis, human resource skill inventories, needs analysis, job analysis, description and specification; orientation and socialization; encouraging performance; uses and abuses of performance appraisals; recruitment, training, and development; compens...\n\n      more description for TCHS1-GC 3010 »\n\n      \n\n\n\nThis course investigates the management of the human asset in organizations by examining the implementation of the strategies, plans and programs required to attract, motivate, develop, reward and retain the right people to meet the organizational goals and operational objectives of the enterprise.  Topics include workforce/workplace value system analysis, human resource skill inventories, needs analysis, job analysis, description and specification; orientation and socialization; encouraging performance; uses and abuses of performance appraisals; recruitment, training, and development; compensation and benefits; discipline and motivation techniques.\n\n      less description for TCHS1-GC 3010 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3015",
            "course_name": "",
            "description": "TCHS1-GC 3015\n\n   Planning Strategies for Hotel Product Develpmnt\n\nThis course presents an in-depth study of the planning process as it relates to the creation of hotel products. Emphasis is on macro development, different types, styles and quality of hotels, as well as on micro development, revenue center development such as retail, entertainment, recreation, and food. Branding, quality management, product life cycles, positioning, and packaging are explored in the context of the hospitality industry. Emerging trends in the demand for lodging and hospitality products are studied as they relate to the development of market-oriented products in both domestic a...\n\n      more description for TCHS1-GC 3015 »\n\n      \n\n\n\nThis course presents an in-depth study of the planning process as it relates to the creation of hotel products. Emphasis is on macro development, different types, styles and quality of hotels, as well as on micro development, revenue center development such as retail, entertainment, recreation, and food. Branding, quality management, product life cycles, positioning, and packaging are explored in the context of the hospitality industry. Emerging trends in the demand for lodging and hospitality products are studied as they relate to the development of market-oriented products in both domestic and international markets. The theoretical foundations and practical considerations of franchising and the key success/failure elements of these enterprises are explored.\n\n      less description for TCHS1-GC 3015 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3020",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2697",
                    "section": "001",
                    "period": "09/04/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 3020\n\n   Hotel Operations Analysis\n\nThis course is concerned the economics of individual companies and properties.  Financial statement analysis, hotel operating arrangements, hotel budgets; per room cost analysis, setting room rates are discussed in-depth. The manner by which ROI can be impacted by establishing quantifiable operational analysis objectives is studied specifically in terms of productivity, service, and improving efficiency and effectiveness.  Additional topics include setting goals consistent with customer requirements, controlling processes and improving capability, establishing systems of quality, benchmarking,...\n\n      more description for TCHS1-GC 3020 »\n\n      \n\n\n\nThis course is concerned the economics of individual companies and properties.  Financial statement analysis, hotel operating arrangements, hotel budgets; per room cost analysis, setting room rates are discussed in-depth. The manner by which ROI can be impacted by establishing quantifiable operational analysis objectives is studied specifically in terms of productivity, service, and improving efficiency and effectiveness.  Additional topics include setting goals consistent with customer requirements, controlling processes and improving capability, establishing systems of quality, benchmarking, production scheduling, inventory policies, and developing service systems. Prerequisite: Y65.3410 Hospitality Managerial Accounting\n\n      less description for TCHS1-GC 3020 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3030",
            "course_name": "Entrepreneurship for Hospitality & Tourism",
            "description": "TCHS1-GC 3030 Entrepreneurship for Hospitality & Tourism \nBy virtue of its diversity and often low start-up costs, the hospitality and tourism industry lends itself well to entrepreneurship. The latter has been defined as the creation of an innovative profit-driven enterprise under conditions of risk and uncertainty. This course reviews the individual characteristics needed by the prospective entrepreneur and the physical, demographic, economic, and financial environment of the new venture. Special emphasis is placed on identification of funding sources and the concept of risk management.",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3040",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3037",
                    "section": "001",
                    "period": "09/14/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 3040\n\n   Hotel Management Fundamentals\n\nThis course provides an in-depth investigation of the many components surrounding the primary hotel revenue producing departments.  Extensive on-site hotel analysis will be used to examine and evaluate those criteria that produce excellence in room, food and beverage operations.  The course will focus on financial, marketing, technological, and operational systems employed at the finest hotels in the world. Topics include information systems analysis, interdepartmental coordination, service excellence, financial analysis and reporting, revenue and cost management, and leadership considerations...\n\n      more description for TCHS1-GC 3040 »\n\n      \n\n\n\nThis course provides an in-depth investigation of the many components surrounding the primary hotel revenue producing departments.  Extensive on-site hotel analysis will be used to examine and evaluate those criteria that produce excellence in room, food and beverage operations.  The course will focus on financial, marketing, technological, and operational systems employed at the finest hotels in the world. Topics include information systems analysis, interdepartmental coordination, service excellence, financial analysis and reporting, revenue and cost management, and leadership considerations.\n\n      less description for TCHS1-GC 3040 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3050",
            "course_name": "",
            "description": "TCHS1-GC 3050\n\n   The Hotel Executive\n\nThis course examines managerial and leadership practices of successful hotel general managers and serves as the hotel operations concentration capstone course. Industry experts and case studies will be used extensively to examine and evaluate the criteria that produce excellence in hotel general management.  The course will focus on the process used by senior-level managers to analyze and convert information into knowledge which provide the foundation for executive decisions affecting the financial and operational health of the hotel asset. Topics include revenue and cost interpretation for pr...\n\n      more description for TCHS1-GC 3050 »\n\n      \n\n\n\nThis course examines managerial and leadership practices of successful hotel general managers and serves as the hotel operations concentration capstone course. Industry experts and case studies will be used extensively to examine and evaluate the criteria that produce excellence in hotel general management.  The course will focus on the process used by senior-level managers to analyze and convert information into knowledge which provide the foundation for executive decisions affecting the financial and operational health of the hotel asset. Topics include revenue and cost interpretation for profit maximization; marketing and selling the property, human asset enhancements for service excellence, information systems for executive decision making, and example-setting leadership characteristics.\n\n      less description for TCHS1-GC 3050 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3060",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2903",
                    "section": "001",
                    "period": "09/04/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 8.00 AM - 10.45 AM",
                    "open": true,
                    "professor": "SILV 508"
                }
            ],
            "course_name": "Managing The Hotel Sales Process",
            "description": "TCHS1-GC 3060 Managing The Hotel Sales Process \nSales and marketing within individual hotels is one of the most important aspects of revenue generation in the hospitality industry.  This course investigates the typical sales and marketing operation in luxury hotels and contrasts these techniques with other industry market segments.  Guest segment analysis and regional marketing techniques; analysis of local competition; impact issues; rate comparisons; revenue and cost management interfacing; corporate marketing integration; horizon analysis; and interdepartmental communications are examined in-depth.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3100",
            "course_name": "Management Hospitality Facility",
            "description": "TCHS1-GC 3100 Management Hospitality Facility",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3205",
            "course_name": "Advanced Hotel Finance",
            "description": "TCHS1-GC 3205 Advanced Hotel Finance",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3215",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17191",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS LL143"
                }
            ],
            "course_name": "Hospitality Economics",
            "description": "TCHS1-GC 3215 Hospitality Economics",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3220",
            "course_name": "Int'L Mktg : Hospitality",
            "description": "TCHS1-GC 3220 Int'L Mktg : Hospitality",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3230",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2775",
                    "section": "001",
                    "period": "09/03/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "TISC LC3"
                }
            ],
            "course_name": "Pricing Strategies",
            "description": "TCHS1-GC 3230 Pricing Strategies \nPrice management requires a commitment to a continuous systematic analysis of demand, competition, and product/service offerings. Pricing is the most sensitive or variable component determining the market mix. This course examines the meaning and importance of price-value relationships, the factors that determine pricing objectives and decisions, pricing in organizational markets, the evaluation and examination of demand, cost, profit issues, the selection of a pricing policy, distribution strategies and balancing operating cost and customer price sensitivity.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3235",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2698",
                    "section": "001",
                    "period": "09/14/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3044",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS LL141"
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 3235\n\n   Revenue Strategies\n\nPredicting consumer behavior at the property level while optimizing room inventory and price is crucial to maximizing revenue potential and profit maximization.  The intangible elements of changing demand, the perishable nature of the hotel product, the complexity of the hotel business (different market segments, length of stay and use of other products) and the strength of competition require tracking and measurement.  Managing yield, manipulating price, and making constant and rapid changes are accomplished by means of data analysis techniques.  Revenue Management requires a commitment to a ...\n\n      more description for TCHS1-GC 3235 »\n\n      \n\n\n\nPredicting consumer behavior at the property level while optimizing room inventory and price is crucial to maximizing revenue potential and profit maximization.  The intangible elements of changing demand, the perishable nature of the hotel product, the complexity of the hotel business (different market segments, length of stay and use of other products) and the strength of competition require tracking and measurement.  Managing yield, manipulating price, and making constant and rapid changes are accomplished by means of data analysis techniques.  Revenue Management requires a commitment to a continuous systematic analysis of demand, competition and product/service offerings.  Hotel professionals must be capable of utilizing data-analysis techniques and financial models to forecast consumer behavior, price, competition and the optimal mix of business during peak, shoulder and valley seasons.  Using financial statement data in business analysis as the framework the course explores financial and cost analysis, demand forecasting and prospective business analysis.\n\n      less description for TCHS1-GC 3235 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3245",
            "course_name": "Hospitality Statistics",
            "description": "TCHS1-GC 3245 Hospitality Statistics \nThis course examines to use of statistics in the revenue management process. An understanding of revenue statistics is vital to the analysis and interpretation of effective revenue strategies.  Course begins with a discussion of basic statistical procedures and builds to an investigation of current formulas used in hospitality revenue management computer solutions.  Topic includes descriptive and inferential statistical procedures, revenue modeling, and an exploration of current and future techniques and procedures for maximizing yield potential in the hospitality industry operations.",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3255",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2727",
                    "section": "001",
                    "period": "09/03/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS LL145"
                }
            ],
            "course_name": "Strategic Brand Managmnt",
            "description": "TCHS1-GC 3255 Strategic Brand Managmnt \nThe importance of managing the brand is fundamental to meeting revenue and sales goals. In an era of global competition the development and maintenance of integrated brand strategies impacts the marketing and development plan, the product and service offerings, distribution channels, and pricing. This course focuses on defining and analyzing brand competition, determining customers' attractiveness, and developing market forecasts. Topics include pioneering and innovative brand strategies, growth strategies, strategies for mature and declining markets, and defensive marketing strategies.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3270",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3036",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 3270\n\n   New Media & Distribution\n\nThis course explores the elements and management of marketing channels. The need for effective and efficient distribution networks is fundamental to the development of global brands, loyalty, enhanced value, and cost reduction. The focus is on effective and efficient distribution of hospitality products and services from development to consumption. In light of changing technology this course explores the fluidity (or lack) of channel structure and the management of relationships among organizations that are linked together in a variety of distribution systems. The blending of revenue and sales...\n\n      more description for TCHS1-GC 3270 »\n\n      \n\n\n\nThis course explores the elements and management of marketing channels. The need for effective and efficient distribution networks is fundamental to the development of global brands, loyalty, enhanced value, and cost reduction. The focus is on effective and efficient distribution of hospitality products and services from development to consumption. In light of changing technology this course explores the fluidity (or lack) of channel structure and the management of relationships among organizations that are linked together in a variety of distribution systems. The blending of revenue and sales goals is most clearly linked in the distribution channel.\n\n      less description for TCHS1-GC 3270 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3275",
            "course_name": "Market Research",
            "description": "TCHS1-GC 3275 Market Research",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3400",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2904",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL145",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Hennessey, Sean"
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 3400\n\n   Hotel Investment Analysis\n\nThe course will cover the complete financial cycle of hotel investment analysis including development; lending; operations; investment analysis; renovation decisions; and acquisition or disposition. Real estate valuation principles and procedures are explored with emphasis on the replacement cost, sales comparison, and income capitalization approaches. As well, the role and function of the asset manager is discussed with emphasis on investment underwriting, operations analysis, portfolio management, strategic investment analysis, market strategy, management contracts, franchises, and involveme...\n\n      more description for TCHS1-GC 3400 »\n\n      \n\n\n\nThe course will cover the complete financial cycle of hotel investment analysis including development; lending; operations; investment analysis; renovation decisions; and acquisition or disposition. Real estate valuation principles and procedures are explored with emphasis on the replacement cost, sales comparison, and income capitalization approaches. As well, the role and function of the asset manager is discussed with emphasis on investment underwriting, operations analysis, portfolio management, strategic investment analysis, market strategy, management contracts, franchises, and involvement with the property management team.\n\n      less description for TCHS1-GC 3400 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3405",
            "course_name": "",
            "description": "TCHS1-GC 3405\n\n   Asset Management\n\nThis course examines the role of the asset manager and the various disciplines incorporated into this function. Topics include investment underwriting, operations analysis, portfolio management, strategic investment analysis, market strategy, management contracts, franchises and the asset manager's involvement with the property management team. The course utilizes skills taught in other classes as they relate to the asset management function, such as valuation techniques, acquisition, market/economic analyses, and legal and environmental issues. The overall emphasis of the course is value enha...\n\n      more description for TCHS1-GC 3405 »\n\n      \n\n\n\nThis course examines the role of the asset manager and the various disciplines incorporated into this function. Topics include investment underwriting, operations analysis, portfolio management, strategic investment analysis, market strategy, management contracts, franchises and the asset manager's involvement with the property management team. The course utilizes skills taught in other classes as they relate to the asset management function, such as valuation techniques, acquisition, market/economic analyses, and legal and environmental issues. The overall emphasis of the course is value enhancement strategies for owners and managers of lodging facilities.\n\n      less description for TCHS1-GC 3405 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3410",
            "course_name": "",
            "description": "TCHS1-GC 3410\n\n   Hospitality Accounting & Operation\n\nThe concepts and techniques of hospitality managerial accounting and hotel operational analysis are explored in-depth. Analysis and interpretation of financial statements, the formation of operational and capital budgets, and the use of ratio analysis are investigated. The manner by which ROI can be impacted by establishing quantifiable operational analysis objectives is studied specifically in terms of productivity, service, and improving efficiency and effectiveness. Additional topics include setting goals consistent with customer requirements, controlling processes and improving capability,...\n\n      more description for TCHS1-GC 3410 »\n\n      \n\n\n\nThe concepts and techniques of hospitality managerial accounting and hotel operational analysis are explored in-depth. Analysis and interpretation of financial statements, the formation of operational and capital budgets, and the use of ratio analysis are investigated. The manner by which ROI can be impacted by establishing quantifiable operational analysis objectives is studied specifically in terms of productivity, service, and improving efficiency and effectiveness. Additional topics include setting goals consistent with customer requirements, controlling processes and improving capability, establishing systems of quality, benchmarking, production scheduling, inventory policies, and developing service systems.\n\n      less description for TCHS1-GC 3410 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3420",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2699",
                    "section": "001",
                    "period": "09/14/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Financial Markets & Instruments",
            "description": "TCHS1-GC 3420 Financial Markets & Instruments \nThis course provides an overview of domestic and world economic determinants, conditions, and measurement as well as a review of the essential principles of economics and financial analysis relative to the hospitality industry. A complete investigation of the financial markets, analytical techniques, terminology, concepts, theories, and structures are explained in the context of the hospitality industry. Topics include sources and uses of capital, brokerage firms, investment banks, commercial banks, private investment funds, and current investment and lending preferences.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3425",
            "course_name": "",
            "description": "TCHS1-GC 3425\n\n   Entrepreneurship\n\nThe creation of entrepreneurial profit-driven enterprises is the foundation of any evolving business environment.  This course examines and entrepreneurial process as it relates to the hospitality industry.  The individual skills needed by the prospective entrepreneur as well as the physical, demographic, economic, and financial environment of new ventures are explored.  Topics include opportunity recognition; entry and marketing strategies; the elements of successful business plans; venture capital, debt and equity financing techniques; organizational structures; and legal and tax considerati...\n\n      more description for TCHS1-GC 3425 »\n\n      \n\n\n\nThe creation of entrepreneurial profit-driven enterprises is the foundation of any evolving business environment.  This course examines and entrepreneurial process as it relates to the hospitality industry.  The individual skills needed by the prospective entrepreneur as well as the physical, demographic, economic, and financial environment of new ventures are explored.  Topics include opportunity recognition; entry and marketing strategies; the elements of successful business plans; venture capital, debt and equity financing techniques; organizational structures; and legal and tax considerations.\n\n      less description for TCHS1-GC 3425 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3430",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2700",
                    "section": "001",
                    "period": "09/03/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "25W4 C-12"
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 3430\n\n   Design & Development\n\nThis course examines the phases of a hotel development project from conceptualization to completion. The basic principles of architectural design including the relationship between form and function, basic zoning and building code laws, the business and contractual relationship between developer, architect and contractor and architectural drawings and specifications are explained.  Students will be involved in the discussion of physical plant management of commercial buildings, basic building systems design and operation, preventive maintenance programs, physical plant maintenance, energy mana...\n\n      more description for TCHS1-GC 3430 »\n\n      \n\n\n\nThis course examines the phases of a hotel development project from conceptualization to completion. The basic principles of architectural design including the relationship between form and function, basic zoning and building code laws, the business and contractual relationship between developer, architect and contractor and architectural drawings and specifications are explained.  Students will be involved in the discussion of physical plant management of commercial buildings, basic building systems design and operation, preventive maintenance programs, physical plant maintenance, energy management. Topics include: budgeting and planning and cost of large scale project design; selecting, negotiating with and establishing contractual relationships with architects, engineers, construction managers, and contractors; the financial package; and managing construction.\n\n      less description for TCHS1-GC 3430 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3510",
            "course_name": "",
            "description": "TCHS1-GC 3510\n\n   Customer Behavior\n\nThe concept of the supremacy of the consumer requires an in-depth understanding of the factors that influence behavior. This course investigates various models used to analyze consumer behavior and applies these methods to hospitality and tourism situations. In addition, this course examines various market segments such as baby boomers, generation X-ers, couples, and seniors by comparing and contrasting travel habits and needs through market research and the analysis of supply and demand. Topics include knowledge and involvement, attention and comprehension, attitudes and intentions, decision-...\n\n      more description for TCHS1-GC 3510 »\n\n      \n\n\n\nThe concept of the supremacy of the consumer requires an in-depth understanding of the factors that influence behavior. This course investigates various models used to analyze consumer behavior and applies these methods to hospitality and tourism situations. In addition, this course examines various market segments such as baby boomers, generation X-ers, couples, and seniors by comparing and contrasting travel habits and needs through market research and the analysis of supply and demand. Topics include knowledge and involvement, attention and comprehension, attitudes and intentions, decision-making behaviors, classical and operant learning, cultural influences, reference groups, satisfiers, life stages, values, needs, behavior, and motivation theory.\n\n      less description for TCHS1-GC 3510 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3520",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17190",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "TISC LC13"
                }
            ],
            "course_name": "",
            "description": "TCHS1-GC 3520\n\n   Customer Relationship Management\n\nAn analysis of organizations that provide services as products is necessary to provide an understanding of the forces in this environment (technological, economic, competitive, social, cultural, political and legal forces) that impact the customer service relationship. This course investigates structures, cultures, and the goals of organizations with the purpose of developing effective strategies for customer relationship management. Topics include analysis of customer touch points within organizations, service challenges in the next millennium, developing service strategies consistent with co...\n\n      more description for TCHS1-GC 3520 »\n\n      \n\n\n\nAn analysis of organizations that provide services as products is necessary to provide an understanding of the forces in this environment (technological, economic, competitive, social, cultural, political and legal forces) that impact the customer service relationship. This course investigates structures, cultures, and the goals of organizations with the purpose of developing effective strategies for customer relationship management. Topics include analysis of customer touch points within organizations, service challenges in the next millennium, developing service strategies consistent with corporate culture and mission, and implementing customer service necessary to achieve excellence and dominant market share.\n\n      less description for TCHS1-GC 3520 «",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3530",
            "course_name": "",
            "description": "TCHS1-GC 3530\n\n   Customer Relationship Training & Evaluation\n\nThe importance of customer relationships can not be overemphasized in today?s hospitality and tourism industries - it is a critical factor in determining success or failure in the service sector.  This course explores customer relationship training methods, techniques and approaches as they relate to hospitality or tourism organization?s mission and objectives.  In addition, the measurement or evaluation of customer relationships with the subsequent feedback to the employees through changes in training programs is studied.  Topics include methods in quality measurement, defining superior servi...\n\n      more description for TCHS1-GC 3530 »\n\n      \n\n\n\nThe importance of customer relationships can not be overemphasized in today?s hospitality and tourism industries - it is a critical factor in determining success or failure in the service sector.  This course explores customer relationship training methods, techniques and approaches as they relate to hospitality or tourism organization?s mission and objectives.  In addition, the measurement or evaluation of customer relationships with the subsequent feedback to the employees through changes in training programs is studied.  Topics include methods in quality measurement, defining superior service, setting standards and measuring performance, selection and training of personnel, and the development of a personal customer relationship credo.\n\n      less description for TCHS1-GC 3530 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3615",
            "course_name": "",
            "description": "TCHS1-GC 3615\n\n   Hospitality E-Procurement Systems\n\nBusiness-to-business is the largest segment of activity in the e-commerce world as companies conduct e-business on the World Wide Web. B2B Internet, Intranet and Extranet usage is becoming ubiquitous as industries are realizing the advantages and opportunities afforded in this electronic world. This course analyzes the current and future use of B2B e-procurement in the hospitality industry. Topics include: an investigation of current hospitality e-procurement joint ventures and partnerships, categories of e-procurement in hospitality, costs and benefits of hospitality e-procurement, digital e-...\n\n      more description for TCHS1-GC 3615 »\n\n      \n\n\n\nBusiness-to-business is the largest segment of activity in the e-commerce world as companies conduct e-business on the World Wide Web. B2B Internet, Intranet and Extranet usage is becoming ubiquitous as industries are realizing the advantages and opportunities afforded in this electronic world. This course analyzes the current and future use of B2B e-procurement in the hospitality industry. Topics include: an investigation of current hospitality e-procurement joint ventures and partnerships, categories of e-procurement in hospitality, costs and benefits of hospitality e-procurement, digital e-procurement marketplaces, e-procurement Extranet design, and supply chain management.\n\n      less description for TCHS1-GC 3615 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3630",
            "course_name": "",
            "description": "TCHS1-GC 3630\n\n   Hospitality E-Knowledge Systems\n\nAccess to systems that provide information in creative, useful ways is essential to the decision making process affecting most businesses. The assimilation and processing of information can form knowledge systems that may create significant advantages and new opportunities in the business world. This course analyzes and develops hospitality information systems and processes that provide effective hospitality industry knowledge systems. Topics include: an investigation of current information systems to create and effectively use organizational knowledge, methods of knowledge sharing, CRM and cu...\n\n      more description for TCHS1-GC 3630 »\n\n      \n\n\n\nAccess to systems that provide information in creative, useful ways is essential to the decision making process affecting most businesses. The assimilation and processing of information can form knowledge systems that may create significant advantages and new opportunities in the business world. This course analyzes and develops hospitality information systems and processes that provide effective hospitality industry knowledge systems. Topics include: an investigation of current information systems to create and effectively use organizational knowledge, methods of knowledge sharing, CRM and customer information management, content management, privacy issues, Extranet and Intranet roles in knowledge sharing, types of hospitality knowledge sharing, distance learning for training and education, and knowledge systems for the future.\n\n      less description for TCHS1-GC 3630 «",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3720",
            "course_name": "Analysis of Transportations Systems",
            "description": "TCHS1-GC 3720 Analysis of Transportations Systems",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3900",
            "course_name": "Graduate Internship Hospitality",
            "description": "TCHS1-GC 3900 Graduate Internship Hospitality \nThe Center arranges with various hotel and tourism enterprises, internships for students who have successfully completed 15 Credits of course work. Students work a minimum of 20 hours per week for a period of 10 weeks or more. Admission to an internship depends on availability and approval from both the program's internship office and the cooperating employer.",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3915",
            "course_name": "Internship II",
            "description": "TCHS1-GC 3915 Internship II \nAn opportunity to expand industry experience by working in a hospitality company or organization under faculty supervision.  This course will expand students’ career opportunities beyond Internship I and provide them with additional professional industry work experience to strengthen their knowledge and skill acquired in the classroom.  Students will be expected to complete a three hundred hour (300) work experience approved by the Tisch Center.",
            "offering": false
        },
        {
            "course_id": "TCHS1-GC 3920",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2702",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study in Hosp Tourism and Sports",
            "description": "TCHS1-GC 3920 Independent Study in Hosp Tourism and Sports \nProvides the opportunity to work with a faculty member on a well-defined specific topic via independent study. Approved topics should be extensions of existing courses previously taken on areas in which no courses are offered. Independent research is intended to extend the student?s knowledge in an area in which his or her interest is more specialized than the norm. Requires prior approval of an appropriate academic adviser as to the topic of the research.",
            "offering": true
        },
        {
            "course_id": "TCHS1-GC 3930",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2703",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship",
            "description": "TCHS1-GC 3930 Internship",
            "offering": true
        }
    ]
}