{
    "major_id": "LRMS1-UC",
    "file": "./2015-2016/Leadership_and_Management_Studies(LRMS1-UC).html",
    "courses": [
        {
            "course_id": "LRMS1-UC 543",
            "course_name": "Managerial Decision- Making",
            "description": "LRMS1-UC  543 Managerial Decision- Making \nPrinciples and models of decision-making theory are presented and discussed. Decision making as an aspect of planning as well as problem solving under conditions of risk and uncertainty are analyzed. A case study approach is used to develop individual critical and analytical skills.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 548",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9721",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Meth, Stephanie",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Human Resources Management Principles",
            "description": "LRMS1-UC  548 Human Resources Management Principles \nA comprehensive overview of personnel administration: the ability to handle the problems that affect personnel relationships. Topics covered are: recruitment, selection, induction, training, performance appraisals, wage problems (including evaluation), grievances, morale, safety, fringe benefits, and turnover.",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 562",
            "course_name": "",
            "description": "LRMS1-UC  562\n\n   Hr Leadership & Strategy\n\nThis course prepares students for organizational leadership in the field of Human Resource/Personnel Management, with particular reference to the challenges of international settings, international career development, and the achievement of strategic impact in this functional area of management. In addition to acquiring survey-level appreciation of all major applied tasks in the field, each participant will develop a distinctive competence on one of the four major sub-field areas - Staffing (HR planning, recruitment, selection and development of employees), Compensation (job evaluation, pay po...\n\n      more description for LRMS1-UC  562 »\n\n      \n\n\n\nThis course prepares students for organizational leadership in the field of Human Resource/Personnel Management, with particular reference to the challenges of international settings, international career development, and the achievement of strategic impact in this functional area of management. In addition to acquiring survey-level appreciation of all major applied tasks in the field, each participant will develop a distinctive competence on one of the four major sub-field areas - Staffing (HR planning, recruitment, selection and development of employees), Compensation (job evaluation, pay policy, incentive pay and benefits design and administration), Job/Work Analysis and Design, and Employee Rights & Influence Management (e.g., individual and collective legal rights and firm-level policies). Lectures, discussion and individual field research projects will be undertaken so as to develop skill in mounting both tactical and strategic critiques of actual firm practices, with particular reference to linkages between HRM policies and practices, on the one hand, and leadership modes and competitive strategies, on the other.\n\n      less description for LRMS1-UC  562 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 563",
            "course_name": "",
            "description": "LRMS1-UC  563\n\n   Work Analysis & Design\n\nThis course is concerned with applied theory, strategies, operational issues and research related to conducting job analyses. Individual job description and specification development is emphasized but 'macro' concerns of organizational design are also considered. Emphasis is placed on using appropriate techniques to acquire, measure, assess, and use information gathered in the work place. The course also explores and develops consulting skills used in the HR field. Students learn to use work analysis modeling techniques to support decision-making in job and organizational design and specificat...\n\n      more description for LRMS1-UC  563 »\n\n      \n\n\n\nThis course is concerned with applied theory, strategies, operational issues and research related to conducting job analyses. Individual job description and specification development is emphasized but 'macro' concerns of organizational design are also considered. Emphasis is placed on using appropriate techniques to acquire, measure, assess, and use information gathered in the work place. The course also explores and develops consulting skills used in the HR field. Students learn to use work analysis modeling techniques to support decision-making in job and organizational design and specification, performance appraisal and development, program evaluation (e.g., training initiatives), and other HRM tasks. Specific strategies and methods are compared and critically analyzed.\n\n      less description for LRMS1-UC  563 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 564",
            "course_name": "",
            "description": "LRMS1-UC  564\n\n   Recruitment, Selection & Career Development\n\nThis course teaches principle and analytical methods associated with the HR sub-field of 'staffing'; specifically recruitment, selection and career development. Topics include external and internal labor market analysis, application of formal job analysis to recruitment and selection techniques and decision-making, as well as principles of effective organizational and occupational career development. Included is the application of quantitative forecasting methods. Insights are drawn from industrial and organizational psychology, behavioral economics, labor economics, public relations, public p...\n\n      more description for LRMS1-UC  564 »\n\n      \n\n\n\nThis course teaches principle and analytical methods associated with the HR sub-field of 'staffing'; specifically recruitment, selection and career development. Topics include external and internal labor market analysis, application of formal job analysis to recruitment and selection techniques and decision-making, as well as principles of effective organizational and occupational career development. Included is the application of quantitative forecasting methods. Insights are drawn from industrial and organizational psychology, behavioral economics, labor economics, public relations, public policy, and employment law.\n\n      less description for LRMS1-UC  564 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 565",
            "course_name": "Compensation Management",
            "description": "LRMS1-UC  565 Compensation Management \nThis course teaches analytical methods associated with the HR sub-field of 'compensation'; specifically, salaries, incentive pay, and benefits management. Topics include the design and implementation of basic pay systems (pay-for-the-job), incentive pay schemes (pay-for-performance), and employment benefits; together with the use of Human Resource Information sub-systems in support of these tasks. Emphasis is placed on the concept of total compensation across these decision-making areas, in relation to both HR and general competitive strategy.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 566",
            "course_name": "Human Resource Technology & Policy",
            "description": "LRMS1-UC  566 Human Resource Technology & Policy \nThis course examines and critically analyzes alternative approaches to the selection or design and use of Human Resource Information Systems (HRIS) from a general managerial perspective. Emphasis is placed on HRIS choice in relation to levels of integration with other (non-HRM) organizational information systems.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 567",
            "course_name": "",
            "description": "LRMS1-UC  567\n\n   International Human Resource Management\n\nThe general objective of this course is to enable a manager to respond effectively and comprehensively to the demands of IHRM. Knowledge of strategic choices in Staffing, Compensation, Performance Appraisal, and Labor Relations is developed, primarily on the basis of selected readings on these topics. Skill in diagnosing the origins of HR problems in international settings and responding effectively to it is also developed, primarily through the use of case materials. Finally, participants will demonstrate expertise in a discrete IHRM problem or issue associated with one or another of the stra...\n\n      more description for LRMS1-UC  567 »\n\n      \n\n\n\nThe general objective of this course is to enable a manager to respond effectively and comprehensively to the demands of IHRM. Knowledge of strategic choices in Staffing, Compensation, Performance Appraisal, and Labor Relations is developed, primarily on the basis of selected readings on these topics. Skill in diagnosing the origins of HR problems in international settings and responding effectively to it is also developed, primarily through the use of case materials. Finally, participants will demonstrate expertise in a discrete IHRM problem or issue associated with one or another of the strategic or tactical HRM tasks addressed by the course.\n\n      less description for LRMS1-UC  567 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 573",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9926",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "25W4 C-4",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "McEneaney, Janet"
                },
                {
                    "format": "Lecture",
                    "class_id": "9928",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Maier, Philip",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Business Ethics",
            "description": "LRMS1-UC  573 Business Ethics \nA discussion of the corporation's role in and relationship to society. What are the social responsibilities of business? What is the corporation's responsibility to its clients, customers, and employees? What are the ethics that act as the guiding principles and values of most organizations? The case study approach is used. Guest lecturers, at times, present specific issues and students are required to read, analyze, and write reflective responses.",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 578",
            "course_name": "Strategic Planning & Financial Analysis",
            "description": "LRMS1-UC  578 Strategic Planning & Financial Analysis \nThis course looks at the competitive advantages associated with strategic planning, reporting, and analysis. An emphasis on the quantitative analysis aspects of financial planning, budgeting, accounting, forecasting, cost/benefit analysis, auditing, and the company financial report will help the student understand the importance of having an informed basis for organizational decision making. Both service and manufacturing industries will be studied with special attention given to understanding and interpreting statistical and financial company reports.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 579",
            "course_name": "Comparative Management & Leadership",
            "description": "LRMS1-UC  579 Comparative Management & Leadership \nAnalyzes the management systems of a variety of nations, including Japan, Germany, and the U.S. Students explore how variations in culture, society, and politics influence organizational and managerial dynamics.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 583",
            "course_name": "",
            "description": "LRMS1-UC  583\n\n   International Trade & Investment\n\nBalancing political-economic and behavioral analysis, this course has three objectives. The first is to develop knowledge of the political-economic contexts of strategic managerial decision-making in foreign direct investment (FDI) and international trade. Emphasis is placed on aggregate bilateral contexts such as the European Union vis-a-vis other regional-trade entities (e.g., NAFTA and the Southern Africa Development Union) and industry-level considerations. Second, participants will develop skills in assessing desirable institutional qualities of foreign direct investment vehicles such as ...\n\n      more description for LRMS1-UC  583 »\n\n      \n\n\n\nBalancing political-economic and behavioral analysis, this course has three objectives. The first is to develop knowledge of the political-economic contexts of strategic managerial decision-making in foreign direct investment (FDI) and international trade. Emphasis is placed on aggregate bilateral contexts such as the European Union vis-a-vis other regional-trade entities (e.g., NAFTA and the Southern Africa Development Union) and industry-level considerations. Second, participants will develop skills in assessing desirable institutional qualities of foreign direct investment vehicles such as international joint ventures and the negotiation of same. The third objective of the course is to develop knowledge of behavioral problems and issues associated with bicultural/intercultural organizations. In this context, participants will acquire knowledge of structural and procedural responses in selected policy-making domains and functional areas of international management.\n\n      less description for LRMS1-UC  583 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 584",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17035",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Pennings, Anthony",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Comparative Political Economy",
            "description": "LRMS1-UC  584 Comparative Political Economy \nThis course provides an applied understanding of international business and trade, with an emphasis on the generation of competitive opportunities on the basis of such an understanding. Specifically, traditional economic and behavioral science understanding of such diverse topics as overseas investment, the political economy of international business, and economic behavior are presented from relatively novel (but rigorous) new perspectives - the political economy of the so-called 'global' economy and behavioral economics.",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 585",
            "course_name": "",
            "description": "LRMS1-UC  585\n\n   International Entrepreneurship\n\nInternational Business is no longer the (almost) exclusive domain of large multinational corporations. Increasingly, small 'start-up' firms are having a significant impact on cross-border commerce. Reflecting this development, this course has two main goals. The first is to help students understand the particular challenges of entrepreneurial action in international context. The second is to provide an educational vehicle for developing a draft international business plan for future use in seeking venture capital and other support. To that end, objectives include familiarization with all the c...\n\n      more description for LRMS1-UC  585 »\n\n      \n\n\n\nInternational Business is no longer the (almost) exclusive domain of large multinational corporations. Increasingly, small 'start-up' firms are having a significant impact on cross-border commerce. Reflecting this development, this course has two main goals. The first is to help students understand the particular challenges of entrepreneurial action in international context. The second is to provide an educational vehicle for developing a draft international business plan for future use in seeking venture capital and other support. To that end, objectives include familiarization with all the classical elements of a Business Plan and development of skill in understanding the factors that venture capitalists look for in evaluating such plans. Students critically analyze entrepreneurial ventures from history and field?s literature to identify causal factors in success or failure of such ventures. They learn to identify the distinctive bases of sustainable competitive advantage that are essential to the success of an entrepreneurial firm, never more crucially than in international context.\n\n      less description for LRMS1-UC  585 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 709",
            "course_name": "Technology Integration",
            "description": "LRMS1-UC  709 Technology Integration \nThis course seeks to explain how Information Technology can successfully integrate multiple business functions such as finance, accounting, human resources, statistical analysis, marketing, and operations.  The focus is on the critical nature of decision-making with regards to data analysis and corporate information integration.  The course will demonstrate the critical nature of information integration as a vital corporate resource.  Topics will include: human factors modeling, data architecture integration, and project management.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 710",
            "course_name": "Project & Innovation Management",
            "description": "LRMS1-UC  710 Project & Innovation Management \nDue to changes in business practices and the rapid introduction of new business tools and applications into the market, today's challenge for the project manager is to understand how to incorporate technology innovation into an already existing technical framework, which will enable the team to meet organizational needs. This course provides students with the understanding and skills to follow a course of action that will result in a successful implementation of appropriate technology that meets organizational needs and causes minimal disruptions and frustrations.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 712",
            "course_name": "Customer Relations & Technology Management",
            "description": "LRMS1-UC  712 Customer Relations & Technology Management \nThis course provides students with an introduction and analysis of the major business strategies and technologies companies are using to communicate interactively with existing and potential customers. Specific attention is given to the switch from technology-facilitated to technology-enabled customer relations and the management of the technological systems that enable this switch. Frequently case studies and guest speakers are used to develop a deeper understanding of the design and implementation of digital direct marketing and advertising strategies within different types of businesses.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 713",
            "course_name": "Data Management",
            "description": "LRMS1-UC  713 Data Management \nThis course provides students with a thorough understanding of the data lifecycle within business. Students will learn principles and practices associated with the development and management of business modeling, data preparation, data warehousing, and data mining solutions. Using case studies and homework, students will apply principles learned from readings and class discussion to the solution of business scenarios. The development of metadata repositories will also be investigated.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 714",
            "course_name": "It Finance & Strategy",
            "description": "LRMS1-UC  714 It Finance & Strategy \nThis course provides students with a detailed and in-depth investigation into the cost-justification of IT spending and the integration of information technologies into business strategy. Students are introduced to the financial models used to evaluate IT spending, the process of business strategy formulation, and the specific role of IT in business strategy. The skills needed to assess new and emerging information and communication technologies are also reviewed. Frequently, case studies are used to apply principles to business scenarios.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 715",
            "course_name": "",
            "description": "LRMS1-UC  715\n\n   Knowledge Management & Decision Support\n\nThrough an investigation of knowledge management and decision support systems, this course provides students with an introduction to the use of information and communication technologies to facilitate business intelligence. Principles of knowledge management and decision support are covered and their relationship to management decision making are reviewed. The role of information and communication technologies in facilitating knowledge management and decision support are explored in detail. Throughout the course, case studies are used to apply principles and technologies to a variety of real w...\n\n      more description for LRMS1-UC  715 »\n\n      \n\n\n\nThrough an investigation of knowledge management and decision support systems, this course provides students with an introduction to the use of information and communication technologies to facilitate business intelligence. Principles of knowledge management and decision support are covered and their relationship to management decision making are reviewed. The role of information and communication technologies in facilitating knowledge management and decision support are explored in detail. Throughout the course, case studies are used to apply principles and technologies to a variety of real world scenario.\n\n      less description for LRMS1-UC  715 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 716",
            "course_name": "Mobile & Ubiquitous Tech for Business",
            "description": "LRMS1-UC  716 Mobile & Ubiquitous Tech for Business \nStudents are introduced to the strategic use of mobile and ubiquitous technologies in business. Specific attention is given to the diverse use of these technologies by domestic and international organizations to augment internal communication, improve communication and interaction with customers, and enter new markets. Through readings and case studies, topics covered include overview of technologies and network design, m-commerce, mobile marketing, and an investigation into the existing and anticipated effects of mobile and ubiquitous technologies on everyday life.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 717",
            "course_name": "Supply Chain Management",
            "description": "LRMS1-UC  717 Supply Chain Management \nThis course is an overview of supply chain management and the use of information and communication technology to create, facilitate, and strengthen relationships between business partners. Topics include broad and in-depth coverage of business-to-business (B2B) supply chain business models and technologies. In addition to readings and homework, case studies will be used to develop B2B decision-making skills for managers. New and emerging technologies related to supply chain integration are investigated.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 718",
            "course_name": "",
            "description": "LRMS1-UC  718\n\n   Technological Entrepreneurship\n\nPrinciples and models of technological entrepreneurship inside and outside of the corporate environment are investigated. Specific attention is given to understanding and interpreting the cultural and psychological contexts through which technology is diffused and adopted by the general public and within organizations. Strategies for marketing and selling new technological innovations are also investigated. Through readings, class discussions, case studies, and guest speakers, students will develop the knowledge and skills needed to execute entrepreneurial activities on their own or within the...\n\n      more description for LRMS1-UC  718 »\n\n      \n\n\n\nPrinciples and models of technological entrepreneurship inside and outside of the corporate environment are investigated. Specific attention is given to understanding and interpreting the cultural and psychological contexts through which technology is diffused and adopted by the general public and within organizations. Strategies for marketing and selling new technological innovations are also investigated. Through readings, class discussions, case studies, and guest speakers, students will develop the knowledge and skills needed to execute entrepreneurial activities on their own or within their work environment.\n\n      less description for LRMS1-UC  718 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 750",
            "course_name": "Fundamental of Media Relations",
            "description": "LRMS1-UC  750 Fundamental of Media Relations \nExplores the dissemination and management of public information in the corporate environment. For many organizations both print and broadcast media are integral parts of the day-to-day business operation, particularly in moments of crisis. This course examines the relationship of the media to business organizations; reactive vs. proactive media relations; effective message and meaning making; and interview techniques. Role-play and seminar approaches are used. Guest speakers include representatives from government, nonprofit, and profit organizations.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 920",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9995",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "25W4 C-17"
                }
            ],
            "course_name": "",
            "description": "LRMS1-UC  920\n\n   Consumer Behavior\n\nConsumer Behavior focuses on the study of psychological, sociological, economic and other dimensions influencing consumer behavior and how these factors are used to develop marketing strategies.  Students will learn how and why consumers behave by examining how they use products to define themselves and how this self-definition affects attention and perception, motivation to buy, memory for brands, product and advertising awareness, brand attitudes, product judgment and choice, customer satisfaction and brand loyalty.  In uncovering answers to these questions, students will develop a deep unde...\n\n      more description for LRMS1-UC  920 »\n\n      \n\n\n\nConsumer Behavior focuses on the study of psychological, sociological, economic and other dimensions influencing consumer behavior and how these factors are used to develop marketing strategies.  Students will learn how and why consumers behave by examining how they use products to define themselves and how this self-definition affects attention and perception, motivation to buy, memory for brands, product and advertising awareness, brand attitudes, product judgment and choice, customer satisfaction and brand loyalty.  In uncovering answers to these questions, students will develop a deep understanding of the psychological basis of consumer behavior within its self-defining context, while developing a customer analysis `toolbox? for making informed decisions about marketing strategy based on how consumers use products to create, define and enhance their self-identities.\n\n      less description for LRMS1-UC  920 «",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 921",
            "course_name": "",
            "description": "LRMS1-UC  921\n\n   Direct Marketing\n\nDirect Marketing is designed to give students an overview of the principles associated with direct marketing and the practical experience concerned with direct marketing as a technique for developing customer-based marketing strategies.  During the semester, students will be exposed to different types of collected and stored customer information and how to effectively use that information to create effective customer communications.  Students will also be exposed to various successful direct marketing strategies being used today and the major issues facing direct marketers, such as the issue o...\n\n      more description for LRMS1-UC  921 »\n\n      \n\n\n\nDirect Marketing is designed to give students an overview of the principles associated with direct marketing and the practical experience concerned with direct marketing as a technique for developing customer-based marketing strategies.  During the semester, students will be exposed to different types of collected and stored customer information and how to effectively use that information to create effective customer communications.  Students will also be exposed to various successful direct marketing strategies being used today and the major issues facing direct marketers, such as the issue of privacy.  Finally, students will gain real world experience by working with actual clients / businesses to develop a relevant direct marketing strategy.  Students will be given the opportunity to work as part of a team and hone your presentation skills, the two most identified keys to success in today's business world.??\n\n      less description for LRMS1-UC  921 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 922",
            "course_name": "",
            "description": "LRMS1-UC  922\n\n   Market & Managerial Research\n\nMarket and Managerial Research integrates the study of marketing research with the study of consumer behavior for the purpose of developing information that supports managerial decision-making.  The objective of this course is to provide an understanding of marketing research methods employed by well-managed firms. The course is aimed at managers who are the ultimate users of the research and consultants who assist managers in their decision-making. The course will focus on helping managers recognize the role of systematic information gathering and analysis in making marketing decisions, and d...\n\n      more description for LRMS1-UC  922 »\n\n      \n\n\n\nMarket and Managerial Research integrates the study of marketing research with the study of consumer behavior for the purpose of developing information that supports managerial decision-making.  The objective of this course is to provide an understanding of marketing research methods employed by well-managed firms. The course is aimed at managers who are the ultimate users of the research and consultants who assist managers in their decision-making. The course will focus on helping managers recognize the role of systematic information gathering and analysis in making marketing decisions, and develop an appreciation for the potential contributions and limitations of marketing research data.  The material presented in this course will be in the context of an overall information system used by management to make strategic or operational decisions.\n\n      less description for LRMS1-UC  922 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 923",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17037",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "SILV 412",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "O'Keefe, Margaret"
                }
            ],
            "course_name": "",
            "description": "LRMS1-UC  923\n\n   Product Innovation and Management\n\nProduct Management is designed to enhance student marketing skills and understanding of specific marketing topics, as well as larger issues of brand development. Accordingly, Product Management is organized around the product and brand management decisions that must be made to build and manage brand equity.  The work of the product manager is to manage product and service offerings in the marketplace for the twin purposes of maximizing customer satisfaction and product profitability.  This is called managing the value exchange process.  All business strategy is rooted in a concept of value exc...\n\n      more description for LRMS1-UC  923 »\n\n      \n\n\n\nProduct Management is designed to enhance student marketing skills and understanding of specific marketing topics, as well as larger issues of brand development. Accordingly, Product Management is organized around the product and brand management decisions that must be made to build and manage brand equity.  The work of the product manager is to manage product and service offerings in the marketplace for the twin purposes of maximizing customer satisfaction and product profitability.  This is called managing the value exchange process.  All business strategy is rooted in a concept of value exchange, whether it is explicitly formulated or implied as a pattern of business practices. Accordingly, this course will promote product management as a implementing business strategy in the marketplace.\n\n      less description for LRMS1-UC  923 «",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 924",
            "course_name": "",
            "description": "LRMS1-UC  924\n\n   Promotion & Sales Management\n\nPromotional and Sales Management is designed to assist students in integrating and applying philosophies and concepts for solving of problems in promotion and sales.  The course will present an analysis of marketing systems, examining planning, implementing, and controlling a firm's personal selling and promotional functions.  The role of selling in the promotional mix and sales objectives of management in relation to the total marketing program will be examined.   Emphasis will be placed on the integration of current and emerging ideas in the strategic development and operations of the sales ...\n\n      more description for LRMS1-UC  924 »\n\n      \n\n\n\nPromotional and Sales Management is designed to assist students in integrating and applying philosophies and concepts for solving of problems in promotion and sales.  The course will present an analysis of marketing systems, examining planning, implementing, and controlling a firm's personal selling and promotional functions.  The role of selling in the promotional mix and sales objectives of management in relation to the total marketing program will be examined.   Emphasis will be placed on the integration of current and emerging ideas in the strategic development and operations of the sales force.  This course will also cover competitive and customer needs analysis, idea identification, testing and refinement, positioning products within their markets, forecasting volume, developing introductory marketing launch strategies, conducting sensitivity analyses, and managing the process and interfunctional project teams.\n\n      less description for LRMS1-UC  924 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 925",
            "course_name": "",
            "description": "LRMS1-UC  925\n\n   Retail Marketing\n\nStudents taking Retail Marketing will study the retail industry from a marketing perspective.  The class will examine changes in consumer demographics and retail formats that will determine shopping patterns for the new millennium.  Past, present and future innovative retail marketing strategies will also be explored and the strategic issues that underpin retail-marketing decision-making will be examined.   This course takes an integrated perspective of retail market planning and the development of retail business areas such as, strategic decising making, store image, locational trends, mercha...\n\n      more description for LRMS1-UC  925 »\n\n      \n\n\n\nStudents taking Retail Marketing will study the retail industry from a marketing perspective.  The class will examine changes in consumer demographics and retail formats that will determine shopping patterns for the new millennium.  Past, present and future innovative retail marketing strategies will also be explored and the strategic issues that underpin retail-marketing decision-making will be examined.   This course takes an integrated perspective of retail market planning and the development of retail business areas such as, strategic decising making, store image, locational trends, merchandise assortment and pricing.  Course discussions are focused on understanding the role of retailing in the distribution of goods, with particular attention to the management of retailing including buying, selling, accounting, organization and legal considerations.\n\n      less description for LRMS1-UC  925 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 926",
            "course_name": "",
            "description": "LRMS1-UC  926\n\n   Services Marketing\n\nServices Marketing studies the characteristics of services, their contribution to assorted economies, service quality, service customer behavior and the relationship between organizational performance and customer retention.  The course will focus on a number of service organizations such as theme parks, hair salons, banks, transportation companies, hotels, hospitals, restaurants, insurance companies, law firms, educational institutions, advertising agencies, consulting companies, and other professional service firms that require a distinctive approach to marketing strategy in development and ...\n\n      more description for LRMS1-UC  926 »\n\n      \n\n\n\nServices Marketing studies the characteristics of services, their contribution to assorted economies, service quality, service customer behavior and the relationship between organizational performance and customer retention.  The course will focus on a number of service organizations such as theme parks, hair salons, banks, transportation companies, hotels, hospitals, restaurants, insurance companies, law firms, educational institutions, advertising agencies, consulting companies, and other professional service firms that require a distinctive approach to marketing strategy in development and execution.  Services marketing topics will include planning, delivering, and evaluating a firm?s performance with respect to customer?s experiences.  Understanding the development and uniqueness of a service?s marketing program will be the objective for study.\n\n      less description for LRMS1-UC  926 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 927",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9724",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "25W4 C-10",
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Afriyie, Kofi"
                }
            ],
            "course_name": "",
            "description": "LRMS1-UC  927\n\n   Strategic International Marketing\n\nThe goal of this course is to enhance student understanding of Strategic International Marketing, and its fundamental importance and contribution to todays businesses or operation of any size.  Course objectives include providing a background in international business and economics, human resources, cultural issues and interrelationships, and business decision processes in product planning, marketing, and organizational planning, structure, goals, and performance.  These objectives of necessity also include development of strategic international managerial skills appropriate to strategic plann...\n\n      more description for LRMS1-UC  927 »\n\n      \n\n\n\nThe goal of this course is to enhance student understanding of Strategic International Marketing, and its fundamental importance and contribution to todays businesses or operation of any size.  Course objectives include providing a background in international business and economics, human resources, cultural issues and interrelationships, and business decision processes in product planning, marketing, and organizational planning, structure, goals, and performance.  These objectives of necessity also include development of strategic international managerial skills appropriate to strategic planning, marketing and sales policy, and implementation of the organizations goals.  The increasing international and multinational nature of business activities drives the necessity to recognitize the management aspects of this increasingly important field.   Effort will be made to recognize current and evolving interests and trends.??\n\n      less description for LRMS1-UC  927 «",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 941",
            "course_name": "Fundamentals of Advertising, Media, and Public Relations",
            "description": "LRMS1-UC  941 Fundamentals of Advertising, Media, and Public Relations \nDesigned to explore the role of advertising in marketing programs. The strategy and components of advertising campaigns are addressed as well as their planning, execution, and evaluation. The impact of today's changing technology on the media is discussed.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 942",
            "course_name": "Fundamentals of Public Relations",
            "description": "LRMS1-UC  942 Fundamentals of Public Relations \nStudy of the role of public relations in industry and other complex organizations. Students review and analyze the public relations process: planning, production, and evaluation. The functions and limitations of public relations are considered. Students are required to investigate the public relations program of a specific organization as well as develop and write a campaign program.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 948",
            "course_name": "Integrated Marketing Campaigns",
            "description": "LRMS1-UC  948 Integrated Marketing Campaigns \nThis course will be a study in multi-media advertising campaigns. Advertising campaigns include developing research, creating strategy, media-mix selection, matching product with message, execution of campaign, and evaluation of campaign effectiveness.  Students will present individual and group projects culminating in formal, in-class presentations.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 949",
            "course_name": "Advertising Design & Layout",
            "description": "LRMS1-UC  949 Advertising Design & Layout \nThis course is an overview of the elements of design and layout utilized in the creation and production of integrated advertising materials.  Students will focus on the translation of ideas into effective advertising through the use of text, art and/or photography. Focus will be on \nadvertisements, newsletters, brochures, and logos.  Students will study and critique current professional designs, as well as learn basic concepts by planning, executing and evaluating their own designs.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 950",
            "course_name": "Advertising: Research Planning & Acct Mgmnt",
            "description": "LRMS1-UC  950 Advertising: Research Planning & Acct Mgmnt \nThis course presents an overview of research methodologies utilized in understanding consumer attitudes and behavior, as well as product/service research.  The research process will be studied with special attention given to sampling procedures, survey research, data collection instruments, data analysis, and critiques of professional research.  The course will explore techniques in proper planning and management of advertising accounts.  Special attention will be given to developing the plan, estimating costs, creating budgets, and effective scheduling.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 951",
            "course_name": "Corporate & Non-Profit Public Relations",
            "description": "LRMS1-UC  951 Corporate & Non-Profit Public Relations \nCovers trends and principles of writing for traditional business, as well as human and public service organizations.  Unique issues for each sector will be explored; for example, non-profits need for fund-raising practices.  Common organizational public relations issues will be studied in detail including: crisis management, employee relations, communication problems, environmental concerns, press releases, resumes, and speeches.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 952",
            "course_name": "Copywriting",
            "description": "LRMS1-UC  952 Copywriting \nThis course guides students through the critical thinking process and essential writing skills necessary for effective copywriting.  The course will emphasize writing skills as the primary method of public communication through either print or broadcast media.  Students will write one sentence, one paragraph, and one page copy on a variety of topics.  Special focus will be on selection of persuasive appeals, and preparation of message.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 953",
            "course_name": "Ethics & Soc Respnsiblty in Advertising & Pr",
            "description": "LRMS1-UC  953 Ethics & Soc Respnsiblty in Advertising & Pr \nThis course examines the responsibility of the advertising and public relations professional to all stakeholders including themselves, their client, and the community.  Ethical and moral dilemmas will be presented in the form of case studies in order for students to develop critical thinking skills regarding this topic. Topics include: publics? right to know, legal issues, public disclosure, privacy issues, and professional industry standards.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 954",
            "course_name": "New Tech for Advertising & Public Relations",
            "description": "LRMS1-UC  954 New Tech for Advertising & Public Relations \nExamines state of the art technologies instrumental in successful advertising and public relations.  The course will use both classroom and laboratory to cover emerging technologies in design.  Students will develop expertise in the latest techniques associated with computer imaging, videography, lighting, sound, editing, and printing.  Course will address message development/ delivery, the role of technology in speed of message, message distortion, and the new challenges demanded by these new technologies.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 955",
            "course_name": "Political & Governmental Public Relations",
            "description": "LRMS1-UC  955 Political & Governmental Public Relations \nCourse emphasis is on American government and political public relations issues.  Topics covered will include: public opinion, managing the message, leadership communication, interest groups, community affairs, and governmental relations.  Special attention will be given to the role of the press secretary, media consultant, pollster, and public affairs officer.  Students will learn of the unique role of the public relations professional with regard to speaking engagements, speech preparation and public events such as conventions.",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 1903",
            "course_name": "",
            "description": "LRMS1-UC 1903\n\n   Employment Law & Rights\n\nIn this course, students will learn the laws of hiring, promotion, recruitment and discharge; anti-discrimination and harassment laws; time and leave laws; worker safety and injury compensation; immigration controls; class actions; dispute resolution; and labor relations in unionized environments. These topics are presented with readings from the text, using real-life cases and maximizing student discussion. The class will also use current legal materials to keep students up-to-date in this quickly changing field. In this course, students address the legal context of managerial decision making...\n\n      more description for LRMS1-UC 1903 »\n\n      \n\n\n\nIn this course, students will learn the laws of hiring, promotion, recruitment and discharge; anti-discrimination and harassment laws; time and leave laws; worker safety and injury compensation; immigration controls; class actions; dispute resolution; and labor relations in unionized environments. These topics are presented with readings from the text, using real-life cases and maximizing student discussion. The class will also use current legal materials to keep students up-to-date in this quickly changing field. In this course, students address the legal context of managerial decision making in the areas of hiring, promotion, recruitment and discharge; anti-discrimination and harassment laws; time and leave laws; worker safety and injury compensation; immigration controls; class action suits; dispute resolution; and labor relations in unionized environments. These topics are presented with readings from the text and case studies while maximizing student discussion. The class will also use current legal materials to keep students up-to-date in this rapidly changing field.\n\n      less description for LRMS1-UC 1903 «",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 1971",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "9736",
                    "section": "001",
                    "period": "09/02/2015 - 12/22/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "LRMS1-UC 1971 Independent Study \nIndependent investigation of selected topics outside the boundaries of the classroom. Its purpose is to allow students to pursue specialized interests, within the framework of the curriculum, that are not available in existing courses. Although student-directed, participants work closely with a faculty mentor who guides and evaluates their work.",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 7990",
            "course_name": "Special Topics Leadershp & Management Studies",
            "description": "LRMS1-UC 7990 Special Topics Leadershp & Management Studies",
            "offering": false
        },
        {
            "course_id": "LRMS1-UC 7991",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17046",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS 836"
                }
            ],
            "course_name": "",
            "description": "LRMS1-UC 7991\n\n   Senior Project: Seminar\n\nThe graduation project consists of either a seminar project or an internship. The seminar allows students to develop a project under the guidance of a faculty mentor. The seminar requires regular class attendance to discuss projects and to document them, as well as individual meetings with the mentor. The projects themselves may be in one of the degree?s various concentration areas. Projects must be the student?s individual, original work and include the product, the technical documentation, and a learning experience essay summarizing the process and skills used. The internship provides an opp...\n\n      more description for LRMS1-UC 7991 »\n\n      \n\n\n\nThe graduation project consists of either a seminar project or an internship. The seminar allows students to develop a project under the guidance of a faculty mentor. The seminar requires regular class attendance to discuss projects and to document them, as well as individual meetings with the mentor. The projects themselves may be in one of the degree?s various concentration areas. Projects must be the student?s individual, original work and include the product, the technical documentation, and a learning experience essay summarizing the process and skills used. The internship provides an opportunity for students to use knowledge gained in their major combined with the knowledge provided by professionals in a variety of industry settings. Students are required to complete a minimum of 100 hours during the semester to earn four credits. (Students? full-time jobs cannot serve as internships.) In addition to hours at their placement, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final learning experience essay summarizing the outcome, including samples of work completed.\n\n      less description for LRMS1-UC 7991 «",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 7992",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9737",
                    "section": "001",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Burns, William",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "LRMS1-UC 7992\n\n   Senior Project: Intrnshp\n\nThe graduation project consists of either a seminar project or an internship. The internship provides an opportunity for students to use knowledge gained in their major combined with the knowledge provided by professionals in a variety of industry settings. Students are required to complete a minimum of 100 hours during the semester to earn four credits. (Students' full-time jobs cannot serve as internships.) In addition to hours at their placement, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final learning-experience essay summarizing ...\n\n      more description for LRMS1-UC 7992 »\n\n      \n\n\n\nThe graduation project consists of either a seminar project or an internship. The internship provides an opportunity for students to use knowledge gained in their major combined with the knowledge provided by professionals in a variety of industry settings. Students are required to complete a minimum of 100 hours during the semester to earn four credits. (Students' full-time jobs cannot serve as internships.) In addition to hours at their placement, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final learning-experience essay summarizing the outcome, including samples of work completed.\n\n      less description for LRMS1-UC 7992 «",
            "offering": true
        },
        {
            "course_id": "LRMS1-UC 7993",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "9929",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Carryl, Colin",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "10121",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Senior Project:  Independent Study - Leadership and Management Studies",
            "description": "LRMS1-UC 7993 Senior Project:  Independent Study - Leadership and Management Studies",
            "offering": true
        }
    ]
}