{
    "major_id": "LEAD-AD",
    "file": "./2015-2016/Leadership_and_Social_Entrepreneurship(LEAD-AD).html",
    "courses": [
        {
            "course_id": "LEAD-AD 110",
            "course_name": "Social Entrepreneurship and Innovation",
            "description": "LEAD-AD  110 Social Entrepreneurship and Innovation \nThis course provides a broad introduction to the role of organizations and entrepreneurs in achieving social impact through their work. The course examines the definition of social entrepreneurship and different strategies for\ncreating ideas that help solve pressing social issues such as poverty, illiteracy, hunger, economic opportunity, and disease. Students work in teams to develop venture plans for implementing an entrepreneurial idea. The course examines\nsocial entrepreneurship in a variety of settings, including government, nongovernmental organizations, and the private sector.",
            "offering": false
        },
        {
            "course_id": "LEAD-AD 115",
            "course_name": "J",
            "description": "LEAD-AD  115J\n\n   Critical Issues in Social Entrepreneurship: Innovations in the Middle East\n\nSocial Entrepreneurship is a dynamic and growing field which may be defined in various ways, yet at its core is about using evolved business thinking and practices to change the world. This course provides an introduction to the topic through discussion of how social entrepreneurs develop their ideas of social and environmental innovation, how they fund/finance their ventures, the ways in which they overcome the challenges of integrating various levels of economic performance with social/environmental impact and the types of organizations social entrepreneurs create (for-profit, non-profit, co...\n\n      more description for LEAD-AD  115J »\n\n      \n\n\n\nSocial Entrepreneurship is a dynamic and growing field which may be defined in various ways, yet at its core is about using evolved business thinking and practices to change the world. This course provides an introduction to the topic through discussion of how social entrepreneurs develop their ideas of social and environmental innovation, how they fund/finance their ventures, the ways in which they overcome the challenges of integrating various levels of economic performance with social/environmental impact and the types of organizations social entrepreneurs create (for-profit, non-profit, cooperative, hybrid, etc). Through a \"deep dive\" case study of a leading social enterprise, Sekem Group in Egypt, we explore the relevance of social entrepreneurship in a changing world and heighten our understanding of the potential we each hold to be \"change makers.\" The course includes a field trip to Egypt.\n\n      less description for LEAD-AD  115J «",
            "offering": false
        },
        {
            "course_id": "LEAD-AD 210",
            "course_name": "Models of Leadership",
            "description": "LEAD-AD  210 Models of Leadership \nThis course examines the role and meaning of leadership within work organizations, communities, markets, and governments. Students are introduced to different theories and models of leadership, and are encouraged to examine their own leadership styles. The impact of history, culture, and circumstance on how we define and identify leaders is examined.",
            "offering": false
        },
        {
            "course_id": "LEAD-AD 211",
            "course_name": "Policy Studies",
            "description": "LEAD-AD  211 Policy Studies \nThis course introduces specific analytical tools useful for effectively assessing public policies and social issues. It surveys the topics central to the task of policy analysis: how problems are defined, how information is collected, how relative costs and benefits of policy are assessed, how policy solutions are formulated and adopted, and how ethics inform policy analysis. Students will conduct a series of policy debates.",
            "offering": false
        },
        {
            "course_id": "LEAD-AD 212",
            "course_name": "Special Topics in Leadership and Social Innovation",
            "description": "LEAD-AD  212 Special Topics in Leadership and Social Innovation \nThis course is taught by leading management and policy scholars from around the world who are in residence in Abu Dhabi. The content is oriented toward the scholar’s expertise and the evolving landscape of leadership, entrepreneurship,\nand innovation.",
            "offering": false
        },
        {
            "course_id": "LEAD-AD 300",
            "course_name": "Business Acceleration and Disciplined Entrepreneurship",
            "description": "LEAD-AD  300 Business Acceleration and Disciplined Entrepreneurship \nThe Business Acceleration course provides a framework for teams to move from an idea about a product or service to forming a viable company.  We will walk through initial customer discovery, market size, customer value, marketing to customers and many other areas.  Our process will allow students to understand their idea, the competitive landscape, the scale and economics of their potential business and have a sense of customer needs as it relates to their product or service.",
            "offering": false
        },
        {
            "course_id": "LEAD-AD 500",
            "course_name": "",
            "description": "LEAD-AD  500\n\n   Entreprenurs in Training\n\nThis course enables student entrepreneurs to apply the knowledge gained from previous coursework and develop a viable, realistic business proposal for their start-up company.  Students will submit a written business proposal which will include, product identification, competitive landscape details, customer verification, and market size, customer validation, pricing and monetization plan, marketing and sales plans, space requirements, fund raising and a detailed three-year plan with clear deliverables and any and all supporting documents based on significant regional customer and stakeholder d...\n\n      more description for LEAD-AD  500 »\n\n      \n\n\n\nThis course enables student entrepreneurs to apply the knowledge gained from previous coursework and develop a viable, realistic business proposal for their start-up company.  Students will submit a written business proposal which will include, product identification, competitive landscape details, customer verification, and market size, customer validation, pricing and monetization plan, marketing and sales plans, space requirements, fund raising and a detailed three-year plan with clear deliverables and any and all supporting documents based on significant regional customer and stakeholder data.\n\n      less description for LEAD-AD  500 «",
            "offering": false
        },
        {
            "course_id": "LEAD-AD 501",
            "course_name": "",
            "description": "LEAD-AD  501\n\n   Entrepreneurs in Training\n\nThe purpose of the course is to enable student entrepreneurs to research and develop a viable, realistic business proposal for a start-up company in the UAE.  An inaugural, NYUAD Entrepreneurs in Training Advisory Board has been commissioned to guide and evaluate the progress of the business proposal.  At the end of the course, students will submit a written business proposal which will include, product identification, competitive landscape details, customer verification, and market size, customer validation, pricing and monetization plan, marketing and sales plans, space requirements, fund ra...\n\n      more description for LEAD-AD  501 »\n\n      \n\n\n\nThe purpose of the course is to enable student entrepreneurs to research and develop a viable, realistic business proposal for a start-up company in the UAE.  An inaugural, NYUAD Entrepreneurs in Training Advisory Board has been commissioned to guide and evaluate the progress of the business proposal.  At the end of the course, students will submit a written business proposal which will include, product identification, competitive landscape details, customer verification, and market size, customer validation, pricing and monetization plan, marketing and sales plans, space requirements, fund raising and a detailed three year plan with clear deliverables and any and all supporting documents based on significant regional customer and stakeholder  data. \nDrawing from the pedagogy of place-based education, this course promotes learning that is \trooted in a specific, local cultural context, in this case, UAE. Required skills include customer identification and observation, field note taking, and bringing critical reflection to experience.  Students are required to engage in a hands-on, fieldwork doing research and data collection for 40 hours per week.\n\n      less description for LEAD-AD  501 «",
            "offering": false
        }
    ]
}