{
    "major_id": "CHINL-AD",
    "file": "./2015-2016/Mandarin_Chinese_Language_(CHINL-AD).html",
    "courses": [
        {
            "course_id": "CHINL-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12808",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Mon,Tue,Wed,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "CAMP W009"
                }
            ],
            "course_name": "",
            "description": "CHINL-AD  101\n\n   Elementary Chinese 1\n\nOpen to students with little or no training in Chinese, this course is designed to develop and reinforce language skills in listening, speaking, reading, and\nwriting as Chinese language relates to everyday life situations. The objectives are: to master the Chinese phonetic system (pinyin and tones) with satisfactory\npronunciation; to understand the construction of commonly used Chinese characters (both simplified and traditional) and learn to write them correctly; to understand and use correctly basic Chinese grammar and sentence structures; to build up essential vocabulary; to read and write ...\n\n      more description for CHINL-AD  101 »\n\n      \n\n\n\nOpen to students with little or no training in Chinese, this course is designed to develop and reinforce language skills in listening, speaking, reading, and\nwriting as Chinese language relates to everyday life situations. The objectives are: to master the Chinese phonetic system (pinyin and tones) with satisfactory\npronunciation; to understand the construction of commonly used Chinese characters (both simplified and traditional) and learn to write them correctly; to understand and use correctly basic Chinese grammar and sentence structures; to build up essential vocabulary; to read and write level appropriate passages; to become acquainted with aspects of Chinese culture and society related to the course materials.\n\n      less description for CHINL-AD  101 «",
            "offering": true
        },
        {
            "course_id": "CHINL-AD 102",
            "course_name": "Elementary Chinese 2",
            "description": "CHINL-AD  102 Elementary Chinese 2 \nA continuation of Elementary Chinese I. The course is designed to reinforce and further develop language skills in listening, speaking, reading, and writing as these relate to everyday life situations.",
            "offering": false
        },
        {
            "course_id": "CHINL-AD 103",
            "course_name": "",
            "description": "CHINL-AD  103\n\n   Intensive Elementary Chinese\n\nIntensive Elementary Chinese is the first-year level of the standard foundational sequence of training in listening, speaking, reading, and writing modern Chinese. This course is designed especially for those beginners who have no previous background in Chinese but would like to learn the language more intensively and more quickly. Unlike the regular Elementary Chinese I course which will teach ten chapters during one semester, this course will cover twenty chapters during the semester. The training that students get will be equal to one academic year of training, and after completing this cou...\n\n      more description for CHINL-AD  103 »\n\n      \n\n\n\nIntensive Elementary Chinese is the first-year level of the standard foundational sequence of training in listening, speaking, reading, and writing modern Chinese. This course is designed especially for those beginners who have no previous background in Chinese but would like to learn the language more intensively and more quickly. Unlike the regular Elementary Chinese I course which will teach ten chapters during one semester, this course will cover twenty chapters during the semester. The training that students get will be equal to one academic year of training, and after completing this course, students will be eligible to skip Elementary Chinese II  and take Intermediate Chinese I directly. \n\nThe course will begin with introducing Pinyin, the phonetic system of Mandarin Chinese. After that, it will introduce radicals, some basic vocabulary, sentence structures, and grammar points. By the end of the semester, students are expected to be able to read Chinese characters with correct tones; write characters in correct stroke order; compose short essays by using the vocabulary and grammar they have learned;  understand by listening conversations about some easy topics; and handle certain informal topics that require an exchange of basic information related to study and leisure activities.\n\n      less description for CHINL-AD  103 «",
            "offering": false
        },
        {
            "course_id": "CHINL-AD 201",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12809",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Mon,Tue,Wed,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "CAMP W009"
                }
            ],
            "course_name": "",
            "description": "CHINL-AD  201\n\n   Intermediate Chinese 1\n\nThis course is designed to consolidate overall listening and speaking proficiency, with the focus gradually moving toward semi-formal usage of Chinese language in topic-oriented discussions. The objectives are: to be able to obtain information from extended conversation; to both express and expound on, in relative length, feelings and opinions on common topics; to expand vocabulary and learn to decipher the meaning of compound words; to develop reading comprehension of extended narrative, expository, and simple argumentative passages; to solve non-complex textual problems with the aid of dicti...\n\n      more description for CHINL-AD  201 »\n\n      \n\n\n\nThis course is designed to consolidate overall listening and speaking proficiency, with the focus gradually moving toward semi-formal usage of Chinese language in topic-oriented discussions. The objectives are: to be able to obtain information from extended conversation; to both express and expound on, in relative length, feelings and opinions on common topics; to expand vocabulary and learn to decipher the meaning of compound words; to develop reading comprehension of extended narrative, expository, and simple argumentative passages; to solve non-complex textual problems with the aid of dictionaries; to write in Chinese mid-length personal narratives,\ninformational narratives, comparison and discussion of viewpoints with level appropriate vocabulary and grammatical accuracy, as well as basic syntactical cohesion; to continue being acquainted with aspects of Chinese culture and society related to the course materials.\n\n      less description for CHINL-AD  201 «",
            "offering": true
        },
        {
            "course_id": "CHINL-AD 202",
            "course_name": "Intermediate Chinese 2",
            "description": "CHINL-AD  202 Intermediate Chinese 2 \nA continuation of Intermediate Chinese I, focusing on semi-formal usage of Chinese language when discussing more academically-inflected cultural\nor social topics.",
            "offering": false
        },
        {
            "course_id": "CHINL-AD 298",
            "course_name": "Directed Study",
            "description": "CHINL-AD  298 Directed Study",
            "offering": false
        },
        {
            "course_id": "CHINL-AD 301",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12810",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "CAMP W009"
                }
            ],
            "course_name": "",
            "description": "CHINL-AD  301\n\n   Advanced Chinese 1\n\nThis course is designed to further develop proficiency in speaking and writing through readings on and discussions of socio-cultural topics relevant to\ntoday’s China. The main focus is the improvement of reading comprehension and writing skills. The objectives are: to further improve oral communicative\ncompetence by incorporating semi-formal or formal usages; to acquire vocabulary and patterns necessary for conducting semi-formal or formal discussions of socio-cultural topics; to increase reading speed of texts with more advanced syntax; to learn to make context-based guesses about the meaning...\n\n      more description for CHINL-AD  301 »\n\n      \n\n\n\nThis course is designed to further develop proficiency in speaking and writing through readings on and discussions of socio-cultural topics relevant to\ntoday’s China. The main focus is the improvement of reading comprehension and writing skills. The objectives are: to further improve oral communicative\ncompetence by incorporating semi-formal or formal usages; to acquire vocabulary and patterns necessary for conducting semi-formal or formal discussions of socio-cultural topics; to increase reading speed of texts with more advanced syntax; to learn to make context-based guesses about the meaning of a new word, conduct sentence analysis and solve textual problems\nwith the aid of dictionaries; to write and present more fully developed narratives or reasoned and structured arguments; to learn to employ basic rhetorical methods; to learn to appreciate stylistic usage of Chinese language.\n\n      less description for CHINL-AD  301 «",
            "offering": true
        },
        {
            "course_id": "CHINL-AD 302",
            "course_name": "Advanced Chinese 2",
            "description": "CHINL-AD  302 Advanced Chinese 2 \nContinuation of Advanced Chinese I. Designed to reinforce and further develop students knowledge of formal usage of Chinese language.",
            "offering": false
        }
    ]
}