{
    "major_id": "MKTG-UB",
    "file": "./2015-2016/Marketing_(MKTG-UB).html",
    "courses": [
        {
            "course_id": "MKTG-UB 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9362",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Mon,Wed 8.00 AM - 9.15 AM",
                    "open": true,
                    "professor": "Machfoedy, Ambar"
                },
                {
                    "format": "Lecture",
                    "class_id": "9363",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Dzyabura, Daria"
                },
                {
                    "format": "Lecture",
                    "class_id": "9364",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Dzyabura, Daria"
                },
                {
                    "format": "Lecture",
                    "class_id": "9365",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Dzyabura, Daria"
                },
                {
                    "format": "Lecture",
                    "class_id": "9366",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Mon,Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Alter, Adam"
                },
                {
                    "format": "Lecture",
                    "class_id": "9367",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Tue,Thu 8.00 AM - 9.15 AM",
                    "open": true,
                    "professor": "Greenleaf, Eric"
                },
                {
                    "format": "Lecture",
                    "class_id": "9368",
                    "section": "007",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Greenleaf, Eric"
                },
                {
                    "format": "Lecture",
                    "class_id": "9369",
                    "section": "008",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Greenleaf, Eric"
                },
                {
                    "format": "Lecture",
                    "class_id": "9370",
                    "section": "009",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Morwitz, Vicki"
                },
                {
                    "format": "Lecture",
                    "class_id": "9371",
                    "section": "010",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC04",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Morwitz, Vicki"
                }
            ],
            "course_name": "Intro to Marketing",
            "description": "MKTG-UB    1 Intro to Marketing \nThis course evaluates marketing as a system for the satisfaction of human wants and a catalyst of business activity. It presents a comprehensive framework that includes (1) researching and analyzing customers, company, competition, and the marketing environment; (2) identifying and targeting attractive segments with a strategic positioning; and (3) making product, pricing, communication, and distribution decisions. Cases and examples are utilized to develop problem-solving abilities.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 2",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9372",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 4-120",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Assael, Henry"
                },
                {
                    "format": "Lecture",
                    "class_id": "9373",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 4-120",
                    "time": "Mon,Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Assael, Henry"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB    2\n\n   Consumer Behavior\n\nThis course presents a comprehensive, systematic, and practical conceptual framework for understanding people as consumers—the basic subject matter of all marketing. It draws on the social sciences to evaluate the influence of both individual and ecological factors on market actions. Students discuss relevant psychological and sociological theories and study how they can be used to predict consumers' reactions to strategic marketing decisions. Basic methodologies for research in consumer behavior are developed and applied. Course emphasis is on developing applications of behavioral concepts an...\n\n      more description for MKTG-UB    2 »\n\n      \n\n\n\nThis course presents a comprehensive, systematic, and practical conceptual framework for understanding people as consumers—the basic subject matter of all marketing. It draws on the social sciences to evaluate the influence of both individual and ecological factors on market actions. Students discuss relevant psychological and sociological theories and study how they can be used to predict consumers' reactions to strategic marketing decisions. Basic methodologies for research in consumer behavior are developed and applied. Course emphasis is on developing applications of behavioral concepts and methods for marketing actions.\n\n      less description for MKTG-UB    2 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 3",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9374",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC25",
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Cohen, Daniel"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB    3\n\n   Advertising\n\nThis course provides students with a comprehensive framework and tools to understand the advertising process and to appreciate managerial and theoretical perspectives in advertising. It tackles the stages in developing an advertising plan- from analyzing the situation and defining clear advertising objectives to execution. Students learn tools related to various skill areas in advertising, including account planning, media planning and buying, and copywriting/art direction, while developing a broader appreciation of how each skill area fits into the overall structure of the advertising process...\n\n      more description for MKTG-UB    3 »\n\n      \n\n\n\nThis course provides students with a comprehensive framework and tools to understand the advertising process and to appreciate managerial and theoretical perspectives in advertising. It tackles the stages in developing an advertising plan- from analyzing the situation and defining clear advertising objectives to execution. Students learn tools related to various skill areas in advertising, including account planning, media planning and buying, and copywriting/art direction, while developing a broader appreciation of how each skill area fits into the overall structure of the advertising process. Coursework involves a comprehensive group project that utilizes learning in all functional areas of advertising, while simulating the development of an advertising campaign.\n\n      less description for MKTG-UB    3 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 4",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9622",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Lieberman, Alvin"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB    4\n\n   Managing Creative Content Development\n\nThis course provides students with an opportunity to learn about the individual and collaborative services provided by professional managers both inside and outside EMT companies. It develops a system by which to evaluate the quality of the service provided, the nature of the service and how these services are being implemented through collaboration with industry creative and business executives. Through discussions with and lectures by entertainment and media lawyers, accountants, talent and literary agents, studio executives, producers, publicity and advertising specialists, the student will...\n\n      more description for MKTG-UB    4 »\n\n      \n\n\n\nThis course provides students with an opportunity to learn about the individual and collaborative services provided by professional managers both inside and outside EMT companies. It develops a system by which to evaluate the quality of the service provided, the nature of the service and how these services are being implemented through collaboration with industry creative and business executives. Through discussions with and lectures by entertainment and media lawyers, accountants, talent and literary agents, studio executives, producers, publicity and advertising specialists, the student will understand the diversity of talents required to complete a project or product successfully. Course Objectives: To provide students with an understanding of the role of the executive in the entertainment and media industries who can assemble a team of creative professionals and manage their activities so that successful content can be the outcome. To share an overview of the various disciplines and content genres/typology needed for the industry sectors that include movies, television, music, publishing, electronic games, theater, and related businesses. To gain insights into legal and financial issues pertaining to the various entertainment and media industry sectors, including basic copyright, intellectual property and privacy issues. To examine the roles and responsibilities of each of the members of the team assembled by the manager (producer, head of production, student head, manager/agent, manager/lawyer, business coach, management consultant). To review and be capable of implementing business plans for funding entertainment projects offered through venture capital, limited partnerships, angels or other specialists in financial deal making. To learn from the experts using lectures, cases, film, texts and guest lectures.\n\n      less description for MKTG-UB    4 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 9",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9683",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 4-80",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Kruger, Justin"
                },
                {
                    "format": "Lecture",
                    "class_id": "17650",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC21",
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Pluzinski, Carol"
                }
            ],
            "course_name": "Research for Customer Insights",
            "description": "MKTG-UB    9 Research for Customer Insights \nThis course provides students with both research and managerial perspectives in the development and application of marketing research tools and procedures. It describes the development of research designs from problem formulation to analysis and submission of the research report. It also covers the analysis of techniques in marketing research, such as focus groups, experimental design, surveys, sampling, statistical analysis, and reporting. Cases are utilized in the development of methods and in specific areas of application.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 10",
            "course_name": "Professional Management in Entertainment and Media",
            "description": "MKTG-UB   10 Professional Management in Entertainment and Media",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 16",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17648",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "TISC UC25",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Ahmad, Nabeel"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   16\n\n   Mobile for Managers\n\nThis course is designed to provide managers in the technology industry with a framework for understanding and succeeding in the burgeoning mobile ecosystem. The course covers trends in the industry and foundational pieces, including but not limited to: mobile design and development, B2B/B2C applications, business models, data collection/privacy. Students will learn the basic concepts, terms and principles that apply to the mobile industries. At the end of the course they will be able to analyze the activities of the leading mobile companies and applications through articles, case studies, and ...\n\n      more description for MKTG-UB   16 »\n\n      \n\n\n\nThis course is designed to provide managers in the technology industry with a framework for understanding and succeeding in the burgeoning mobile ecosystem. The course covers trends in the industry and foundational pieces, including but not limited to: mobile design and development, B2B/B2C applications, business models, data collection/privacy. Students will learn the basic concepts, terms and principles that apply to the mobile industries. At the end of the course they will be able to analyze the activities of the leading mobile companies and applications through articles, case studies, and lectures. The course will help them become familiar with key strategic issues across all the sectors of the mobile industry. Finally, they will develop an understanding and appreciation of the challenges involved in managing mobile products.\n\n      less description for MKTG-UB   16 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 17",
            "course_name": "",
            "description": "MKTG-UB   17\n\n   New Media Strategy\n\nThe explosion in media options has created a huge challenge for the marketing and brand manager as technology creates new and exciting opportunities while adding complexity to any implementation. Todays marketing executive must be able to leverage touch points along the entire customer journey in order to be competitive. The question remains, how and when do you choose to implement a new platform and what are the goals and expectations in doing so? This class will provide frameworks and strategies to systematically analyze various platforms and identify how to integrate them into a marketing p...\n\n      more description for MKTG-UB   17 »\n\n      \n\n\n\nThe explosion in media options has created a huge challenge for the marketing and brand manager as technology creates new and exciting opportunities while adding complexity to any implementation. Todays marketing executive must be able to leverage touch points along the entire customer journey in order to be competitive. The question remains, how and when do you choose to implement a new platform and what are the goals and expectations in doing so? This class will provide frameworks and strategies to systematically analyze various platforms and identify how to integrate them into a marketing plan. Various media platforms will be discussed including social, mobile, e-mail, gaming, search, location and embedded technologies as they complement, extend or replace traditional media such as broadcast, out-of-home, print, PR and direct response. These topics will be discussed in context with tactical and strategic goals and with demographic targets.\n\n      less description for MKTG-UB   17 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 19",
            "course_name": "Business of Publishing",
            "description": "MKTG-UB   19 Business of Publishing \nThis course provides students with working knowledge of the publishing industry comprising newspapers, magazines, and books. It explores traditional business models and how disruptive forces including digitalization, consumer generated content, low barriers to entry, and changing media consumption patterns are reshaping the industry. By the end of the course, students understand the operations of media companies, and can speak to the opportunities and challenges facing the industry, engage in discussions on the economics, terms, and metrics, and explain emerging business models.",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 20",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9375",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Mon 6.30 PM - 7.45 PM",
                    "open": true,
                    "professor": "Malin, Amir"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   20\n\n   Business of Film\n\nThis course is designed to provide both business and films students with a systematic overview of the modern day filmed entertainment business.   The course covers the traditional “Hollywood System” operating out of Los Angeles and also examine the independent film model.. The course takes a critical look at the financing, production, marketing and distribution of filmed entertainment.  Particular attention is focused on the various revenue streams inherent in the exploitation of such product both in the domestic marketplace and in the international arena. The primary objective of the course i...\n\n      more description for MKTG-UB   20 »\n\n      \n\n\n\nThis course is designed to provide both business and films students with a systematic overview of the modern day filmed entertainment business.   The course covers the traditional “Hollywood System” operating out of Los Angeles and also examine the independent film model.. The course takes a critical look at the financing, production, marketing and distribution of filmed entertainment.  Particular attention is focused on the various revenue streams inherent in the exploitation of such product both in the domestic marketplace and in the international arena. The primary objective of the course is to provide students with real life experiences, the practical realities, and a keen understanding of how things actually work in the film business.  The course will hopefully provide students with a requisite background and orientation that can lead to an entry level position with a film production or distribution company, an international sales organization, or related support organizations.\n\n      less description for MKTG-UB   20 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 21",
            "course_name": "Entertainment Finance",
            "description": "MKTG-UB   21 Entertainment Finance \nThis course provides a basic financial understanding of a variety of entertainment subcategories, including film, television, music, cable, and the Internet. In addition to text materials, real life examples are presented and include vignettes ranging from blockbuster films, television commercials, and Internet successes and failures. Accounting and finance principles are also introduced and applied throughout the course.",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 22",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9376",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Tue 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Faber, Gary S."
                },
                {
                    "format": "Lecture",
                    "class_id": "9571",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Tue 6.30 PM - 7.45 PM",
                    "open": true,
                    "professor": "Faber, Gary S."
                }
            ],
            "course_name": "Movie Marketing",
            "description": "MKTG-UB   22 Movie Marketing \nThis course gives students a basic understanding of key business issues relating to producing, distributing, marketing, and exploiting feature films. The course examines key aspects of the movie business, including managing a creative enterprise, deal making, acquiring rights, building a library, branding, and all aspects of effective marketing. The concepts developed in the course are applied in a group project presentation.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 23",
            "course_name": "Technology's Impact On Entertainment & Media",
            "description": "MKTG-UB   23 Technology's Impact On Entertainment & Media \nThroughout the industry value chain, from content creation to distribution and consumption, technology has changed the way consumers view and use entertainment. Technology has also changed the advertising industry, which is a major source of revenue for the entertainment industry. This course explores the impact of technology, such as interactivity and VOD, on audience trends and fragmentation. The course provides a brief introduction to each of these industries and examines the impact that technology has had on them, including assessment of possibilities for the future.",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 25",
            "course_name": "",
            "description": "MKTG-UB   25\n\n   The Business of Broadway\n\nThis is a specialty marketing course designed to provide students with a framework for understanding the dynamics of Broadway and live theater, as an important business enterprise within the entertainment industry. The focus is on understanding the development and application of the economics, finance, structure, implementation and staging of performances, as well as the marketing strategies and tactics for gaining audience awareness and decision to purchase. The course will examine funding, marketing, branding, product positioning and the global distribution of live theatrical entertainment. ...\n\n      more description for MKTG-UB   25 »\n\n      \n\n\n\nThis is a specialty marketing course designed to provide students with a framework for understanding the dynamics of Broadway and live theater, as an important business enterprise within the entertainment industry. The focus is on understanding the development and application of the economics, finance, structure, implementation and staging of performances, as well as the marketing strategies and tactics for gaining audience awareness and decision to purchase. The course will examine funding, marketing, branding, product positioning and the global distribution of live theatrical entertainment. The course will cover the history, venues, vocabulary, players, business and creative structures, budget development, supplementary revenue streams, successes and failures, relationship with the movie and music industries, the important figures and support systems that make the system work, global reach, and other topics. Lecture, discussions, site visits, and project work will be included.\n\n      less description for MKTG-UB   25 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 40",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9377",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC25",
                    "time": "Mon 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Narayanan, Sunder"
                },
                {
                    "format": "Lecture",
                    "class_id": "9378",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC25",
                    "time": "Mon 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Narayanan, Sunder"
                },
                {
                    "format": "Lecture",
                    "class_id": "9379",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC25",
                    "time": "Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Lieberman, Alvin"
                },
                {
                    "format": "Lecture",
                    "class_id": "9380",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC25",
                    "time": "Wed 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Lieberman, Alvin"
                },
                {
                    "format": "Lecture",
                    "class_id": "9570",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Narayanan, Sunder"
                },
                {
                    "format": "Lecture",
                    "class_id": "9631",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Thu 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Narayanan, Sunder"
                }
            ],
            "course_name": "Entertainment & Media Industries",
            "description": "MKTG-UB   40 Entertainment & Media Industries \nThis course provides students with a framework for understanding the economics and key strategic issues facing organizations in the entertainment industry. It establishes a basis for the formulation of marketing tactics and strategies for firms competing for consumers' discretionary spending. Recent developments in major sectors of the entertainment industry are covered, including movies, television and cable, theatre, and sports. Issues that cut across all types of entertainment industries are examined, including licensing, promotion, and new technologies.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 41",
            "course_name": "",
            "description": "MKTG-UB   41\n\n   Media Planning\n\nThis course is designed to provide you with a framework for understanding the role of strategic media planning in the overall context of marketing and advertising decisions. It covers audience research as well as selection, evaluation, and planning of all major advertising media and considers various decisions and problems that arise in the media planning process. The knowledge gained in this course is useful for those interested in any career that requires them to interact with the media industries, such as brand management, advertising, research, as well as the media and entertainment indust...\n\n      more description for MKTG-UB   41 »\n\n      \n\n\n\nThis course is designed to provide you with a framework for understanding the role of strategic media planning in the overall context of marketing and advertising decisions. It covers audience research as well as selection, evaluation, and planning of all major advertising media and considers various decisions and problems that arise in the media planning process. The knowledge gained in this course is useful for those interested in any career that requires them to interact with the media industries, such as brand management, advertising, research, as well as the media and entertainment industry.\n\n      less description for MKTG-UB   41 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 44",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17621",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.30 PM - 7.45 PM",
                    "open": true,
                    "professor": "TISC UC25"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   44\n\n   Television Management: Network, Cable/Satellite\n\nThis course covers the television industry, focusing on network television, cable, and satellite. It primarily surveys the American market and investigates new technology including digitization and HDTV, while providing some comparison with the international broadcast market. Students explore the organization, programming, and revenue strategies, as well as marketing innovations and competition in the newly configured broadcast landscape. Important legislation including the Telecommunications Act of 1996 are also examined. The recent volume of mergers and acquisitions in the broadcast industry...\n\n      more description for MKTG-UB   44 »\n\n      \n\n\n\nThis course covers the television industry, focusing on network television, cable, and satellite. It primarily surveys the American market and investigates new technology including digitization and HDTV, while providing some comparison with the international broadcast market. Students explore the organization, programming, and revenue strategies, as well as marketing innovations and competition in the newly configured broadcast landscape. Important legislation including the Telecommunications Act of 1996 are also examined. The recent volume of mergers and acquisitions in the broadcast industry are studied for their impact on the domestic entertainment landscape.\n\n      less description for MKTG-UB   44 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 45",
            "course_name": "",
            "description": "MKTG-UB   45\n\n   Social Media Strategy\n\nThe course covers marketing, advertising, and communications strategies in the new media landscape where traditional media (e.g., television, print) and the online social media (i.e., Web 2.0; e.g., online social networks, user-generated content, blogs, forums) co-exist. Students are expected to have knowledge about the fundamentals of traditional advertising methods and strategies. With this background knowledge, the primary focus of the course is on understanding social media, developing social media marketing strategies, and tracking their effectiveness. This course does not look at more ta...\n\n      more description for MKTG-UB   45 »\n\n      \n\n\n\nThe course covers marketing, advertising, and communications strategies in the new media landscape where traditional media (e.g., television, print) and the online social media (i.e., Web 2.0; e.g., online social networks, user-generated content, blogs, forums) co-exist. Students are expected to have knowledge about the fundamentals of traditional advertising methods and strategies. With this background knowledge, the primary focus of the course is on understanding social media, developing social media marketing strategies, and tracking their effectiveness. This course does not look at more tactical aspects of advertising/communications such as creative, message management, and publicity.\n\n      less description for MKTG-UB   45 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 46",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9381",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC 200",
                    "time": "Tue 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Lieberman, Alvin"
                },
                {
                    "format": "Lecture",
                    "class_id": "9537",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Tue 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Lieberman, Alvin"
                }
            ],
            "course_name": "Globalization of The Entertainment Industry",
            "description": "MKTG-UB   46 Globalization of The Entertainment Industry \nProvides a framework for understanding the global expansion of media and entertainment companies. Examines the impact that the significant export growth of American leisure products and services has on the U.S economy. Analyzes the strategies of several leading entertainment and media multinational companies and the development of their entertainment businesses within the major world economic zones. International speakers, cases and readings are used in this course.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 47",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9382",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Tue 6.30 PM - 7.45 PM",
                    "open": true,
                    "professor": "Master, Stephen"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   47\n\n   Sports Marketing\n\nProvides an overview of sports marketing as a component of a fully integrated marketing communication strategy. Studies the history and contemporary application of sports marketing as a method to achieve goals. Considers corporate as well as sporting property use of sports marketing strategies to achieve business objectives. Examines strategies that address critical business constituencies, including consumers, trade factors, employees, and the financial community. Covers sports marketing within the context of special sporting event sponsorships and professional sports teams as well as governi...\n\n      more description for MKTG-UB   47 »\n\n      \n\n\n\nProvides an overview of sports marketing as a component of a fully integrated marketing communication strategy. Studies the history and contemporary application of sports marketing as a method to achieve goals. Considers corporate as well as sporting property use of sports marketing strategies to achieve business objectives. Examines strategies that address critical business constituencies, including consumers, trade factors, employees, and the financial community. Covers sports marketing within the context of special sporting event sponsorships and professional sports teams as well as governing organizations, sports media (broadcast, print, and the Internet), licensing, hospitality, etc.\n\n      less description for MKTG-UB   47 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 48",
            "course_name": "Entertainment Law",
            "description": "MKTG-UB   48 Entertainment Law",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 49",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9509",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Tue 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Campo, Darren"
                },
                {
                    "format": "Lecture",
                    "class_id": "9534",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Tue 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Campo, Darren"
                },
                {
                    "format": "Lecture",
                    "class_id": "9568",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Newman, Peter"
                },
                {
                    "format": "Lecture",
                    "class_id": "9624",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Thu 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Newman, Peter"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   49\n\n   Business of Producing\n\nA specialized EMT course within the Berkley Center for Entrepreneurial Studies designed to provide students with a framework for understanding the dynamics of producing (as a business profession) a finished creative product in the entertainment and media industries, developing a business model, and generating an income stream to repay and provide investors with a profit. Educates the student in the process of feature film and long-form television production from the initial concept of the story, through script development, to completion of the project. Covers the most important steps in the pr...\n\n      more description for MKTG-UB   49 »\n\n      \n\n\n\nA specialized EMT course within the Berkley Center for Entrepreneurial Studies designed to provide students with a framework for understanding the dynamics of producing (as a business profession) a finished creative product in the entertainment and media industries, developing a business model, and generating an income stream to repay and provide investors with a profit. Educates the student in the process of feature film and long-form television production from the initial concept of the story, through script development, to completion of the project. Covers the most important steps in the production of an independent film, a studio project, a network TV or cable show, a radio program, a Broadway production, and an advertising television commercial. Explores all the elements a producer must know, understand, and eventually become skilled with through mastery of development, including script selection, finance, budgeting, timetable development, team building, talent selection, sales, contract and union negotiation, regulations, technology, and other relevant core competencies.\n\n      less description for MKTG-UB   49 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 50",
            "course_name": "Marketing Financial Services",
            "description": "MKTG-UB   50 Marketing Financial Services",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 51",
            "course_name": "",
            "description": "MKTG-UB   51\n\n   Craft & Commerce of Cinema:  Tribeca Film Fest\n\nThis is a specialized EMT course, designed in coordination with the Tribeca Film Festival Board, that provides students with a framework for understanding the dynamics of the global film industry including the complete film production process from crafting the idea for a script, hiring or becoming a producer, financing the project, selling it to a studio or independent production company, building a team, production elements, post-production including music acquisition, and the selling or distribution to a global marketplace. The course includes learning about distribution and exhibition, mark...\n\n      more description for MKTG-UB   51 »\n\n      \n\n\n\nThis is a specialized EMT course, designed in coordination with the Tribeca Film Festival Board, that provides students with a framework for understanding the dynamics of the global film industry including the complete film production process from crafting the idea for a script, hiring or becoming a producer, financing the project, selling it to a studio or independent production company, building a team, production elements, post-production including music acquisition, and the selling or distribution to a global marketplace. The course includes learning about distribution and exhibition, marketing and building audience awareness, research applications, international licensing, and preparation for careers in the industry. Students attend and fully participate in the panels offered during the two week period of the Tribeca Film Festival.\n\n      less description for MKTG-UB   51 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 52",
            "course_name": "",
            "description": "MKTG-UB   52\n\n   Introduction to Pricing\n\n“What’s it worth?” “How much should I pay?” “What are my other choices?” “Did I get a good deal?” Buyers ask these questions, explicitly and implicitly, every time they consider and/or make a purchase. “How much should I charge?” “How much do I need (want) to make?” “How will my channel partners respond?” “What will my competition do?” Brands and companies similarly ask these questions every time they make a pricing decision. Pricing, of course, is one of the “4 Ps”, and is a critical marketing mix component, as we seek to find the optimal interaction of consumer/customer price/value and busin...\n\n      more description for MKTG-UB   52 »\n\n      \n\n\n\n“What’s it worth?” “How much should I pay?” “What are my other choices?” “Did I get a good deal?” Buyers ask these questions, explicitly and implicitly, every time they consider and/or make a purchase. “How much should I charge?” “How much do I need (want) to make?” “How will my channel partners respond?” “What will my competition do?” Brands and companies similarly ask these questions every time they make a pricing decision. Pricing, of course, is one of the “4 Ps”, and is a critical marketing mix component, as we seek to find the optimal interaction of consumer/customer price/value and business profitability. Pricing is out there for our consumers/customers to see and evaluate every day, more so then ever in the digital world. This course will provide a broad introduction to and examination of pricing on strategic, conceptual, and tactical levels. Theoretical constructs and general frameworks will be taught, in combination with real world examples. The course combines textbook study on the theoretical side with case study and in class presentations and discussions on the real world side. Class participation is actively encouraged. Students can expect to develop a very solid understanding of the various elements of pricing strategy from a marketing perspective, and how best to leverage them within the marketing mix.\n\n      less description for MKTG-UB   52 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 53",
            "course_name": "Pricing",
            "description": "MKTG-UB   53 Pricing \nThis course provides students with the frameworks, techniques, and latest thinking on assessing and formulating pricing strategies. The emphasis is on (1) gaining a solid understanding of pricing practices across different industries, (2) learning state-of-the-art frameworks for analyzing pricing issues, and (3) mastering the tools and techniques for making strategic and profitable pricing decisions.",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 54",
            "course_name": "",
            "description": "MKTG-UB   54\n\n   Data-Driven Decision Making\n\nWith recent technological advances and developments in customer databases, firms have access to vast amounts of high-quality data which allows them to understand customer behavior, and customize business tactics to increasingly fine segments. However, much of the promise of such data-driven policies has failed to materialize because managers find it difficult to translate customer data into actionable policies. This course aims to fill this gap by providing students with the tools and techniques used in making business decisions. The emphasis of the class is on applications and interpretation ...\n\n      more description for MKTG-UB   54 »\n\n      \n\n\n\nWith recent technological advances and developments in customer databases, firms have access to vast amounts of high-quality data which allows them to understand customer behavior, and customize business tactics to increasingly fine segments. However, much of the promise of such data-driven policies has failed to materialize because managers find it difficult to translate customer data into actionable policies. This course aims to fill this gap by providing students with the tools and techniques used in making business decisions. The emphasis of the class is on applications and interpretation of the results for use in making real life business decisions.\n\n      less description for MKTG-UB   54 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 55",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9383",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC25",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Erdem, Tulin"
                }
            ],
            "course_name": "Brand Strategy & Planning",
            "description": "MKTG-UB   55 Brand Strategy & Planning \nThis marketing elective focuses on the three major activities common to the marketing planning process across firms and industries: (1) analysis of market information, (2) development of brand and marketing strategy, and (3) programming of the strategy and implementation of the marketing programs. The unifying framework for these activities is the annual marketing plan. Thus, the course simulates the product/brand/marketing manager’s job through the development and implementation of a marketing plan for a particular good or service.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 56",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9519",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Thu 6.30 PM - 7.45 PM",
                    "open": true,
                    "professor": "Narayanan, Sunder"
                }
            ],
            "course_name": "Digital Business Strategies",
            "description": "MKTG-UB   56 Digital Business Strategies \nThis course covers the digital technology industry (e.g. consumer electronics, software) from a strategic and marketing perspective. The objectives are to understand how these industries function, the unique challenges they face, and how digital technology companies can leverage their strengths to achieve success in the marketplace. The focus is on understanding the interactions between competition, technology evolution, and firm capabilities.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 57",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9623",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Cohen, Louis"
                }
            ],
            "course_name": "Digital Marketing",
            "description": "MKTG-UB   57 Digital Marketing \nThis course focuses on enabling students to analyze and develop sophisticated interactive marketing programs. The primary objectives of this course are to introduce students to digital advertising and marketing theories, best practices in digital marketing, and to give students the opportunity to apply this knowledge to building or improving the marketer’s use of digital media. The course is designed to be a practical mix of strategic and tactical practice.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 58",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9682",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC19",
                    "time": "Thu 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Van Dreunen, Joost"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   58\n\n   Business of Video Games\n\nVideo games are now a mainstream form of entertainment. In economic terms, this industry has experienced tremendous growth, despite a grueling recession, growing to an estimated $60 billion worldwide. A key development that has changed the playing field for both the producers and consumers of interactive entertainment is a shift away from physical retail to digital and online game distribution. The audience for games has also shifted—no longer the exclusive practice of hardcore gamers, video games have gained mass appeal in the form of social and casual gaming, on the internet, on consoles, an...\n\n      more description for MKTG-UB   58 »\n\n      \n\n\n\nVideo games are now a mainstream form of entertainment. In economic terms, this industry has experienced tremendous growth, despite a grueling recession, growing to an estimated $60 billion worldwide. A key development that has changed the playing field for both the producers and consumers of interactive entertainment is a shift away from physical retail to digital and online game distribution. The audience for games has also shifted—no longer the exclusive practice of hardcore gamers, video games have gained mass appeal in the form of social and casual gaming, on the internet, on consoles, and smartphones. At the same time, the development and publishing of games has become far more accessible. The game behind the game, in a manner of speaking, has changed.\n\nIn this class, we explore the basic components of the current video game industry. Every week, we review major current events, will hear from people currently working in the industry, examine case studies, and discuss the overall business landscape. Central to each class is the notion that practical business considerations and the design-driven creative process do not have to be in opposition.\n\n      less description for MKTG-UB   58 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 60",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9384",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC21",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Muller, Eitan"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   60\n\n   New Product Development\n\nMaximizing the success of new products and services can drive growth and shareholder value, lead to significant competitive advantage, and leapfrog a company ahead of its competitors. However, innovation is risky and most new products fail in the marketplace. Thus, expertise in the design and marketing of new products is a critical skill for all managers, inside and outside the marketing department. This course focuses on the tools and techniques associated with analyzing market opportunities as well as on designing, testing, and introducing new products and services. Both quantitative and qua...\n\n      more description for MKTG-UB   60 »\n\n      \n\n\n\nMaximizing the success of new products and services can drive growth and shareholder value, lead to significant competitive advantage, and leapfrog a company ahead of its competitors. However, innovation is risky and most new products fail in the marketplace. Thus, expertise in the design and marketing of new products is a critical skill for all managers, inside and outside the marketing department. This course focuses on the tools and techniques associated with analyzing market opportunities as well as on designing, testing, and introducing new products and services. Both quantitative and qualitative approaches are covered. In particular, the course covers the new product development process, strategic opportunity identification, how to generate new product concepts and ideas, mapping customer perceptions, segmentation, product positioning, forecasting market demand, product design, market entry strategies, and testing.\n\n      less description for MKTG-UB   60 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 64",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9665",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 4-90",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Fischer, Eileen"
                }
            ],
            "course_name": "Global Marketing Management",
            "description": "MKTG-UB   64 Global Marketing Management \nExamines the specific issues involved in entering international markets and in conducting marketing operations on an international scale. Attention is focused on problems such as identifying and evaluating opportunities worldwide, developing and adapting market strategies in relation to specific national market needs and constraints, and coordinating global marketing and branding strategies. Emphasis is on strategic issues relating to international operations rather than on technical aspects of exporting and importing.",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 65",
            "course_name": "",
            "description": "MKTG-UB   65\n\n   Decision-Making Strat in Mktg and Mgmt\n\nThis course is intended for future marketing managers, industry analysts, and management consultants interested in developing and evaluating marketing and business strategies based on Nobel Prize-winning research on judgment and decision making. The purpose of this course is to inform future managers and consultants of people’s decision rules and their associated biases and to enable these future managers and consultants to incorporate such insights in their business and marketing strategies. The course has two facets. First, it gives students a broad overview of important results from various...\n\n      more description for MKTG-UB   65 »\n\n      \n\n\n\nThis course is intended for future marketing managers, industry analysts, and management consultants interested in developing and evaluating marketing and business strategies based on Nobel Prize-winning research on judgment and decision making. The purpose of this course is to inform future managers and consultants of people’s decision rules and their associated biases and to enable these future managers and consultants to incorporate such insights in their business and marketing strategies. The course has two facets. First, it gives students a broad overview of important results from various behavioral sciences (e.g., social and cognitive psychology, behavioral decision research, consumer research) that clarify how people really make decisions. Second, it investigates how these results can be leveraged to design original and more effective marketing and business strategies.\n\n      less description for MKTG-UB   65 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 75",
            "course_name": "EXPERIENTIAL LEARNING SEMINAR: FASHION INDUSTRY: CREATIVITY & BUSINESS",
            "description": "MKTG-UB   75 EXPERIENTIAL LEARNING SEMINAR: FASHION INDUSTRY: CREATIVITY & BUSINESS",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 80",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9625",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC 200",
                    "time": "Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Lieberman, Alvin"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   80\n\n   Leisure Marketing\n\nThis is a specialty marketing course designed to provide students with a framework for understanding the dynamics of marketing several leading sectors within the leisure industry. The focus is on understanding the development and application of marketing strategies and tactics for leisure companies competing for a share of the consumers discretionary spending. Key marketing concepts such as segmentation, branding, life-time value, and CRM are examined in the context of leisure industries. The course will also cover recent activities including mergers, acquisitions in those key sectors of the l...\n\n      more description for MKTG-UB   80 »\n\n      \n\n\n\nThis is a specialty marketing course designed to provide students with a framework for understanding the dynamics of marketing several leading sectors within the leisure industry. The focus is on understanding the development and application of marketing strategies and tactics for leisure companies competing for a share of the consumers discretionary spending. Key marketing concepts such as segmentation, branding, life-time value, and CRM are examined in the context of leisure industries. The course will also cover recent activities including mergers, acquisitions in those key sectors of the leisure industry: casinos, cruise ships, theme parks, eco-tourism, themed restaurants, resorts, leisure hotels, time shares. The course will explore marketing techniques that apply across the leisure companies, including licensing, sponsorships, line extensions and promotion. Discussion of evolution, and current status in these sectors through lectures, case studies, text and article readings and project work will be included.\n\n      less description for MKTG-UB   80 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 85",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9562",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "TISC UC24",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Serdari, Thomai"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   85\n\n   Luxury Marketing\n\nThis course is designed to provide students with an understanding of the fundamentals of luxury. When was the concept of luxury first articulated and what did it mean within its various manifestations? Who were the luxury consumers in pre-modern cultures and what were the events that catapulted luxury into the sociopolitical discourse? How did modernity affect ancient processes associated with the production of luxury products? How did the products, consumer tastes, material exchanges, and producer strategies evolved through history? How has the luxury industry evolved through time and what is...\n\n      more description for MKTG-UB   85 »\n\n      \n\n\n\nThis course is designed to provide students with an understanding of the fundamentals of luxury. When was the concept of luxury first articulated and what did it mean within its various manifestations? Who were the luxury consumers in pre-modern cultures and what were the events that catapulted luxury into the sociopolitical discourse? How did modernity affect ancient processes associated with the production of luxury products? How did the products, consumer tastes, material exchanges, and producer strategies evolved through history? How has the luxury industry evolved through time and what is at its core? According to a common dictum, a luxury brand is a bridge between the past and the future. By the end of this course students will have developed: a.An understanding of the luxury segment of the market as it applies to a variety of industries (decorative objects, accessories, jewelry, beauty products, hospitality, automotive—fashion will be discussed as well but the discussion will be limited to the true luxury fashion houses) b.Observation skills that will allow them to distinguish what constitutes luxury in a product (regardless of industry) c.The necessary vocabulary to articulate the nuances that differentiate these products and the ability to do so with clarity and precision in terms of technique, design, and materials d.The critical skills to identify potential new luxury products and how they relate to a variety of markets, including emerging markets.\n\n      less description for MKTG-UB   85 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 86",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9658",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Serdari, Thomai"
                }
            ],
            "course_name": "",
            "description": "MKTG-UB   86\n\n   Advanced Luxury Marketing\n\nBuilding on concepts and business principles discussed in Luxury Marketing, this course is designed to provide students with an understanding of branding, design thinking and how these are combined to define luxury business strategies. It also completes the discussion on luxury products and brands by demonstrating that branding within the luxury segment of the market is an integral part of business strategy. By the end of this course students will have developed: a) An understanding of design thinking and strategy and their fundamental role in reinforcing the emotional impact of luxury brands ...\n\n      more description for MKTG-UB   86 »\n\n      \n\n\n\nBuilding on concepts and business principles discussed in Luxury Marketing, this course is designed to provide students with an understanding of branding, design thinking and how these are combined to define luxury business strategies. It also completes the discussion on luxury products and brands by demonstrating that branding within the luxury segment of the market is an integral part of business strategy. By the end of this course students will have developed: a) An understanding of design thinking and strategy and their fundamental role in reinforcing the emotional impact of luxury brands on consumers; b) A deeper understanding of the luxury segment of hotel, fashion, beauty and automotive industries without excluding other product/service groups; c) Analytical skills by hands-on experience and business case analysis, discussion, and presentation; d) The critical skills to distinguish/discover faults in business strategies that are not compatible with or contradict the essence of a particular luxury brand.\n\n      less description for MKTG-UB   86 «",
            "offering": true
        },
        {
            "course_id": "MKTG-UB 87",
            "course_name": "Retail Management",
            "description": "MKTG-UB   87 Retail Management",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 92",
            "course_name": "Internship in Marketing",
            "description": "MKTG-UB   92 Internship in Marketing",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 93",
            "course_name": "",
            "description": "MKTG-UB   93\n\n   Research Seminar: Current Research in Marketing\n\nThis course will focus on a collection of articles published in the past several years.  These contain the findings and theories that the next generation will find in their textbooks.  The topics these articles focus on will be ones that are of current commercial interest.  They may include:\n•\tThe value of a customer\n•\tMeasuring the value of a brand\n•\tForecasting movie success\n•\tThe relationship between the stock market and marketing activity\n•\tThe impact of scandal on product markets (e.g. Tiger Woods)\n•\tInfluencing consumer food choices\n•\tThe impact of online advertising on consumer behavior...\n\n      more description for MKTG-UB   93 »\n\n      \n\n\n\nThis course will focus on a collection of articles published in the past several years.  These contain the findings and theories that the next generation will find in their textbooks.  The topics these articles focus on will be ones that are of current commercial interest.  They may include:\n•\tThe value of a customer\n•\tMeasuring the value of a brand\n•\tForecasting movie success\n•\tThe relationship between the stock market and marketing activity\n•\tThe impact of scandal on product markets (e.g. Tiger Woods)\n•\tInfluencing consumer food choices\n•\tThe impact of online advertising on consumer behavior\n•\tMarketing in times of economic volatility\n \nThe class will meet once a week for 3 hours.  Each class will discuss 3 to 5 articles.  We will focus on the interest and importance of the research idea in each article, the approach used to address the idea, potential limitations of the work, and possible extensions of it.  There will be no exams.  Students will make mini-presentations and be required to produce a research proposal either individually or in groups.  It is an ideal course for those interested in SPUR activities.\n\n      less description for MKTG-UB   93 «",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 94",
            "course_name": "Ind Study in Marketing",
            "description": "MKTG-UB   94 Ind Study in Marketing",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 95",
            "course_name": "Ind Study in Marketing",
            "description": "MKTG-UB   95 Ind Study in Marketing",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 98",
            "course_name": "Ind Study in Marketing",
            "description": "MKTG-UB   98 Ind Study in Marketing",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 99",
            "course_name": "Ind Study in Marketing",
            "description": "MKTG-UB   99 Ind Study in Marketing",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 101",
            "course_name": "Experiential Learning Seminar:  Marketing Social Initiatives in Developing Countries",
            "description": "MKTG-UB  101 Experiential Learning Seminar:  Marketing Social Initiatives in Developing Countries",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 9001",
            "course_name": "Intro to Marketing",
            "description": "MKTG-UB 9001 Intro to Marketing \nThis course evaluates marketing as a system for the satisfaction of human wants and a catalyst of business activity. It presents a comprehensive framework that includes (1) researching and analyzing customers, company, competition, and the marketing environment; (2) identifying and targeting attractive segments with a strategic positioning; and (3) making product, pricing, communication, and distribution decisions. Cases and examples are utilized to develop problem-solving abilities.",
            "offering": false
        },
        {
            "course_id": "MKTG-UB 9064",
            "course_name": "International Marketing Management",
            "description": "MKTG-UB 9064 International Marketing Management",
            "offering": false
        }
    ]
}