{
    "major_id": "MULT-UB",
    "file": "./2015-2016/Multidisciplinary_(MULT-UB).html",
    "courses": [
        {
            "course_id": "MULT-UB 5",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9393",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": null,
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "TISC UC21"
                }
            ],
            "course_name": "",
            "description": "MULT-UB    5\n\n   Casing Method : Data Analysis & Presentation\n\nCase methodology is a critical tool for analysts, managers, and entrepreneurs. This course explores how strategic frameworks are applied to high level business problems. Case interviews and case competitions are used as models for learning. Students study the principles behind creating and delivering effective visual slide-based presentations via mock deliveries. Class time focuses on concept lectures and skill-building through individual and group exercises with self-critique. Assignments focus on creating and editing data-based presentations. This course is highly recommended for students wh...\n\n      more description for MULT-UB    5 »\n\n      \n\n\n\nCase methodology is a critical tool for analysts, managers, and entrepreneurs. This course explores how strategic frameworks are applied to high level business problems. Case interviews and case competitions are used as models for learning. Students study the principles behind creating and delivering effective visual slide-based presentations via mock deliveries. Class time focuses on concept lectures and skill-building through individual and group exercises with self-critique. Assignments focus on creating and editing data-based presentations. This course is highly recommended for students who wish to participate in case competitions.\n\n      less description for MULT-UB    5 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 7",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9394",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-75",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Asadpour, Arash"
                }
            ],
            "course_name": "",
            "description": "MULT-UB    7\n\n   Decision Models and Analytics\n\nAn introduction to basic principles and techniques of applied mathematical modeling for managerial decision making (models used in fields such as finance, operations, and marketing). Students learn the use of important analytical methods (e.g., spreadsheet modeling, Monte-Carlo simulation) to recognize their assumptions and limitations and to employ them in decision making. Emphasis is placed on model formulation and interpretation of results, not mathematical theory. Aimed at undergraduates with little prior exposure to modeling and quantitative analysis, but appropriate for all students who ...\n\n      more description for MULT-UB    7 »\n\n      \n\n\n\nAn introduction to basic principles and techniques of applied mathematical modeling for managerial decision making (models used in fields such as finance, operations, and marketing). Students learn the use of important analytical methods (e.g., spreadsheet modeling, Monte-Carlo simulation) to recognize their assumptions and limitations and to employ them in decision making. Emphasis is placed on model formulation and interpretation of results, not mathematical theory. Aimed at undergraduates with little prior exposure to modeling and quantitative analysis, but appropriate for all students who wish to strengthen their quantitative skills.\n\n      less description for MULT-UB    7 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 8",
            "course_name": "",
            "description": "MULT-UB    8\n\n   Global Team Collaboration:  An International Business Game\n\nAs businesses expand globally, virtual team communication becomes\nintegral to the future of international business. Within this course,\nstudents will explore the core competencies of virtual teaming through\nan online business simulation, VIBu RealGame. Played in partnership with\n business universities across the globe, this intensive experience\npresents identical challenges to those found in international business\nenvironments.\n\nStudents are grouped into 10 or so small multicultural \"companies\"\nwithin the manufacturing industry. Student teams manage their work force\n and arrange prod...\n\n      more description for MULT-UB    8 »\n\n      \n\n\n\nAs businesses expand globally, virtual team communication becomes\nintegral to the future of international business. Within this course,\nstudents will explore the core competencies of virtual teaming through\nan online business simulation, VIBu RealGame. Played in partnership with\n business universities across the globe, this intensive experience\npresents identical challenges to those found in international business\nenvironments.\n\nStudents are grouped into 10 or so small multicultural \"companies\"\nwithin the manufacturing industry. Student teams manage their work force\n and arrange production shifts, determine their product portfolio, and\nmanage supplies and inventory; most excitingly, students communicate\ndirectly with other international teams while negotiating sales in real\ntime.\n\nThis course counts as an elective toward the International Business co-major.\n\n      less description for MULT-UB    8 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 9",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9311",
                    "section": "001",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 10.55 AM",
                    "open": true,
                    "professor": "KMEC 2-65"
                },
                {
                    "format": "Lecture",
                    "class_id": "9312",
                    "section": "002",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 2-70",
                    "time": "Fri 9.30 AM - 10.55 AM",
                    "open": true,
                    "professor": "Dhir, Shivani; Ault, Taylor"
                },
                {
                    "format": "Lecture",
                    "class_id": "9313",
                    "section": "003",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 2-90",
                    "time": "Fri 9.30 AM - 10.55 AM",
                    "open": true,
                    "professor": "Yamaguchi, Akiko; Dhir, Shivani"
                },
                {
                    "format": "Lecture",
                    "class_id": "9314",
                    "section": "004",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 4-90",
                    "time": "Fri 9.30 AM - 10.55 AM",
                    "open": true,
                    "professor": "Tucker, Caitlin E; Dhir, Shivani"
                },
                {
                    "format": "Lecture",
                    "class_id": "9315",
                    "section": "005",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 4-80",
                    "time": "Fri 9.30 AM - 10.55 AM",
                    "open": true,
                    "professor": "Lee, Karen; Caporiccio, Marc; Dhir, Shivani"
                },
                {
                    "format": "Lecture",
                    "class_id": "9316",
                    "section": "006",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 2-65",
                    "time": "Fri 2.00 PM - 3.25 PM",
                    "open": true,
                    "professor": "Dhir, Shivani"
                },
                {
                    "format": "Lecture",
                    "class_id": "9317",
                    "section": "007",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 2-70",
                    "time": "Fri 2.00 PM - 3.25 PM",
                    "open": true,
                    "professor": "Dhir, Shivani; Ault, Taylor"
                },
                {
                    "format": "Lecture",
                    "class_id": "9318",
                    "section": "008",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 2-90",
                    "time": "Fri 2.00 PM - 3.25 PM",
                    "open": true,
                    "professor": "Yamaguchi, Akiko; Dhir, Shivani"
                },
                {
                    "format": "Lecture",
                    "class_id": "9319",
                    "section": "009",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 4-90",
                    "time": "Fri 2.00 PM - 3.25 PM",
                    "open": true,
                    "professor": "Tucker, Caitlin E; Dhir, Shivani"
                },
                {
                    "format": "Lecture",
                    "class_id": "9320",
                    "section": "010",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "KMEC 4-80",
                    "time": "Fri 2.00 PM - 3.25 PM",
                    "open": true,
                    "professor": "Lee, Karen; Caporiccio, Marc; Dhir, Shivani"
                },
                {
                    "format": "Lecture",
                    "class_id": "9694",
                    "section": "011",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "Dhir, Shivani",
                    "time": "Fri 9.30 AM - 10.55 AM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "9695",
                    "section": "012",
                    "period": "09/02/2015 - 11/20/2015",
                    "location": "Dhir, Shivani",
                    "time": "Fri 2.00 PM - 3.25 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MULT-UB    9\n\n   Cohort Leadership Program I\n\nThe purpose of the Cohort Leadership Program, Introduction to Markets, Professionalism, Analysis, Community, and Teamwork (IMPACT), is to facilitate community building among Stern freshmen. IMPACT achieves its mission by cultivating an educationally stimulating environment of curricular and co-curricular experiences.  IMPACT’s dynamic platform exposes students to Stern Undergraduate College’s values: Explore, Collaborate, and Engage.  Freshmen explore some of the central tenets of business through academic theory, collaborate to develop a real-world strategy based on social impact, and engage ...\n\n      more description for MULT-UB    9 »\n\n      \n\n\n\nThe purpose of the Cohort Leadership Program, Introduction to Markets, Professionalism, Analysis, Community, and Teamwork (IMPACT), is to facilitate community building among Stern freshmen. IMPACT achieves its mission by cultivating an educationally stimulating environment of curricular and co-curricular experiences.  IMPACT’s dynamic platform exposes students to Stern Undergraduate College’s values: Explore, Collaborate, and Engage.  Freshmen explore some of the central tenets of business through academic theory, collaborate to develop a real-world strategy based on social impact, and engage in the implementation and launch of their strategy.\n\n      less description for MULT-UB    9 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 10",
            "course_name": "",
            "description": "MULT-UB   10\n\n   Cohort Leadership Program II\n\nCohort Leadership Program (CLP) II: GO LEAD (Global Opportunities for Leadership, Ethics, and Academic Development) builds upon the strong foundation in business ethics, social responsibility, and leadership that students develop during their Freshman year through the Cohort Leadership Program and Business and Its Publics courses.\nGO LEAD is a required comprehensive semester long program that actively engages Stern Sophomores in curricular and co-curricular learning experiences. Integrated within the Office of Student Engagement and the Office of Academic Affairs, GO LEAD encourages students t...\n\n      more description for MULT-UB   10 »\n\n      \n\n\n\nCohort Leadership Program (CLP) II: GO LEAD (Global Opportunities for Leadership, Ethics, and Academic Development) builds upon the strong foundation in business ethics, social responsibility, and leadership that students develop during their Freshman year through the Cohort Leadership Program and Business and Its Publics courses.\nGO LEAD is a required comprehensive semester long program that actively engages Stern Sophomores in curricular and co-curricular learning experiences. Integrated within the Office of Student Engagement and the Office of Academic Affairs, GO LEAD encourages students to take an active role in their leadership, ethics, and academic development through the exploration of global opportunities in both the private and public sectors.\n\n      less description for MULT-UB   10 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 11",
            "course_name": "Sophomore Cohort Experience: Team Dynamics",
            "description": "MULT-UB   11 Sophomore Cohort Experience: Team Dynamics",
            "offering": false
        },
        {
            "course_id": "MULT-UB 12",
            "course_name": "Innovative Thinking for Business",
            "description": "MULT-UB   12 Innovative Thinking for Business",
            "offering": false
        },
        {
            "course_id": "MULT-UB 13",
            "course_name": "World Studies Trk Sr Sem Globalization & Business",
            "description": "MULT-UB   13 World Studies Trk Sr Sem Globalization & Business",
            "offering": false
        },
        {
            "course_id": "MULT-UB 14",
            "course_name": "",
            "description": "MULT-UB   14\n\n   Stern Foundations: Business Essentials for Non-Business Students\n\nIn today ’s competitive job market knowledge of core business concepts and skills will open doors and give students an edge in the marketplace. This intensive business training course is designed to equip undergraduate students and recent graduates with practical knowledge in the key areas of Accounting, Finance, Management and Marketing. NYU Stern's preeminent faculty combine theory and practice using real-world examples from their experiences as researchers and working with leading corporations. The course is ideal for students who have not yet taken business courses, yet want to become acqu...\n\n      more description for MULT-UB   14 »\n\n      \n\n\n\nIn today ’s competitive job market knowledge of core business concepts and skills will open doors and give students an edge in the marketplace. This intensive business training course is designed to equip undergraduate students and recent graduates with practical knowledge in the key areas of Accounting, Finance, Management and Marketing. NYU Stern's preeminent faculty combine theory and practice using real-world examples from their experiences as researchers and working with leading corporations. The course is ideal for students who have not yet taken business courses, yet want to become acquainted with the fundamentals skills that are essential in every career field. Students will develop a comfort level and confidence while speaking the language of business. For students with non-business majors and who have not taken accounting, finance, management or  marketing courses.\n\n      less description for MULT-UB   14 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 16",
            "course_name": "",
            "description": "MULT-UB   16\n\n   Decision Making Under Uncertainty\n\nThis course is designed for students who have taken Decision Models (MULT-UB 7) and would like to develop further their quantitative modeling skills for managerial decision making. Students learn more advanced modeling tools including: static stochastic optimization, two-stage stochastic optimization with recourse, chance-constrained stochastic optimization, and dynamic programming. Students explore their applications in various business domains, such as marketing, finance, inventory management, revenue management, supply chain management, and project management, among others. Students learn h...\n\n      more description for MULT-UB   16 »\n\n      \n\n\n\nThis course is designed for students who have taken Decision Models (MULT-UB 7) and would like to develop further their quantitative modeling skills for managerial decision making. Students learn more advanced modeling tools including: static stochastic optimization, two-stage stochastic optimization with recourse, chance-constrained stochastic optimization, and dynamic programming. Students explore their applications in various business domains, such as marketing, finance, inventory management, revenue management, supply chain management, and project management, among others. Students learn how these models can be solved using Risk Solver Platform for Excel, a powerful tool for risk analysis, simulation, and optimization. The emphasis throughout the course is on model formulation, solution methods, and managerial interpretation of the results, rather than in the mathematical algorithms used to solve the models.\n\n      less description for MULT-UB   16 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 20",
            "course_name": "Game Theory",
            "description": "MULT-UB   20 Game Theory \nThis course introduces the basics of game theory. It focuses on fundamentals of game theory, covering basic concepts and techniques through a mix of lectures, exercises, and case discussions. Students also think about how the lessons learned may apply to other contexts, such as politics. The course equips students with game theory techniques for making good business decisions by learning how to recognize and model strategic situations and to predict when and how actions will influence the decisions of others.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 21",
            "course_name": "The Entrepreneurship Game",
            "description": "MULT-UB   21 The Entrepreneurship Game",
            "offering": false
        },
        {
            "course_id": "MULT-UB 22",
            "course_name": "Business & Film:Vehicles for Globalization",
            "description": "MULT-UB   22 Business & Film:Vehicles for Globalization",
            "offering": false
        },
        {
            "course_id": "MULT-UB 23",
            "course_name": "",
            "description": "MULT-UB   23\n\n   Law Through The Lens of Film\n\nThe layman often perceives the law as a mysterious abstraction -- something one hears about on a news report about the Supreme Court or in relation to criminal law, something one hopes to avoid just by not having any traffic violations. But law is not only visible in everyday life, it is not so esoteric as to be beyond the laymans understanding. This course aims to develop a more educated perception of the law so that it becomes less intimidating. The objective is to equip students with a basic level of savvy and analytical ability in relation to law. To do this, we will watch  films over the ...\n\n      more description for MULT-UB   23 »\n\n      \n\n\n\nThe layman often perceives the law as a mysterious abstraction -- something one hears about on a news report about the Supreme Court or in relation to criminal law, something one hopes to avoid just by not having any traffic violations. But law is not only visible in everyday life, it is not so esoteric as to be beyond the laymans understanding. This course aims to develop a more educated perception of the law so that it becomes less intimidating. The objective is to equip students with a basic level of savvy and analytical ability in relation to law. To do this, we will watch  films over the course of the semester and learn to spot legal issues in a variety of scenarios, from personal life to business transactions. Discussions will then go into how such issues can impact the individuals and entities involved, how they can be resolved, what the ramifications of those issues are in the bigger scheme of society, and what kind of examples actually do exist in both historical and contemporary case law. While this is a Stern course, it is not limited to business law and rather, is a broad overview of law as viewed through film.\n\n      less description for MULT-UB   23 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 26",
            "course_name": "Capitalism and Development",
            "description": "MULT-UB   26 Capitalism and Development",
            "offering": false
        },
        {
            "course_id": "MULT-UB 27",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9636",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC 201",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Smith, Roy"
                }
            ],
            "course_name": "",
            "description": "MULT-UB   27\n\n   The Financial System\n\nThe financial crisis has shown both how important the financial system is to the global economy, and how complicated it is. Financial systems are centered around financial institutions and capital markets, but they also involve governments, public policy and regulation. They span the globe from the US, the EU and Japan to Russia, China and the Emerging Markets. This course provides students with a broad and rigorous understanding of (i) how the global financial system works and what purposes it serves, (ii) who the major players are and how they operate, and (iii) what challenges the system cr...\n\n      more description for MULT-UB   27 »\n\n      \n\n\n\nThe financial crisis has shown both how important the financial system is to the global economy, and how complicated it is. Financial systems are centered around financial institutions and capital markets, but they also involve governments, public policy and regulation. They span the globe from the US, the EU and Japan to Russia, China and the Emerging Markets. This course provides students with a broad and rigorous understanding of (i) how the global financial system works and what purposes it serves, (ii) who the major players are and how they operate, and (iii) what challenges the system creates for public policy. In doing so, the course helps students understand and make the most of their own opportunities in the financial system.\n\n      less description for MULT-UB   27 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 30",
            "course_name": "",
            "description": "MULT-UB   30\n\n   Revenue Management and Pricing\n\nRevenue Management and Pricing (RMP) focuses on how firms should manage their pricing and product availability policies across different selling channels in order to maximize performance and profitability. One of the best-known applications of RMP is yield management whereby airlines, hotels, and other companies seek to maximize operating contribution by dynamically managing capacity over time. For example, American Airlines estimates that its pricing and revenue management practices have generated more than $1.4 billion in additional incremental revenue over a three-year period. In addition, ...\n\n      more description for MULT-UB   30 »\n\n      \n\n\n\nRevenue Management and Pricing (RMP) focuses on how firms should manage their pricing and product availability policies across different selling channels in order to maximize performance and profitability. One of the best-known applications of RMP is yield management whereby airlines, hotels, and other companies seek to maximize operating contribution by dynamically managing capacity over time. For example, American Airlines estimates that its pricing and revenue management practices have generated more than $1.4 billion in additional incremental revenue over a three-year period. In addition, the restless evolution of information technologies and software development have fueled the rapid growth of commercial RMP systems and related consulting services. Building on a combination of lectures and case studies the course develops a set of methodologies that students could use to identify and develop opportunities for revenue optimization in different business contexts including the transportation and hospitality industries, retail, media and entertainment, financial services, health care and manufacturing, among others. The course places particular emphasis on discussing quantitative models needed to tackle a number of important business problems including capacity allocation, markdown management, dynamic pricing for ecommerce, customized pricing, and demand forecasts under market uncertainty, to name a few.\n\n      less description for MULT-UB   30 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 35",
            "course_name": "Trading Strategies and Systems",
            "description": "MULT-UB   35 Trading Strategies and Systems \nThis course describes how equity and derivatives markets work and the commonly employed trading strategies employed by professionals in these markets. The course focuses on how to construct indicators that measure the state of a market, the development of trading strategies based on these indicators, and the measurement and management of risk associated with the strategies. The course is useful to anyone interested in hedge funds, sales and trading, operations, and technology.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 36",
            "course_name": "",
            "description": "MULT-UB   36\n\n   Search & The New Economy\n\nThis course introduces students to the changes search technology has brought upon business and society. Search engine companies like Google, Yahoo, and Microsoft are rapidly changing the way companies market their products, how consumers purchase products, and how businesses produce and deliver products. The amount of data being generated and maintained by these companies has also forced them to develop completely new approaches to managing systems and data. These approaches are now being used in other industries, in particular, pharma and financial services. The course covers the basic elemen...\n\n      more description for MULT-UB   36 »\n\n      \n\n\n\nThis course introduces students to the changes search technology has brought upon business and society. Search engine companies like Google, Yahoo, and Microsoft are rapidly changing the way companies market their products, how consumers purchase products, and how businesses produce and deliver products. The amount of data being generated and maintained by these companies has also forced them to develop completely new approaches to managing systems and data. These approaches are now being used in other industries, in particular, pharma and financial services. The course covers the basic elements of search technologies and how they are impacting the many emerging new industries such as social networks, mobile advertising, text messaging, and search engine optimization.\n\n      less description for MULT-UB   36 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 39",
            "course_name": "",
            "description": "MULT-UB   39\n\n   Entrepreneurship 2.0\n\nEntrepreneurship 2.0 studies the process to launch and build a company. Technology and the Internet continue to accelerate rapid innovation that is disrupting most industries and creating many new ones. There has never been a better time to launch a business, and with so many relatively inexpensive technology tools available, most entrepreneurs today are entering markets with a lean, rapid and agile approach. In short, startups research their market to become “Ready”, test their product by firing away “FIRE”, and use the real market feedback to improve their “Aim”, and then they repeat the “Re...\n\n      more description for MULT-UB   39 »\n\n      \n\n\n\nEntrepreneurship 2.0 studies the process to launch and build a company. Technology and the Internet continue to accelerate rapid innovation that is disrupting most industries and creating many new ones. There has never been a better time to launch a business, and with so many relatively inexpensive technology tools available, most entrepreneurs today are entering markets with a lean, rapid and agile approach. In short, startups research their market to become “Ready”, test their product by firing away “FIRE”, and use the real market feedback to improve their “Aim”, and then they repeat the “Ready-FIRE-Aim” loop until they have the best product-market fit. This course, taught by experienced entrepreneurs, mixes lectures, office-hours, case studies, and guest entrepreneur presentations in an interactive and collaborative classroom environment. The students will form startup teams to brainstorm business ideas, research and test their products, and create a business summary for a live presentation to the class. Guest entrepreneurs, investors and your instructor will review your presentations to provide feedback and direction.\n\n      less description for MULT-UB   39 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 40",
            "course_name": "",
            "description": "MULT-UB   40\n\n   Entrepreneurship for The New Economy\n\nDiscusses how the Internet has created a truly global and completely interconnected world economy. The ability to reach and target your customer is much greater and the cost to sell your product is much cheaper, creating businesses that can get to market rapidly, build scale with capital efficiency, and create value for its founders and investors. Focuses on the dynamics of this new business environment and the steps necessary to build a business in a Web 2.0 economy. Also focuses on the steps one should evaluate when launching a new venture and how (and when and whether) to secure financing. ...\n\n      more description for MULT-UB   40 »\n\n      \n\n\n\nDiscusses how the Internet has created a truly global and completely interconnected world economy. The ability to reach and target your customer is much greater and the cost to sell your product is much cheaper, creating businesses that can get to market rapidly, build scale with capital efficiency, and create value for its founders and investors. Focuses on the dynamics of this new business environment and the steps necessary to build a business in a Web 2.0 economy. Also focuses on the steps one should evaluate when launching a new venture and how (and when and whether) to secure financing. The course mixes case studies, lectures, and field trips to actual companies. Students work to create a business plan that is presented to the class. The top three business concepts are invited to a leading NYC-based venture firm for a presentation to its partners for funding.\n\n      less description for MULT-UB   40 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 41",
            "course_name": "",
            "description": "MULT-UB   41\n\n   Social Entrepreneurship\n\nSocial Entrepreneurship is an emerging and rapidly changing business field that examines the practice of identifying, starting and growing successful mission-driven for profit and nonprofit ventures, that is, organizations that strive to advance social change through innovative solutions.  This course is designed to provide a socially relevant academic experience in order to help students gain in-depth insights into economic and social value creation across a number of sectors/areas including poverty alleviation, energy, health and sustainability.\nEssentially, students will have the opportunit...\n\n      more description for MULT-UB   41 »\n\n      \n\n\n\nSocial Entrepreneurship is an emerging and rapidly changing business field that examines the practice of identifying, starting and growing successful mission-driven for profit and nonprofit ventures, that is, organizations that strive to advance social change through innovative solutions.  This course is designed to provide a socially relevant academic experience in order to help students gain in-depth insights into economic and social value creation across a number of sectors/areas including poverty alleviation, energy, health and sustainability.\nEssentially, students will have the opportunity to find and test new ideas and solutions to social problems, create sustainable business models (using lean startup principles), identify funding options and alternatives, learn how to measure social impact as well as scale/grow a social enterprise to name a few. We provide students with a toolkit and frameworks that can be used in a social venture or within an existing organization to influence social change.\n\n      less description for MULT-UB   41 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 42",
            "course_name": "",
            "description": "MULT-UB   42\n\n   Economics Inequalities: Perspectives and Practices\n\nThis course provides students with a deeper understanding of current policy debates about economic inequality. The course format integrates a discussion seminar with a collaborative research project. In the seminar context, students become familiar with relevant terms and concepts drawn from economics, political science, organizational studies and philosophy. Informed by these analytic perspectives, students undertake research projects focused on the roles that individual organizations play in increasing and/or decreasing economic inequality. Funded by the Graduate Management Admissions Counci...\n\n      more description for MULT-UB   42 »\n\n      \n\n\n\nThis course provides students with a deeper understanding of current policy debates about economic inequality. The course format integrates a discussion seminar with a collaborative research project. In the seminar context, students become familiar with relevant terms and concepts drawn from economics, political science, organizational studies and philosophy. Informed by these analytic perspectives, students undertake research projects focused on the roles that individual organizations play in increasing and/or decreasing economic inequality. Funded by the Graduate Management Admissions Council (GMAC), these projects include collaboration with business students from ESADE in Barcelona, Spain, SDA Bocconi School of Management in Milan, Italy and Sogang University in Seoul, South Korea. This dimension of the course exposes students to a variety of international perspectives on economic inequality, and allows them to learn from the experience of producing deliverables in a geographically-dispersed team.\n\n      less description for MULT-UB   42 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 45",
            "course_name": "",
            "description": "MULT-UB   45\n\n   The Middle East: Cultures, Markets and Strategies\n\nMULT-UB 45 The Middle East: Culture, Markets and Strategies, is designed as an introduction to the Middle East, with a special focus on the Arabian Gulf (GCC) countries. It will examine key cultural, economic, political, and social structures in the region, and their implication for business strategies. The trip to Abu Dhabi will be used as a context to examine special topics that are relevant to the region. Some examples of topics that would be covered include sovereign wealth funds, the geopolitics of oil and renewable energy, Islam and Islamic finance, cultural issues, demographic and consu...\n\n      more description for MULT-UB   45 »\n\n      \n\n\n\nMULT-UB 45 The Middle East: Culture, Markets and Strategies, is designed as an introduction to the Middle East, with a special focus on the Arabian Gulf (GCC) countries. It will examine key cultural, economic, political, and social structures in the region, and their implication for business strategies. The trip to Abu Dhabi will be used as a context to examine special topics that are relevant to the region. Some examples of topics that would be covered include sovereign wealth funds, the geopolitics of oil and renewable energy, Islam and Islamic finance, cultural issues, demographic and consumption patterns, and entrepreneurship. The topics will be covered through lectures, discussions, guest lectures, company visits, cultural excursions, and projects.\n\n      less description for MULT-UB   45 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 48",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9395",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 3-90",
                    "time": "Mon 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Hendler, Richard"
                },
                {
                    "format": "Lecture",
                    "class_id": "9563",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 3-90",
                    "time": "Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Hendler, Richard"
                }
            ],
            "course_name": "",
            "description": "MULT-UB   48\n\n   Entertainment Law\n\nLaw inevitably touches all fields in some way, and mass media and entertainment is no exception. This course examines the inner workings of the entertainment business from a legal perspective. Major topics include contracts, torts (defamation and privacy), and intellectual property. It also focuses on the relationships between various parties in the entertainment field (e.g., the artist, manager, agent, and so on), the protection of intellectual property interests, and various aspects of the recording industry (e.g., contracts and royalties). Ultimately, this course  prepares students for gene...\n\n      more description for MULT-UB   48 »\n\n      \n\n\n\nLaw inevitably touches all fields in some way, and mass media and entertainment is no exception. This course examines the inner workings of the entertainment business from a legal perspective. Major topics include contracts, torts (defamation and privacy), and intellectual property. It also focuses on the relationships between various parties in the entertainment field (e.g., the artist, manager, agent, and so on), the protection of intellectual property interests, and various aspects of the recording industry (e.g., contracts and royalties). Ultimately, this course  prepares students for general analysis of a wide variety of entertainment law issues. Dealing with more narrow topics, such as constitutional concerns or union representation, requires additional, specialized independent study. This class also helps students further develop their reasoning and communication skills.\n\n      less description for MULT-UB   48 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 51",
            "course_name": "Real Estate Transactions",
            "description": "MULT-UB   51 Real Estate Transactions \nThis course examines the legal issues of real estate financing with an emphasis on commercial transactions. The main topics covered are acquisition, development, construction, permanent financing and management. The course focuses on these topics from a legal perspective. Students will develop the ability to use legal concepts in real estate transactions. The final part of the course covers some aspects of taxation specific to real estate.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 65",
            "course_name": "Fundamentals/Social Entr Problem Solv & Integratn",
            "description": "MULT-UB   65 Fundamentals/Social Entr Problem Solv & Integratn \nThe course highlights innovative case studies of success in restoring the environment, resolving conflicts, curing diseases, overcoming poverty, and addressing other problems of social injustice. During the term, each student develops an original blueprint for social innovation: a creative proposal for solving a societal problem.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 66",
            "course_name": "",
            "description": "MULT-UB   66\n\n   Advanced Social Entrepreneurship\n\nThis is an advanced seminar for students who have taken the introductory course on social entrepreneurship, or have focused on similar course work in past study. Each student is responsible for developing an original blueprint for social innovation: a creative proposal for solving a societal problem. Over the course of the term, students are expected to turn their blueprint into a reality. To help them, course work focuses on the skill-building necessary to complete the projects. Students receive support from the instructor, teaching assistant, and their fellow classmates, as well as financial...\n\n      more description for MULT-UB   66 »\n\n      \n\n\n\nThis is an advanced seminar for students who have taken the introductory course on social entrepreneurship, or have focused on similar course work in past study. Each student is responsible for developing an original blueprint for social innovation: a creative proposal for solving a societal problem. Over the course of the term, students are expected to turn their blueprint into a reality. To help them, course work focuses on the skill-building necessary to complete the projects. Students receive support from the instructor, teaching assistant, and their fellow classmates, as well as financial support in the form of seed money, provided by a generous donor who has \"adopted the class,\" for project completion. Guest lecturers with particular experience and expertise on the weekly topics present throughout the term.\n\n      less description for MULT-UB   66 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 70",
            "course_name": "",
            "description": "MULT-UB   70\n\n   Social Innovation Practicum\n\nThis course is designed to help students gain actionable insights into the nexus between economic and social value creation. Specifically, the purpose is to provide students with hands-on exposure to the entrepreneurial pursuit of social impact and innovation. As a result of this course, students will gain: \n\n• Increased ability to recognize and critically assess various forms of social enterprise strategies as tools of economic development and social transformation \n\n• Greater understanding of the challenges of growing and sustaining a social enterprise, as well as special insights into e...\n\n      more description for MULT-UB   70 »\n\n      \n\n\n\nThis course is designed to help students gain actionable insights into the nexus between economic and social value creation. Specifically, the purpose is to provide students with hands-on exposure to the entrepreneurial pursuit of social impact and innovation. As a result of this course, students will gain: \n\n• Increased ability to recognize and critically assess various forms of social enterprise strategies as tools of economic development and social transformation \n\n• Greater understanding of the challenges of growing and sustaining a social enterprise, as well as special insights into enterprise development and growth \n\n• Improved consulting skills, including project planning, issue and stakeholder analysis, formulation of strategic and tactical recommendations, and client relationship management.\n\n      less description for MULT-UB   70 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 71",
            "course_name": "Business Practicum",
            "description": "MULT-UB   71 Business Practicum \nInternships are a wonderful complement to classroom learning, and can be a valuable part of a student's education, especially with all of the exciting opportunities offered in New York City. The Stern 0.5-credit elective course, Business Practicum, is designed to help Stern students learn leadership and interpersonal skills that will allow them to effectively apply their classroom knowledge to the workplace.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 72",
            "course_name": "Business Practicum II",
            "description": "MULT-UB   72 Business Practicum II",
            "offering": false
        },
        {
            "course_id": "MULT-UB 73",
            "course_name": "Business Practicum III",
            "description": "MULT-UB   73 Business Practicum III",
            "offering": false
        },
        {
            "course_id": "MULT-UB 74",
            "course_name": "Business Practicum IV",
            "description": "MULT-UB   74 Business Practicum IV",
            "offering": false
        },
        {
            "course_id": "MULT-UB 75",
            "course_name": "Business Practicum V",
            "description": "MULT-UB   75 Business Practicum V",
            "offering": false
        },
        {
            "course_id": "MULT-UB 76",
            "course_name": "Business Practicum VI",
            "description": "MULT-UB   76 Business Practicum VI",
            "offering": false
        },
        {
            "course_id": "MULT-UB 86",
            "course_name": "Entrepreneurship & Law in Practice",
            "description": "MULT-UB   86 Entrepreneurship & Law in Practice \nThe course is designed around two games: the law game and the entrepreneurship game. The entrepreneurship game focuses on the legal and financial issues an entrepreneur considers in starting a business (teams follow the life-cycle of a business they create. It is our hope that some students may go on to create companies started in the game!). The law game simulates a civil trial from inception to end.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 100",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9396",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Menna, Larry"
                },
                {
                    "format": "Lecture",
                    "class_id": "9397",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Menna, Larry"
                },
                {
                    "format": "Lecture",
                    "class_id": "9398",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Wosnitzer, Robert"
                },
                {
                    "format": "Lecture",
                    "class_id": "9399",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Mon,Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Diyanni, Robert"
                },
                {
                    "format": "Lecture",
                    "class_id": "9400",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Wosnitzer, Robert"
                },
                {
                    "format": "Lecture",
                    "class_id": "9572",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Blount-Lyon, Robert"
                },
                {
                    "format": "Lecture",
                    "class_id": "9573",
                    "section": "007",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Blount-Lyon, Robert"
                },
                {
                    "format": "Lecture",
                    "class_id": "9574",
                    "section": "008",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC01",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Blount-Lyon, Robert"
                },
                {
                    "format": "Lecture",
                    "class_id": "9652",
                    "section": "009",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC03",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Tanaka, Aya"
                },
                {
                    "format": "Lecture",
                    "class_id": "9653",
                    "section": "010",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC03",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Tanaka, Aya"
                }
            ],
            "course_name": "Commerce and Culture",
            "description": "MULT-UB  100 Commerce and Culture \nThis course explores representations of American business in literature, film, art, and architecture. These artistic texts, placed in various business milieus, act as resources for students to develop their writing and critical thinking skills. Three major writing assignments ask students to consider the role of commerce and institutions in three aspects of modern life: individual identity and destiny, expressions of culture, and as sites for social and individual trans-\nformation.",
            "offering": true
        },
        {
            "course_id": "MULT-UB 101",
            "course_name": "",
            "description": "MULT-UB  101\n\n   Experiential Learning Seminar:  Marketing Social Initiatives in Developing Countries\n\nThere are many social challenges in the developing world—health, agriculture, violence against women, education, labor and the environment. In the healthcare field alone they include preventing the spread of AIDS, child immunization, family planning, breast feeding, preventing and controlling a range of communicable and non-communicable diseases, drug abuse, diet and nutrition. This project based course will present a behavioral impact marketing planning process with a focus on integrated communication plans. The projects will be “live”, based on current initiatives by governments and NGOs (e....\n\n      more description for MULT-UB  101 »\n\n      \n\n\n\nThere are many social challenges in the developing world—health, agriculture, violence against women, education, labor and the environment. In the healthcare field alone they include preventing the spread of AIDS, child immunization, family planning, breast feeding, preventing and controlling a range of communicable and non-communicable diseases, drug abuse, diet and nutrition. This project based course will present a behavioral impact marketing planning process with a focus on integrated communication plans. The projects will be “live”, based on current initiatives by governments and NGOs (e.g. World Health Organization (WHO), UNICEF) in Asia, Latin America and African countries. Lectures and discussions will be augmented by external speakers from the field with students creating marketing plans to address social challenges in developing countries.\n\n      less description for MULT-UB  101 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 103",
            "course_name": "Experiential Learning Seminar:  Social Impact Consulting",
            "description": "MULT-UB  103 Experiential Learning Seminar:  Social Impact Consulting \nThis course is an experiential learning seminar involving project-based collaboration among students, faculty and nonprofit organizations in New York City.  Its two objectives are to provide students with an occasion to put the lessons learned in the Social Impact Core Curriculum into practice as consultants; and to produce project outcomes that have meaning and value for participating stakeholders.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 104",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9686",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-140",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Carr, Jeffrey"
                }
            ],
            "course_name": "",
            "description": "MULT-UB  104\n\n   Experiential Learning Seminar:  Fashion Industry: Creativity & Business\n\nThere are many challenges in running a fashion business. Marrying the oftentimes conflicting views and orientations of the creative side of the business with the practical operational realities of making money is one of the largest ones. This course is a Junior/Senior Undergraduate Experiential Learning Workshop. It provides students with the opportunity to work on projects with executives, designers, merchandisers, manufacturers and marketers from leading fashion companies and start-up ventures. Both established players and entrepreneurial ventures will be represented, focusing on specific ch...\n\n      more description for MULT-UB  104 »\n\n      \n\n\n\nThere are many challenges in running a fashion business. Marrying the oftentimes conflicting views and orientations of the creative side of the business with the practical operational realities of making money is one of the largest ones. This course is a Junior/Senior Undergraduate Experiential Learning Workshop. It provides students with the opportunity to work on projects with executives, designers, merchandisers, manufacturers and marketers from leading fashion companies and start-up ventures. Both established players and entrepreneurial ventures will be represented, focusing on specific challenges the fashion industry faces in finance, marketing, sales, manufacturing, management and operations. This is a project based class. Students will learn the ins and outs of the fashion industry through working on “live cases.” It is an opportunity to marry the theory and process learned in the core classes, with the reality of running real businesses in a creative and dynamic industry. The basic format of the class is learn by doing. This will be a highly interactive class with an emphasis on participation and application. Projects will cover all aspects of the industry and will vary from working with established fashion brands and retailers to helping start-ups launch their businesses. Each project will have a student team (maximum five members, a project leader from the host company and an academic adviser (Professor Carr or Professor Ferrara). Many of the projects will come from the Council of Fashion Designers of Americas (CFDA) members and CFDA Incubator companies. At the completion of the projects, teams will present their analysis and plans to a panel of industry experts who will evaluate them based on their thoroughness and value to the companies.\n\n      less description for MULT-UB  104 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 105",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19849",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC05",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Narayanan, Sunder"
                }
            ],
            "course_name": "",
            "description": "MULT-UB  105\n\n   Emerging Innovations in the Energy Industry\n\nThis course lies at the intersection of two academic streams - Technology & Innovation, and the Energy Industry. Specifically it examines the rapid technological changes that are taking place in the energy industry from an economic, geopolitical, and sociocultural perspective. It will cover traditional petroleum-based industries as well as other industries such as solar, nuclear, sand oil, wind, biofuels, and renewable energy. It will also examine technological changes in the electricity market such as smart grids etc. As part of the Experiential Learning Seminar, the course will require stude...\n\n      more description for MULT-UB  105 »\n\n      \n\n\n\nThis course lies at the intersection of two academic streams - Technology & Innovation, and the Energy Industry. Specifically it examines the rapid technological changes that are taking place in the energy industry from an economic, geopolitical, and sociocultural perspective. It will cover traditional petroleum-based industries as well as other industries such as solar, nuclear, sand oil, wind, biofuels, and renewable energy. It will also examine technological changes in the electricity market such as smart grids etc. As part of the Experiential Learning Seminar, the course will require students to work on projects with New York city-based organizations.\n\n      less description for MULT-UB  105 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 151",
            "course_name": "",
            "description": "MULT-UB  151\n\n   Executive Practitioner Seminar: The Dynamics of the Fashion Industry\n\nThe fashion industry is a unique and highly visible part of the business world. Its economic impact to New York City is significant, employing 173,000 people and generating nearly $10 billion in wages. In addition, the semi-annual Fashion Week, which includes more than 500 fashion shows and attracts approximately 232,000 attendees each year, generates an economic impact of almost $900 million annually. New York City is the global capital of fashion. This course will bring together leading designers, manufacturers and retailers who will present and discuss with students the unique aspects of th...\n\n      more description for MULT-UB  151 »\n\n      \n\n\n\nThe fashion industry is a unique and highly visible part of the business world. Its economic impact to New York City is significant, employing 173,000 people and generating nearly $10 billion in wages. In addition, the semi-annual Fashion Week, which includes more than 500 fashion shows and attracts approximately 232,000 attendees each year, generates an economic impact of almost $900 million annually. New York City is the global capital of fashion. This course will bring together leading designers, manufacturers and retailers who will present and discuss with students the unique aspects of the fashion business. Both established players and entrepreneurial ventures will be represented, focusing on specific challenges the fashion industry faces in finance, marketing, sales, manufacturing, management and operations.\n\n      less description for MULT-UB  151 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 152",
            "course_name": "",
            "description": "MULT-UB  152\n\n   Executive Practitioner Seminar: Financial Reporting: Practical Insights\n\nMany Stern students are involved in some aspects of reporting and analyzing financial statements after they graduate. Therefore, having a good understanding of the practical aspects of financial reporting and analysis is crucial to finding a job and having a successful career. These practical aspects cannot be communicated in a traditional classroom setting; their understanding requires presentations by and in-depth discussions with industry professionals. Our New York City location gives us an unparalleled access to such professionals. The course offers a unique opportunity to interact with t...\n\n      more description for MULT-UB  152 »\n\n      \n\n\n\nMany Stern students are involved in some aspects of reporting and analyzing financial statements after they graduate. Therefore, having a good understanding of the practical aspects of financial reporting and analysis is crucial to finding a job and having a successful career. These practical aspects cannot be communicated in a traditional classroom setting; their understanding requires presentations by and in-depth discussions with industry professionals. Our New York City location gives us an unparalleled access to such professionals. The course offers a unique opportunity to interact with them.\n\n      less description for MULT-UB  152 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 200",
            "course_name": "CPA Workshop",
            "description": "MULT-UB  200 CPA Workshop",
            "offering": false
        },
        {
            "course_id": "MULT-UB 201",
            "course_name": "Dean's Research Project II",
            "description": "MULT-UB  201 Dean's Research Project II",
            "offering": false
        },
        {
            "course_id": "MULT-UB 230",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9508",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-90",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Ruhl, Kim"
                }
            ],
            "course_name": "",
            "description": "MULT-UB  230\n\n   Global Macroeconomics\n\nThis course introduces students to international macroeconomics and analyzes current international macroeconomics and financial issues, policies, and events, including current global economic conditions in the United States, Europe, and Asia and emerging market economies; interest rates, exchange rates, and asset prices in the global economy; causes and consequences of trade deficits and external imbalances; emerging market economies; financial crises; causes of currency, banking, and financial crises; short- and long-term effects of monetary and fiscal policy asset bubbles, credit booms, and ...\n\n      more description for MULT-UB  230 »\n\n      \n\n\n\nThis course introduces students to international macroeconomics and analyzes current international macroeconomics and financial issues, policies, and events, including current global economic conditions in the United States, Europe, and Asia and emerging market economies; interest rates, exchange rates, and asset prices in the global economy; causes and consequences of trade deficits and external imbalances; emerging market economies; financial crises; causes of currency, banking, and financial crises; short- and long-term effects of monetary and fiscal policy asset bubbles, credit booms, and financial crises; and the globalization of financial markets. These topics are integrated into a theoretical framework that stresses international factors from the start. Examples from the United States, Europe, Japan, China, and emerging market economies are used to enhance knowledge of the world economy.\n\n      less description for MULT-UB  230 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 275",
            "course_name": "",
            "description": "MULT-UB  275\n\n   Business and Investments\n\nThis course is designed for rising high school juniors and seniors who want to learn about personal and business finances. The business and financial skills covered are crucial to a successful career in business either as an entrepreneur or in the corporate world. A broad overview of the topics and tools covered in the course include the following:\n\n•\tPersonal finance: Time value of money, personal financial planning and borrowing, risk versus return trade off in investments in stocks and bonds, pricing in competitive financial markets\n•\tUnderstanding businesses and building business plans and...\n\n      more description for MULT-UB  275 »\n\n      \n\n\n\nThis course is designed for rising high school juniors and seniors who want to learn about personal and business finances. The business and financial skills covered are crucial to a successful career in business either as an entrepreneur or in the corporate world. A broad overview of the topics and tools covered in the course include the following:\n\n•\tPersonal finance: Time value of money, personal financial planning and borrowing, risk versus return trade off in investments in stocks and bonds, pricing in competitive financial markets\n•\tUnderstanding businesses and building business plans and models: Income statements and margins, Balance sheets and funding needs, projecting size, growth, margins, net asset intensity, and risk\n•\tCapital markets: Public offerings, financial reporting, basic valuation ratios\n\nThis course does not count toward the Stern BS in Business degree.\n\n      less description for MULT-UB  275 «",
            "offering": false
        },
        {
            "course_id": "MULT-UB 276",
            "course_name": "Behavioral Economics & The Science of Decision Making",
            "description": "MULT-UB  276 Behavioral Economics & The Science of Decision Making \nThis course is designed for rising high school juniors and seniors who want to study the science behind how people make decisions through an overview of research in the behavioral sciences. Students will develop an understanding of how these tools can be leveraged to predict consumers’ responses, anticipate managerial biases, and, ultimately, design more effective managerial and marketing strategies to obtain a competitive advantage.\n\nThis course does not count toward the Stern BS in Business degree.",
            "offering": false
        },
        {
            "course_id": "MULT-UB 300",
            "course_name": "Of Profits & Prophets: Amer Busns Thru Cinema",
            "description": "MULT-UB  300 Of Profits & Prophets: Amer Busns Thru Cinema",
            "offering": false
        },
        {
            "course_id": "MULT-UB 301",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "9681",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Mon,Wed 8.00 AM - 9.15 AM",
                    "open": true,
                    "professor": "Franklin, Cynthia"
                }
            ],
            "course_name": "",
            "description": "MULT-UB  301\n\n   Getting to Launch: The Lean Startup Lab\n\nThis course broadly focuses on venture creation and guides students through the thrilling ride that is the entrepreneurial startup process. Students explore the how-tos of identifying and evaluating opportunities, developing innovative business models, concept testing, gaining early customer feedback, and then rapidly iterating to better address market demand and meet competitor challenges. Emphasis is placed on completing a feasibility analysis that examines will it fly? and on creating a strategic plan for launching, operating, and financing their business, whether a web 2.0, traditional bri...\n\n      more description for MULT-UB  301 »\n\n      \n\n\n\nThis course broadly focuses on venture creation and guides students through the thrilling ride that is the entrepreneurial startup process. Students explore the how-tos of identifying and evaluating opportunities, developing innovative business models, concept testing, gaining early customer feedback, and then rapidly iterating to better address market demand and meet competitor challenges. Emphasis is placed on completing a feasibility analysis that examines will it fly? and on creating a strategic plan for launching, operating, and financing their business, whether a web 2.0, traditional brick and mortar, for-profit, or social impact venture\n\n      less description for MULT-UB  301 «",
            "offering": true
        },
        {
            "course_id": "MULT-UB 400",
            "course_name": "Undergraduate Research Seminar",
            "description": "MULT-UB  400 Undergraduate Research Seminar",
            "offering": false
        },
        {
            "course_id": "MULT-UB 401",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "9708",
                    "section": "013",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Undergraduate Research Seminar",
            "description": "MULT-UB  401 Undergraduate Research Seminar",
            "offering": true
        },
        {
            "course_id": "MULT-UB 402",
            "course_name": "Undergraduate Research Seminar",
            "description": "MULT-UB  402 Undergraduate Research Seminar",
            "offering": false
        },
        {
            "course_id": "MULT-UB 403",
            "course_name": "Undergraduate Research Seminar",
            "description": "MULT-UB  403 Undergraduate Research Seminar",
            "offering": false
        },
        {
            "course_id": "MULT-UB 410",
            "course_name": "Undergraduate Research Seminar",
            "description": "MULT-UB  410 Undergraduate Research Seminar",
            "offering": false
        },
        {
            "course_id": "MULT-UB 411",
            "course_name": "Undergraduate Research Seminar",
            "description": "MULT-UB  411 Undergraduate Research Seminar",
            "offering": false
        },
        {
            "course_id": "MULT-UB 412",
            "course_name": "Undergraduate Research Seminar",
            "description": "MULT-UB  412 Undergraduate Research Seminar",
            "offering": false
        },
        {
            "course_id": "MULT-UB 1729",
            "course_name": "Calculus I",
            "description": "MULT-UB 1729 Calculus I",
            "offering": false
        },
        {
            "course_id": "MULT-UB 9027",
            "course_name": "The Finanical System",
            "description": "MULT-UB 9027 The Finanical System",
            "offering": false
        }
    ]
}