{
    "major_id": "NEUR-SHU",
    "file": "./2015-2016/Neural_Science_(NEUR-SHU).html",
    "courses": [
        {
            "course_id": "NEUR-SHU 10",
            "course_name": "J",
            "description": "NEUR-SHU   10J\n\n   What Can Neuroscience Tell Us About Free Will?\n\n\"The concept of free will plays a central role in society, in particular in the criminal justice system. In this course, we will explore the concept of free will and related topics in neuroscience such as intention and self-control. We will cover the evidence from neuroscience that argues that behavior is, under normal conditions, not deterministic, thus providing a material basis for the concept of individual agency.  We will then address the neuroscience evidence for cases where individual agency is reduced through external influence via learning and the reward and punishment systems. Finall...\n\n      more description for NEUR-SHU   10J »\n\n      \n\n\n\n\"The concept of free will plays a central role in society, in particular in the criminal justice system. In this course, we will explore the concept of free will and related topics in neuroscience such as intention and self-control. We will cover the evidence from neuroscience that argues that behavior is, under normal conditions, not deterministic, thus providing a material basis for the concept of individual agency.  We will then address the neuroscience evidence for cases where individual agency is reduced through external influence via learning and the reward and punishment systems. Finally, we will examine the most extreme cases of this, psychiatric disorders that reduce agency: addiction, compulsive disorders, and anxiety disorders.\"(Science, Technology and Society)\n\n      less description for NEUR-SHU   10J «",
            "offering": false
        },
        {
            "course_id": "NEUR-SHU 201",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "13235",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Erlich, Jeffrey",
                    "time": "Tue,Thu 11.15 AM - 12.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "NEUR-SHU  201\n\n   Introduction to Neural Science\n\nIntroductory lecture course covering the fundamental principles of neuroscience. Topics include principles of brain organization, structure and ultrastrucIntroductory lecture course covering the fundamental principles of neuroscience. Topics include principles of brain organization, structure and ultrastructure of neurons, neurophysiology and biophysics of excitable cells, synaptic transmission, neurotransmitter systems and neurochemistry, neuropharmacology, neuroendocrine relations, molecular biology of neurons, development and plasticity of the brain, aging and diseases of the nervous system...\n\n      more description for NEUR-SHU  201 »\n\n      \n\n\n\nIntroductory lecture course covering the fundamental principles of neuroscience. Topics include principles of brain organization, structure and ultrastrucIntroductory lecture course covering the fundamental principles of neuroscience. Topics include principles of brain organization, structure and ultrastructure of neurons, neurophysiology and biophysics of excitable cells, synaptic transmission, neurotransmitter systems and neurochemistry, neuropharmacology, neuroendocrine relations, molecular biology of neurons, development and plasticity of the brain, aging and diseases of the nervous system, organization of sensory and motor systems, structure and function of the cerebral cortex, and modeling of neural systems. Prerequisite: CCSC-110.\n\n      less description for NEUR-SHU  201 «",
            "offering": true
        },
        {
            "course_id": "NEUR-SHU 251",
            "course_name": "Behavioral and Integrative Neuroscience",
            "description": "NEUR-SHU  251 Behavioral and Integrative Neuroscience \nThis lecture and laboratory course addresses the physiological and anatomical bases of behavior. Lectures and laboratory experiments will emphasize mammalian sensory, motor, regulatory, and motivational mechanisms involved in the control of behavior, and higher mental processes such as those involved in language and memory. Prerequisite: NEUR-201.",
            "offering": false
        },
        {
            "course_id": "NEUR-SHU 260",
            "course_name": "",
            "description": "NEUR-SHU  260\n\n   Development and Dysfunction of the Nervous System\n\nThis course will explore how the nervous system develops in normal animals, and how genetic and epigenetic factors can disrupt these processes. Lectures on normal developmental mechanisms will be interleaved with those on disorders to provide a solid foundation for our discussions of abnormal events during maturation. The lectures on normal development cover a broad range of topics including differentiation, axon outgrowth, synapse formation, specificity of connections, and plasticity. The lectures on dysfunction include autism, dyslexia, mental retardation, specific language impairment, heari...\n\n      more description for NEUR-SHU  260 »\n\n      \n\n\n\nThis course will explore how the nervous system develops in normal animals, and how genetic and epigenetic factors can disrupt these processes. Lectures on normal developmental mechanisms will be interleaved with those on disorders to provide a solid foundation for our discussions of abnormal events during maturation. The lectures on normal development cover a broad range of topics including differentiation, axon outgrowth, synapse formation, specificity of connections, and plasticity. The lectures on dysfunction include autism, dyslexia, mental retardation, specific language impairment, hearing loss, blindness, ADHD, demyelinating or neurodegenerative disorders, and axon regeneration. The major goals of the course will be understand the extent to which current theories can explain the etiology of each disorder, and to learn how basic research can best facilitate advances in our knowledge and, ultimately, lead to treatments or cures. Prerequisites: CCSC-114 & NEUR-251.\n\n      less description for NEUR-SHU  260 «",
            "offering": false
        },
        {
            "course_id": "NEUR-SHU 280",
            "course_name": "",
            "description": "NEUR-SHU  280\n\n   Special Topics in Neural Science\n\nA seminar course providing in-depth treatment of an area of current interest neuroscience. Lectures will present background material and address current problems in the area related to the topic. Students will read and discuss review articles and current literature on the topic. Course content will be determined on a semester-by-semester basis. Possible topics include “Decision Making”; “Neurobiology of Learning and Memory”; “Signal Processing in Neural Networks”; “Intro to Computer Modeling of Neuronal Systems”; “Cognitive Neuroscience”; “Can Exercise Change Your Brain?”; “Molecular Mechanism...\n\n      more description for NEUR-SHU  280 »\n\n      \n\n\n\nA seminar course providing in-depth treatment of an area of current interest neuroscience. Lectures will present background material and address current problems in the area related to the topic. Students will read and discuss review articles and current literature on the topic. Course content will be determined on a semester-by-semester basis. Possible topics include “Decision Making”; “Neurobiology of Learning and Memory”; “Signal Processing in Neural Networks”; “Intro to Computer Modeling of Neuronal Systems”; “Cognitive Neuroscience”; “Can Exercise Change Your Brain?”; “Molecular Mechanisms of Memory”; “Color Vision”; and “Neuroeconomics and Decision-Making.” Prerequisite: BIOL-201.\n\n      less description for NEUR-SHU  280 «",
            "offering": false
        },
        {
            "course_id": "NEUR-SHU 301",
            "course_name": "Cellular and Molecular Neuroscience",
            "description": "NEUR-SHU  301 Cellular and Molecular Neuroscience \nA lecture course that provides students with broad exposure to current questions and experimental approaches in cellular neuroscience. Lectures are organized into three areas: cell structure and organization of the vertebrate central nervous system, mechanisms underlying neural signaling and plasticity, and control of cell form and its developmental determinants. . Prerequisites: CCSC-114 & NEUR-251.",
            "offering": false
        }
    ]
}