{
    "major_id": "OART-UT",
    "file": "./2015-2016/Open_Arts_Curriculum_(OART-UT).html",
    "courses": [
        {
            "course_id": "OART-UT 5",
            "course_name": "",
            "description": "OART-UT    5\n\n   All-University Choir at Tisch\n\nAll University Choir is a highly trained vocal vehicle, dedicated to the artistic excellence of the first art, and open to the entire student body at NYU.\nWe accept up to seventy-five beautiful blending voices: Sopranos, Altos, Tenors and Basses (Baritones). Students who read music and have previous choir experience are preferred, but we welcome all-comers. Ability to read music is a plus but not mandatory. This year's concert is entitled \"ROCK AND BACH AND ROLL\" The performance will contain works of pop and rock music from the 70s through the present, classical works from the Baroque up throu...\n\n      more description for OART-UT    5 »\n\n      \n\n\n\nAll University Choir is a highly trained vocal vehicle, dedicated to the artistic excellence of the first art, and open to the entire student body at NYU.\nWe accept up to seventy-five beautiful blending voices: Sopranos, Altos, Tenors and Basses (Baritones). Students who read music and have previous choir experience are preferred, but we welcome all-comers. Ability to read music is a plus but not mandatory. This year's concert is entitled \"ROCK AND BACH AND ROLL\" The performance will contain works of pop and rock music from the 70s through the present, classical works from the Baroque up through the romantic era, original pieces by students at the university, and famous Broadway songs.\n\n      less description for OART-UT    5 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 11",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14435",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 814",
                    "time": "Mon 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": "Ross-Smith, Bayete"
                },
                {
                    "format": "Studio",
                    "class_id": "14436",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 814",
                    "time": "Mon 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Baum, Matthew"
                },
                {
                    "format": "Studio",
                    "class_id": "14437",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 814",
                    "time": "Wed 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": "Boddie, Terry"
                }
            ],
            "course_name": "",
            "description": "OART-UT   11\n\n   Photography I\n\nA basic black-and-white photography course designed for those with little or no experience in photography. Emphasis is placed on the application of technique in terms of personal expression through the selection and composition of subject matter. Class size is limited, providing for a greater degree of individual critique and classroom participation. The course comprises technical lectures, darkroom demonstrations, slide lectures on historical and contemporary work as well as class critiques. Each student must have a camera with manually adjustable aperture and shutter speeds. A lab fee is ass...\n\n      more description for OART-UT   11 »\n\n      \n\n\n\nA basic black-and-white photography course designed for those with little or no experience in photography. Emphasis is placed on the application of technique in terms of personal expression through the selection and composition of subject matter. Class size is limited, providing for a greater degree of individual critique and classroom participation. The course comprises technical lectures, darkroom demonstrations, slide lectures on historical and contemporary work as well as class critiques. Each student must have a camera with manually adjustable aperture and shutter speeds. A lab fee is assessed by the University Bursar for this course.  The department reserves the right to drop any student from a course who does not attend the first class. Please note there is a non-refundable lab fee for this class.\n\n      less description for OART-UT   11 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 12",
            "course_name": "",
            "description": "OART-UT   12\n\n   The Future of Imaging\n\nThe introduction of digital imaging systems, allowing a new flexibility in image-making and distribution, is revolutionizing photography. This course will look at photography's strengths and weaknesses, both real and imagined, in attempting to determine new strategies for its use as both society and technology evolve. Subjects will include the role of the photograph during the recent war in Iraq, its heavy use in the field of \"multimedia,\" its problematic function as social critic, the imagery emerging from other cultures, the clarion call for improved visual literacy, and photography's use in...\n\n      more description for OART-UT   12 »\n\n      \n\n\n\nThe introduction of digital imaging systems, allowing a new flexibility in image-making and distribution, is revolutionizing photography. This course will look at photography's strengths and weaknesses, both real and imagined, in attempting to determine new strategies for its use as both society and technology evolve. Subjects will include the role of the photograph during the recent war in Iraq, its heavy use in the field of \"multimedia,\" its problematic function as social critic, the imagery emerging from other cultures, the clarion call for improved visual literacy, and photography's use in cyborg culture.. We will also look at related trends in other media including film, video, music and hypertext. After more than 150 years in which photographs have proliferated, this course will look at how we have been changed by them, and how we can arrive at some understanding of this newly digital \"image culture\" around us in order to discern where it might be taking us.\n\n      less description for OART-UT   12 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 13",
            "course_name": "Photography II for Non-Majors",
            "description": "OART-UT   13 Photography II for Non-Majors",
            "offering": false
        },
        {
            "course_id": "OART-UT 14",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14438",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 711",
                    "time": "Mon 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Benevides, Robert"
                }
            ],
            "course_name": "",
            "description": "OART-UT   14\n\n   Intro Special Effects Makeup\n\nThis is an introductory level hands-on workshop designed for students wishing to explore their artistry, experienced make-up artists seeking advanced techniques, non-make-up artists just starting out, and anyone who has ever wondered “how’d they do that?” This course explores the art of special effects make-up. Topics include “out-of-kit” make-up effects including cuts, bruises, black eyes, scabs, scars, wounds, burns, and decayed flesh; skin safe molding procedures; casting and painting silicone replica props, designing and sculpting, molding and applying silicone prosthetics to execute a zom...\n\n      more description for OART-UT   14 »\n\n      \n\n\n\nThis is an introductory level hands-on workshop designed for students wishing to explore their artistry, experienced make-up artists seeking advanced techniques, non-make-up artists just starting out, and anyone who has ever wondered “how’d they do that?” This course explores the art of special effects make-up. Topics include “out-of-kit” make-up effects including cuts, bruises, black eyes, scabs, scars, wounds, burns, and decayed flesh; skin safe molding procedures; casting and painting silicone replica props, designing and sculpting, molding and applying silicone prosthetics to execute a zombie make-up; and designing and creating a 1:1 scale character maquette.  Anatomical reference and safety using materials is also addressed.\n\nUniversity Bursar will assess a lab fee for this course. Students receive their own specially designed make-up kit with all materials necessary to complete all in-class assignments.\nNo artistic background required.\n\n      less description for OART-UT   14 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 16",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "17197",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 711",
                    "time": "Wed 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Benevides, Robert"
                }
            ],
            "course_name": "",
            "description": "OART-UT   16\n\n   Intermediate Special Effects Make Up\n\nThis course expands upon the art of special effects make-up in an Intermediate level hands-on workshop. It is designed for students wishing to further develop and build upon the skills and techniques learned in the Introductory level class.  Intermediate projects will include bald cap application, life casting, designing/sculpting/molding and painting a 1:1 scale silicone mutant creature in a jar prop, application/blending/painting a ready made foam latex prosthetic and much more!\n \nUniversity Bursar will assess a lab fee for this course. Students receive their own specially designed make-up k...\n\n      more description for OART-UT   16 »\n\n      \n\n\n\nThis course expands upon the art of special effects make-up in an Intermediate level hands-on workshop. It is designed for students wishing to further develop and build upon the skills and techniques learned in the Introductory level class.  Intermediate projects will include bald cap application, life casting, designing/sculpting/molding and painting a 1:1 scale silicone mutant creature in a jar prop, application/blending/painting a ready made foam latex prosthetic and much more!\n \nUniversity Bursar will assess a lab fee for this course. Students receive their own specially designed make-up kit with all materials necessary to complete all in-class assignments.\n\n      less description for OART-UT   16 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 20",
            "course_name": "",
            "description": "OART-UT   20\n\n   Creative Computing\n\nWhat can computation add to human communication? Creating computer applications, instead of just using them, will give you a deeper understanding of the essential possibilities of computation. Conversely excitement about your computational project ideas whether they be in the domain of art, design, humanities, sciences or engineering will best propel your acquisition of skills necessary to realize those ideas.  In this class student will learn computer programming primarily in the context of images and video.  The course focuses on fundamentals of computer programming (variables, conditionals,...\n\n      more description for OART-UT   20 »\n\n      \n\n\n\nWhat can computation add to human communication? Creating computer applications, instead of just using them, will give you a deeper understanding of the essential possibilities of computation. Conversely excitement about your computational project ideas whether they be in the domain of art, design, humanities, sciences or engineering will best propel your acquisition of skills necessary to realize those ideas.  In this class student will learn computer programming primarily in the context of images and video.  The course focuses on fundamentals of computer programming (variables, conditionals, iteration, arrays, functions, objects) as well as more advanced techniques such as image processing, networking, data parsing and computer vision. The Java-based ‘Processing’ programming environment is the primary vehicle.   While the example applications will be primarily in a screen based, visual domain, motivated students are encouraged to incorporate more physical interface to their projects using tools such as the Arduino.  The course is designed for computer programming novices but the project centered pedagogy will allow more experienced programmers the opportunity to play further with their project ideas and make lots of friends by helping the other students.\n\n      less description for OART-UT   20 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 21",
            "course_name": "",
            "description": "OART-UT   21\n\n   Intro to Physical Computing\n\nPhysical Computing is an approach to learning how humans communicate through computers that starts by considering how humans express themselves physically. In this course, we take the human body as a given, and attempt to design computing applications within the limits of its expression.  To realize this goal, you'll learn how to use sensors to detect changes in energy given off by our bodies (in the form of sound, light, motion, and other forms) and feed these values into a very simple computer called a microcontrollers that will also control output of the circuit. The microcontroller used in...\n\n      more description for OART-UT   21 »\n\n      \n\n\n\nPhysical Computing is an approach to learning how humans communicate through computers that starts by considering how humans express themselves physically. In this course, we take the human body as a given, and attempt to design computing applications within the limits of its expression.  To realize this goal, you'll learn how to use sensors to detect changes in energy given off by our bodies (in the form of sound, light, motion, and other forms) and feed these values into a very simple computer called a microcontrollers that will also control output of the circuit. The microcontroller used in this class is called Arduino, is much more accessible than previous microcontrollers and is intended specifically for artists and hobbyist. The core technical concepts of the class include digital, analog and serial input and output. You'll also learn how microcontrollers communicate with other computers.  Physical computing takes a hands-on approach, which means that you spend a lot of time building circuits, soldering, writing programs, building structures to hold sensors and controls, and figuring out how best to make all of these things relate to a person's expression. Students have weekly lab exercises to build skills with the microcontroller and related tools, and longer assignments in which they apply the principles from weekly labs in creative applications. Both individual work and group work is required.\n\n      less description for OART-UT   21 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 35",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14440",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 010 with Woodbury, William09/02/2015 - 12/15/2015 Fri 11.00 AM - 12.15 PM at 721B 014",
                    "time": "Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Woodbury, William"
                },
                {
                    "format": "Lecture",
                    "class_id": "14441",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "ARC_ LL03",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Woodbury, William"
                }
            ],
            "course_name": "",
            "description": "OART-UT   35\n\n   Fund of Developing the Screenplay\n\nThe course combines lectures on the basics of feature length screenwriting with the development of the student’s own writing work. Students are required to complete 50-70 pages of a full length screenplay with an outline of the rest. The students study story structure, conflict, and character, in conjunction with the screening and study of several classic films and screenplays. The writing process starts in the first month with a focus on exercises to help students develop five story ideas with the complexity and depth to sustain a full-length screenplay. One of these ideas will serve as the b...\n\n      more description for OART-UT   35 »\n\n      \n\n\n\nThe course combines lectures on the basics of feature length screenwriting with the development of the student’s own writing work. Students are required to complete 50-70 pages of a full length screenplay with an outline of the rest. The students study story structure, conflict, and character, in conjunction with the screening and study of several classic films and screenplays. The writing process starts in the first month with a focus on exercises to help students develop five story ideas with the complexity and depth to sustain a full-length screenplay. One of these ideas will serve as the basis for the required work. Each idea can be described in one or two paragraphs. Special instructions: All students must come to the first class with three ideas for full-length screenplays.\n\n      less description for OART-UT   35 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 36",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14650",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 941",
                    "time": "Mon 3.30 PM - 6.15 PM",
                    "open": true,
                    "professor": "Schulman, Charles"
                }
            ],
            "course_name": "",
            "description": "OART-UT   36\n\n   Intermediate Screenwriting\n\nA continuation of the training presented in Fundamentals of Developing the Screenplay. Required work in the class includes extensive scene work. Guided by their screenwriting instructor, students will complete the screenplay begun in Fundamentals of Developing the Screenplay and then do a rewrite or they may begin, complete, and rewrite a new full-length screenplay. The focus in this class will be on story structure and development and the completion of a full-length screenplay. If you plan to do a new work, you must come to the first class with three ideas for full-length screenplays. Each id...\n\n      more description for OART-UT   36 »\n\n      \n\n\n\nA continuation of the training presented in Fundamentals of Developing the Screenplay. Required work in the class includes extensive scene work. Guided by their screenwriting instructor, students will complete the screenplay begun in Fundamentals of Developing the Screenplay and then do a rewrite or they may begin, complete, and rewrite a new full-length screenplay. The focus in this class will be on story structure and development and the completion of a full-length screenplay. If you plan to do a new work, you must come to the first class with three ideas for full-length screenplays. Each idea can be described in one or two paragraphs.\n\n      less description for OART-UT   36 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 110",
            "course_name": "Computer Vision: Seeing Digital in the Visual Arts",
            "description": "OART-UT  110 Computer Vision: Seeing Digital in the Visual Arts",
            "offering": false
        },
        {
            "course_id": "OART-UT 140",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14442",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 435",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Neogy, Chitra"
                }
            ],
            "course_name": "",
            "description": "OART-UT  140\n\n   Film: A Transformative Process, a Vision Beyond Technology\n\nThis course emphasizes the content, the aesthetics, and the purpose of cinema as a truly distinctive and dynamic art form uncovering the inner vision of the filmmaker, and the organic and transformative process where filmmakers projects their original truth, not compromising or borrowing ideas and themes from other films. Students explore the use of technology as a valuable tool that enhances the vision of the filmmaker without diminishing the organic texture of the work by its overwhelming presence. The course brings to light the stagnant and repetitious formulae of commercial cinema, resulti...\n\n      more description for OART-UT  140 »\n\n      \n\n\n\nThis course emphasizes the content, the aesthetics, and the purpose of cinema as a truly distinctive and dynamic art form uncovering the inner vision of the filmmaker, and the organic and transformative process where filmmakers projects their original truth, not compromising or borrowing ideas and themes from other films. Students explore the use of technology as a valuable tool that enhances the vision of the filmmaker without diminishing the organic texture of the work by its overwhelming presence. The course brings to light the stagnant and repetitious formulae of commercial cinema, resulting in diluted mainstream films. The works of iconic filmmakers who embrace and use film as an original, vibrant and reflective art form are reviewed throughout the course. Extracts and readings from relevant filmmakers are given throughout the course.\n\n      less description for OART-UT  140 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 401",
            "course_name": "Final Projects in Performance Studies",
            "description": "OART-UT  401 Final Projects in Performance Studies",
            "offering": false
        },
        {
            "course_id": "OART-UT 410",
            "course_name": "",
            "description": "OART-UT  410\n\n   Analyzing World Dance\n\nThis course will introduce students to a range of dance forms from diverse cultural contexts, and how to think critically about the category of “world dance.” How does dance articulate national or ethnic identity? How can it inscribe history? How might it help communities to cohere and/or resist colonial or neocolonial pressures? Readings of major works from the field of dance ethnography will be supplemented by some practical encounters with movement forms.\n\nThis course is open to “non-dancers” who hope to gain not only familiarity with diverse dance practices from around the world, but also ...\n\n      more description for OART-UT  410 »\n\n      \n\n\n\nThis course will introduce students to a range of dance forms from diverse cultural contexts, and how to think critically about the category of “world dance.” How does dance articulate national or ethnic identity? How can it inscribe history? How might it help communities to cohere and/or resist colonial or neocolonial pressures? Readings of major works from the field of dance ethnography will be supplemented by some practical encounters with movement forms.\n\nThis course is open to “non-dancers” who hope to gain not only familiarity with diverse dance practices from around the world, but also a critical lens with which to think about how “ethnic” dance is presented and understood. Movement practitioners will also develop a more nuanced and informed way of understanding what it means to study and perform dance traditions from other cultural contexts. While a small amount of actual dance instruction will take place in the course, the emphasis will be on the scholarly analysis of movement forms.\n\n      less description for OART-UT  410 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 560",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14443",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 941",
                    "time": "Tue 9.30 AM - 4.45 PM",
                    "open": true,
                    "professor": "Rinella, Elizabeth; Michels, Stevin"
                },
                {
                    "format": "Studio",
                    "class_id": "14444",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 369",
                    "time": "Wed 9.30 AM - 4.45 PM",
                    "open": true,
                    "professor": "Juhola, Eric; Bankert, Scott"
                }
            ],
            "course_name": "",
            "description": "OART-UT  560\n\n   Fundamentals of Filmmaking: A Digital Workshop\n\nThis practical workshop is designed to introduce students to the techniques and theory of developing and producing short film ideas that are shot on digital video and edited digitally on computer using Adobe Premiere Pro software. The course centers on learning elements of visual storytelling through a spectrum of aesthetic approaches. Working in crews of four, students learn directing, shooting, and editing skills as they each direct three short videos (three to five minutes in length).   \n\nThis course is specifically designed to fulfill the major requirements in production of students not ma...\n\n      more description for OART-UT  560 »\n\n      \n\n\n\nThis practical workshop is designed to introduce students to the techniques and theory of developing and producing short film ideas that are shot on digital video and edited digitally on computer using Adobe Premiere Pro software. The course centers on learning elements of visual storytelling through a spectrum of aesthetic approaches. Working in crews of four, students learn directing, shooting, and editing skills as they each direct three short videos (three to five minutes in length).   \n\nThis course is specifically designed to fulfill the major requirements in production of students not majoring in film and therefore, students who need to fulfill this requirement are given registration priority. Students should add themselves to the waitlist for this class\n\n      less description for OART-UT  560 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 561",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14592",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 018",
                    "time": "Wed 9.30 AM - 1.30 PM",
                    "open": true,
                    "professor": "Rinella, Elizabeth"
                }
            ],
            "course_name": "",
            "description": "OART-UT  561\n\n   Intermediate Dig Filmmaking\n\nIn this course, students will build upon the visual storytelling skills learned in the prerequisite course, Fundamentals of Filmmaking. Students will be introduced to color cinematography, aesthetics, sound recording, casting and directing actors, production logistics, and editing. This course is aimed at the film enthusiast who would like to further explore digital filmmaking. Students will shoot on Sony FS100 HD digital video cameras, and edit with Adobe Premiere Pro software on Apple computers. Students will have access to a compact lighting and mini mic kit for use on their productions. St...\n\n      more description for OART-UT  561 »\n\n      \n\n\n\nIn this course, students will build upon the visual storytelling skills learned in the prerequisite course, Fundamentals of Filmmaking. Students will be introduced to color cinematography, aesthetics, sound recording, casting and directing actors, production logistics, and editing. This course is aimed at the film enthusiast who would like to further explore digital filmmaking. Students will shoot on Sony FS100 HD digital video cameras, and edit with Adobe Premiere Pro software on Apple computers. Students will have access to a compact lighting and mini mic kit for use on their productions. Students are required to purchase their own portable hard drive to use during the editing process.\n\n      less description for OART-UT  561 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 562",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14445",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 383",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Falk, Leon"
                },
                {
                    "format": "Lecture",
                    "class_id": "14475",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 109",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Badal, Sharon"
                }
            ],
            "course_name": "",
            "description": "OART-UT  562\n\n   Media Moguls in the 20th Century\n\nThis course attempts to track the American entertainment industry from its plebian origins through its rise to becoming the predominant mass entertainment culture in the world. Students discover the origins of the production practices that are employed in the entertainment industry today by following the legendary characters, movie moguls, and media titans of the early 20th century and the companies they built. The emphasis is on the way the visionaries of the time impacted seemingly risk-averse systems to invigorate and sometimes completely revolutionize them. These innovative men and women i...\n\n      more description for OART-UT  562 »\n\n      \n\n\n\nThis course attempts to track the American entertainment industry from its plebian origins through its rise to becoming the predominant mass entertainment culture in the world. Students discover the origins of the production practices that are employed in the entertainment industry today by following the legendary characters, movie moguls, and media titans of the early 20th century and the companies they built. The emphasis is on the way the visionaries of the time impacted seemingly risk-averse systems to invigorate and sometimes completely revolutionize them. These innovative men and women include, but are not limited, to Louis B. Mayer, George Lucas, Maya Deren, Shirley Clark, Nam Jun Paik, Lucille Ball, Russell Simmons, Clive Davis, Julie Taymor, and Steve Jobs.\n\n      less description for OART-UT  562 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 564",
            "course_name": "",
            "description": "OART-UT  564\n\n   Music for Film and TV\n\nA professional composer leads a theoretical and practical course dealing with artistic and technical aspects in composing music for film and television. Through analysis, demonstration, and controlled practice, students learn and deal with the specifics of the composer’s job, duties, and responsibilities, and develop listening and production skills necessary for the creative use of music. The course provides an inside look into a relationship between composer and music editor, and explores music as a creative tool. In addition to musical considerations, the business and personal relationship b...\n\n      more description for OART-UT  564 »\n\n      \n\n\n\nA professional composer leads a theoretical and practical course dealing with artistic and technical aspects in composing music for film and television. Through analysis, demonstration, and controlled practice, students learn and deal with the specifics of the composer’s job, duties, and responsibilities, and develop listening and production skills necessary for the creative use of music. The course provides an inside look into a relationship between composer and music editor, and explores music as a creative tool. In addition to musical considerations, the business and personal relationship between composers and directors/producers is discussed.\n\n      less description for OART-UT  564 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 565",
            "course_name": "Independent Study",
            "description": "OART-UT  565 Independent Study",
            "offering": false
        },
        {
            "course_id": "OART-UT 566",
            "course_name": "",
            "description": "OART-UT  566\n\n   Cell Phone Cinema\n\nHollywood in your palm. That is what this combination of lectures, screenings, demonstrations and practical production workshop will offer to the students in this course. \u2028There will be several professional guests making presentations and Q&A sessions from the mobile phone filmmaking industry. \u2028In addition to the historical and critical overview of the emergence and exponential growth of global cell phone cinema, students will shoot all footage on cell phones and download them for computerized editing. The final project will be under three minute shorts. \u2028\u2028Projects will include all genres of f...\n\n      more description for OART-UT  566 »\n\n      \n\n\n\nHollywood in your palm. That is what this combination of lectures, screenings, demonstrations and practical production workshop will offer to the students in this course. \u2028There will be several professional guests making presentations and Q&A sessions from the mobile phone filmmaking industry. \u2028In addition to the historical and critical overview of the emergence and exponential growth of global cell phone cinema, students will shoot all footage on cell phones and download them for computerized editing. The final project will be under three minute shorts. \u2028\u2028Projects will include all genres of film and television: news, mini-documentaries, animation, music videos and narrative shorts.  Completed student projects will be suitable to be posted on the Internet and entered into domestic and international mobile phone film festivals. For example, two minutes long improvisations of Bollywood Style Music Videos shot on Cell Phones by the students have been projected at the Tribeca Cinemas as part of the New York Indian Film Festival. It is suggested but not compulsory that students bring to the class a cell phone capable of recording video.\n\n      less description for OART-UT  566 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 567",
            "course_name": "",
            "description": "OART-UT  567\n\n   Live Video Performance Art\n\nThis course will combine a history of video art and experimental film with practical training in the use of live video performance art technology. Students will explore new ways to create and edit films and videos using VJ software, projections, and multi-channel video surfaces. Workshops will demonstrate concepts and software that can be integrated into the creative process of video performance art and video art installations. \n\nCOURSE OBJECTIVES\n\nAt the completion of this course, the student will be able to:\n1)\tDraw inspiration from the recent history of incredible video and multi-media...\n\n      more description for OART-UT  567 »\n\n      \n\n\n\nThis course will combine a history of video art and experimental film with practical training in the use of live video performance art technology. Students will explore new ways to create and edit films and videos using VJ software, projections, and multi-channel video surfaces. Workshops will demonstrate concepts and software that can be integrated into the creative process of video performance art and video art installations. \n\nCOURSE OBJECTIVES\n\nAt the completion of this course, the student will be able to:\n1)\tDraw inspiration from the recent history of incredible video and multi-media artists.\n2)\tDevelop an understanding of audio and visual hardware used by VJ’s.\n3)\tUse Modul8, live VJ software to manipulate digital media in real time to create Video Performance Art.\n4)\tUse Projection Mapping techniques to project video art onto 3D surfaces.\n5)\tCreate original video performance art, video installations, and other performance pieces.\n6)\tUtilize skills to make video art in the professional market.\n\n      less description for OART-UT  567 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 568",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14669",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 403",
                    "time": "Mon 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Limoncelli, Rosanne"
                }
            ],
            "course_name": "",
            "description": "OART-UT  568\n\n   Understanding Story\n\nUnderstanding Story is a class composed of lectures, discussions, screenings, readings, critical and creative writing, group critiques and presentations.  The course is designed to expose the student to the fundamental principles of storytelling across a spectrum of mediums, including the written story, playwriting, film, poetry, dance, games, photography, fine art and music.  How do all these different art forms tell stories?  How can the student apply what is learned to their own creative work?  History and theory of story will be studied and used to inspire personal and creative work in ord...\n\n      more description for OART-UT  568 »\n\n      \n\n\n\nUnderstanding Story is a class composed of lectures, discussions, screenings, readings, critical and creative writing, group critiques and presentations.  The course is designed to expose the student to the fundamental principles of storytelling across a spectrum of mediums, including the written story, playwriting, film, poetry, dance, games, photography, fine art and music.  How do all these different art forms tell stories?  How can the student apply what is learned to their own creative work?  History and theory of story will be studied and used to inspire personal and creative work in order to better understand how story can most successfully be expressed in different mediums and reach its audience.\n\n      less description for OART-UT  568 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 682",
            "course_name": "Develop, Pitch, Write TV pilot",
            "description": "OART-UT  682 Develop, Pitch, Write TV pilot",
            "offering": false
        },
        {
            "course_id": "OART-UT 701",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17760",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL139",
                    "time": "Mon 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Beaman, Patricia"
                }
            ],
            "course_name": "",
            "description": "OART-UT  701\n\n   History of Dance\n\nThis course will explore why and how dance is a vital participant in cultural practices around the world.  Looking back through the perspective of present research, we will examine how dance is inherently a reflection of the culture it represents. A wide overview of dance will be covered, beginning with temple devotion in India, to its inclusion in the rituals of Bali, the Noh and Kabuki theatrical traditions of Japan, the rites of passage and ancestor worship in the Ashanti, Yoruba, and Dogon tribes of Africa, in Aboriginal Australian ceremonies, and in the rituals of Native American tribes. ...\n\n      more description for OART-UT  701 »\n\n      \n\n\n\nThis course will explore why and how dance is a vital participant in cultural practices around the world.  Looking back through the perspective of present research, we will examine how dance is inherently a reflection of the culture it represents. A wide overview of dance will be covered, beginning with temple devotion in India, to its inclusion in the rituals of Bali, the Noh and Kabuki theatrical traditions of Japan, the rites of passage and ancestor worship in the Ashanti, Yoruba, and Dogon tribes of Africa, in Aboriginal Australian ceremonies, and in the rituals of Native American tribes. The presentation of dance at Court as a symbol of power in Catherine de Medici’s Renaissance pageants will be examined, and continued in viewing the Baroque spectacles of Louis XIV's Versailles and the Paris Opera. The inevitable impact of politics on dance will be studied in the propagandist works of China’s Cultural Revolution, the French Revolution’s influence upon Romantic ballets such as La Sylphide and Giselle, and how the repression of a Gypsy culture led to the emergence of Flamenco in Spain. In addition to written texts and video documentation, we will review examples of related art forms such as visual arts, music, and drama.\n\n      less description for OART-UT  701 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 703",
            "course_name": "",
            "description": "OART-UT  703\n\n   Why Dance Matters: Politics, Race, Class\n\nTraversing Europe, the Americas, and Asia, this course investigates the various social, political, and historical contexts that have contributed to the evolution of dance, and conversely, explores the ways that performers and choreographers have utilized the medium of dance to reflect their personal concerns back to society in powerful ways.  Artistic movements, choreographers, and dancers examined will include Vaudevillian tropes; the impact of the Industrial Revolution on ballet; sexual manipulation in the roles of Nijinsky; the political work of early modern dancers; WW I and II and its aft...\n\n      more description for OART-UT  703 »\n\n      \n\n\n\nTraversing Europe, the Americas, and Asia, this course investigates the various social, political, and historical contexts that have contributed to the evolution of dance, and conversely, explores the ways that performers and choreographers have utilized the medium of dance to reflect their personal concerns back to society in powerful ways.  Artistic movements, choreographers, and dancers examined will include Vaudevillian tropes; the impact of the Industrial Revolution on ballet; sexual manipulation in the roles of Nijinsky; the political work of early modern dancers; WW I and II and its aftermath in the German Ausdruckstanz of Mary Wigman, Kurt Jooss, and in Japanese Butoh; the propagandist ballets of the Chinese Cultural Revolution; exploration of the commonplace in the psychological dance-theater of Antony Tudor and Pina Bausch; the anthropological research of black choreographers Katherine Dunham and Pearl Primus; exploration of Postmodern rebellion of the Judson Dance Theater; and the response of choreographers and performance artists to the Culture Wars and the AIDS crisis. Students will pursue extended research, view performance videos and documentaries, and be expected to write and talk about dance.\n\n      less description for OART-UT  703 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 800",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14447",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Tue 9.30 AM - 11.30 AM",
                    "open": true,
                    "professor": "Hall, Patricia"
                }
            ],
            "course_name": "",
            "description": "OART-UT  800\n\n   Steps Rhythm Movement: African Dance\n\nThis is an introduction to the dances and rhythms from Africa and the African Diaspora. Through movement, students will explore certain aesthetic characteristics that help to classify the dances as “African.” Traditional and or cultural dances and rhythms from various regions in Africa and the Caribbean will be taught along with the basic rhythmic patterns that are the foundation for the dances. There will be an emphasis on specific West African movements that have been transported and transplanted to the Americas. Class will consist of an extensive warm-up, including floor work, stretching, a...\n\n      more description for OART-UT  800 »\n\n      \n\n\n\nThis is an introduction to the dances and rhythms from Africa and the African Diaspora. Through movement, students will explore certain aesthetic characteristics that help to classify the dances as “African.” Traditional and or cultural dances and rhythms from various regions in Africa and the Caribbean will be taught along with the basic rhythmic patterns that are the foundation for the dances. There will be an emphasis on specific West African movements that have been transported and transplanted to the Americas. Class will consist of an extensive warm-up, including floor work, stretching, and isolation exercises that utilize elements of the Katherine Dunham isolation technique. This course has a nonrefundable lab fee.\n\n      less description for OART-UT  800 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 801",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14448",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Thu 9.00 AM - 11.00 AM",
                    "open": true,
                    "professor": "Harissiadis, Najma"
                }
            ],
            "course_name": "",
            "description": "OART-UT  801\n\n   Steps Rhythm Movement: Indian Dance\n\nThis introductory course explores the cosmic movement of Indian Dance from the sacred to secular through the manifestation of cosmic energies, symbolism and story telling, using the wide range of emotions, and mudras (gesture language). Rhythmic composition will also be introduced utilizing the verbal expression of rhythm called \"bol\" as expressed through the footwork and body movements. Various dance styles will be introduced primarily Kathak (Jaipuri Tradition), Yoga Dance, Bhangra warm-up and “Bollywood” — all playing a significant role in the mosaic of dance arts of India. This course has ...\n\n      more description for OART-UT  801 »\n\n      \n\n\n\nThis introductory course explores the cosmic movement of Indian Dance from the sacred to secular through the manifestation of cosmic energies, symbolism and story telling, using the wide range of emotions, and mudras (gesture language). Rhythmic composition will also be introduced utilizing the verbal expression of rhythm called \"bol\" as expressed through the footwork and body movements. Various dance styles will be introduced primarily Kathak (Jaipuri Tradition), Yoga Dance, Bhangra warm-up and “Bollywood” — all playing a significant role in the mosaic of dance arts of India. This course has a nonrefundable lab fee.\n\n      less description for OART-UT  801 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 802",
            "course_name": "",
            "description": "OART-UT  802\n\n   Steps Rhythm Movement: Afro-Latin Dance\n\nThis course is an introduction to Afro Cuban dances that includes various Afro-diasporic forms. Some are rooted in African sub-Saharan ethnicities like Congo and Yoruba,  while others are native Caribbean manifestations such as Son and Rumba. Afro Cuban dances, both sacred and secular, are manifested in transnational dance repertoires like Latin, Ballroom, and Salsa, from the international “Rumba Craze” of the 1920s to the present. Students will explore the different aesthetics, content,  and context of the dances. There will be an emphasis on the recognition of the musical patterns that ident...\n\n      more description for OART-UT  802 »\n\n      \n\n\n\nThis course is an introduction to Afro Cuban dances that includes various Afro-diasporic forms. Some are rooted in African sub-Saharan ethnicities like Congo and Yoruba,  while others are native Caribbean manifestations such as Son and Rumba. Afro Cuban dances, both sacred and secular, are manifested in transnational dance repertoires like Latin, Ballroom, and Salsa, from the international “Rumba Craze” of the 1920s to the present. Students will explore the different aesthetics, content,  and context of the dances. There will be an emphasis on the recognition of the musical patterns that identify the different dances. Classes will consist of a warm up, isolation,  contextualization of the dance, floor work, and cool down using particular elements of Cuban body motion. There will  be video and music samples  to analyzed in the class. This class holds dance as a central means of knowledge for African Diaspora cultures,  exploring the notion of the body as a sacred medium.No prior dance experience required!\n\n      less description for OART-UT  802 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 803",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14513",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Thu 2.00 PM - 4.00 PM",
                    "open": true,
                    "professor": "Rose, Alyssa"
                }
            ],
            "course_name": "Steps Rhythm Movement: Chinese Dance",
            "description": "OART-UT  803 Steps Rhythm Movement: Chinese Dance \nThis course is an introduction to Han dance and Chinese Minority dancing. Students will learn and perform dance combinations from the following categories: Han folk, Han classical, and one minority dance. Emphasis is on the dances from the northeast and southwest regions in China.",
            "offering": true
        },
        {
            "course_id": "OART-UT 804",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14616",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Tue 11.00 AM - 1.00 PM",
                    "open": true,
                    "professor": "Kellman, Joy"
                }
            ],
            "course_name": "",
            "description": "OART-UT  804\n\n   Modern Dance: Mind Body Knowledge and Expression\n\nThis course is an introduction to the fundamental concepts of Modern Dance technique that focuses on the dynamic rapport between body-mind knowledge and expression. In movement, students will become more aware and organized in their bodies. They will explore certain aesthetic characteristics that help to define dance material as “Modern” or contemporary. Through structured improvisation and teamwork approaches students will learn to dance from the inside out, exercise choice with imagination and work together as an ensemble. Ultimately, students will gain an appreciation for the expressive cap...\n\n      more description for OART-UT  804 »\n\n      \n\n\n\nThis course is an introduction to the fundamental concepts of Modern Dance technique that focuses on the dynamic rapport between body-mind knowledge and expression. In movement, students will become more aware and organized in their bodies. They will explore certain aesthetic characteristics that help to define dance material as “Modern” or contemporary. Through structured improvisation and teamwork approaches students will learn to dance from the inside out, exercise choice with imagination and work together as an ensemble. Ultimately, students will gain an appreciation for the expressive capacity of the body, recognizing shared, unifying attributes and those that are unique and intrinsic to each individual. The thorough warm up places an emphasis on breath and proper placement for safe practices and well being. It includes floor work, stretching and strength exercises and patterns that incorporate elements of Bartenieff Fundamentals. Short dances / sequences will be learned to sharpen knowledge of the Modern Dance lexicon and increase facility for translation of weight, space, time and energy ideas. \n\nAll levels are welcome. No previous dance experience is required.\n\n      less description for OART-UT  804 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 805",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14476",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Tue,Thu 5.00 PM - 8.00 PM",
                    "open": true,
                    "professor": "Rose, Alyssa"
                }
            ],
            "course_name": "",
            "description": "OART-UT  805\n\n   Choreography\n\nThe purpose of this course is to enable the student to gain a heightened awareness, appreciation, and knowledge of dance through movement and performance. We focus on the foundations of dance such as control, aesthetics, alignment, development of strength and flexibility, dynamics, athleticism, musicality, use of space, development of learning strategies within a group context, and personal, artistic expression.  The student’s mastery of their body, expression with their body and creativity through their body is the center of the work.\n\nThrough individual and collective kinesthetic participa...\n\n      more description for OART-UT  805 »\n\n      \n\n\n\nThe purpose of this course is to enable the student to gain a heightened awareness, appreciation, and knowledge of dance through movement and performance. We focus on the foundations of dance such as control, aesthetics, alignment, development of strength and flexibility, dynamics, athleticism, musicality, use of space, development of learning strategies within a group context, and personal, artistic expression.  The student’s mastery of their body, expression with their body and creativity through their body is the center of the work.\n\nThrough individual and collective kinesthetic participation in unfamiliar patterns, related, but not limited to China, West Africa, United States, and Japan, the student is physically and conceptually challenged and informed.  Using these learned dances as inspiration, students go on to re interpret, improvise and choreograph their own variations on dance forms in their class assignments.  Dance experience is not necessary.\n\n      less description for OART-UT  805 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 806",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14477",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Wed 9.00 AM - 11.00 AM",
                    "open": true,
                    "professor": "Chau, Selina"
                }
            ],
            "course_name": "",
            "description": "OART-UT  806\n\n   Ballet\n\nThis course is an introduction to the fundamentals of classical ballet technique. Looking into the evolution of ballet from the time of Louis XIV through the present, students will explore the different styles of training and performance presentation through the use of images, video, practice and discussions. Reading assignments will be provided to explain how social changes have affected the development of ballet technique and choreography. \n \nA thorough warm-up will be given in each class. The technical content will vary according to the skill level of the class and the individual dancer. ...\n\n      more description for OART-UT  806 »\n\n      \n\n\n\nThis course is an introduction to the fundamentals of classical ballet technique. Looking into the evolution of ballet from the time of Louis XIV through the present, students will explore the different styles of training and performance presentation through the use of images, video, practice and discussions. Reading assignments will be provided to explain how social changes have affected the development of ballet technique and choreography. \n \nA thorough warm-up will be given in each class. The technical content will vary according to the skill level of the class and the individual dancer. Through the instruction of proper alignment and dynamic imagery, students will learn how to dance safely and improve their technical skills effectively. All levels are welcome. No previous dance experience is required.\n\nThe course is designed to help students develop a clean and precise technical base for ballet dancing. Through practice and application, students will understand the unique structure of their own bodies and expand their awareness of self and others. They will discover new technical capabilities regarding flexibility, strength, coordination, balance and their comprehension of the ballet form in relation to music, space, time and energy. Eventually students will experience how the mind, body and breath come together to produce greater freedom in movement. Discussions will examine how this informs personal interactions in everyday life. Students are encouraged to study the different styles of ballet and ballet performers around the world.\n \nFor the final group project, students will choreograph a short ballet that incorporates ballet vocabulary, dance or pedestrian movements and an idea that’s related to today’s society.\n\n      less description for OART-UT  806 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 807",
            "course_name": "",
            "description": "OART-UT  807\n\n   Steps Rhythm Movement: Flamenco Dance\n\nThis class will embark on an historical dance journey exploring the dances that make up the hybrid form of Flamenco i.e., Banjara Gypsy Dance of Rajesthan (India), Zambra Dances of the Sephardic Jews and Moorish influences. \n\nThe course will be divided into 3 sections focusing on the contributing characteristics of the dance culminating with Flamenco Dance. Each class will begin with a historical introduction and demonstration of the indigenous forms and how the elements are integrated into Flamenco cultivating a sense of freedom and uniqueness. Periodic viewing of course related videos will b...\n\n      more description for OART-UT  807 »\n\n      \n\n\n\nThis class will embark on an historical dance journey exploring the dances that make up the hybrid form of Flamenco i.e., Banjara Gypsy Dance of Rajesthan (India), Zambra Dances of the Sephardic Jews and Moorish influences. \n\nThe course will be divided into 3 sections focusing on the contributing characteristics of the dance culminating with Flamenco Dance. Each class will begin with a historical introduction and demonstration of the indigenous forms and how the elements are integrated into Flamenco cultivating a sense of freedom and uniqueness. Periodic viewing of course related videos will be shown, i.e., “Latcho Drom, and “Gypsy Caravan - “When the Road Bends.” Students will be assigned weekly reading, research and practice projects relevant to up and coming course work. \nAll levels are welcome. Dance experience not required.\n\n      less description for OART-UT  807 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 808",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "17757",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Thu 6.00 PM - 8.00 PM",
                    "open": true,
                    "professor": "Watson, Alan"
                }
            ],
            "course_name": "",
            "description": "OART-UT  808\n\n   Steps Rhythm Movement: Hip Hop Dance\n\nThis is an introduction to the dances and rhythms from different styles that comprise Hip-Hop dance today. The first stage of the course will explore the wide array of styles that comprise and influence Hip-Hop movement. This course will not only introduce steps, but investigate root moves and historical context that shaped contemporary Hip-Hop today. \nDuring the course, students will also discuss the current and emerging trends of the genre. As an ever-evolving dance, this class will focus on budding dance styles, such as Flexing, Lite feet and Finger Tuts, comparing and contrasting those to ...\n\n      more description for OART-UT  808 »\n\n      \n\n\n\nThis is an introduction to the dances and rhythms from different styles that comprise Hip-Hop dance today. The first stage of the course will explore the wide array of styles that comprise and influence Hip-Hop movement. This course will not only introduce steps, but investigate root moves and historical context that shaped contemporary Hip-Hop today. \nDuring the course, students will also discuss the current and emerging trends of the genre. As an ever-evolving dance, this class will focus on budding dance styles, such as Flexing, Lite feet and Finger Tuts, comparing and contrasting those to case studies of past styles that emerged, (or re-emerged) to become heavily popularized such as Gliding, Krumping and Waacking. Additionally students will explore the globalized nature of Hip-Hop. To see the full evolution, students will see how other cultures have embraced and left their mark street styles, and how international dance battles and competitions have emerged, ultimately changing the landscape of Hip-Hop dance. Over the course of study students will begin to realize the complexity, the history and the varying opinions focused around Hip-Hop.\n\n      less description for OART-UT  808 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 823",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14449",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "LSTC MACLB",
                    "time": "Thu 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": "Fallon, Catherine"
                },
                {
                    "format": "Studio",
                    "class_id": "14670",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "LSTC MACLB",
                    "time": "Wed 11.00 AM - 2.00 PM",
                    "open": true,
                    "professor": "Fallon, Catherine"
                }
            ],
            "course_name": "",
            "description": "OART-UT  823\n\n   Intro to Digital Tools\n\nThis course will explore the basic tools of digital imaging. During the semester we will cover the 3 main adobe products for creative imaging - Photoshop, Illustrator and InDesign. Through a series of short weekly assignments we will look at various graphic design and layout ideas using Illustrator and Indesign. We will also touch on the wealth of image enhancement and manipulation techniques afforded by photoshop. Several small assignments will introduce the basics of scanning, printing and compositing images drawing on the strengths of the individual pieces of software. Students will have th...\n\n      more description for OART-UT  823 »\n\n      \n\n\n\nThis course will explore the basic tools of digital imaging. During the semester we will cover the 3 main adobe products for creative imaging - Photoshop, Illustrator and InDesign. Through a series of short weekly assignments we will look at various graphic design and layout ideas using Illustrator and Indesign. We will also touch on the wealth of image enhancement and manipulation techniques afforded by photoshop. Several small assignments will introduce the basics of scanning, printing and compositing images drawing on the strengths of the individual pieces of software. Students will have the opportunity to complete a small project of their own for the end of the term. Class time will be divided between lectures, critiques, and work in progress sessions. This course is not intended to completely cover the software listed, but will give students a fundamental understanding of the possibilities of digital imaging.\n\n      less description for OART-UT  823 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 826",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14450",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 288",
                    "time": "Thu 2.00 PM - 4.40 PM",
                    "open": true,
                    "professor": "Cameron, Donna"
                }
            ],
            "course_name": "",
            "description": "OART-UT  826\n\n   Politics of Portraiture\n\nThis course explores the pictorial articulation of individual human likeness and its fiction in the public forum. The art of portraiture has survived its own origins in myth making and archetype building. The human image, or icon, forever landmarks the voices, textures, physicality, spirituality, symbols, politics, aesthetic concerns and military contexts, religious rituals, government, calendar ceremonies, daily functions, heroic acts and social disorders of diverse cultures throughout recorded history. It is the history of creation, the story of romance, the mark of progress, the record of r...\n\n      more description for OART-UT  826 »\n\n      \n\n\n\nThis course explores the pictorial articulation of individual human likeness and its fiction in the public forum. The art of portraiture has survived its own origins in myth making and archetype building. The human image, or icon, forever landmarks the voices, textures, physicality, spirituality, symbols, politics, aesthetic concerns and military contexts, religious rituals, government, calendar ceremonies, daily functions, heroic acts and social disorders of diverse cultures throughout recorded history. It is the history of creation, the story of romance, the mark of progress, the record of royalty and the profile of democracy. It is the revolution of fine art and a catalyst of discipline. Imaging the individual in the public eye is the story of humankind. This course bridges the worlds of the oral and written mythologies which inhabit and empower us and the creative manifestation (conscious and unconscious) of these ancient archetypes into contemporary art, media and design. Students will critically rethink the implied and material presence of portraiture in everyday life. Students will gain practical knowledge and insight into the origins and potential power of the archetypes which permeate our collective unconscious.\n\n      less description for OART-UT  826 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 827",
            "course_name": "",
            "description": "OART-UT  827\n\n   Picture Essay for Paper and Pixels\n\nThis course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of historical models from magazines, newspapers, books, exhibitions and digital environments, including the Web. While the course will concentrate on the work being created by each student, there will also be a variety of reading and looking assignments. Each student will be required to complete one p...\n\n      more description for OART-UT  827 »\n\n      \n\n\n\nThis course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of historical models from magazines, newspapers, books, exhibitions and digital environments, including the Web. While the course will concentrate on the work being created by each student, there will also be a variety of reading and looking assignments. Each student will be required to complete one photographic essay in either analog or digital form.\n\n      less description for OART-UT  827 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 829",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14451",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 621",
                    "time": "Mon 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Lucas, Peter"
                }
            ],
            "course_name": "",
            "description": "OART-UT  829\n\n   Poetics of Witnessing\n\nToday, many documentarians consider themselves working within a well-defined human rights framework where images and film are used to raise awareness about social injustice. On the far edge of this movement, however, there are writers, photographers and filmmakers whose work calls attention to the traditional documentary ethics of bearing witness but whose modes of representation blur the lines between fact and fiction. This body of work is more open-ended to interpretation and multiple readings, which also include more personal themes such as loss and melancholy, the ephemeral nature of time ...\n\n      more description for OART-UT  829 »\n\n      \n\n\n\nToday, many documentarians consider themselves working within a well-defined human rights framework where images and film are used to raise awareness about social injustice. On the far edge of this movement, however, there are writers, photographers and filmmakers whose work calls attention to the traditional documentary ethics of bearing witness but whose modes of representation blur the lines between fact and fiction. This body of work is more open-ended to interpretation and multiple readings, which also include more personal themes such as loss and melancholy, the ephemeral nature of time and memory, nostalgia and change.\n\nWe will study several different kinds of visual poetics such as combining documentary photos with literature, artists working with archives and found images, the personal essay film, ethnographic poetics, photo reportage and new media visual storytelling, mixed media and public projections. Some of the writers and artists we will study include Alfredo Jaar, W.G. Sebald, Chris Marker, Christian Boltanski, Forough Farrokhzad, Susan Sontag, Marcelo Brodsky, Roland Barthes, Miguel Rio Branco, Alexander Sokurov, Lorna Simpson, Jean Rouch, Susan Meiselas, Jonas Mekas.\n\n      less description for OART-UT  829 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 830",
            "course_name": "",
            "description": "OART-UT  830\n\n   Island Hopping: A Photo Safari\n\nNew York City is an island, which is all too easily forgotten as we walk north and south and east and west on a relatively small expanse of land, Manhattan, known as one of the most legendary metropolises in the world. Students are invited to experience the city waterfront and beyond the 34 square miles that make up Manhattan to go, effectively, island hopping. With dozens of islands to choose from in New York waters, we select locations to explore in depth: i.e. Governor’s Island, Roosevelt Island, City Island, Randall & Ward’s island, Riker’s Island, Coney Island, Ellis & Liberty Island, Sta...\n\n      more description for OART-UT  830 »\n\n      \n\n\n\nNew York City is an island, which is all too easily forgotten as we walk north and south and east and west on a relatively small expanse of land, Manhattan, known as one of the most legendary metropolises in the world. Students are invited to experience the city waterfront and beyond the 34 square miles that make up Manhattan to go, effectively, island hopping. With dozens of islands to choose from in New York waters, we select locations to explore in depth: i.e. Governor’s Island, Roosevelt Island, City Island, Randall & Ward’s island, Riker’s Island, Coney Island, Ellis & Liberty Island, Staten Island, Broad Channel (Jamaica Bay), Breezy Point (Rockaways peninsula), etc.\n\nIn addition to the photo safari to explore the city waterways, we study photographers' work on the urban landscape, read literary works (exploring NYC as mythic city) and nonfiction (revealing the quirkiness of NYC behind the glitter), and see film on the subject of New York, such as the 1920s classic Manhatta by painter Charles Sheeler and photographer Paul Strand-based loosely on a poem by Walt Whitman. Student work, images and words, is reviewed in discussion groups with an eye on editing work for the independent study—a personal project which students present in hardcopy or electronic media at the end of the course.\n\nCOURSE OBJECTIVES\n\nAt the completion of this course, students will be able to:\n1.\tExperience and translate New York City (urban space) visually as a complex environment in which the natural environment and water play as big a role as steel and concrete in defining the landscape\n\n2.\tIdentify through literature, film, and art (late 19th century to present) the culture richness and uniqueness of New York City\n\n3.\tLook at images, discuss, and place them in a social context 4.\tCreate project-based work (using analog cameras, DSLR, Digicam,\niPhoneography, other of student choice); create independent work (self- expression), plan (conceptualize), and execute (realize) a final project\n\n      less description for OART-UT  830 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 831",
            "course_name": "Photo/Fiction/Film",
            "description": "OART-UT  831 Photo/Fiction/Film \nThis seminar will explore some of the ways in which photography has been incorporated in to the novel, the poem and the fictional film. It will also look at ways in which the medium of photography and its practitioners have been imagined within these media. Works investigated will include stories, novels and films by authors such as Michelangelo Antonioni, Julio Cortazar, Penelope Lively, Chris Marker, Ronit Matalon, WG Sebald, and Wim Wenders, among others.  The seminar will require a considerable amount of reading and writing.",
            "offering": false
        },
        {
            "course_id": "OART-UT 832",
            "course_name": "",
            "description": "OART-UT  832\n\n   Contemporary Cuba:  Art, Politics, History,  Ideas\n\nThe course will focus on the development of different artistic media over five decades of Cuba’s contemporary history and consider how Cuban works of art reflect the complexity of the country’s history, culture and changing political situations. Beginning with photography from the 1960’s that recorded the triumph of the Revolution in 1959, we will analyze the history of the post-revolutionary era, \nfocusing particularly on the fusion of propaganda and art to construct iconic images, such as the famous photo of Che Guevara by Alberto Korda. We will study the impact of Cuban cultural policy dict...\n\n      more description for OART-UT  832 »\n\n      \n\n\n\nThe course will focus on the development of different artistic media over five decades of Cuba’s contemporary history and consider how Cuban works of art reflect the complexity of the country’s history, culture and changing political situations. Beginning with photography from the 1960’s that recorded the triumph of the Revolution in 1959, we will analyze the history of the post-revolutionary era, \nfocusing particularly on the fusion of propaganda and art to construct iconic images, such as the famous photo of Che Guevara by Alberto Korda. We will study the impact of Cuban cultural policy dictated by Fidel Castro in 1961 and in 1970 through documents of the period, which determined the course of Cuban \narts for decades. We will continue with a survey of the visual arts on the island and consider how they constituted highly sophisticated interpretations of the always changing reality, whether in painting of the 1970’s and 80’s or installation practice of the 1990’s. Classic documentaries and films by prestigious Cuban filmmakers (Santiago Alvarez and Tomás Gutiérrez Alea) will be reviewed and analyzed, and we will conclude with an analysis of the most recent artistic expressions: Cuban hip-hop music and the edgy video works of Ernesto Oroza, Henry Eric Hernández, and other young artists. In this most recent work, political criticism, Cuban history and deconstructive techniques collide, reflecting the multiple layers of Cuban culture and its continuing development today. The course will include visits to the Center of Cuban Studies and to The 8th Floor Gallery in New York to discuss Cuban artworks in view.\n\n      less description for OART-UT  832 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 901",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14694",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-8",
                    "time": "Tue 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Zivkovic, Branislav"
                }
            ],
            "course_name": "",
            "description": "OART-UT  901\n\n   Portrait of an Artist: Walter Murch\n\nThis course examines the artistic career and creative work of Walter Murch, Oscar-winning film editor and sound designer, and the first and only artist to win Academy Awards for both film editing and sound mixing on a single film (The English Patient, 1997). The class will provide an unprecedented inside look into Mr. Murch’s processes of sound designing, editing, mixing, writing, and directing on such acclaimed and memorable films as THX 1138, American Graffiti, The Conversation, Apocalypse Now, The Godfather, Return to Oz, The English Patient, Touch of Evil, and Cold Mountain. Through interv...\n\n      more description for OART-UT  901 »\n\n      \n\n\n\nThis course examines the artistic career and creative work of Walter Murch, Oscar-winning film editor and sound designer, and the first and only artist to win Academy Awards for both film editing and sound mixing on a single film (The English Patient, 1997). The class will provide an unprecedented inside look into Mr. Murch’s processes of sound designing, editing, mixing, writing, and directing on such acclaimed and memorable films as THX 1138, American Graffiti, The Conversation, Apocalypse Now, The Godfather, Return to Oz, The English Patient, Touch of Evil, and Cold Mountain. Through interviews, articles, and materials from his private archives never before publicly available, students learn about the creative world of an artist who has brought the importance of sound and editing to a new level. In addition to his work in film and his inventions used in the filmmaking process, two additional areas of interest of Mr. Murch will be examined: translations of Curzio Malaparte’s writings and his passion for astronomy. Mr. Murch will participate on several occasions in the course as a guest lecturer by visiting the class and/or via video conferencing.\n\n      less description for OART-UT  901 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 951",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17683",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 375",
                    "time": "Tue,Thu 4.00 PM - 6.00 PM",
                    "open": true,
                    "professor": "Cepero Amador, Iliana"
                }
            ],
            "course_name": "",
            "description": "OART-UT  951\n\n   Topics in Cuban Culture\n\nThis course provides a multifaceted exploration of Cuban history, culture and society from the period of Spanish colonialism, through the wars of independence and the Revolution, and into the \"special period\" of the 1990s, all the way to the present day.\nThe class will be composed of three parts: (i) the class seminar/recitation, (ii) the study trip, and (iii) final project presentations. Weekly class sessions are in New York and there is a one-week study trip to Cuba during winter break (tentative travel dates: January 10-18, 2015).\nThrough guest lectures, screenings, workshops and discussi...\n\n      more description for OART-UT  951 »\n\n      \n\n\n\nThis course provides a multifaceted exploration of Cuban history, culture and society from the period of Spanish colonialism, through the wars of independence and the Revolution, and into the \"special period\" of the 1990s, all the way to the present day.\nThe class will be composed of three parts: (i) the class seminar/recitation, (ii) the study trip, and (iii) final project presentations. Weekly class sessions are in New York and there is a one-week study trip to Cuba during winter break (tentative travel dates: January 10-18, 2015).\nThrough guest lectures, screenings, workshops and discussions, students will engage the arts and culture of Cuba, paying particular attention to topics such as Afro-Cuban identity, architecture, film, dance, photography, music, Santeria, theatre and politics. The class will also be able to take advantage of local exhibits, performances, theatre, film, and other cultural events current during the spring. On the study trip, students will have an opportunity to experience life in Cuba and to interact with leading Cuban artists, writers, performers and scholars.\n\n      less description for OART-UT  951 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 952",
            "course_name": "Topics in South African Culture",
            "description": "OART-UT  952 Topics in South African Culture",
            "offering": false
        },
        {
            "course_id": "OART-UT 953",
            "course_name": "",
            "description": "OART-UT  953\n\n   Topics in Chinese Culture\n\nChina boasts one of the world’s oldest cultural histories—dating back over five thousand years ago—as well as one of the earliest dance and film histories. This course explores the country’s artistic legacy through Chinese arts and examines the history of China as it is interpreted within the context of theatre, poetry/literature, philosophy, film, and the visual arts. The class also explores how the cultural and arts traditions of China have been adapted to contemporary life, represented by Beijing and Shanghai’s move into the forefront of the international arts and political scene.\n\nAfter th...\n\n      more description for OART-UT  953 »\n\n      \n\n\n\nChina boasts one of the world’s oldest cultural histories—dating back over five thousand years ago—as well as one of the earliest dance and film histories. This course explores the country’s artistic legacy through Chinese arts and examines the history of China as it is interpreted within the context of theatre, poetry/literature, philosophy, film, and the visual arts. The class also explores how the cultural and arts traditions of China have been adapted to contemporary life, represented by Beijing and Shanghai’s move into the forefront of the international arts and political scene.\n\nAfter the course, students participate in a ten-day study trip to China, hosted by academic and arts institutions in Beijing and Shanghai.\n\n      less description for OART-UT  953 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 954",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17689",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "OART-UT  954\n\n   Topics in Brazilian Culture\n\nThe cultural landscape of Brazil is one of the most distinctive and dynamic in the world. This class explores Brazil’s celebrated cultural traditions in light of the country’s social and political history in general, and the legacies of colonialism and slavery in particular. In the course of the semester, students will engage in the cinema, dance, government, language, literature, music, religion, sport, television, and theatre of Brazil, all understood in connection to their African, European, and native South American ancestries. A one-week study trip to Salvador da Bahia and Rio de Janeiro ...\n\n      more description for OART-UT  954 »\n\n      \n\n\n\nThe cultural landscape of Brazil is one of the most distinctive and dynamic in the world. This class explores Brazil’s celebrated cultural traditions in light of the country’s social and political history in general, and the legacies of colonialism and slavery in particular. In the course of the semester, students will engage in the cinema, dance, government, language, literature, music, religion, sport, television, and theatre of Brazil, all understood in connection to their African, European, and native South American ancestries. A one-week study trip to Salvador da Bahia and Rio de Janeiro gives students the privilege to witness the Brazilian culture and interact with artists, writers, filmmakers, and performers to gain a more complete understanding of life in Brazil and the diverse arts programs and performances in Brazil’s multicultural cadre.\n\n      less description for OART-UT  954 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 956",
            "course_name": "Topics in Turkish Culture",
            "description": "OART-UT  956 Topics in Turkish Culture",
            "offering": false
        },
        {
            "course_id": "OART-UT 957",
            "course_name": "",
            "description": "OART-UT  957\n\n   Topics in Vietnamese Culture\n\nVietnam has a rich history of regional and cultural traditions and a complicated history of occupation, rebellion, and war. In the 35 years since the end of military conflicts and the beginning of reunification, the country has undergone some remarkable transformations. Today, with a booming economy and with two-thirds of the population born after reunification, Vietnam is modern, vibrant and exciting.\n\nTopics: Vietnam will explore the arts of Vietnam in the context of the country’s indigenous traditions and political legacies. Through weekly guest lectures, screenings and workshops, students ...\n\n      more description for OART-UT  957 »\n\n      \n\n\n\nVietnam has a rich history of regional and cultural traditions and a complicated history of occupation, rebellion, and war. In the 35 years since the end of military conflicts and the beginning of reunification, the country has undergone some remarkable transformations. Today, with a booming economy and with two-thirds of the population born after reunification, Vietnam is modern, vibrant and exciting.\n\nTopics: Vietnam will explore the arts of Vietnam in the context of the country’s indigenous traditions and political legacies. Through weekly guest lectures, screenings and workshops, students will survey the cultural landscape of Vietnam, paying particular attention to the country’s dynastic, colonial and communist history.\n\nA ten day study trip to Ho Chi Minh City and Hanoi in May will give students the opportunity to further engage Vietnamese culture and to interact with local artists, performers, writers and filmmakers.\n\n      less description for OART-UT  957 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1006",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14452",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 261",
                    "time": "Tue 9.20 AM - 12.20 PM",
                    "open": true,
                    "professor": "Falk, Leon"
                },
                {
                    "format": "Lecture",
                    "class_id": "14453",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 367",
                    "time": "Tue 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Abramowitz, Richard"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1006\n\n   Producing Essentials\n\nToday’s major creative fields—film, television, music, theatre, dance, and new media—need quality producers. A producer with a firm knowledge of the craft, a discerning eye for material, fund-raising ability, a grasp of the law, cash flow, people, and ethics is rare. This course provides students with a framework for understanding the dynamics of producing—as an art form and a business profession—and for completing a creative product in the entertainment and media industries. Students are introduced to the basic concepts, terms, and principles that apply to the role of producer in the entertai...\n\n      more description for OART-UT 1006 »\n\n      \n\n\n\nToday’s major creative fields—film, television, music, theatre, dance, and new media—need quality producers. A producer with a firm knowledge of the craft, a discerning eye for material, fund-raising ability, a grasp of the law, cash flow, people, and ethics is rare. This course provides students with a framework for understanding the dynamics of producing—as an art form and a business profession—and for completing a creative product in the entertainment and media industries. Students are introduced to the basic concepts, terms, and principles that apply to the role of producer in the entertainment and media industries along with the specific job functions that are required to effectively and efficiently complete a production.\n\n      less description for OART-UT 1006 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1008",
            "course_name": "Internship in Producing",
            "description": "OART-UT 1008 Internship in Producing",
            "offering": false
        },
        {
            "course_id": "OART-UT 1009",
            "course_name": "Production Experience",
            "description": "OART-UT 1009 Production Experience",
            "offering": false
        },
        {
            "course_id": "OART-UT 1010",
            "course_name": "",
            "description": "OART-UT 1010\n\n   Film Development: The Tools of Creative Movie Producing\n\nThis course de-mystifies the film development process and teaches students the key tools necessary for a successful career as a film executive or producer.  This course will chart the key stages of finding and preparing a good script for production. These steps include how to find, evaluate and shape material from the producer's perspective. Students will learn the practical art of writing script coverage and notes, as well as how to establish a tracking group and develop tracking reports for new material. Other topics include the role of key players in the process, such as agents and studio e...\n\n      more description for OART-UT 1010 »\n\n      \n\n\n\nThis course de-mystifies the film development process and teaches students the key tools necessary for a successful career as a film executive or producer.  This course will chart the key stages of finding and preparing a good script for production. These steps include how to find, evaluate and shape material from the producer's perspective. Students will learn the practical art of writing script coverage and notes, as well as how to establish a tracking group and develop tracking reports for new material. Other topics include the role of key players in the process, such as agents and studio executives, and how to avoid \"development hell.\" \n\n      less description for OART-UT 1010 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1017",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14454",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 667",
                    "time": "Tue 12.30 PM - 3.25 PM",
                    "open": true,
                    "professor": "Bitel, Mary"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1017\n\n   Working with Groups in Community Settings\n\nThis course provides students interested in exploring their artistic field of study in community settings or providing community service through the arts, with a foundation for working with small and large group structures in community settings. Students will gain an understanding of group theory and stages of group development as they impact the visiting artist’s work with community groups. Cultural and ethnic issues and an overview of population needs will be discussed in relation to entering into and engaging community groups in the creative process. Students will work in small groups to br...\n\n      more description for OART-UT 1017 »\n\n      \n\n\n\nThis course provides students interested in exploring their artistic field of study in community settings or providing community service through the arts, with a foundation for working with small and large group structures in community settings. Students will gain an understanding of group theory and stages of group development as they impact the visiting artist’s work with community groups. Cultural and ethnic issues and an overview of population needs will be discussed in relation to entering into and engaging community groups in the creative process. Students will work in small groups to brainstorm project ideas for working with groups in community settings and will prepare and present an individual project design for a visiting artist’s work with a community group, drawing on specific fields of artistic study and taking into consideration material covered in class lectures and discussions.\n\n      less description for OART-UT 1017 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1040",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14455",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 652",
                    "time": "Thu 10.00 AM - 12.45 PM",
                    "open": true,
                    "professor": "Drukman, Steven"
                },
                {
                    "format": "Lecture",
                    "class_id": "14456",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 635",
                    "time": "Mon 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Schulman, Charles"
                },
                {
                    "format": "Lecture",
                    "class_id": "14457",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 646",
                    "time": "Tue 3.30 PM - 6.15 PM",
                    "open": true,
                    "professor": "Olesker, Elizabeth"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1040\n\n   Playwriting Practicum\n\nAn introductory course on the basic techniques employed in writing a play. Class includes discussion of samples of the students’ work in addition to discussion of theory and various theatrical exercises. Students read selected plays to enhance discussions of structuring a dramatic piece of writing. The course addresses actors writing material for themselves and focuses on character and dialogue as well as examining scene work, outlining, and the completion of a first draft of a one-act play. This course counts towards Theatre Studies requirements for Drama students and as elective credits for ...\n\n      more description for OART-UT 1040 »\n\n      \n\n\n\nAn introductory course on the basic techniques employed in writing a play. Class includes discussion of samples of the students’ work in addition to discussion of theory and various theatrical exercises. Students read selected plays to enhance discussions of structuring a dramatic piece of writing. The course addresses actors writing material for themselves and focuses on character and dialogue as well as examining scene work, outlining, and the completion of a first draft of a one-act play. This course counts towards Theatre Studies requirements for Drama students and as elective credits for other TSOA students.\n\n      less description for OART-UT 1040 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1041",
            "course_name": "Playwriting Practicum II",
            "description": "OART-UT 1041 Playwriting Practicum II",
            "offering": false
        },
        {
            "course_id": "OART-UT 1042",
            "course_name": "Playwriting:from Page to Stage",
            "description": "OART-UT 1042 Playwriting:from Page to Stage",
            "offering": false
        },
        {
            "course_id": "OART-UT 1043",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17752",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17752",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "OART-UT 1043\n\n   Discovering Playwright's Voice\n\nPlaywriting classes tend to fall into two distinct categories: craft-centric introductory classes and feedback-centric advanced classes. In the former, one learns the basic tenets of playwriting. In the latter, one is expected to get cracking on his or her first masterpiece. Rarely do we see an opportunity for a burgeoning playwright to not just learn the fundamentals, but to also begin to discover his or her artistic voice. How many potentially successful writers have given up just because they never knew where their strengths lay? What if a young writer is slogging away trying to write boule...\n\n      more description for OART-UT 1043 »\n\n      \n\n\n\nPlaywriting classes tend to fall into two distinct categories: craft-centric introductory classes and feedback-centric advanced classes. In the former, one learns the basic tenets of playwriting. In the latter, one is expected to get cracking on his or her first masterpiece. Rarely do we see an opportunity for a burgeoning playwright to not just learn the fundamentals, but to also begin to discover his or her artistic voice. How many potentially successful writers have given up just because they never knew where their strengths lay? What if a young writer is slogging away trying to write boulevard comedies, when, in fact, he or she has an incredible knack for experimental theater? Or vice versa? This is where Discovering The Writer’s Voice comes in.\n\nThis is a class built on artistic experimentation. Works of notable playwrights of various styles and backgrounds will be read and discussed, in order to discover various possible approaches to writing, in terms of theatricality, character development (or non-development), dialogue style, etc. After the characteristics of a given playwright’s style have been agreed upon, the students will then be assigned an 8-15 page play, wherein they incorporate the listed aspects of the playwright’s work. This is not meant to be an imitation or, worse, a parody of the assigned writer’s work. Students will instead write plays with themes, topics, and characters that are of interest to them, but following certain guidelines. Over the course of the semester, students will write three short plays, each featuring the “style” of an assigned playwright. Ideally, students will thrive in some styles and struggle mightily in others.\n\n      less description for OART-UT 1043 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1045",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14641",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL148",
                    "time": "Thu 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "DeMaio, Donald"
                }
            ],
            "course_name": "Writing the TV Sitcom",
            "description": "OART-UT 1045 Writing the TV Sitcom \nAdapted from the Dramatic Writing Program’s popular “Introduction to the Sitcom” course, this intensive scriptwriting class answers the question, “What do I need to break into TV writing?” – the student will be guided through the step-by-step development of an episode for an ongoing TV sitcom, from premise line to one-page outline, to pages and revisions. The course will require the completion of a polished draft while introducing students to the rigors of professional standards through weekly story goals.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1046",
            "course_name": "",
            "description": "OART-UT 1046\n\n   Writing for Children's TV\n\nChildren’s TV has been a major part of media since the early 50’s and 60’s.  Shows such as Howdy Doody, Mr. Rogers, Captain Kangaroo, My Friend Flicker, and Lassie were the early pioneers of this television format, designed to engage a young audience.  In 1969, educational children’s TV hit the ground running with the launch of Sesame Street produced by The Children’s Television Workshop.  It was a program that researched the how, why, and what children needed to watch if the programming for them was to help improve their cognitive skills.  With the success of Sesame Street other companies and...\n\n      more description for OART-UT 1046 »\n\n      \n\n\n\nChildren’s TV has been a major part of media since the early 50’s and 60’s.  Shows such as Howdy Doody, Mr. Rogers, Captain Kangaroo, My Friend Flicker, and Lassie were the early pioneers of this television format, designed to engage a young audience.  In 1969, educational children’s TV hit the ground running with the launch of Sesame Street produced by The Children’s Television Workshop.  It was a program that researched the how, why, and what children needed to watch if the programming for them was to help improve their cognitive skills.  With the success of Sesame Street other companies and stations began to launch additional programming for children. The course will guide students through the process of developing a showbible for an original half-hour educational children’s television show, and then, based upon that showbible, students will write a pilot script of their original show.\n\nThe course will focus on the following educational children’s shows: Sesame Street, Elmo’s World, The Magic School Bus, Fitness Fighters, Superchefs of The Universe, Puzzle Place.  DVD’s, scripts, curriculum materials, and showbibles from these shows will be examined to discover their overviews, target audience, goals, characters, and show formats. The course will also explore the impact of children’s TV in media in the United States and throughout the world.\n\n      less description for OART-UT 1046 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1049",
            "course_name": "Socially Relevant Documentary Production",
            "description": "OART-UT 1049 Socially Relevant Documentary Production",
            "offering": false
        },
        {
            "course_id": "OART-UT 1050",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14458",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS 937",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Derfner, Joel; Childs, Kirsten"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1050\n\n   Musical Theatre Writing Workshop\n\nA team-taught workshop that encourages composers, lyricists, and book writers to find their own voices and learn to merge their unique artistic visions with those of other collaborative artists to create exciting new songs in a theatrical context. Rotating teams write and present a series of projects culminating in a short musical theatre work to be presented at the end of the semester by Broadway actors. Theatre songwriting craft, issues of communication between artists of different disciplines, and storytelling through music and text are emphasized. Great musical theatre works of the 20th ce...\n\n      more description for OART-UT 1050 »\n\n      \n\n\n\nA team-taught workshop that encourages composers, lyricists, and book writers to find their own voices and learn to merge their unique artistic visions with those of other collaborative artists to create exciting new songs in a theatrical context. Rotating teams write and present a series of projects culminating in a short musical theatre work to be presented at the end of the semester by Broadway actors. Theatre songwriting craft, issues of communication between artists of different disciplines, and storytelling through music and text are emphasized. Great musical theatre works of the 20th century are read and discussed to support the students' examination of their own creative process. Poets, playwrights, and writers from other genres, and composers from a wide variety of stylistic background ranging from pop to classical-country, hip-hop, rap, and jazz to fusion, are welcome to participate.\n\n      less description for OART-UT 1050 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1072",
            "course_name": "Screenwriting Lab:",
            "description": "OART-UT 1072 Screenwriting Lab: \nThis class will develop fundamental screenwriting skills through a series of talks and presentations with exercises in scene writing, story development, use of genre, pitching and refining the pitch. Emphasis will be on scene study and story construction, visualization, use of the cut, understanding of movie forms, and presentation of story ideas.",
            "offering": false
        },
        {
            "course_id": "OART-UT 1093",
            "course_name": "",
            "description": "OART-UT 1093\n\n   Creative Fundraising\n\nThis course is about the struggle between commerce and art in the worlds of film, television, theatre, music and new technologies.  It provides students with a framework for understanding the dynamics and various routes to raising funds for artistic endeavors.  The students will learn about basic financial tools and structures as well as creative fundraising and financing.  In the process they will better understand the series of challenges and compromises that are often necessary to complete the creative journey.\n\nThis course will explore traditional and non-traditional fundraising and fina...\n\n      more description for OART-UT 1093 »\n\n      \n\n\n\nThis course is about the struggle between commerce and art in the worlds of film, television, theatre, music and new technologies.  It provides students with a framework for understanding the dynamics and various routes to raising funds for artistic endeavors.  The students will learn about basic financial tools and structures as well as creative fundraising and financing.  In the process they will better understand the series of challenges and compromises that are often necessary to complete the creative journey.\n\nThis course will explore traditional and non-traditional fundraising and financing techniques. At its core, this course is about developing a general understanding of fundraising and financing the entertainment world and refining the creative skills necessary to develop proposals that allow the student to one day realize her or his creative vision, build a career, and establish themselves as an entrepreneur.\n\n      less description for OART-UT 1093 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1094",
            "course_name": "",
            "description": "OART-UT 1094\n\n   Strategic and Business Planning for the Arts\n\nStrategic and Business Planning introduces the students to the process and development of strategic and/or business plans for the arts and arts-related industries. Through a combination of readings, business plan analyses, and collaborative projects, the students are exposed to all aspects of such planning and the creation of documents formalizing the planning. The class is structured as a combination of focused readings and discussions; group planning; writing, and development projects; and class presentations. Students will be exposed to and explore a specific process of planning from beginn...\n\n      more description for OART-UT 1094 »\n\n      \n\n\n\nStrategic and Business Planning introduces the students to the process and development of strategic and/or business plans for the arts and arts-related industries. Through a combination of readings, business plan analyses, and collaborative projects, the students are exposed to all aspects of such planning and the creation of documents formalizing the planning. The class is structured as a combination of focused readings and discussions; group planning; writing, and development projects; and class presentations. Students will be exposed to and explore a specific process of planning from beginning to final presentation. During the semester, each student will be expected to engage in all of the skills that go into the making of such plans; research, analysis, writing, public presentation, and scheduling.\n\n      less description for OART-UT 1094 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1104",
            "course_name": "Constructing a Record Company",
            "description": "OART-UT 1104 Constructing a Record Company",
            "offering": false
        },
        {
            "course_id": "OART-UT 1153",
            "course_name": "",
            "description": "OART-UT 1153\n\n   Race in 20th Century American Popular Music\n\nThe history of popular sound in the United States illuminates how music, movement, and performance are key to a contemporary understanding of how individual and group identity has been composed throughout the nation’s history. Unpacking this sonic history reveals how identity is connected to how race is heard, both historically and at present. In this course, we explore how race is constructed in the development of global popular music and the culture of sound in and before the 20th century in the United States. This course, in particular, will especially focus on music of the global African D...\n\n      more description for OART-UT 1153 »\n\n      \n\n\n\nThe history of popular sound in the United States illuminates how music, movement, and performance are key to a contemporary understanding of how individual and group identity has been composed throughout the nation’s history. Unpacking this sonic history reveals how identity is connected to how race is heard, both historically and at present. In this course, we explore how race is constructed in the development of global popular music and the culture of sound in and before the 20th century in the United States. This course, in particular, will especially focus on music of the global African Diaspora from the late nineteenth century until the 1960s. We will examine how the sounds and performance of blackface minstrelsy—the first native form of popular music in the U.S.—became the basis of contemporary popular sound, ranging from Tin Pan Alley to blues and jazz, as well as to country and rock ‘n roll. Irving Berlin, Big Momma Thornton, Elvis Presley, The Supremes, Johnny Cash, Mick Jagger, Tina Turner, and Jimi Hendrix are but a few of the many artists who will be considered in relation to the history of American popular music and (racialized) sound. Students will consider critical race theories, primary and secondary accounts of popular performance, as well as selected audio and visual material to investigate how race ties into various ideas about individual and community identity, nationalism, and imperialism. In addition, students will gain a nuanced understanding of the relationship between sound, race, and American Music, as they develop critical listening skills to deconstruct how music is performed, heard, and embodied in more contemporary contexts through lectures, discussion, as well as multimedia and written projects. While racial identity will remain central to how we deconstruct the sounds and performance of popular music, aspects of identity such as gender, class, and sexuality will also be closely considered.\n\n      less description for OART-UT 1153 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1230",
            "course_name": "Understanding Digital Media",
            "description": "OART-UT 1230 Understanding Digital Media",
            "offering": false
        },
        {
            "course_id": "OART-UT 1270",
            "course_name": "Social Entrepreneurship in the Music Industry",
            "description": "OART-UT 1270 Social Entrepreneurship in the Music Industry",
            "offering": false
        },
        {
            "course_id": "OART-UT 1273",
            "course_name": "",
            "description": "OART-UT 1273\n\n   Music Supervision & Licensing\n\nMusic supervision and music licensing are two of the hottest topics in the music business. This class will focus on both and help you understand the ins and outs of music supervision and the nuts and bolts of music licensing. We will look at how music supervision can benefit the artist, the manager, the label, the publisher, as well as study all possible players in the music supervision and licensing worlds. We will learn the rules that govern music licensing, or the business side, to the creative engine fueled by music supervision. We will understand topics like music publishing, clearances, ...\n\n      more description for OART-UT 1273 »\n\n      \n\n\n\nMusic supervision and music licensing are two of the hottest topics in the music business. This class will focus on both and help you understand the ins and outs of music supervision and the nuts and bolts of music licensing. We will look at how music supervision can benefit the artist, the manager, the label, the publisher, as well as study all possible players in the music supervision and licensing worlds. We will learn the rules that govern music licensing, or the business side, to the creative engine fueled by music supervision. We will understand topics like music publishing, clearances, budgets, and the art of pitching music for licensing opportunities. We will look at all of the platforms where music is supervised and licensed, including film, television, advertising, video games, and more. We will also discuss the impact of music supervision from a creative perspective by looking at case studies such as Lorde curating the Hunger Games Soundtrack, the music side of The Tonight Show, Apple using Hudson Mohawke's music in their advertisement campaign, and how DJ Hero changed the landscape of music in video games forever. The final class project will involve supervising and licensing music in real-time, using all of the knowledge gained in class, and applying it to the real world.\n\n      less description for OART-UT 1273 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1286",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14692",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "SILV 621",
                    "time": "Tue 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "King, Jason"
                },
                {
                    "format": "Lecture",
                    "class_id": "14787",
                    "section": "002",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "SILV 509",
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Morrison, Matthew"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1286\n\n   Topics in Recorded Music:Diasporic SoundsImmersive Experiences\n\nStudents may register for either one of the courses individually, or both. Both courses meet during the second seven weeks of the semester.\n \nSection 001 Immersive Experiences: If you've been to a 3D or Imax movie, if you've tried Google glasses, if you've listened to music on surround sound speakers or noise-canceling headphones, if you’ve explored an interactive website, visual album, pop up store or app, or visited the Burning Man Festival, you are a consumer of immersive experiences. One of the main drivers of culture and technology in the 21st century, immersion is defined as the process ...\n\n      more description for OART-UT 1286 »\n\n      \n\n\n\nStudents may register for either one of the courses individually, or both. Both courses meet during the second seven weeks of the semester.\n \nSection 001 Immersive Experiences: If you've been to a 3D or Imax movie, if you've tried Google glasses, if you've listened to music on surround sound speakers or noise-canceling headphones, if you’ve explored an interactive website, visual album, pop up store or app, or visited the Burning Man Festival, you are a consumer of immersive experiences. One of the main drivers of culture and technology in the 21st century, immersion is defined as the process by which one or more of the senses become saturated as environmental objects surround envelope or come in closer proximity to us. Virtual or augmented reality, innovative video games, and the idea that consumers area always “plugged in” via mobile devices are just some of the ways we experience immersion in contemporary commercial terms. But the concept is not new: scholars like Benjamin, McLuhan, and Debord have long been concerned with theorizing the “sensorium” and media spectacle. Immersion underwrites so many developments in media and elsewhere: film close-ups, site-specific theater, photography, daguerrotypes and dioramas, haunted houses, house of mirrors and certain forms of installation art. Immersion is also widely considered to be the key to learning new languages or mastering different cultures and tourism, so it plays a key role in 20th and 21st century globalization. This class looks at the global history and culture of immersion in various cultural traditions and how emergent technology has impacted immersion. It also considers how our ongoing demand for proximity has shaped contemporary entertainment and technological needs; immersion is now a multi-billion dollar global business. We especially look at immersion in popular music – spanning everything from Satie to ambient music to surround sound and panoramic sound and Dolby to theme parks to 21st century ‘experience websites,’ spectacular live shows, app culture, brand experiences, pop-up stores, holograms and holophonics. Students should leave the class with greater understanding of immersion as a cultural principle and a better knowledge of how entertainment industries will be meeting consumer need for immersion in the past now and into the future. \n \nSection 002 Diasporic Sounds: In the early modern era, the movement, migration, and dispossession of Europeans and Africans to the “New World” encouraged the transmission of diverse cultural practices within new contexts. In particular, the “African Diaspora” was forged, as multiple tribes and ethnicities were forcibly transported throughout the Americas during the Atlantic slave trade. In the Americas, varied forms of traditional African life and culture were both preserved and transformed within the confines of enslavement, while distinct ethnic practices converged in newly formed communities and settings, as well as in relation to (ethnic) European Diasporic practices. The topics of this course will travel across the Atlantic and three centuries, as we explore how the sounds of the African Diaspora have been (per)formed, transmitted, circulated, and commodified within the development of popular sounds in the Americas. Diasporic Sounds will begin by engaging the spiritual, improvisatory, rhythmic, and corporeal aspects of how sounds of the African Diaspora were (re)created throughout the New World. Focusing on the United States, the Caribbean, and Brazil, this course will continue to explore the ways in which these diasporic sounds both related and differed across regions and contexts, reflecting the diversity implicit within how we investigate (Africa’s) Diaspora. While the course considers the specific contexts of Africans throughout the Americas, students will gain an understanding of the relationship between identity and popular sound by considering how sounds of the African Diaspora became thematized, commodified, and circulated in the context of an increasingly industrial and globalized world economy during the nineteenth and twentieth centuries. As we explore the range, singularity, and hybridity of (African) Diasporic sounds, we will also cover a number of genres and their performers, including (but not limited to) the folk spiritual of the U.S., Haitian Compas, blackface minstrelsy, samba, Hip Hop, Bomba, Cuban jazz, and reggaeton, in addition to styles such as bluegrass, techno, and British soul.\n\n      less description for OART-UT 1286 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1287",
            "course_name": "Cultural Branding",
            "description": "OART-UT 1287 Cultural Branding \nContemporary marketers are increasingly focused on the cultural interests and behaviors of the consumer. Market segments have evolved from census demographics to unifying sub-cultures that transcend ethnicity, geography, age and gender. Technology has accelerated the speed at which a culture evolves and/ or becomes obsolete which in turn requires a new marketing paradigm. This class will focus on these shifts in the industry's culture as it applies to music industry professionals and beyond.",
            "offering": false
        },
        {
            "course_id": "OART-UT 1288",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19243",
                    "section": "001",
                    "period": "10/21/2015 - 12/15/2015",
                    "location": "BOBS LL143",
                    "time": "Wed 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Dede, Mehmet"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1288\n\n   Producing Live Music Events\n\nThis course is geared to all students interested in live music event production and the technical and business aspects involved in planning, developing, and producing a live music event. Topics included: talent and venue contracts and negotiations, primary and secondary revenue streams budgeting, marketing, best practices for promotion and more.  Course work includes lectures, interactive class discussion, peer and self-assessments, short answer analytical responses and hands-on collaboration on the production of one live music event. By the end, students have the skills and a framework to boo...\n\n      more description for OART-UT 1288 »\n\n      \n\n\n\nThis course is geared to all students interested in live music event production and the technical and business aspects involved in planning, developing, and producing a live music event. Topics included: talent and venue contracts and negotiations, primary and secondary revenue streams budgeting, marketing, best practices for promotion and more.  Course work includes lectures, interactive class discussion, peer and self-assessments, short answer analytical responses and hands-on collaboration on the production of one live music event. By the end, students have the skills and a framework to book and oversee all aspects of a live music event - whether for themselves or for any artists with whom they work.\n\n      less description for OART-UT 1288 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1289",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19763",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "BOBS LL143",
                    "time": "Wed 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Davis, Lauren"
                }
            ],
            "course_name": "Music Contracts & Dealmaking",
            "description": "OART-UT 1289 Music Contracts & Dealmaking \nThe course provides a comprehensive and practical overview of the music contracts that you -- and every artist, musician, songwriter, record producer and other music business professionals -- need to launch and grow an entrepreneurial music venture. Learn proven strategies for navigating conflicts when they arise and how to safeguard your rights and interests in music that you create. Practice and apply newly acquired drafting and negotiation skills to current projects you are working on with personalized instructor and peer feedback.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1300",
            "course_name": "",
            "description": "OART-UT 1300\n\n   Free Culture and Open Access\n\nAt the root of \"Free Culture\" and \"Open Access\" lies the idea that aesthetic and informational works become public resources that should be shared. This interdisciplinary class examines both ideas from a variety of perspectives: aesthetics, politics, law, and social movements. It pays particular attention to the relationship between these ideas and the rise of new forms of media that allow age-old concepts like \"The Commons\" to flourish. It also situates these ideas within longstanding practices of both scholarship and librarianship.  The course places a focus on contemporary and very recent a...\n\n      more description for OART-UT 1300 »\n\n      \n\n\n\nAt the root of \"Free Culture\" and \"Open Access\" lies the idea that aesthetic and informational works become public resources that should be shared. This interdisciplinary class examines both ideas from a variety of perspectives: aesthetics, politics, law, and social movements. It pays particular attention to the relationship between these ideas and the rise of new forms of media that allow age-old concepts like \"The Commons\" to flourish. It also situates these ideas within longstanding practices of both scholarship and librarianship.  The course places a focus on contemporary and very recent activities, and will also examine closely related ideas and movements such as \"Information Wants to be Free\", Free Software, CopyLeft, and Access to Knowledge.\n\n      less description for OART-UT 1300 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1500",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14530",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 279",
                    "time": "Thu 3.30 PM - 6.15 PM",
                    "open": true,
                    "professor": "Gharabaghi, Hadi"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1500\n\n   Iran Arts Activism\n\n'Art activism' has recently become a popular and yet ambiguous point of reference for media artists specially in their negotiations with various human rights organizations, art and educational institutions and philanthropic foundations towards funding and infrastructural support for artistic projects that address democratic change throughout the world. This course examines theoretical genealogy of the concept and its contemporary application in the context of a case study of Iran, a Middle Eastern country with almost no direct American tourist and educational access in the last 35 years and ye...\n\n      more description for OART-UT 1500 »\n\n      \n\n\n\n'Art activism' has recently become a popular and yet ambiguous point of reference for media artists specially in their negotiations with various human rights organizations, art and educational institutions and philanthropic foundations towards funding and infrastructural support for artistic projects that address democratic change throughout the world. This course examines theoretical genealogy of the concept and its contemporary application in the context of a case study of Iran, a Middle Eastern country with almost no direct American tourist and educational access in the last 35 years and yet voluminous mediated access to archives of often hyperbolic and partisan geopolitical debates, a famous national arthouse cinema, lively Iranian and diasporic art and documentary media, state/citizen-driven public diplomacy video-journalism etc. For this course, therefore, familiarity with and critical assessment of rich moving-image media archives becomes the point of entry into understanding the country historically within the Cold War context of a large scale involvement of American government and non-government institutions in social and economic modernization, political transformation and cultural policies affecting artistic movements inside Iran and the diaspora. This course encourages students to develop \"activist\" relation with the country through establishing social media contact and reflecting on their mediated artistic access. The course is structured around group projects, online assignments, journal reports, short theory paper and a documentary presentation of final project. No prior knowledge of Iran and/or Persian languages are required for a successful completion of this course.\n\n      less description for OART-UT 1500 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1560",
            "course_name": "The Art & Technique of the Documentary",
            "description": "OART-UT 1560 The Art & Technique of the Documentary",
            "offering": false
        },
        {
            "course_id": "OART-UT 1600",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14490",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "19W4 101"
                },
                {
                    "format": "Recitation",
                    "class_id": "17639",
                    "section": "011",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "2MTC 801"
                },
                {
                    "format": "Recitation",
                    "class_id": "17640",
                    "section": "012",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "2MTC 801"
                },
                {
                    "format": "Recitation",
                    "class_id": "17641",
                    "section": "013",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "2MTC 801"
                },
                {
                    "format": "Recitation",
                    "class_id": "17642",
                    "section": "014",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "2MTC 801"
                },
                {
                    "format": "Recitation",
                    "class_id": "17643",
                    "section": "015",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "2MTC 801"
                },
                {
                    "format": "Recitation",
                    "class_id": "17644",
                    "section": "016",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "2MTC 801"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1600\n\n   Games 101\n\nGames 101 is the foundational course for the NYU Game Center and a prerequisite for all other Game Center classes starting in the fall of 2012. The focus of Games 101 is game literacy – the development of a shared understanding of games as complex cultural and aesthetic objects. This class is a broad, introductory survey which covers the full spectrum of digital and non-digital games. The class will incorporate lectures, discussions, and writing assignments, but the primary activity of the class is critical play – playing games and writing about them in order to better understand and appreciat...\n\n      more description for OART-UT 1600 »\n\n      \n\n\n\nGames 101 is the foundational course for the NYU Game Center and a prerequisite for all other Game Center classes starting in the fall of 2012. The focus of Games 101 is game literacy – the development of a shared understanding of games as complex cultural and aesthetic objects. This class is a broad, introductory survey which covers the full spectrum of digital and non-digital games. The class will incorporate lectures, discussions, and writing assignments, but the primary activity of the class is critical play – playing games and writing about them in order to better understand and appreciate them.\n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n1)\tDevelop a thorough understanding of the most important and influential historical and modern games.\n2)\tPlace games within a comprehensive overall framework of historical, technological, and stylistic categories.\n3)\tUnderstand games as designed experiences, as technological systems, and as social and cultural artifacts.\n4)\tBuild a critical vocabulary that allows them to participate in productive, high-level spoken and written conversations about games.\n5)\tAnalyze games and clearly articulate their formal, cultural, and expressive qualities\n6)\tGain a basic understanding of games as aesthetic objects that lays a foundation for further studies in game design, production, and scholarship.\n\n      less description for OART-UT 1600 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1601",
            "course_name": "",
            "description": "OART-UT 1601\n\n   Intro to Game Production I\n\nIntroduction to Game Design is a one-semester course that explores the fundamentals of game design. The focus of the class is the actual creation of several non-digital (off the computer) games. Just as art students might take “fundamentals” classes in figure drawing or color theory as part of their education to become visual artists, this class remains rooted squarely in the basics. It focuses on the elementals common to all games that are fundamental for a game designer working in any medium, from sports to board games to computer and videogames. Although the focus of the course is on the cr...\n\n      more description for OART-UT 1601 »\n\n      \n\n\n\nIntroduction to Game Design is a one-semester course that explores the fundamentals of game design. The focus of the class is the actual creation of several non-digital (off the computer) games. Just as art students might take “fundamentals” classes in figure drawing or color theory as part of their education to become visual artists, this class remains rooted squarely in the basics. It focuses on the elementals common to all games that are fundamental for a game designer working in any medium, from sports to board games to computer and videogames. Although the focus of the course is on the creation of non-digital games, digital games will also be discussed and one of the assignments will focus on digital game design specifically.\n\n\nGoals of the course\n\n-\tExplore the basic methodologies and conceptual skills of game design, such as systems thinking, an iterative design process, playtesting, design collaboration, critical design analysis, etc.\n\n-\tGain the experience of actually creating several playable games using an iterative design process.\n\n-\tFoster an understanding of what games are, on and off the computer, and how they function to create meaningful experiences for players.\n\n-\tExplore fundamental concepts relating to games and design, such as rules and play, emergent complexity, long and short-term goals, etc. This includes understanding games as formal systems, experienced human systems, and cultural systems.\n\n-\tBecome familiar with the foundational texts in the field of game design, and understand game design as a field that encompasses all kinds of games. \n\n-\tLink the principles of the course to computer and video games on a variety of platforms.\n\n      less description for OART-UT 1601 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1602",
            "course_name": "Recapturing Life",
            "description": "OART-UT 1602 Recapturing Life",
            "offering": false
        },
        {
            "course_id": "OART-UT 1603",
            "course_name": "Game Art & Beyond",
            "description": "OART-UT 1603 Game Art & Beyond",
            "offering": false
        },
        {
            "course_id": "OART-UT 1604",
            "course_name": "",
            "description": "OART-UT 1604\n\n   Game Development Workshop\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the clo...\n\n      more description for OART-UT 1604 »\n\n      \n\n\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the close supervision of instructors, students will collaborate on the creation of a playable game. As a creative constraint to help inspire them and guide their designs, the students will be given a theme to express in their game projects.\n\n      less description for OART-UT 1604 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1605",
            "classes": [
                {},
                {
                    "format": "Studio",
                    "class_id": "17672",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "2MTC 80209/02/2015 - 12/15/2015 Wed 12.30 PM - 3.50 PM"
                },
                {
                    "format": "Studio",
                    "class_id": "17673",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "2MTC 83009/02/2015 - 12/15/2015 Thu 9.30 AM - 12.15 PM"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1605\n\n   Intro to Game Design\n\nThis is an intensive, hands-on workshop addressing the complex challenges of game design. The premise of the class is that all games, digital and non-digital, share common fundamental principles, and that understanding these principles is an essential part of designing successful games. Learning how to create successful non-digital games provides a solid foundation for the development of digital games. Students will analyze existing digital and non-digital games, taking them apart to understand how they work as interactive systems. A number of non-digital games will be created in order to mast...\n\n      more description for OART-UT 1605 »\n\n      \n\n\n\nThis is an intensive, hands-on workshop addressing the complex challenges of game design. The premise of the class is that all games, digital and non-digital, share common fundamental principles, and that understanding these principles is an essential part of designing successful games. Learning how to create successful non-digital games provides a solid foundation for the development of digital games. Students will analyze existing digital and non-digital games, taking them apart to understand how they work as interactive systems. A number of non-digital games will be created in order to master the basic design principles that apply to all games regardless of format. This course is subject to a non-refundable department fee, please see the Notes section for more detail.\n\n      less description for OART-UT 1605 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1606",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17674",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "2MTC 825"
                },
                {
                    "format": "Lecture",
                    "class_id": "17675",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "2MTC 825"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1606\n\n   Thinking About Games\n\nThis class is an overview of the field of video games that approaches them from several theoretical and critical perspectives. No special theoretical background or prior training is needed to take the course, but to have had a broad practical experience with and basic knowledge of games is a distinct advantage. Also, an interest in theoretical and analytical issues will help. You are expected to actively participate in the lectures, which are dialogic in form, with ample room for discussion.\n\nThe course will prepare the student to:\n\n- Understand and discuss games from a theoretical perspec...\n\n      more description for OART-UT 1606 »\n\n      \n\n\n\nThis class is an overview of the field of video games that approaches them from several theoretical and critical perspectives. No special theoretical background or prior training is needed to take the course, but to have had a broad practical experience with and basic knowledge of games is a distinct advantage. Also, an interest in theoretical and analytical issues will help. You are expected to actively participate in the lectures, which are dialogic in form, with ample room for discussion.\n\nThe course will prepare the student to:\n\n- Understand and discuss games from a theoretical perspective - what are the components of a game?\n\n- Apply new theories and evaluate them critically.\n\n- Assess and discuss game concepts and the use of games in various contexts.\n\n- Analyze games, and understand and apply a range of analytical methods.\n\n      less description for OART-UT 1606 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1607",
            "course_name": "Games: Special Topics",
            "description": "OART-UT 1607 Games: Special Topics",
            "offering": false
        },
        {
            "course_id": "OART-UT 1608",
            "course_name": "Game Studio: Lab",
            "description": "OART-UT 1608 Game Studio: Lab",
            "offering": false
        },
        {
            "course_id": "OART-UT 1609",
            "course_name": "Advanced Game Design",
            "description": "OART-UT 1609 Advanced Game Design \nThe focus of this class is the actual creation of several non-digital games. Students deeply explore advanced topics in game design, wrestling with complex and challenging problems, such as formal play-testing procedures, balancing game economies, and designing games for learning. The class will cover both the craft and the culture of making games, and has a particular emphasis on how designers communicate their ideas. Although most of the projects will take the form of non-digital design, the course will address the application of ideas and procedures to digital games.",
            "offering": false
        },
        {
            "course_id": "OART-UT 1610",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "OART-UT 1610\n\n   Game Development: Modding\n\nIn this course, students get practice building game play experiences through a series of short-cycle exercises. Students work in small teams to create and tune gaming experiences in a range of game genres, using the game engine that they will use in Game Studio (a semester-long project class). The course introduces students to production roles, playtesting, considerations of audience and platform, and other practical concerns in building games. \n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n\n1)\tDescribe typical work practice in game development.\n2)\tDis...\n\n      more description for OART-UT 1610 »\n\n      \n\n\n\nIn this course, students get practice building game play experiences through a series of short-cycle exercises. Students work in small teams to create and tune gaming experiences in a range of game genres, using the game engine that they will use in Game Studio (a semester-long project class). The course introduces students to production roles, playtesting, considerations of audience and platform, and other practical concerns in building games. \n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n\n1)\tDescribe typical work practice in game development.\n2)\tDiscuss his/her experience in producing short gameplay experiences using a game engine.\n3)\tDemonstrate competency in game production through a series of exercises. \n4)\tWork with a game engine, and understand the basics of how to build a game in the engine.\n\n      less description for OART-UT 1610 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1611",
            "course_name": "",
            "description": "OART-UT 1611\n\n   Advanced Topics in Game Studies\n\nAdvanced Topics in Game Studies is a research-focused course that examines methodological and foundational issues in the study of video games. In addition, a current topic relating to video game culture, design, or theory will be explored every semester. The class is thereby focused on allowing students to actively participate in the development of video game theory, with specific attention to how video game studies evolve as a theoretical field, and how it interacts with changes in the design and culture of video games.\n\nNote: In this syllabus, the current topic is \"gamification\" – the use ...\n\n      more description for OART-UT 1611 »\n\n      \n\n\n\nAdvanced Topics in Game Studies is a research-focused course that examines methodological and foundational issues in the study of video games. In addition, a current topic relating to video game culture, design, or theory will be explored every semester. The class is thereby focused on allowing students to actively participate in the development of video game theory, with specific attention to how video game studies evolve as a theoretical field, and how it interacts with changes in the design and culture of video games.\n\nNote: In this syllabus, the current topic is \"gamification\" – the use of game design in non-game contexts such as teaching, politics, or business. Every semester will explore a different current topic.\n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n•\tTo understand the foundational discussions and questions behind the current state of video game theory.\n•\tTo develop new theory applicable to new developments in video game design/culture.\n•\tTo apply new perspectives on existing theoretical discussions in video game studies.\n•\tTo prepare to submit papers to conferences and/or write reports on game issues.\n\n      less description for OART-UT 1611 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1612",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "OART-UT 1612\n\n   Game Development\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the clo...\n\n      more description for OART-UT 1612 »\n\n      \n\n\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the close supervision of instructors, students will collaborate on the creation of a playable game. As a creative constraint to help inspire them and guide their designs, the students will be given a theme to express in their game projects.\n\n      less description for OART-UT 1612 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1613",
            "course_name": "Roleplaying on the Margins",
            "description": "OART-UT 1613 Roleplaying on the Margins \nThis course will examine the history, practice, and current state of the art of independent role-playing games, focusing on non-digital roleplaying games generally played by two or more participants in person. Selected games will be played in-class as well as assigned for out-of-class play, and will emphasize works that explore themes, mechanics, and play dynamics beyond the most familiar and popular forms of fantasy role-playing game.",
            "offering": false
        },
        {
            "course_id": "OART-UT 1614",
            "course_name": "",
            "description": "OART-UT 1614\n\n   Code Lab\n\nProcessing is a great tool for learning the fundamentals of programming.  Based on Java, one of the most popular programming languages, Processing simplifies Java to help creatives to develop programming literacy.  With the mission of allowing visual artists develop interactive systems, Processing provides a language, libraries, and a development environment.  You can use it to export applications for the Web, Windows, Mac OSX, Android, and Linux.  Processing is completely free and open source.  Many game developers learned to program with it and the concepts it teaches are useful for many pro...\n\n      more description for OART-UT 1614 »\n\n      \n\n\n\nProcessing is a great tool for learning the fundamentals of programming.  Based on Java, one of the most popular programming languages, Processing simplifies Java to help creatives to develop programming literacy.  With the mission of allowing visual artists develop interactive systems, Processing provides a language, libraries, and a development environment.  You can use it to export applications for the Web, Windows, Mac OSX, Android, and Linux.  Processing is completely free and open source.  Many game developers learned to program with it and the concepts it teaches are useful for many programming languages and game engines.  We will explore Processing beyond the Processing IDE, working with Processing in Eclipse, peeling back a layer to see how professional developers work with Processing and Java. Beyond simply learning to program, students in this class will explore models and algorithms useful for developing games.  We will discuss how platforms, libraries, frameworks, and engines affect game design, in both empowering and limiting ways.  Finally, we will discuss the history of digital games, how new tools have democratized the process of game development, and the costs and benefits of those trends.\n\n      less description for OART-UT 1614 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1615",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17676",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.45 PM - 3.15 PM",
                    "open": true,
                    "professor": "2MTC 802"
                }
            ],
            "course_name": "Intro to StarCraft",
            "description": "OART-UT 1615 Intro to StarCraft \nThis class will involve the development of a high level understanding of the real time strategy game, Starcraft 2,  including optimizing early gameplay, mastering tactical maneuvers and strategies, and real-time strategic decision making. At the same time it will touch on the development of the industry of e-sports and the design of high-level multiplayer games. Finally, the class will emphasize honing the universally valuable skills of critical thinking, mental discipline, and understanding complex systems and data in real-time, the very skills that make for a world class Starcraft player.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1616",
            "course_name": "",
            "description": "OART-UT 1616\n\n   Looking Glass Games\n\nThis course covers the works and legacy of Looking Glass Studios, one of the most influential video game studios of the 1990s. Through a series of seminal works including Ultima Underworld (1992), System Shock (1994), and Thief (1998), they defined and pushed the limits of first-person 3D gaming. In contrast to first-person shooters, LookingGlass’ first-person games were experiments in simulation, storytelling, and interface that were years ahead of their time, and formed a vocabulary still used today for building stories in real-time virtual worlds.\n\nThis is a history class with a forensic st...\n\n      more description for OART-UT 1616 »\n\n      \n\n\n\nThis course covers the works and legacy of Looking Glass Studios, one of the most influential video game studios of the 1990s. Through a series of seminal works including Ultima Underworld (1992), System Shock (1994), and Thief (1998), they defined and pushed the limits of first-person 3D gaming. In contrast to first-person shooters, LookingGlass’ first-person games were experiments in simulation, storytelling, and interface that were years ahead of their time, and formed a vocabulary still used today for building stories in real-time virtual worlds.\n\nThis is a history class with a forensic structure. Students will play through, discuss, read and write about Looking Glass’ games, with emphasis put on their core “immersive design trilogy” of Ultima Underworld, System Shock, and Thief and how all these works influenced and revised each other. Students will also play other games of the era for context, read articles about and interviews with the developers, and complete a series of assignments to structure their understanding.\n\nThe immediate goal is to foster a deep understanding of the work and influence of a seminal game company, the way one would for any other important group of artists in an art history context. The larger goal is to foster a set of skills for historical and critical analysis that is culturally situated and which complicates the notion of sole authorship.\n\nThis course is for students interested in the culture and evolution of video game aesthetics and who understand and value the practice of close reading and comparative analysis, the way a serious student would be expected to when studying the works of a painter.\n\n      less description for OART-UT 1616 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1701",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14460",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 375",
                    "time": "Wed 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Dorman, Joseph"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1701\n\n   History of Documentary Film\n\nThe course traces the documentary film from its origins to the present day.  Pioneer documentarians like Dziga Vertov and Robert Flaherty saw in documentary film the ability to portray life with a kind of truthfulness never before possible.  Early Polish filmmaker Boleslaw Matuszewski wrote that while “the cinematograph does not give the whole truth at least what it gives is unquestionable and of an absolute truth.”  Since those heady days, it has become all too clear that documentaries have no special access to the truth. Nevertheless, as this still-young art evolved, documentarians of differ...\n\n      more description for OART-UT 1701 »\n\n      \n\n\n\nThe course traces the documentary film from its origins to the present day.  Pioneer documentarians like Dziga Vertov and Robert Flaherty saw in documentary film the ability to portray life with a kind of truthfulness never before possible.  Early Polish filmmaker Boleslaw Matuszewski wrote that while “the cinematograph does not give the whole truth at least what it gives is unquestionable and of an absolute truth.”  Since those heady days, it has become all too clear that documentaries have no special access to the truth. Nevertheless, as this still-young art evolved, documentarians of different schools constantly sought new means to tell the human story. Documentary filmmaking has always been a blend of artistry and technical means and we will also explore this critical relationship.  \n\nThe course explores the development of the documentary and the shifting intentions of documentary filmmakers through the evolution of narrative approach and structure paying special attention to the documentary tradition’s relationship to journalism. Students examine how different filmmakers have gone about trying to convey “reality” on screen both through the use and avoidance of narration, through interviews, editing and dramatizations.  \n\nThroughout the semester, students investigate how image-driven medium attempts to report stories and the ways an emotion-driven art can be problematic for journalistic objectivity.  Finally, the ethical and journalistic responsibilities the documentary filmmaker are discussed.  Special attention is given to dramatic re-creations, the filmmaker’s relationship to his/her subjects and the construction of narrative through editing.\n\n      less description for OART-UT 1701 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1702",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14461",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-13",
                    "time": "Tue 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Slesin, Aviva"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1702\n\n   Master Class in Documentary\n\nThis course, while not a production class, is designed to give students the opportunity to learn each stage of the documentary filmmaking process from the best working professionals in their field. Each week we will watch a documentary and meet someone who had a pivotal role in the making of that documentary. Our guests will include producers, directors, cinematographers, sound engineers, editors, writers, film composers and sound mixers. These professionals will share their experience and expertise with the class and answer questions about their work thereby providing a foundation of insight ...\n\n      more description for OART-UT 1702 »\n\n      \n\n\n\nThis course, while not a production class, is designed to give students the opportunity to learn each stage of the documentary filmmaking process from the best working professionals in their field. Each week we will watch a documentary and meet someone who had a pivotal role in the making of that documentary. Our guests will include producers, directors, cinematographers, sound engineers, editors, writers, film composers and sound mixers. These professionals will share their experience and expertise with the class and answer questions about their work thereby providing a foundation of insight into the decisions, tools and skills that go into the making of good documentaries. Class discussions will explore the creative and technical decisions involved in the making the film.\n\n      less description for OART-UT 1702 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1703",
            "course_name": "",
            "description": "OART-UT 1703\n\n   Essentials of Documentary Pre-Production\n\nThis class is designed to give students an insider’s “jump start” into producing documentaries by learning the best practices and essentials of pre-production. Since pre-production is to documentary filmmaking what script writing is to feature filmmaking, this course is essential for those students who want to produce documentaries. Students will gain experience in developing and researching their ideas, attaining and confirming access to key subjects, pre-interviewing, writing a good pitch and a cogent, powerful proposal that includes the why, where and how of the film. Students will learn ab...\n\n      more description for OART-UT 1703 »\n\n      \n\n\n\nThis class is designed to give students an insider’s “jump start” into producing documentaries by learning the best practices and essentials of pre-production. Since pre-production is to documentary filmmaking what script writing is to feature filmmaking, this course is essential for those students who want to produce documentaries. Students will gain experience in developing and researching their ideas, attaining and confirming access to key subjects, pre-interviewing, writing a good pitch and a cogent, powerful proposal that includes the why, where and how of the film. Students will learn about stock footage, permits, release forms and rights. And they will be taught how to estimate, create and propose a realistic shooting schedule and budget. The object of this training is how to withstand and perhaps circumvent the many obstacles that lie ahead and, by planning, gain the freedom to act spontaneously during production. Along with screenings and class discussions, the instructor, an Oscar winning producer/director, and guest filmmakers will share their proposals and budgets and talk about how their films adhered to or changed from original/preproduction plans. Students enrolled in the course are asked to bring in ideas in writing for a documentary film they would like to make. By the end of the course, each student will be ready to move into production.\n\n      less description for OART-UT 1703 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1704",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14462",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 017",
                    "time": "Wed 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Slesin, Aviva"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1704\n\n   Through the Documentary Lens:  Human Rights\n\nThis course is designed for students with an interest in exploring Human Rights through viewing and discussing documentaries. The course will cover different perspectives as well as provide insights into both the subject matter contained in the films and the techniques and skills of good documentary filmmaking. Through research, class screenings, discussions and a few invited guest filmmakers, students will learn about both the evolution of the documentary genre as a means of better understanding history, and gain insights about what has been done and what still needs to be done about Human Ri...\n\n      more description for OART-UT 1704 »\n\n      \n\n\n\nThis course is designed for students with an interest in exploring Human Rights through viewing and discussing documentaries. The course will cover different perspectives as well as provide insights into both the subject matter contained in the films and the techniques and skills of good documentary filmmaking. Through research, class screenings, discussions and a few invited guest filmmakers, students will learn about both the evolution of the documentary genre as a means of better understanding history, and gain insights about what has been done and what still needs to be done about Human Rights worldwide.\n\n      less description for OART-UT 1704 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1705",
            "course_name": "",
            "description": "OART-UT 1705\n\n   Through the Documentary Lens: Civil Rights\n\nThis course is designed for students with an interest in exploring the Civil Rights Movement of 20th-century America through viewing and discussing documentaries.  While the struggle for civil rights began early in American history, the course mostly focuses on the black Civil Rights movement with an emphasis on the period from 1954 through 1966.  By focusing on this time period, which was reported and chronicled by the television/film media, the course covers different perspectives as well as provides insights about both the subject matter contained in the films and the techniques and skills ...\n\n      more description for OART-UT 1705 »\n\n      \n\n\n\nThis course is designed for students with an interest in exploring the Civil Rights Movement of 20th-century America through viewing and discussing documentaries.  While the struggle for civil rights began early in American history, the course mostly focuses on the black Civil Rights movement with an emphasis on the period from 1954 through 1966.  By focusing on this time period, which was reported and chronicled by the television/film media, the course covers different perspectives as well as provides insights about both the subject matter contained in the films and the techniques and skills of good documentary filmmaking.  Through weekly screenings of films, class discussions, and invited guest speakers, students learn about the evolution of the documentary genre as a means of better understanding history, and students gain knowledge about the historical/political/cultural milestones and the heroes of the movement.\n\n      less description for OART-UT 1705 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1706",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14695",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL25",
                    "time": "Tue 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Slesin, Aviva"
                }
            ],
            "course_name": "Through the Documentary Lens: Contemporary Art",
            "description": "OART-UT 1706 Through the Documentary Lens: Contemporary Art \nThis course explores contemporary fine artists and their work through documentary film. The course covers a variety of perspectives pertaining to both the art world and the techniques and skills of documentary filmmaking. Through weekly screenings of films, class discussions, a few invited guest filmmakers and several visits to museums/galleries, students will explore the evolution of the documentary genre as a means of better understanding art and a form of scholarship. The goal is to expose students to the work of contemporary artists and their creative process.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1906",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14463",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Thu 9.30 AM - 11.30 AM",
                    "open": true,
                    "professor": "Pietropinto, Angela"
                },
                {
                    "format": "Studio",
                    "class_id": "14464",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Fri 1.00 PM - 3.00 PM",
                    "open": true,
                    "professor": "Del Giudice, Judy"
                },
                {
                    "format": "Studio",
                    "class_id": "14784",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Thu 11.45 AM - 1.45 PM",
                    "open": true,
                    "professor": "Pietropinto, Angela"
                }
            ],
            "course_name": "Acting I",
            "description": "OART-UT 1906 Acting I \nThis beginner’s course explores the use of games, monologues, and scene work in order to develop knowledge of basic acting skills. Students are encouraged toward self exploration and creative expression. Not open to Tisch drama majors.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1907",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14465",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Fri 3.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Del Giudice, Judy"
                }
            ],
            "course_name": "Acting II",
            "description": "OART-UT 1907 Acting II \nA continuation of Acting I with a concentration on exploring scripted materials. Students prepare a scene or monologue in the course of the work and complete an in-depth study of the play. We learn how the actor uses improvisation, self-exploration, theatre games, imagination, and “make believe” to bring a script to life. Techniques of script analysis are explored. The instructor acts as a director to the student actor, reflecting the working relationship in the professional theatre.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1908",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14466",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 706",
                    "time": "Thu 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Horvath, Joan"
                },
                {
                    "format": "Studio",
                    "class_id": "14467",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 706",
                    "time": "Tue 6.40 PM - 9.40 PM",
                    "open": true,
                    "professor": "Williams, Hannelore"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1908\n\n   Acting for the Camera\n\nThis course is for actors who want to explore and cultivate their filmic talents and for directors who want to create performances that exploit the potential of the camera. Part one of the course reviews the fundamentals of the acting process. Through exercises, improvisations and scene work, techniques and criteria for performances are established. In part two, students work before the camera. The minimalism of film acting is the primary thrust, illustrating the camera’s ability to capture nuances of behavior, and requiring from the actor less physicalization, greater concentration and maxima...\n\n      more description for OART-UT 1908 »\n\n      \n\n\n\nThis course is for actors who want to explore and cultivate their filmic talents and for directors who want to create performances that exploit the potential of the camera. Part one of the course reviews the fundamentals of the acting process. Through exercises, improvisations and scene work, techniques and criteria for performances are established. In part two, students work before the camera. The minimalism of film acting is the primary thrust, illustrating the camera’s ability to capture nuances of behavior, and requiring from the actor less physicalization, greater concentration and maximal inner-life. In the third part of the course, scenes are rehearsed, lit, framed, and taped in a series of camera set-ups. Each student in the course receives a tape of his or her major project suitable, after basic editing, as a work sample or audition piece.\n\n      less description for OART-UT 1908 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1909",
            "course_name": "",
            "description": "OART-UT 1909\n\n   The Bard Out Loud: Intro to Acting Shakespeare\n\nThis course provides a hands-on, performance-based introduction to reading, understanding, and performing Shakespeare’s works. Students will begin with text analysis, gaining a broad foundation in Shakespeare’s text, including but not limited to: use of language, meter, scansion, alliteration and antithesis in order to approach sonnets, monologues, and scenes from Shakespeare’s canon. Students will work as a class group to analyze sonnets as an introduction to working on Shakespeare’s plays. Throughout the course of the semester, students will work on a monologue and a scene for action-based a...\n\n      more description for OART-UT 1909 »\n\n      \n\n\n\nThis course provides a hands-on, performance-based introduction to reading, understanding, and performing Shakespeare’s works. Students will begin with text analysis, gaining a broad foundation in Shakespeare’s text, including but not limited to: use of language, meter, scansion, alliteration and antithesis in order to approach sonnets, monologues, and scenes from Shakespeare’s canon. Students will work as a class group to analyze sonnets as an introduction to working on Shakespeare’s plays. Throughout the course of the semester, students will work on a monologue and a scene for action-based acting and character work. Students will be expected to prepare and rehearse material outside of class and will be paired for a final assignment of preparing a Shakespeare scene for rehearsal and presentation in class. Monologue and scene suggestions will be provided from a list handed out by the instructor. This is not a lecture-based seminar on Shakespeare’s writing, but rather an introductory approach to analyzing text for clues and insights into performing Shakespeare’s works. Open to all students of all levels of experience. Not open to Tisch Drama Majors.\n\n      less description for OART-UT 1909 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1910",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14468",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "OFFC ",
                    "time": "Tue 9.30 AM - 11.30 AM",
                    "open": true,
                    "professor": "Pietropinto, Angela"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1910\n\n   Comic Relief\n\nThis class explores the acting of comedy through theater games that focus on comedic techniques such as quick change, neurosis, obsession, shift of status, body part out of control, etc. as well as through analysis and performance of comedic text. If drama holds a mirror up to life, comedy holds up a magnifying glass. The boldness of choice and degree of commitment demanded by comedy are what make it so difficult to perform, especially because bold choices must be supported by psychological truth. Characters' objectives, obsessions, needs and phobias are what compel them to act in comical ways...\n\n      more description for OART-UT 1910 »\n\n      \n\n\n\nThis class explores the acting of comedy through theater games that focus on comedic techniques such as quick change, neurosis, obsession, shift of status, body part out of control, etc. as well as through analysis and performance of comedic text. If drama holds a mirror up to life, comedy holds up a magnifying glass. The boldness of choice and degree of commitment demanded by comedy are what make it so difficult to perform, especially because bold choices must be supported by psychological truth. Characters' objectives, obsessions, needs and phobias are what compel them to act in comical ways; if actors don't find the pain and truth of these catalysts, their behavior becomes silly, and the comedy, shtick. The exercises employed in this course (many of which have their roots in commedia dell'arte) help participants to free their bodies and voices, allowing them to commit both boldly and truthfully, and will be used to analyze and bring to life comedic text from television, to movies and theater.\n\n      less description for OART-UT 1910 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1916",
            "course_name": "",
            "description": "OART-UT 1916\n\n   Acting for Stage Screen: Open Arts Acting Studio\n\nActing for Stage and Screen is the Open Arts Studio at NYU’s Tisch School of the Arts. It is designed for a select, diverse student body, ready to challenge and stretch the physical and emotional instrument of the actor. The studio is dedicated to developing the actor's entire instrument-the body, the voice, and the imagination. Training frees the actor, so that he/she is able to go with his instincts and impulses; out of the head and into the viscera. In scene study classes the student discovers the importance of text analysis and staying in the moment, and the need for selecting strong objec...\n\n      more description for OART-UT 1916 »\n\n      \n\n\n\nActing for Stage and Screen is the Open Arts Studio at NYU’s Tisch School of the Arts. It is designed for a select, diverse student body, ready to challenge and stretch the physical and emotional instrument of the actor. The studio is dedicated to developing the actor's entire instrument-the body, the voice, and the imagination. Training frees the actor, so that he/she is able to go with his instincts and impulses; out of the head and into the viscera. In scene study classes the student discovers the importance of text analysis and staying in the moment, and the need for selecting strong objectives, formidable obstacles, varied actions, and meaningful personalizations. The Alexander technique and teachings of Linklater is used in voice production. The movement component includes yoga, circus, and the teachings of Laban.\n\nAuditions are required; to set up an audition, email tisch.special.admissions@nyu.edu\n\n      less description for OART-UT 1916 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1920",
            "course_name": "",
            "description": "OART-UT 1920\n\n   Mirth Making\n\nMIRTH MAKING is a course of lively, practical and entertaining workshops interspersed with lectures and seminars, all seeking to unpick the challenges facing performers and directors in bringing to life different kinds of comedy. From the outrageous bawdy plots of ancient Greece, through Shakespeare's often puzzling clowns to Noel Coward's crisp one-liners, we explore style and context, props, timing, and stage \"business\". Just how much life can you bring to a mask, a wig - or a fan? This isn't so much a course of study, rather it's one of finding out by taking part, by joining in and sharing ...\n\n      more description for OART-UT 1920 »\n\n      \n\n\n\nMIRTH MAKING is a course of lively, practical and entertaining workshops interspersed with lectures and seminars, all seeking to unpick the challenges facing performers and directors in bringing to life different kinds of comedy. From the outrageous bawdy plots of ancient Greece, through Shakespeare's often puzzling clowns to Noel Coward's crisp one-liners, we explore style and context, props, timing, and stage \"business\". Just how much life can you bring to a mask, a wig - or a fan? This isn't so much a course of study, rather it's one of finding out by taking part, by joining in and sharing a journey of practical, theatrical enquiry - and fun.\n\n      less description for OART-UT 1920 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1921",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14469",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GODD B06",
                    "time": "Thu 3.30 PM - 6.30 PM",
                    "open": true,
                    "professor": "Lazar, Paul"
                }
            ],
            "course_name": "Downtown Theatre",
            "description": "OART-UT 1921 Downtown Theatre \nThis course explores the ecology of artistic creation in the \"downtown\" New York scene.  New venues, performance forms and modes of expression and distribution are attracting audiences to unconventional experiences in \"the cracks of the city.\"  Three themes are explored. First, geography and location; where the non-traditional performance activity is taking place; then hierarchy, or how the venues and institutions of “downtown” relate to each other and finally; networking, or how and why audiences connect with artists and performances within in contemporary performance.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1922",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14470",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 408",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Nelson, Stephen"
                }
            ],
            "course_name": "Musical Theatre",
            "description": "OART-UT 1922 Musical Theatre \nA survey of American musical theatre, with an emphasis on its significant and unique contribution to US popular culture. Through audio and video recordings, slides, demonstrations, and visits to live performances, the course traces the musical’s relation to 19th century popular entertainments such as minstrelsy, vaudeville, and burlesque, as well as its relation to popular song and dance forms throughout the 20th century to the present day.",
            "offering": true
        },
        {
            "course_id": "OART-UT 1923",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14471",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GODD B02",
                    "time": "Tue 3.30 PM - 6.30 PM",
                    "open": true,
                    "professor": "Emelson, Beth"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1923\n\n   Producing Off-Broadway\n\nA comprehensive introduction to producing for New York's professional Off-Broadway theaters.  The goal of this course is to equip students with the skills to enable them to manage the responsibilities inherent in a professional production.  Following a review of the Off-Broadway theater movement, traditions and current trends, the class will take a practical approach to preparing a play for the stage.  Students will complete a semester long project which will have them guide a play from \"option to opening.\"  Course study will include:  play and venue selection; comprehending agreements; fundra...\n\n      more description for OART-UT 1923 »\n\n      \n\n\n\nA comprehensive introduction to producing for New York's professional Off-Broadway theaters.  The goal of this course is to equip students with the skills to enable them to manage the responsibilities inherent in a professional production.  Following a review of the Off-Broadway theater movement, traditions and current trends, the class will take a practical approach to preparing a play for the stage.  Students will complete a semester long project which will have them guide a play from \"option to opening.\"  Course study will include:  play and venue selection; comprehending agreements; fundraising; budgeting; assembling a creative team; marketing and audience development;  pre-production, performances and the closing.\n\n      less description for OART-UT 1923 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1924",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "14472",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "MEYR 261",
                    "time": "Mon,Wed 1.00 PM - 3.00 PM",
                    "open": true,
                    "professor": "Michaels, Stephen"
                },
                {
                    "format": "Studio",
                    "class_id": "14473",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL33",
                    "time": "Mon,Wed 3.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Michaels, Stephen"
                }
            ],
            "course_name": "",
            "description": "OART-UT 1924\n\n   Fundamentals of Acting I\n\nAn introduction to the central tools and skills that make up the actor’s art and craft. Through theatre games, structured improvisation, and beginning scene work, students will exercise their imaginations, learn how to work as an ensemble, and develop a sense of their bodies as expressive instruments. All techniques covered have been developed by the most celebrated 20th century theorists, such as Stanislavski, Grotowski, and Bogart, and are the same theories that underlie the training of the Tisch undergraduate acting conservatory. No prior experience necessary. Not open to Tisch Drama Majors...\n\n      more description for OART-UT 1924 »\n\n      \n\n\n\nAn introduction to the central tools and skills that make up the actor’s art and craft. Through theatre games, structured improvisation, and beginning scene work, students will exercise their imaginations, learn how to work as an ensemble, and develop a sense of their bodies as expressive instruments. All techniques covered have been developed by the most celebrated 20th century theorists, such as Stanislavski, Grotowski, and Bogart, and are the same theories that underlie the training of the Tisch undergraduate acting conservatory. No prior experience necessary. Not open to Tisch Drama Majors.\n\n      less description for OART-UT 1924 «",
            "offering": true
        },
        {
            "course_id": "OART-UT 1925",
            "course_name": "",
            "description": "OART-UT 1925\n\n   Urban Arts Workshop: New York\n\nThis course will be composed of lectures, slide shows, screenings, readings, field trips, field assignments, written reactions, discussion and blogs, as well as visits from guest speakers and artists designed to expose students to the key concepts and fundamental theories of urban studies, public art and the urban-inspired works of many great artists and writers based in New York City. Each week another “form” of urban art will be investigated, including discussions about and encounters with street photography, graffiti, sculpture, installation art, dance, performance art, parkour (freestyle s...\n\n      more description for OART-UT 1925 »\n\n      \n\n\n\nThis course will be composed of lectures, slide shows, screenings, readings, field trips, field assignments, written reactions, discussion and blogs, as well as visits from guest speakers and artists designed to expose students to the key concepts and fundamental theories of urban studies, public art and the urban-inspired works of many great artists and writers based in New York City. Each week another “form” of urban art will be investigated, including discussions about and encounters with street photography, graffiti, sculpture, installation art, dance, performance art, parkour (freestyle street gymnastics), gorilla theater, art vandalism and underground art, urban sound projects, large-scale projections, poetry, essays and short stories with an aim to understand how such art forms came into being and how they express a distinctly urban message to the inhabitants and visitors of New York City. The instructor seeks to combine the critical and theoretical with the experiential and personal in order to lead students to a deeper and more fruitful relationship with their city, the arts and themselves.\n\n      less description for OART-UT 1925 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1926",
            "course_name": "",
            "description": "OART-UT 1926\n\n   Casting and Auditioning\n\nCasting is the most recently recognized profession in film and theater. In this course, students learn how to cast a film and learn the skills casting directors employ to become indispensable members of any production, including script and character analysis, scheduling, and negotiation. Students develop protocols for evaluating resumes and auditions, and learn strategies for communicating with directors and producers to ensure the talent pool has been effectively identified. Techniques for delivering convincing and fruitful casting sessions before learning to close deals between producers, ac...\n\n      more description for OART-UT 1926 »\n\n      \n\n\n\nCasting is the most recently recognized profession in film and theater. In this course, students learn how to cast a film and learn the skills casting directors employ to become indispensable members of any production, including script and character analysis, scheduling, and negotiation. Students develop protocols for evaluating resumes and auditions, and learn strategies for communicating with directors and producers to ensure the talent pool has been effectively identified. Techniques for delivering convincing and fruitful casting sessions before learning to close deals between producers, actors and agents also are presented.\nThis class will also make students ‘audition ready’ -- equipping them with tools and techniques to better understand and get through the audition process.  The course will cover the various disciplines of theater, films, commercials and voiceovers.   Through lectures, character exercises and workshops students will learn strategies for preparing for an audition, developing characters, and working with professionals in the industry.\n\n      less description for OART-UT 1926 «",
            "offering": false
        },
        {
            "course_id": "OART-UT 1927",
            "course_name": "Auditioning",
            "description": "OART-UT 1927 Auditioning \nThis class will make students ‘audition ready’ -- equipping them with tools and techniques to better understand and get through the audition process.  The course will cover the various disciplines of theater, films, commercials and voiceovers.   Through lectures, character exercises and workshops students will learn strategies for preparing for an audition, developing characters, and working with professionals in the industry.",
            "offering": false
        },
        {
            "course_id": "OART-UT 1930",
            "course_name": "",
            "description": "OART-UT 1930\n\n   The Art of the Interview\n\nThe interview is at the heart of the documentary film and many forms of media programming, print journalism and theatrical performance. It is a basic tool in academic research. This course will analyze the skills required to produce a successful interview: selecting subjects; preparing and posing questions; and focused listening. Students will be exposed to some of the finest examples of interviews across disciplines demonstrating the range of styles and contexts for the interview. Whether with a random stranger, a family member or a well-known personality, students will develop the ability to...\n\n      more description for OART-UT 1930 »\n\n      \n\n\n\nThe interview is at the heart of the documentary film and many forms of media programming, print journalism and theatrical performance. It is a basic tool in academic research. This course will analyze the skills required to produce a successful interview: selecting subjects; preparing and posing questions; and focused listening. Students will be exposed to some of the finest examples of interviews across disciplines demonstrating the range of styles and contexts for the interview. Whether with a random stranger, a family member or a well-known personality, students will develop the ability to conduct meaningful interviews during the course of the semester.\n\n      less description for OART-UT 1930 «",
            "offering": false
        }
    ]
}