{
    "major_id": "MPAPA-GE",
    "file": "./2015-2016/Performing_Arts_Administration(MPAPA-GE).html",
    "courses": [
        {
            "course_id": "MPAPA-GE 2001",
            "classes": [
                {}
            ],
            "course_name": "Intern Adm Performing Art Centers",
            "description": "MPAPA-GE 2001 Intern Adm Performing Art Centers \nAssigned, supervised, and evaluated responsibilities at major New York cultural centers, including training in programming, publicity, development, marketing, general management, and fiscal affairs.  Open to matriculated students in the program.",
            "offering": true
        },
        {
            "course_id": "MPAPA-GE 2002",
            "classes": [
                {}
            ],
            "course_name": "Intern Adm of Art Center II",
            "description": "MPAPA-GE 2002 Intern Adm of Art Center II \nAssigned, supervised, and evaluated responsibilities at major New York cultural centers, including training in programming, publicity, development, marketing, general management, and fiscal affairs.  Open to matriculated students in the program.",
            "offering": true
        },
        {
            "course_id": "MPAPA-GE 2008",
            "course_name": "Law & Performing Arts",
            "description": "MPAPA-GE 2008 Law & Performing Arts \nIssues of law that affect the arts, e.g., contracts, liability, copyright, and labor relations.  Analyzes important legal practices that have shaped cultural institutions in this century and examines legal relationships of procedures, artists, and presenters in the performing arts.",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2105",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3744",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 261",
                    "time": "Mon 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Persons, Wende"
                }
            ],
            "course_name": "Marketing The Performing Arts",
            "description": "MPAPA-GE 2105 Marketing The Performing Arts \nInvestigation and application of marketing techniques and practices for performing arts organizations.  The aim is to develop student's abilities to select and identify effective marketing applications to increase earned revenue from all sources.  Promotional techniques such as telemarketing, brochure and advertising, and merchandising-related artistic products are examined.  Participants are required to propose, present, and defend assigned projects.",
            "offering": true
        },
        {
            "course_id": "MPAPA-GE 2120",
            "course_name": "Plnng & Fin F/ The P/a",
            "description": "MPAPA-GE 2120 Plnng & Fin F/ The P/a \nTechniques for strategic planning and managerial finance in the performing arts organization from the perspective of its chief executive officer.  Integration of skills in organizational evaluation, strategic planning, mission formulation, operations management, and finance.  Students are required to write a strategic plan for a performing arts organization.",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2130",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3745",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 288",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Wry, Brann; Persons, Wende"
                },
                {
                    "format": "Lecture",
                    "class_id": "3746",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "12WV L120",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Smith, Molly; Walters, Dennis"
                }
            ],
            "course_name": "",
            "description": "MPAPA-GE 2130\n\n   Enviroment or Performing Arts Administration\n\nIntroduction to the controlling elements affecting performing arts organizations in the United States.  In addition to examining the position of the artist in society and in the labor market, the course analyzes the relationship of the environment to the production, marketing, and distribution of artistic services.  Students study the derivation of the present environment, the relevance and import of tax exemption and nonprofit status, the organizational structures for arts organizations, the role of funding on all levels, and the strategies and techniques needed to manage performing arts orga...\n\n      more description for MPAPA-GE 2130 »\n\n      \n\n\n\nIntroduction to the controlling elements affecting performing arts organizations in the United States.  In addition to examining the position of the artist in society and in the labor market, the course analyzes the relationship of the environment to the production, marketing, and distribution of artistic services.  Students study the derivation of the present environment, the relevance and import of tax exemption and nonprofit status, the organizational structures for arts organizations, the role of funding on all levels, and the strategies and techniques needed to manage performing arts organizations effectively.\n\n      less description for MPAPA-GE 2130 «",
            "offering": true
        },
        {
            "course_id": "MPAPA-GE 2131",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3747",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 261",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "McClimon, Timothy; Webb, Duncan"
                }
            ],
            "course_name": "Prin/Prac Performing Arts Administration",
            "description": "MPAPA-GE 2131 Prin/Prac Performing Arts Administration \nCovers the areas of long-range planning, application for tax exemption, program budgeting, incorporation, demographics, board and constituency building, staff development, and community development as related to the establishment and viability of performing arts organizations.  Students participate in a class project and case studies that integrate administrative, planning, programing development, and marketing skills.",
            "offering": true
        },
        {
            "course_id": "MPAPA-GE 2132",
            "course_name": "Devel for The Perf Arts",
            "description": "MPAPA-GE 2132 Devel for The Perf Arts \nRevenue generation for the performing arts organization.  Examines development and fund-raising in the performing arts organization with a view to students learning strategies and acquiring skills to raise funds from disparate sources.  Development is examined in its potential for fulfilling planning objectives, community development, and stability for the performing arts organization.",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2133",
            "course_name": "Governance of Perf Arts",
            "description": "MPAPA-GE 2133 Governance of Perf Arts \nThe roles and responsibilities of trustees and officers who govern nonprofit, tax-exempt arts organizations.  How the planning, budgeting, personnel development, and marketing policies of arts endeavors are determined.",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2150",
            "course_name": "Envrmnt/Motion Picture Mgmnt/Finance",
            "description": "MPAPA-GE 2150 Envrmnt/Motion Picture Mgmnt/Finance \nThis course examines principles and practices in the business of film, e.g., the business management, finance, marketing and licensing aspects of the motion picture industry. Topics include: motion picture distribution, motion picture exhibition, motion picture marketing, motion picture licensing, merchandising, ancillary exploitation of filmed works (including premium and free television and video/DVD applications) and motion picture intellectual property acquisition.",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2215",
            "course_name": "",
            "description": "MPAPA-GE 2215\n\n   Iss/Pract Art in Admin: European Context\n\nThis course offers the student, whether graduate or arts administration practitioner, an intensive experience in learning about cultural policies and arts management practices in at least two European countries. The Arts Administration Study Abroad is comprised of a series of lectures, site visits, case studies, discussion sessions and presentations. Issues change from year to year as cultural policies develop in chosen venues. Students examine a combination of policy and practice, meet with arts administrators and policy makers, and present case study analyses on the basis of their lectures a...\n\n      more description for MPAPA-GE 2215 »\n\n      \n\n\n\nThis course offers the student, whether graduate or arts administration practitioner, an intensive experience in learning about cultural policies and arts management practices in at least two European countries. The Arts Administration Study Abroad is comprised of a series of lectures, site visits, case studies, discussion sessions and presentations. Issues change from year to year as cultural policies develop in chosen venues. Students examine a combination of policy and practice, meet with arts administrators and policy makers, and present case study analyses on the basis of their lectures and onsite visits.\n\n      less description for MPAPA-GE 2215 «",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2222",
            "course_name": "Sem Cult Pol:Issues in Current  Perf Arts Admin",
            "description": "MPAPA-GE 2222 Sem Cult Pol:Issues in Current  Perf Arts Admin \nStudy and preparation of papers on selected issues and cases in arts administration.  Selected readings.  Major papers required.",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2225",
            "course_name": "Cultural Tourism in Arts",
            "description": "MPAPA-GE 2225 Cultural Tourism in Arts \nThis course examines the interactive relationship between culture and tourism. By taking a case approach the class analyzes the business practices of the arts as a tourism enterprise. The cases will highlight marketing principles drawn from readings, discussions, and guest lectures. Lectures, discussions and guest speakers will accompany text and journal readings. Case studies will provide concrete examples to accompany theoretical concepts.",
            "offering": false
        },
        {
            "course_id": "MPAPA-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3748",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Wry, Brann",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "MPAPA-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        }
    ]
}