{
    "major_id": "PERF-UT",
    "file": "./2015-2016/Performance_Studies_(PERF-UT).html",
    "courses": [
        {
            "course_id": "PERF-UT 101",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14745",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PERF-UT  101\n\n   Introduction to Performance Studies\n\nThis course is an introduction to the field of performance studies. In this course, performance will be broadly construed to include aesthetic performance (performance art, theater, music, dance, and visual culture) and everyday presentations of self. We will study the history of the field and its relation to other fields (anthropology, theatre studies, philosophy, dance studies, feminism, political science, critical race theory, legal studies, etc.) and ask questions of how the study of performance can help us to understand contemporary questions of aesthetics, politics, and social culture. W...\n\n      more description for PERF-UT  101 »\n\n      \n\n\n\nThis course is an introduction to the field of performance studies. In this course, performance will be broadly construed to include aesthetic performance (performance art, theater, music, dance, and visual culture) and everyday presentations of self. We will study the history of the field and its relation to other fields (anthropology, theatre studies, philosophy, dance studies, feminism, political science, critical race theory, legal studies, etc.) and ask questions of how the study of performance can help us to understand contemporary questions of aesthetics, politics, and social culture. We will study the theory and history of the field as grounded in documented performances in addition to attending live performances in New York City. This course will place particular emphasis on political performance (in the US and abroad), queer, and minority performance.\n\n      less description for PERF-UT  101 «",
            "offering": true
        },
        {
            "course_id": "PERF-UT 102",
            "course_name": "Performance Theory",
            "description": "PERF-UT  102 Performance Theory",
            "offering": false
        },
        {
            "course_id": "PERF-UT 103",
            "course_name": "",
            "description": "PERF-UT  103\n\n   Theatre and Performance in New York\n\nThis course asks students to consider a wide variety of performances in New York: theatrical, choreographic, spontaneous, religious, and political. Through contextual readings and close analyses of performances attended, we ask not only how the metropolis makes possible such a diverse performance culture, but also how these performances help to constitute our understanding of the city's identity.  We are particularly attentive to the relation of performance to communities for and by whom they are staged. Public and participatory performances, as well as theatrically and ethnologically framed o...\n\n      more description for PERF-UT  103 »\n\n      \n\n\n\nThis course asks students to consider a wide variety of performances in New York: theatrical, choreographic, spontaneous, religious, and political. Through contextual readings and close analyses of performances attended, we ask not only how the metropolis makes possible such a diverse performance culture, but also how these performances help to constitute our understanding of the city's identity.  We are particularly attentive to the relation of performance to communities for and by whom they are staged. Public and participatory performances, as well as theatrically and ethnologically framed ones, will be examined. Open to Non-Majors.\n\n      less description for PERF-UT  103 «",
            "offering": false
        },
        {
            "course_id": "PERF-UT 104",
            "course_name": "",
            "description": "PERF-UT  104\n\n   Contemporary Experimntal Choreography\n\nThis course will examine the work of diverse choreographers during the latter part of the twentieth century and the beginning of the twenty-first. Through a consideration of experimentation in the realm of dance, we will ask how techniques of the body can change not merely our notions of dance aesthetics, but our fundamental understanding of the constitution of the self. We will look at both Western and non-Western efforts to challenge dance “tradition”, and to engage philosophical issues through bodily practice. How have these experiments reoriented our way of thinking about the relationship ...\n\n      more description for PERF-UT  104 »\n\n      \n\n\n\nThis course will examine the work of diverse choreographers during the latter part of the twentieth century and the beginning of the twenty-first. Through a consideration of experimentation in the realm of dance, we will ask how techniques of the body can change not merely our notions of dance aesthetics, but our fundamental understanding of the constitution of the self. We will look at both Western and non-Western efforts to challenge dance “tradition”, and to engage philosophical issues through bodily practice. How have these experiments reoriented our way of thinking about the relationship between dance and the other arts, and more broadly between art, philosophy, and the social order?\n\n      less description for PERF-UT  104 «",
            "offering": false
        },
        {
            "course_id": "PERF-UT 105",
            "course_name": "",
            "description": "PERF-UT  105\n\n   Voice and Peformance\n\nSituated at the heart of communication and expression, the voice is of vast importance to both social performance and much of the performing arts. This course examines some of the most interesting theories and practices of the voice in performance as a way to understand how the voice functions in society at large. Intended for both thinkers and doers, the course will examine philosophical theories of the voice as well as explore multiple practices, from poetry to song to extended technique to everyday speech, with particular attention to our own vocal practices. It will offer a background in t...\n\n      more description for PERF-UT  105 »\n\n      \n\n\n\nSituated at the heart of communication and expression, the voice is of vast importance to both social performance and much of the performing arts. This course examines some of the most interesting theories and practices of the voice in performance as a way to understand how the voice functions in society at large. Intended for both thinkers and doers, the course will examine philosophical theories of the voice as well as explore multiple practices, from poetry to song to extended technique to everyday speech, with particular attention to our own vocal practices. It will offer a background in the fundamentals of describing the voice in both the humanities and the sciences as well as explore the practical and political ramifications of these descriptions. It is not necessary to be a vocal performer (singer, actor, etc.) to enjoy this class. Students will be given the choice for their final projects to be either a paper or an original performance.\n\n      less description for PERF-UT  105 «",
            "offering": false
        },
        {
            "course_id": "PERF-UT 106",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14744",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PERF-UT  106\n\n   Gender Performance\n\nGender and Performance introduces students to the question of how gender identity is performed. Performance will be broadly construed to include aesthetic performance (performance art, theater, music, dance, and visual/sensorial culture), everyday presentations of self, and performative relations to space, time, species, politics, media, and popular culture. We will ask, in particular, how performance correlates with the expression of gender, feminism and sexuality. Our approach will be both interdisciplinary (employing diverse critical methodologies) and intersectional (considering the relati...\n\n      more description for PERF-UT  106 »\n\n      \n\n\n\nGender and Performance introduces students to the question of how gender identity is performed. Performance will be broadly construed to include aesthetic performance (performance art, theater, music, dance, and visual/sensorial culture), everyday presentations of self, and performative relations to space, time, species, politics, media, and popular culture. We will ask, in particular, how performance correlates with the expression of gender, feminism and sexuality. Our approach will be both interdisciplinary (employing diverse critical methodologies) and intersectional (considering the relationships between gender and other markers of identity, including race, nation, religion and class).\n\n      less description for PERF-UT  106 «",
            "offering": true
        },
        {
            "course_id": "PERF-UT 200",
            "course_name": "",
            "description": "PERF-UT  200\n\n   Performance Studies: An Introduction with Richard Schechner\n\nPerformance Studies -- An Introduction explores the wide world of performance - from theatre, dance, and music to ritual, play, political campaigns, social media, and the performances of everyday life. Performance studies also ranges across cultures -- Asia, Africa, the Caribbean, Europe, the Americas. And it spans historical periods from the art of the paleolithic caves to YouTube and the avant-garde. This course is devised by Richard Schechner, one of the pioneers of performance studies, in dialogue with more than a dozen expert scholars and artists. Performance Studies -- An Introduction pu...\n\n      more description for PERF-UT  200 »\n\n      \n\n\n\nPerformance Studies -- An Introduction explores the wide world of performance - from theatre, dance, and music to ritual, play, political campaigns, social media, and the performances of everyday life. Performance studies also ranges across cultures -- Asia, Africa, the Caribbean, Europe, the Americas. And it spans historical periods from the art of the paleolithic caves to YouTube and the avant-garde. This course is devised by Richard Schechner, one of the pioneers of performance studies, in dialogue with more than a dozen expert scholars and artists. Performance Studies -- An Introduction puts students in dialogue with the most important ideas, approaches, theories, and questions of this dynamic, new academic field.\nPerformance Studies -- An Introduction is a \"flipped\" course: students will read and watch lessons online, blog about the material, and participate in a weekly interactive seminar guided by Professor Erin B. Mee -- a theatre director and scholar -- who has worked with Schechner for years.\n\n      less description for PERF-UT  200 «",
            "offering": false
        },
        {
            "course_id": "PERF-UT 202",
            "course_name": "Queer Politics and Performance",
            "description": "PERF-UT  202 Queer Politics and Performance",
            "offering": false
        },
        {
            "course_id": "PERF-UT 203",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14753",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PERF-UT  203\n\n   Race and Performance\n\nThis semester, the course will consider various forms of performance (including performance art, visual art, sound art, literature, politics, and performance of everyday life) by artists of color to think about belonging and alternative forms of world-making. This course will ask: what difference might it make to think of race as performative? How might the analytic of performance equip us in this course to identify and enact anti-xenophobic strategies for everyday practice? We will explore these questions through engagement with cultural texts, including scholarship in critical ethnic studies...\n\n      more description for PERF-UT  203 »\n\n      \n\n\n\nThis semester, the course will consider various forms of performance (including performance art, visual art, sound art, literature, politics, and performance of everyday life) by artists of color to think about belonging and alternative forms of world-making. This course will ask: what difference might it make to think of race as performative? How might the analytic of performance equip us in this course to identify and enact anti-xenophobic strategies for everyday practice? We will explore these questions through engagement with cultural texts, including scholarship in critical ethnic studies, queer of color critique, and affect studies.\n\n      less description for PERF-UT  203 «",
            "offering": true
        },
        {
            "course_id": "PERF-UT 304",
            "course_name": "",
            "description": "PERF-UT  304\n\n   Performance and Technology\n\nOn blogs, Twitter, Facebook, Ello, Tumblr, email, SoundCloud, YouTube, and more, we are constantly performing using technology. Performance Studies has long been concerned with technology, but it is only recently concerned with questions brought to the fore by new technologies and new technological practices, particularly on the Internet. This survey course requires us to consider the relationship between Performance Studies as a discipline (one that incorporates performance theory, critical theory, feminist theory, queer theory, and other theoretical genres) with technology, particularly the ...\n\n      more description for PERF-UT  304 »\n\n      \n\n\n\nOn blogs, Twitter, Facebook, Ello, Tumblr, email, SoundCloud, YouTube, and more, we are constantly performing using technology. Performance Studies has long been concerned with technology, but it is only recently concerned with questions brought to the fore by new technologies and new technological practices, particularly on the Internet. This survey course requires us to consider the relationship between Performance Studies as a discipline (one that incorporates performance theory, critical theory, feminist theory, queer theory, and other theoretical genres) with technology, particularly the Internet. Open to Non-Majors.\n\n      less description for PERF-UT  304 «",
            "offering": false
        },
        {
            "course_id": "PERF-UT 400",
            "course_name": "Final Projects in Performance Studies",
            "description": "PERF-UT  400 Final Projects in Performance Studies",
            "offering": false
        }
    ]
}