{
    "major_id": "PHTI-GT",
    "file": "./2015-2016/Photography_and_Imaging_(PHTI-GT).html",
    "courses": [
        {
            "course_id": "PHTI-GT 1500",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "5864",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Willis, Deborah",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "PHTI-GT 1500 Independent Study",
            "offering": true
        },
        {
            "course_id": "PHTI-GT 2001",
            "course_name": "",
            "description": "PHTI-GT 2001\n\n   Photography I\n\nMany photographers who have been utilizing digital cameras are turning (and returning) to traditional, silver-based film and papers. This intensive course is designed to introduce and explore the practical and creative applications of analog photography. All fundamental analog camera applications will be covered, including 35mm and 120mm medium roll-film formats as well as the larger 4x5 view camera systems, utilizing sheet film. Attention will be given to the special character and unique possibilities of each of these format categories, from the responsive immediacy of 35mm to the high-resolu...\n\n      more description for PHTI-GT 2001 »\n\n      \n\n\n\nMany photographers who have been utilizing digital cameras are turning (and returning) to traditional, silver-based film and papers. This intensive course is designed to introduce and explore the practical and creative applications of analog photography. All fundamental analog camera applications will be covered, including 35mm and 120mm medium roll-film formats as well as the larger 4x5 view camera systems, utilizing sheet film. Attention will be given to the special character and unique possibilities of each of these format categories, from the responsive immediacy of 35mm to the high-resolution and perspective control of view camera options. Students will learn essential composition and optical principles and metering techniques. Supported by a comprehensive lab facility, students will learn film processing and archival projection print enlarging methods as well as the basics of print finishing and presentation. Classes will incorporate slide lectures of important historical and contemporary imagery, hands-on studio and laboratory demonstrations, critiques of student work and field trips. For those who may wish to combine analog image capture with digital printing alternatives, negative scanning fundamentals will be introduced at the conclusion of the course. There is a lab fee charged for this course.\n\n      less description for PHTI-GT 2001 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2002",
            "course_name": "",
            "description": "PHTI-GT 2002\n\n   Photography II\n\nThis course is designed for those who have completed basic courses in either analog B&W or digital photography. Recommended for transfer students. Utilizing medium format (120mm roll film) and large format (4”x5” and 8”x10” sheet film) cameras, students will explore the special creative advantages of working with larger format films and cameras. Even as digital cameras have replaced 35mm analog cameras, the higher resolution and creative flexibility of medium and large format cameras afford artists the opportunity to render their subjects with greater fidelity and at a larger scale. For some, ...\n\n      more description for PHTI-GT 2002 »\n\n      \n\n\n\nThis course is designed for those who have completed basic courses in either analog B&W or digital photography. Recommended for transfer students. Utilizing medium format (120mm roll film) and large format (4”x5” and 8”x10” sheet film) cameras, students will explore the special creative advantages of working with larger format films and cameras. Even as digital cameras have replaced 35mm analog cameras, the higher resolution and creative flexibility of medium and large format cameras afford artists the opportunity to render their subjects with greater fidelity and at a larger scale. For some, the more deliberate process of working at a slower pace can significantly enhance their interpretation of portraits, still-lifes and architectural subjects.       \n\nLectures will consist of studio and lab demonstrations, slides presentations of historical and contemporary work, and critiques of assignments. All students will be expected to complete a modest portfolio based on a subject of their own choosing.  Representative medium and large format cameras, as well as tripods and light meters will be provided.  Students will have the opportunity to work in a professional lab with excellent technical support. Those who successfully complete this course can expect to have practical experience with camera operation, advanced metering, film processing for contrast control, analog printing, as well as negative scanning for digital output of their negatives. Demonstration materials will be furnished. Participants will be required to provide film and paper for the execution of their assignments.\n\nThis course is charged a lab fee of $372.00.\n\n      less description for PHTI-GT 2002 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2003",
            "course_name": "Multimedia Topics:",
            "description": "PHTI-GT 2003 Multimedia Topics:",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2004",
            "course_name": "Screen Based Projects",
            "description": "PHTI-GT 2004 Screen Based Projects",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2006",
            "course_name": "Documentary Strategies for Contemporary Culture",
            "description": "PHTI-GT 2006 Documentary Strategies for Contemporary Culture",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2013",
            "course_name": "",
            "description": "PHTI-GT 2013\n\n   Lighting:\n\nThis class teaches lighting as a series of the most common lighting problems encountered in professional photography and cinematography.  The course philosophy is that the most complex and difficult lighting problems are really just combinations of small, easily resolved, problems. Starting with basic three-point lighting for portraiture using simple continuous source lighting, the course will progress quickly to extremely complex set ups using electronic flash as well as lighting for the new generation of hybrid dslr’s  (video/still camera) as it moves through multiple environments. Subjects ...\n\n      more description for PHTI-GT 2013 »\n\n      \n\n\n\nThis class teaches lighting as a series of the most common lighting problems encountered in professional photography and cinematography.  The course philosophy is that the most complex and difficult lighting problems are really just combinations of small, easily resolved, problems. Starting with basic three-point lighting for portraiture using simple continuous source lighting, the course will progress quickly to extremely complex set ups using electronic flash as well as lighting for the new generation of hybrid dslr’s  (video/still camera) as it moves through multiple environments. Subjects covered include: Lighting for portraits, still life, fashion, interiors, documentary, and exterior location lighting using battery powered flash. Location scouting and planning according to location limitations. Color temperature and color control.  Light shaping and control. Students will learn how to use:  Digital SLR’s, medium format cameras, Leaf Aptus electronic capture, direct tethered capture using Adobe Lightroom, continuous lighting, electronic flash, color temperature meters and custom white balance profiles as well as the basics of video/sound capture. Lighting equipment is provided. There is a lab fee charged for this course.\n\n      less description for PHTI-GT 2013 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2014",
            "course_name": "",
            "description": "PHTI-GT 2014\n\n   Large Format\n\nPrerequisite: Photography & Imaging: Analog and Digital. Please see the Notes section below.\n\nMany artists turn to 4x5 and 8x10 large-format cameras for the creative control that view cameras afford, as well as for the high resolution and potentially large scale of the resulting prints. This course introduces the special characteristics of large format photography, including perspective control, creative approaches to selective focus and metering strategies facilitated by single negative processing. The exposure and development methods known as the Zone System will also be considered. Because ...\n\n      more description for PHTI-GT 2014 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging: Analog and Digital. Please see the Notes section below.\n\nMany artists turn to 4x5 and 8x10 large-format cameras for the creative control that view cameras afford, as well as for the high resolution and potentially large scale of the resulting prints. This course introduces the special characteristics of large format photography, including perspective control, creative approaches to selective focus and metering strategies facilitated by single negative processing. The exposure and development methods known as the Zone System will also be considered. Because large format work is physically demanding and relatively slow, this is also an opportunity to work more deliberately and, in some respects, more consciously. It may also inform one’s understanding of the methods and approaches of 19th and early 20th Century artists. \n\nThe high resolution of large format description can often produce a compelling image of relatively static subject matter that might not otherwise succeed if recorded in smaller formats. Surfaces and details evoke a more “complete”, or even tactile appreciation of some subjects. Following a series of practical exercises during the first half of the course, students are expected to develop an appropriate project on which to concentrate and apply their evolving skills in the production of an original and integrated body of work. Technical material covered includes different large format camera types and applications, lenses and optics, metering, filters, special B&W developers, large format printing and scanning for digital output. Early historical processes are introduced, current exhibitions of artists and photographers in New York are discussed and field trips are arranged. A variety of cameras, lenses and tripods are available for student use.\n\n      less description for PHTI-GT 2014 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2015",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "5774",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Photojournalism",
            "description": "PHTI-GT 2015 Photojournalism",
            "offering": true
        },
        {
            "course_id": "PHTI-GT 2016",
            "course_name": "Directed Projects",
            "description": "PHTI-GT 2016 Directed Projects \nThis is a multi-topic course. Please see the Notes section below for more information.",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2017",
            "course_name": "Photo and Performance",
            "description": "PHTI-GT 2017 Photo and Performance",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2021",
            "course_name": "",
            "description": "PHTI-GT 2021\n\n   Indesign\n\nThis course is devoted to a different level of understanding the design and production of making a book. On the first day of class, students bring in digital versions of their art and decide to translate it into a printed piece.  The class we’ll focus on book design. Students will begin to explore InDesign and learn how to use the program to create a publication, deciding on the size nand order of image and where text will go.  On the second day of class students learn how to work with type. The class explores how to make type work for you and what typefaces work best depending on your design ...\n\n      more description for PHTI-GT 2021 »\n\n      \n\n\n\nThis course is devoted to a different level of understanding the design and production of making a book. On the first day of class, students bring in digital versions of their art and decide to translate it into a printed piece.  The class we’ll focus on book design. Students will begin to explore InDesign and learn how to use the program to create a publication, deciding on the size nand order of image and where text will go.  On the second day of class students learn how to work with type. The class explores how to make type work for you and what typefaces work best depending on your design and art. The class will talk about image pacing and the flow of text throughout a publication. On the third day of class, homework is reviewed and InDesign files are revised if needed. The class then turns to production. We will go over each file and make it as final as possible and ready for print.  The class will also discuss the different ways to get your document published and how to do each one. In the beginning of this course the students will walk into the classroom with a loose body of work and leave, after the third day, with their work organized into a book format. This course is charged a lab fee of $175.00.\n\n      less description for PHTI-GT 2021 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2025",
            "course_name": "Color Theory & Printing",
            "description": "PHTI-GT 2025 Color Theory & Printing",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2030",
            "course_name": "Directed Projects: I",
            "description": "PHTI-GT 2030 Directed Projects: I \nThis is a multi-topic course. Please see the notes below for more information.",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2100",
            "course_name": "Business of Art",
            "description": "PHTI-GT 2100 Business of Art",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2101",
            "course_name": "Social History of Photography",
            "description": "PHTI-GT 2101 Social History of Photography",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2102",
            "course_name": "Aesthetic History of Photography",
            "description": "PHTI-GT 2102 Aesthetic History of Photography",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2115",
            "course_name": "",
            "description": "PHTI-GT 2115\n\n   Picture Essay for Paper and Pixel\n\nThis course is designed for students that are taking all of the Human Rights courses. However there is space available to other students interested in this topic.  Please contact the Department for permission to register.\n\nThe course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of models from magazines, newspapers, books, exhibitions and digital environment...\n\n      more description for PHTI-GT 2115 »\n\n      \n\n\n\nThis course is designed for students that are taking all of the Human Rights courses. However there is space available to other students interested in this topic.  Please contact the Department for permission to register.\n\nThe course will focus on the long-term photographic essay. It will look at both linear and non-linear forms of the essay, with and without the use of text, sound, video and other media. Intent, ethics, grammar and presentation issues will be considered. There will be many references to a variety of models from magazines, newspapers, books, exhibitions and digital environments, including the Web. The impact of media strategies, both contemporary and historical, on human rights issues will be a central component of the class.\n\n      less description for PHTI-GT 2115 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2116",
            "course_name": "",
            "description": "PHTI-GT 2116\n\n   Human Rights and Photography\n\nThis class will focus on photography, representation, and human rights. Specifically, we will examine the crucial role that photography plays in the global human rights movement. Many photographers who once considered themselves to be working within a documentary tradition now conceive of themselves as also working within a human rights framework.  In order to understand this change, we need to view the many historical and contemporary movements related to documentary photography. We will also explore critical issues surrounding the ethics and politics of photographic representation and the di...\n\n      more description for PHTI-GT 2116 »\n\n      \n\n\n\nThis class will focus on photography, representation, and human rights. Specifically, we will examine the crucial role that photography plays in the global human rights movement. Many photographers who once considered themselves to be working within a documentary tradition now conceive of themselves as also working within a human rights framework.  In order to understand this change, we need to view the many historical and contemporary movements related to documentary photography. We will also explore critical issues surrounding the ethics and politics of photographic representation and the different mediums (such as traditional print media versus new media) used to express human rights issues. We will also carefully place photography and visual representation within the wider field of human rights. And finally, we will study the impact photography has had on social change and the many possibilities photographs may have in the future struggle for universal human rights. This course is charged a lab fee of $339.00.\n\n      less description for PHTI-GT 2116 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2120",
            "course_name": "Advanced History Sem:",
            "description": "PHTI-GT 2120 Advanced History Sem:",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2129",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5901",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 814",
                    "time": "Tue 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Rice, Shelley"
                }
            ],
            "course_name": "Toward a Critical Vocabulary",
            "description": "PHTI-GT 2129 Toward a Critical Vocabulary",
            "offering": true
        },
        {
            "course_id": "PHTI-GT 2133",
            "course_name": "Contemporary Afican Photo",
            "description": "PHTI-GT 2133 Contemporary Afican Photo",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2200",
            "course_name": "Oral/Visual Histories",
            "description": "PHTI-GT 2200 Oral/Visual Histories",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2201",
            "course_name": "Senior Directed Project",
            "description": "PHTI-GT 2201 Senior Directed Project",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2202",
            "course_name": "Advanced Lighting",
            "description": "PHTI-GT 2202 Advanced Lighting",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2203",
            "course_name": "",
            "description": "PHTI-GT 2203\n\n   Editorial Photography for New Media\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the int...\n\n      more description for PHTI-GT 2203 »\n\n      \n\n\n\nPrerequisite: Photography II or permission from the Department.\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and written text. A lab fee of $365.00 is charged for this course.\n\n      less description for PHTI-GT 2203 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2204",
            "course_name": "",
            "description": "PHTI-GT 2204\n\n   Adv. Dir Projects: Photo and Human Rights\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and writt...\n\n      more description for PHTI-GT 2204 »\n\n      \n\n\n\nThis class is designed to train aspiring photographers/journalists in the unique production techniques and tools of hybrid still/video Dslr cameras such as the Canon 5D Mark II.  The course also addresses and familiarizes the student with the emergent landscape for new technologies in digital presentation, journalism and story telling using photography, video, sound, and the written word. Students will be thoroughly trained in production tools and techniques with hybrid Dslr cameras and other recording devices, as well as the integration of content using Adobe Lightroom 3, Final Cut, and written text.  This course is charged a lab fee of $350.00.\n\n      less description for PHTI-GT 2204 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2214",
            "course_name": "Historical Processes",
            "description": "PHTI-GT 2214 Historical Processes",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2216",
            "course_name": "",
            "description": "PHTI-GT 2216\n\n   Advanced Documentary\n\nPrerequisites: Photojournalism I or the equivalent experience\n\nBeginning photojournalists develop a project, and acquire the practical knowledge to enter the profession. Students will work with a director of photography to develop a long-term project with an eye-toward publication (print, blog, self-published). Students will develop an idea; consider similar projects/competition; research appropriate publications/outlets for their work; craft a pitch; present to editors; explore alternative modes of production and distribution; and learn about practical business considerations (representation,...\n\n      more description for PHTI-GT 2216 »\n\n      \n\n\n\nPrerequisites: Photojournalism I or the equivalent experience\n\nBeginning photojournalists develop a project, and acquire the practical knowledge to enter the profession. Students will work with a director of photography to develop a long-term project with an eye-toward publication (print, blog, self-published). Students will develop an idea; consider similar projects/competition; research appropriate publications/outlets for their work; craft a pitch; present to editors; explore alternative modes of production and distribution; and learn about practical business considerations (representation, rights, etc).\n\nStudents should come to the first meeting with a one-page project proposal in hand.\n\nThere is a lab fee charged for this course.\n\n      less description for PHTI-GT 2216 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2220",
            "course_name": "Community Colaborations",
            "description": "PHTI-GT 2220 Community Colaborations",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2230",
            "course_name": "Crafts: Making Ideas Concrete",
            "description": "PHTI-GT 2230 Crafts: Making Ideas Concrete",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2236",
            "course_name": "Advanced Digital Printing",
            "description": "PHTI-GT 2236 Advanced Digital Printing",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2238",
            "course_name": "",
            "description": "PHTI-GT 2238\n\n   Web Design\n\nThis course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students...\n\n      more description for PHTI-GT 2238 »\n\n      \n\n\n\nThis course introduces students to the basics of web design. Students will learn elementary coding using xHTML and CSS using Adobe Dreamweaver. Concepts such as effective design, usability, organization of content, and web publishing will be discussed. Our main focus will be on conceptual and aesthetic aspects of designing for the web. Skills will be developed and demonstrated through the execution of studio and homework web design projects. Works will be critiqued in class to enhance the development of creative and analytical skills. Course Objectives: upon completion of this course, students will: 1. Know how to create basic web pages using xHTML and CSS, 2. Become comfortable using Dreamweaver to aid in web design and construction, 3. Gain an understanding of the unique design problems involved in web design, 4. Develop an ability to design and problem-solve through the creation of their own projects, and 5. Evaluate and explore effective web-based design and the web as a medium. There is a lab fee charged for this course.\n\n      less description for PHTI-GT 2238 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2239",
            "course_name": "Web Design II",
            "description": "PHTI-GT 2239 Web Design II",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2245",
            "course_name": "",
            "description": "PHTI-GT 2245\n\n   Photoshop\n\nPrerequisite: Basic computer experience. \n\nThis three-week course focusing on Photoshop explores the possibilities for image manipulation and the steps involved in learning to translate traditional darkroom skills into digital artwork and montage. Starting from the empty canvas, we look at all the basic elements of Photoshop, including selection tools, text, scale, retouching, and collage. Introducing the principles of layers and masks we will look at creating composite images from photographic images and web sources. We also cover scanning negatives and flat artwork as well as color adjustmen...\n\n      more description for PHTI-GT 2245 »\n\n      \n\n\n\nPrerequisite: Basic computer experience. \n\nThis three-week course focusing on Photoshop explores the possibilities for image manipulation and the steps involved in learning to translate traditional darkroom skills into digital artwork and montage. Starting from the empty canvas, we look at all the basic elements of Photoshop, including selection tools, text, scale, retouching, and collage. Introducing the principles of layers and masks we will look at creating composite images from photographic images and web sources. We also cover scanning negatives and flat artwork as well as color adjustment using levels and curves. We look at all aspects of image creation and enhancement with equal importance given to the aesthetic effect and technical ease. By working on a creative project, students use the software to convey their ideas in this digital environment. Class time is divided between work-in-progress sessions, critiques, and lectures. Because of the holiday, that session will be rescheduled sometime during the three weeks of class. This course is charged a lab fee.\n\n      less description for PHTI-GT 2245 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2247",
            "course_name": "",
            "description": "PHTI-GT 2247\n\n   Digital Printing\n\nPrerequisite: Photography I, Digital Tools for Non-Majors, or permission from the Department.\n\nThis 3-week workshop will explore a range of digital imaging and printing resources. The aesthetic and technical aspects of color will be discussed along with the implication of scanning, file preparation, resolution requirements and color management for printout. The subtleties of various output devices from laser and ink jet printers to large format ink jet plotters and digital C printing will be covered. The objective will be to discover and execute a printing method best suited for individual pro...\n\n      more description for PHTI-GT 2247 »\n\n      \n\n\n\nPrerequisite: Photography I, Digital Tools for Non-Majors, or permission from the Department.\n\nThis 3-week workshop will explore a range of digital imaging and printing resources. The aesthetic and technical aspects of color will be discussed along with the implication of scanning, file preparation, resolution requirements and color management for printout. The subtleties of various output devices from laser and ink jet printers to large format ink jet plotters and digital C printing will be covered. The objective will be to discover and execute a printing method best suited for individual projects. Students will have the opportunity to complete a small project of their own. Class time will be devoted to lectures and demonstrations on scanning, color and color printing, group critiques and possible field trips. Although the department will have a few digital cameras for student use, it is highly recommended that students own their own digital camera. A lab fee of $182.50 is charged for this course.\n\n      less description for PHTI-GT 2247 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2250",
            "course_name": "Advanced Web Design",
            "description": "PHTI-GT 2250 Advanced Web Design",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2251",
            "course_name": "Digital Camera",
            "description": "PHTI-GT 2251 Digital Camera",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2260",
            "course_name": "",
            "description": "PHTI-GT 2260\n\n   Advanced Photoshop\n\nPrerequisite: Photography & Imaging Digital, Photoshop or permission of the Department.\n\nIn this intermediate workshop students will build on their existing knowledge of Photoshop. Whether you want to work in print, on the web, or in video, Photoshop offers extraordinary creative freedom to manipulate existing images, create new artwork, and integrate basic graphic design elements. Emphasis in this class will be on using Photoshop for image manipulation as well as on graphic design principles and non-destructive image editing techniques. You will learn to construct images from photographic sou...\n\n      more description for PHTI-GT 2260 »\n\n      \n\n\n\nPrerequisite: Photography & Imaging Digital, Photoshop or permission of the Department.\n\nIn this intermediate workshop students will build on their existing knowledge of Photoshop. Whether you want to work in print, on the web, or in video, Photoshop offers extraordinary creative freedom to manipulate existing images, create new artwork, and integrate basic graphic design elements. Emphasis in this class will be on using Photoshop for image manipulation as well as on graphic design principles and non-destructive image editing techniques. You will learn to construct images from photographic source material, as well as starting from scratch using Photoshop’s design and media tools.  While grounding in the basics of Photoshop and digital photography is assumed, early sessions will review basic tools to expand and better control these fundamental building blocks of digital imaging. Specifically we will explore creating and using layer masks and image effects, creating paths and shapes, custom fills and patterns. We will review working with layers, adjustment layers and text layers, as well as reviewing the details of resizing, sharpening, and image resolution for various output destinations. The course will be project-based with several short assignments and a final project of the students’ choosing. There is a lab fee charged for this course.\n\n      less description for PHTI-GT 2260 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2270",
            "course_name": "",
            "description": "PHTI-GT 2270\n\n   Digital Tools/Multimedia Projects\n\nThis course will explore a variety of digital media tools that are useful for a documentary photographer. The class will explore issues relating to the digital camera, as well as to image capture, preservation, presentation and transmission. Lighting, audio interviewing, and the production of short videos will also be covered at a basic level. Students work on several small assignments to experiment with software and hardware, and will have the opportunity to complete a small project of their own. This course is intended to give students a fundamental understanding of the efficiencies and poss...\n\n      more description for PHTI-GT 2270 »\n\n      \n\n\n\nThis course will explore a variety of digital media tools that are useful for a documentary photographer. The class will explore issues relating to the digital camera, as well as to image capture, preservation, presentation and transmission. Lighting, audio interviewing, and the production of short videos will also be covered at a basic level. Students work on several small assignments to experiment with software and hardware, and will have the opportunity to complete a small project of their own. This course is intended to give students a fundamental understanding of the efficiencies and possibilities of the digital realm. This class is specifically intended for students enrolled in Photography and Human Rights courses, but is open to others as well. This course is charged a lab fee of $175.00.\n\n      less description for PHTI-GT 2270 «",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2300",
            "course_name": "Multimedia Topic:",
            "description": "PHTI-GT 2300 Multimedia Topic:",
            "offering": false
        },
        {
            "course_id": "PHTI-GT 2409",
            "course_name": "Graduate Playwriting",
            "description": "PHTI-GT 2409 Graduate Playwriting",
            "offering": false
        }
    ]
}