{
    "major_id": "PHYED-AD",
    "file": "./2015-2016/Physical_Education_(PHYED-AD).html",
    "courses": [
        {
            "course_id": "PHYED-AD 1",
            "classes": [
                {},
                {}
            ],
            "course_name": "Fitness for Life | Fitness for Life (Beginners)",
            "description": "PHYED-AD    1 Fitness for Life | Fitness for Life (Beginners) \nThis introductory course orients students to the various exercise equipment and fitness classes in the Saadiyat Fitness Center and provides a framework for the students to design their own personal fitness programs. Through strength and cardio training, TRX, Kettlebells, spinning, yoga and pilates, students will learn how to exercise safely and effectively to maximize progress.  The guided and progressive workouts teach individuals to achieve personal fitness goals by creating and implementing healthy fitness routines.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 2",
            "classes": [
                {}
            ],
            "course_name": "Running 101",
            "description": "PHYED-AD    2 Running 101 \nA class for beginners to experienced runners discussing efficient running, proper form, running for a lifetime, proper gear, preparing for races or running for pleasure. Coach Young has 41 years of running experience that he wants to share with you so you too can enjoy a lifetime of running as he has. You don’t need teammates, you don’t need a ball, you don’t need any equipment, all you need is running shoes.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 3",
            "classes": [
                {},
                {},
                {},
                {}
            ],
            "course_name": "Beginner Swimming",
            "description": "PHYED-AD    3 Beginner Swimming \nBeginner swimming course is designed for students who are non-swimmers and those who have little to no skills in the water.  This course is designed to help the non-swimmer learn basic water safety skills including instruction of proper body position in the water, floating, treading water, holding breath underwater, and introductory to swim strokes, freestyle and backstroke.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 4",
            "classes": [
                {}
            ],
            "course_name": "Intermediate Swimming",
            "description": "PHYED-AD    4 Intermediate Swimming \nIntermediate swimming is a course designed for students who are comfortable treading, floating and swimming in deep water, can swim front crawl with rotary breathing and can swim basic backstroke and breaststroke. Students learn drills for skill improvement. Emphasis is on body form, stroke efficiency, and conditioning in all the strokes.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 5",
            "classes": [
                {},
                {}
            ],
            "course_name": "WO Bellydancing",
            "description": "PHYED-AD    5 WO Bellydancing \nThis course is designed to teach the technique, history, terminology, rhythms, and dance combinations/choreography of Belly Dance. It will also focus on strength, conditioning, and stretching principles necessary for the dance.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 6",
            "classes": [
                {}
            ],
            "course_name": "Capoeira",
            "description": "PHYED-AD    6 Capoeira \nCapoeira is a dynamic Brazilian art form combining self defense, acrobatic movements, music, and dance. Students will develop a strong base in capoeira movements and gain an understanding of capoeira through its rich history, contemporary context, and music. No prior dance or martial arts experience necessary. This class is geared towards all ability levels.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 7",
            "classes": [
                {}
            ],
            "course_name": "Beginner Hip Hop",
            "description": "PHYED-AD    7 Beginner Hip Hop \nHip Hop dance is designed for students with an interest in Hip Hop dance/culture. This class introduces students to Hip Hop through movement that includes freestyle dancing, locomotive movements, and choreography.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 8",
            "course_name": "Introduction to Kayaking and Sailing",
            "description": "PHYED-AD    8 Introduction to Kayaking and Sailing \nThis comprehensive course teaches the fundamentals of sea kayaking (including strokes, rescues, and recovery) as well as basic sailing skills. In addition students learn about the region’s vital ecosystem as they navigate coastal waters and inland areas of Abu Dhabi.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 9",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "PHYED-AD    9\n\n   Scuba - Open Water\n\nThis is a PADI Certified Open Water Scuba Diving Course. Individuals who successfully complete this class are awarded an internationally recognized certificate in scuba diving. Prerequisites: (1) the ability to swim continuously for 200 meter or 300 meter with mask/fin snorkel; (2) the ability to swim/ float in water too deep to stand in for 10 minutes; (3) confidence in open water, and (4) the completion of a medical questionnaire with physician’s consent. PE credit will be awarded upon obtaining a PADI Open Water Dive qualification prior to the end of the class. Given the progressive nature ...\n\n      more description for PHYED-AD    9 »\n\n      \n\n\n\nThis is a PADI Certified Open Water Scuba Diving Course. Individuals who successfully complete this class are awarded an internationally recognized certificate in scuba diving. Prerequisites: (1) the ability to swim continuously for 200 meter or 300 meter with mask/fin snorkel; (2) the ability to swim/ float in water too deep to stand in for 10 minutes; (3) confidence in open water, and (4) the completion of a medical questionnaire with physician’s consent. PE credit will be awarded upon obtaining a PADI Open Water Dive qualification prior to the end of the class. Given the progressive nature of instruction, students must attend all sessions in the order offered. If a session is missed, the affected student is solely responsible for scheduling and paying for the makeup session. All makeup sessions must be completed prior to the next regularly scheduled session.\n\n      less description for PHYED-AD    9 «",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 10",
            "course_name": "Aerobics (women only)",
            "description": "PHYED-AD   10 Aerobics (women only) \nThis comprehensive aerobics class will cover all aspects of movement with the focus on maintaining a targeted heart rate to maximize cardio benefit.  This women's only class will be taught by an in-house instructor.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 11",
            "course_name": "Fencing",
            "description": "PHYED-AD   11 Fencing \nFencing is the art and sport of swordsmanship using a blunt weapon. Fencers use one of three types of weapons – the foil, the epee, or the sabre. Students will learn basic offensive and defensive moves; as well as understand the basic rules of competition.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 12",
            "course_name": "Dance (Women Only)",
            "description": "PHYED-AD   12 Dance (Women Only) \nThis course introduces students to dance by exploring elements of a variety of dance styles and practices through hands- on experiences, movement explorations, dance- making and discussions. Students will be engaged with with the art form and move toward a fuller appreciation of the influence of dance in our everyday lives as well as a reflection and expression of the world we live in.  Dance styles included, but are not limited to, hip-hop, belly dancing, modern ballet and jazz.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 13",
            "classes": [
                {}
            ],
            "course_name": "Jiu Jitsu",
            "description": "PHYED-AD   13 Jiu Jitsu \nJiu Jitsu is a strategic grappling sport where one manipulates an opponent's force against himself rather than confronting it with one's own force. Individuals will learn how to apply the fundamental techniques of Jiu Jitsu, including positioning, leverage, joint locks, escapes, submissions, and self-defense.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 14",
            "course_name": "Pilates and Yoga (Women Only)",
            "description": "PHYED-AD   14 Pilates and Yoga (Women Only) \nPilates is a conditioning program emphasizing the concepts of core strength and stabilization. Through highly focused and controlled movements, individuals experience increased body awareness, flexibility, coordination, and strength. In the yoga portion of this course, individuals learn the basic disciplines of yoga, focusing on body awareness, beginning yoga postures, breathing, and relaxation skills. Upon successful completion, students understand and are able to demonstrate the basic components of yoga practice, including safe, stable body alignment and classic yoga postures.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 17",
            "classes": [
                {}
            ],
            "course_name": "Golf for Beginners",
            "description": "PHYED-AD   17 Golf for Beginners \nThis driving range and putting green based golf instruction class is focused on exposing individuals to the basics of golf. In addition to receiving technical instruction on proper grip and swing, individuals learn the history and rules of golf and basic golf etiquette. The class culminates with an on-course experience.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 18",
            "course_name": "",
            "description": "PHYED-AD   18\n\n   Karting and Driver Fitness\n\nKarting is a motorsport with small, open, four- wheeled vehicles racing on scaled-down circuits. In addition to developing quick reflexes, precision vehicle control, and decision-making skills, individuals gain a basic understanding of what can be altered to try to improve the competitiveness of the kart, including tire pressure, gearing, seat position, and chassis stiffness. The driver fitness portion of the class focuses on the physical fitness training necessary to effectively compete as a race car driver, including strength and cardiovascular training so as to handle steering, braking and ...\n\n      more description for PHYED-AD   18 »\n\n      \n\n\n\nKarting is a motorsport with small, open, four- wheeled vehicles racing on scaled-down circuits. In addition to developing quick reflexes, precision vehicle control, and decision-making skills, individuals gain a basic understanding of what can be altered to try to improve the competitiveness of the kart, including tire pressure, gearing, seat position, and chassis stiffness. The driver fitness portion of the class focuses on the physical fitness training necessary to effectively compete as a race car driver, including strength and cardiovascular training so as to handle steering, braking and the G-forces associated therewith.\n\n      less description for PHYED-AD   18 «",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 22",
            "classes": [
                {}
            ],
            "course_name": "Tennis for Beginners",
            "description": "PHYED-AD   22 Tennis for Beginners \nThis class is geared towards novice tennis players and exposes individuals to the basics of tennis. In addition to receiving technical instruction in serve, volley and forehand and backhand strokes, individuals learn the rules of tennis.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 23",
            "course_name": "Triathlon Training",
            "description": "PHYED-AD   23 Triathlon Training \nThis challenging class is focused on developing athletes interested in competing in local triathlons, including the Yas Tri and Abu Dhabi International Triathlon. Individuals develop a personal triathlon training program—swim, bike and run. Workouts include indoor work on stationary bicycles, rowing ergometers, outdoor work on bicycles, distance swimming, running, and weight training. Individuals learn the secrets of competitive triathletes, including training techniques, equipment, race strategies and nutrition. NOTE: This is a physically demanding class with a challenging culmination.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 25",
            "course_name": "Swimming (women's only)",
            "description": "PHYED-AD   25 Swimming (women's only) \nBeginner swimming course is designed for students who are non-swimmers and those who have little to no skills in the water.  This course is designed to help the non-swimmer learn basic water safety skills including instruction of proper body position in the water, floating, treading water, holding breath underwater, and introductory to swim strokes, freestyle and backstroke.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 27",
            "course_name": "Aerobics",
            "description": "PHYED-AD   27 Aerobics \nThis comprehensive aerobics class will cover all aspects of movement with the focus on maintaining a targeted heart rate to maximize cardio benefit.  This class will be taught by an in-house instructor.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 28",
            "classes": [
                {}
            ],
            "course_name": "Squash",
            "description": "PHYED-AD   28 Squash \nThis course aims to impart the knowledge and competencies essential to having an informed understanding and appreciation of squash. Students are introduced to the basic skills necessary to play the game.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 29",
            "course_name": "Dance (coed)",
            "description": "PHYED-AD   29 Dance (coed) \nThis course introduces students to dance by exploring elements of a variety of dance styles and practices through hands- on experiences, movement explorations, dance-making and discussions. Dance styles included, but are not limited to, hip-hop, belly dancing, modern ballet and jazz.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 32",
            "course_name": "Bootcamp",
            "description": "PHYED-AD   32 Bootcamp \nThis course offers intense exercise sessions that challenge every muscle of the body. By rapidly moving from exercise to exercise with little rest in between, one tones and firms muscles while simultaneously getting a vigorous cardiovascular workout.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 33",
            "classes": [
                {},
                {}
            ],
            "course_name": "Performance Boxing",
            "description": "PHYED-AD   33 Performance Boxing \nThe aim of this course is to gain a greater understanding of boxing technique and how to adapt authentic boxing training for pure fitness. Boxing for fitness is fun and at the same time builds muscle strength, improves body tone, promotes cardiovascular health, and enhances confidence.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 34",
            "course_name": "Touch Rugby",
            "description": "PHYED-AD   34 Touch Rugby \nTouch Rugby is a non-contact form of rugby that focuses on fitness, agility, communication and teamwork. This team sport physical strength is not a requirement for excellence in this sport.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 36",
            "classes": [
                {}
            ],
            "course_name": "Intro Strength Training",
            "description": "PHYED-AD   36 Intro Strength Training \nThis course aims to teach students the essential components of a weighting lifting program and proper execution and techniques for safe and effective strength training. Students will be encouraged to explore their personal health and fitness goals and how strength training may be incorporated into their lifelong fitness plan.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 37",
            "classes": [
                {},
                {}
            ],
            "course_name": "Total Fitness | Total Fitness (Advanced)",
            "description": "PHYED-AD   37 Total Fitness | Total Fitness (Advanced) \nTotal Fitness is a high intensity fitness course with constantly varied and physically demanding workouts. The program is geared to prepare the body for better fitness in any and all activities or sports by focusing on functional movements, strengthening and conditioning of major muscle groups, heart and lung endurance, flexibility, power, speed, agility and balance.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 38",
            "course_name": "",
            "description": "PHYED-AD   38\n\n   Scuba (Women Only)\n\nThis is a PADI Certified Open Water Scuba Diving Course. Individuals who successfully complete this class are awarded an internationally recognized certificate in scuba diving. Prerequisites: (1) the ability to swim continuously for 200 meter or 300 meter with mask/fin snorkel, (2) the ability to swim/float in water too deep to stand in for 10 minutes, (3) confidence in open water, and (4) the completion of a medical questionnaire with physician’s consent, \nPE credit will be awarded upon obtaining a PADI Open Water Dive qualification prior to the end of the class. Given the progressive nature ...\n\n      more description for PHYED-AD   38 »\n\n      \n\n\n\nThis is a PADI Certified Open Water Scuba Diving Course. Individuals who successfully complete this class are awarded an internationally recognized certificate in scuba diving. Prerequisites: (1) the ability to swim continuously for 200 meter or 300 meter with mask/fin snorkel, (2) the ability to swim/float in water too deep to stand in for 10 minutes, (3) confidence in open water, and (4) the completion of a medical questionnaire with physician’s consent, \nPE credit will be awarded upon obtaining a PADI Open Water Dive qualification prior to the end of the class. Given the progressive nature of instruction; i.e. later classes are entirely dependent upon earlier classes, students must attend all sessions in the order offered.  If a session is missed, the affected student is solely responsible for scheduling and paying for the makeup session. All makeup sessions must be completed prior to the next regularly scheduled session.\n\n      less description for PHYED-AD   38 «",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 39",
            "classes": [
                {}
            ],
            "course_name": "Performance Boxing (Women Only)",
            "description": "PHYED-AD   39 Performance Boxing (Women Only) \nThe aim of this course is to gain a greater understanding of boxing technique and how to adapt authentic boxing training for pure fitness. Boxing for fitness is fun and at the same time builds muscle strength, improves body tone, promotes cardiovascular health, and enhances confidence.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 40",
            "course_name": "Bowling",
            "description": "PHYED-AD   40 Bowling \nThis introductory course will expose students to the basics of bowling, including technique, tactics, handicaps and scorekeeping. By the end of the course, students have the capabilities be able to engage in a bowling league and/or competition. This course will be taught by a contracted instructor.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 46",
            "course_name": "Beginner's Equestrian",
            "description": "PHYED-AD   46 Beginner's Equestrian \nThis course is designed to equip students with the fundamental techniques and theories of equestrianship, including walking, trotting, cantering, galloping, and horsemanship.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 47",
            "classes": [
                {},
                {}
            ],
            "course_name": "Yoga",
            "description": "PHYED-AD   47 Yoga \nYoga will commence with an introduction to yoga practice, infusing breathing techniques, physical movement, detox, meditation, strength, flexibility & balance conditioning with balance of body and mind. This program will allow students to build step by step and slowly chip away letting go of both mental and physical barriers.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 48",
            "classes": [
                {}
            ],
            "course_name": "Triathlon Training",
            "description": "PHYED-AD   48 Triathlon Training \nGreat class for anyone interested in doing a triathlon at least learning about the sport. Swimming, biking, running and transitions will all be covered in this class designed to help beginners to experienced triathletes. We’ll talk about gear, each discipline, workouts, training plans and hopefully prepare you to think about doing a triathlon here at NYUAD.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 49",
            "classes": [
                {}
            ],
            "course_name": "Badminton",
            "description": "PHYED-AD   49 Badminton \nThis course is designed to introduce basic badminton skills, techniques, rules and strategies for singles and doubles play with a focus on development of various strokes, serves, and offensive and defensive strategies.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 50",
            "classes": [
                {}
            ],
            "course_name": "Flexible Fitness",
            "description": "PHYED-AD   50 Flexible Fitness \n“Flexible Fitness” is an opportunity for students to receive PE credit through a structured, supervised yet flexible active lifestyle program. Students who enroll in “Flexible Fitness” have one (1) semester to complete 30 hours of physical activity. The program is designed to encourage students to participate in a wide variety of physical activities and to build habits of consistency. Students decide when and how they would like to participate based on a series of guidelines. This is a 14 week course.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 51",
            "course_name": "Aikido",
            "description": "PHYED-AD   51 Aikido \nAikido is a Japanese martial art based on the philosophy of blending with an opponents power and redirecting their aggressiveness to a mutually safe place rather than trying to counter power with power. It is therefore not dependent on the individual's size and strength. Elements of classical Japanese sword and staff are incorporated into the empty hand techniques, which consist of throwing and pinning defenses against a wide variety of attacks. The class is open to both beginners and advanced practitioners and people of all fitness levels. \nAn in-house instructor will teach this course.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 54",
            "classes": [
                {}
            ],
            "course_name": "Speed and Agility",
            "description": "PHYED-AD   54 Speed and Agility \nSpeed and agility training can help you develop explosive power and athleticism for any sport or fitness goal. Training to develop speed and agility also provides a great way to mix up your regular workouts with some fun, metabolically challenging exercises. Also creates unique, proprioceptive challenges that reinforce muscle firing sequences and motor patterns that transfer directly into movements commonly found in sport and life.\nAn in-house instructor will teach this course.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 55",
            "course_name": "Rock Climbing",
            "description": "PHYED-AD   55 Rock Climbing \nThis course is for anyone who wants a fun and educational introduction to rock climbing. Rock climbing is a fantastic way to get fit, build strength and stamina – it’s a myth that you need to have exceptional upper body strength; a positive attitude will get you a long way! You will look at all the essential skills to get you started, learning simple rope work, belaying (controlling the rope for the climber), single pitch climbing, abseiling and use of technical equipment. We will use an indoor climbing wall for all lessons.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 56",
            "course_name": "Ultimate Frisbee",
            "description": "PHYED-AD   56 Ultimate Frisbee \nUltimate is an exciting, non-contact team sport, built on improving players speed, stamina and agility.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 57",
            "course_name": "Water Polo",
            "description": "PHYED-AD   57 Water Polo \nThis team sport can be likened to a sort of aquatic handball, in which a ball has to be throw into a goal.  The courses is designed to introduce students to rules of the game and how to improve your strength, fitness, speed and flexibility. These skills will help you tread water without using your hands, shoot and pass accurately, and improve your swimming stamina. Please note: Students must be confident in water and be able to swim at least 50m unaided.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 58",
            "course_name": "Racquetball",
            "description": "PHYED-AD   58 Racquetball \nThis course is designed as an introduction to racquetball, involving activities to teach students basic racquetball terms, rules, scoring, safety, and techniques for the forehand, backhand, overhead, and serve, as well as singles and doubles.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 59",
            "course_name": "",
            "description": "PHYED-AD   59\n\n   Tae Bo – Zumba (WO)\n\nIn this class, you will kick and dance your way to fitness. Combining the power of Tae Bo and the fun of Zumba, you will improve balance, flexibility, coordination as well as receive cardiovascular benefits. The Zumba Fitness program combines Latin dancing with interval and resistance training for a full-body workout. Tae Bo is a total body fitness system that incorporates martial arts techniques such as kicking and punching. This program use the motions of martial arts at a rapid pace and is designed to promote fitness.Tae Bo is a total body fitness system that incorporates martial arts techn...\n\n      more description for PHYED-AD   59 »\n\n      \n\n\n\nIn this class, you will kick and dance your way to fitness. Combining the power of Tae Bo and the fun of Zumba, you will improve balance, flexibility, coordination as well as receive cardiovascular benefits. The Zumba Fitness program combines Latin dancing with interval and resistance training for a full-body workout. Tae Bo is a total body fitness system that incorporates martial arts techniques such as kicking and punching. This program use the motions of martial arts at a rapid pace and is designed to promote fitness.Tae Bo is a total body fitness system that incorporates martial arts techniques such as kicking and punching. This program use the motions of martial arts at a rapid pace and is designed to promote fitness.\n\n      less description for PHYED-AD   59 «",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 61",
            "course_name": "",
            "description": "PHYED-AD   61\n\n   Archery\n\nThis course is designed to give students an introduction to archery from a historical perspective which includes, but is not limited to, cultural use of the bow and arrow for food, protection, recreation and competition. Students will learn fundamental skills, strategies, rules and regulations. The underlying sub-focus of the course is the development of persistence and discipline necessary for success and the resulting self-enhancement that accompanies personal success. The commitment to Archery requires students to develop a focus which is achieved only through rigorous attention to fine mot...\n\n      more description for PHYED-AD   61 »\n\n      \n\n\n\nThis course is designed to give students an introduction to archery from a historical perspective which includes, but is not limited to, cultural use of the bow and arrow for food, protection, recreation and competition. Students will learn fundamental skills, strategies, rules and regulations. The underlying sub-focus of the course is the development of persistence and discipline necessary for success and the resulting self-enhancement that accompanies personal success. The commitment to Archery requires students to develop a focus which is achieved only through rigorous attention to fine motor movement. The improvement of individual skills in Archery is important but the process required for target success can be a foundation for a lifelong recreational opportunity.\n\n      less description for PHYED-AD   61 «",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 62",
            "course_name": "Quidditch",
            "description": "PHYED-AD   62 Quidditch \nThe word Quidditch may or may not sound familiar to you, depending on whether you are familiar with the Harry Potter series. With a broom planted between their legs, players will be taught how to dodge, weave, throw and catch. Having to keep the broom between your legs serves as a vital handicap to mobility, stability and throwing accuracy, encouraging players to develop a precise throwing arm and positional awareness. A fun new PE course, Quidditch is fast-paced game, which is growing in popularity throughout colleges around the world.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 63",
            "course_name": "Team Sports PE",
            "description": "PHYED-AD   63 Team Sports PE \nTeam Sports- This course will introduce students to a variety of indoor team sports and the elements necessary to play them. Those elements include, but are not limited to, skills, offensive and defensive strategies, rules and lots of game play.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 65",
            "course_name": "Flag Football",
            "description": "PHYED-AD   65 Flag Football \nA version of American football without blocking or tackling, with tackling being replaced by \"deflagging\" an opponent. The rules of the game will be designed to reduce physical contact and injury while promoting teamwork, leadership, agility and gross motor coordination.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 66",
            "classes": [
                {}
            ],
            "course_name": "WO Yoga",
            "description": "PHYED-AD   66 WO Yoga \nThe Women's Only Yoga course will commence with an introduction to the Yoga practice, infusing breathing techniques, physical movement, detox, meditation, strength, flexibility & balance conditioning with balance of body and mind. This program will allow students to build step by step and slowly chip away letting go of both mental and physical barriers.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 67",
            "course_name": "Outdoor Conditioning",
            "description": "PHYED-AD   67 Outdoor Conditioning \nThis course will combine interval training, speed work, tempo's, endurance & full body functional exercises in an outdoor environment. The students will works in teams as well as partners in a variety of training styles to keep them challenged and motivated.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 68",
            "course_name": "WO Healthy Living",
            "description": "PHYED-AD   68 WO Healthy Living \nThe course will focus on the relationship between individual choices, social responsibilities and optimal human functioning through healthy living. Health and social issues relevant to young women will be examined in discussion based sessions, while being combined with the practice of a diversified fitness routine that focuses on strength, flexibility, endurance and muscle tone. An understanding of cardiovascular fitness and nutritional information related to exercise is emphasized.",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 69",
            "classes": [
                {}
            ],
            "course_name": "A Intro to Athletic Training - Part A",
            "description": "PHYED-AD   69A Intro to Athletic Training - Part A \nThis course provides an overview of the various fields of athletic training and sports medicine. Students will learn how to use training equipment and materials, procedures for athletic training and the role of trainers as care providers. They will examine the organizations, regulations and ethics that govern the profession. This course must be taken with part B. Successful completion of the two courses will satisfy the Physical Education requirement.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 69",
            "classes": [
                {}
            ],
            "course_name": "B Intro to Athletic Training - Part B",
            "description": "PHYED-AD   69B Intro to Athletic Training - Part B \nThis course provides an overview of the various fields of athletic training and sports medicine. Students will learn how to use training equipment and materials, procedures for athletic training and the role of trainers as care providers. They will examine the organizations, regulations and ethics that govern the profession. This course must be taken with part A. Successful completion of the two courses will satisfy the Physical Education requirement.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 70",
            "classes": [
                {}
            ],
            "course_name": "A",
            "description": "PHYED-AD   70A\n\n   Lifeguard Training Certification Part A\n\nThis class teaches lifeguard candidates the skills and knowledge needed to prevent and respond to aquatic emergencies at an aquatic facility. Upon successful completion of the course, each student will receive American Red Cross Lifeguard Training/ First Aid and CPR for the Professional Rescuer. This course must be taken with part B. Successful completion of the two courses will satisfy the Physical Education requirement. Attendance is required for all classes within each session. No exceptions!\nPrerequisites: \n•\tAbility to swim 300 yards continuously swimming demonstrating breath control and ...\n\n      more description for PHYED-AD   70A »\n\n      \n\n\n\nThis class teaches lifeguard candidates the skills and knowledge needed to prevent and respond to aquatic emergencies at an aquatic facility. Upon successful completion of the course, each student will receive American Red Cross Lifeguard Training/ First Aid and CPR for the Professional Rescuer. This course must be taken with part B. Successful completion of the two courses will satisfy the Physical Education requirement. Attendance is required for all classes within each session. No exceptions!\nPrerequisites: \n•\tAbility to swim 300 yards continuously swimming demonstrating breath control and rhythmic breathing swimming freestyle and breaststroke.\n•\tAbility to tread water for 2 minutes using only your legs.\n•\tAbility swim 20 yards of freestyle or breaststroke, submerge to 10 ft and pick up a 10 lb object, holding it with both hands return 20 yards and exit pool in 1 minute and 40 seconds.\n\n      less description for PHYED-AD   70A «",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 70",
            "classes": [
                {}
            ],
            "course_name": "B",
            "description": "PHYED-AD   70B\n\n   Lifeguard Training Certification Part B\n\nThis class teaches lifeguard candidates the skills and knowledge needed to prevent and respond to aquatic emergencies at an aquatic facility. Upon successful completion of the course, each student will receive American Red Cross Lifeguard Training/ First Aid and CPR for the Professional Rescuer. This course must be taken with part A. Successful completion of the two courses will satisfy the Physical Education requirement. Attendance is required for all classes within each session. No exceptions!\nPrerequisites: \n•\tAbility to swim 300 yards continuously swimming demonstrating breath control and ...\n\n      more description for PHYED-AD   70B »\n\n      \n\n\n\nThis class teaches lifeguard candidates the skills and knowledge needed to prevent and respond to aquatic emergencies at an aquatic facility. Upon successful completion of the course, each student will receive American Red Cross Lifeguard Training/ First Aid and CPR for the Professional Rescuer. This course must be taken with part A. Successful completion of the two courses will satisfy the Physical Education requirement. Attendance is required for all classes within each session. No exceptions!\nPrerequisites: \n•\tAbility to swim 300 yards continuously swimming demonstrating breath control and rhythmic breathing swimming freestyle and breaststroke.\n•\tAbility to tread water for 2 minutes using only your legs.\n•\tAbility swim 20 yards of freestyle or breaststroke, submerge to 10 ft and pick up a 10 lb object, holding it with both hands return 20 yards and exit pool in 1 minute and 40 seconds.\n\n      less description for PHYED-AD   70B «",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 71",
            "classes": [
                {}
            ],
            "course_name": "A Intro to Sports Management Part A",
            "description": "PHYED-AD   71A Intro to Sports Management Part A \nThis course examines issues of management and organization within the broad context of the sports industry, with specific reference to issues of staffing, motivation, and communication. Introduces how to most effectively put leadership theory to work on a daily basis within a sports organization. Students will gain experience at NYUAD organized sports events and create a sports event at the conclusion of the 14 week course that will be open to the NYUAD community. This course must be taken with part B. Successful completion of the two courses will satisfy the Physical Education requirement.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 71",
            "classes": [
                {}
            ],
            "course_name": "B Intro to Sports Management Part B",
            "description": "PHYED-AD   71B Intro to Sports Management Part B \nThis course examines issues of management and organization within the broad context of the sports industry, with specific reference to issues of staffing, motivation, and communication. Introduces how to most effectively put leadership theory to work on a daily basis within a sports organization. Students will gain experience at NYUAD organized sports events and create a sports event at the conclusion of the 14 week course that will be open to the NYUAD community. This course must be taken with part A. Successful completion of the two courses will satisfy the Physical Education requirement.",
            "offering": true
        },
        {
            "course_id": "PHYED-AD 90",
            "course_name": "Men's Varsity Soccer",
            "description": "PHYED-AD   90 Men's Varsity Soccer \nParticipate as a team member in the Men's Varsity Soccer team for at least one (1) semester",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 91",
            "course_name": "Women's Varsity Soccer",
            "description": "PHYED-AD   91 Women's Varsity Soccer \nParticipate in the Women's Varsity Soccer team for at least one (1) semester",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 92",
            "course_name": "Men's Varsity Basketball",
            "description": "PHYED-AD   92 Men's Varsity Basketball \nParticipate in the Men's Varsity Basketball team for at least one (1) semester",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 93",
            "course_name": "Women's Varsity Basketball",
            "description": "PHYED-AD   93 Women's Varsity Basketball \nParticipate in the Women's Varsity Basketball team for at least (1) semester",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 94",
            "course_name": "Competitive Table Tennis",
            "description": "PHYED-AD   94 Competitive Table Tennis \nParticipate in competitive table tennis",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 95",
            "course_name": "Men's Badminton",
            "description": "PHYED-AD   95 Men's Badminton \nCompetitive badminton",
            "offering": false
        },
        {
            "course_id": "PHYED-AD 98",
            "course_name": "Physical Education - Independent Study",
            "description": "PHYED-AD   98 Physical Education - Independent Study",
            "offering": false
        }
    ]
}