{
    "major_id": "POLSC-AD",
    "file": "./2015-2016/Political_Science_(POLSC-AD).html",
    "courses": [
        {
            "course_id": "POLSC-AD 112",
            "course_name": "",
            "description": "POLSC-AD  112\n\n   Introduction to Game Theory\n\nThis course introduces the basic concepts of elementary game theory in a way that allows students to use them in solving simple problems. Topics include: the basics of cooperative and noncooperative game theory; basic solution concepts\nsuch as Nash equilibrium and the core; and the extensions of these solutions to dynamic games and situations of incomplete information. Students\nare exposed to a variety of simple games with varied and useful applications: zero-sum games; the Prisoner’s Dilemma; coordination games; the Battle of the Sexes; repeated games; and elementary signaling games. The cour...\n\n      more description for POLSC-AD  112 »\n\n      \n\n\n\nThis course introduces the basic concepts of elementary game theory in a way that allows students to use them in solving simple problems. Topics include: the basics of cooperative and noncooperative game theory; basic solution concepts\nsuch as Nash equilibrium and the core; and the extensions of these solutions to dynamic games and situations of incomplete information. Students\nare exposed to a variety of simple games with varied and useful applications: zero-sum games; the Prisoner’s Dilemma; coordination games; the Battle of the Sexes; repeated games; and elementary signaling games. The course relies\non a wide array of example applications of game theory in the social sciences.\n\n      less description for POLSC-AD  112 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 113",
            "course_name": "",
            "description": "POLSC-AD  113\n\n   Advanced Game Theory\n\nThis course continues the study of game theory and its applications to the social sciences. The course is divided into two parts. Part 1 studies non-cooperative game theory: Nash equilibrium in static games; extensions such as subgame\nperfection for dynamic games of complete information; Bayesian Nash equilibrium for static games with incomplete information; and sequential\nequilibrium (with refinements) for dynamic games with incomplete information. Applications to the social sciences include strategic choice of electoral platforms, collusion, lobbying, bargaining, and signaling. Part 2 studie...\n\n      more description for POLSC-AD  113 »\n\n      \n\n\n\nThis course continues the study of game theory and its applications to the social sciences. The course is divided into two parts. Part 1 studies non-cooperative game theory: Nash equilibrium in static games; extensions such as subgame\nperfection for dynamic games of complete information; Bayesian Nash equilibrium for static games with incomplete information; and sequential\nequilibrium (with refinements) for dynamic games with incomplete information. Applications to the social sciences include strategic choice of electoral platforms, collusion, lobbying, bargaining, and signaling. Part 2 studies cooperative game theory, including common solution concepts such as the core and the stable set, as well as hybrid topics such as coalition and network formation, or mechanism design. Applications include: political party formation; dynamic agenda-setting; the construction and implementation of voting rules; and the study of social networks.\n\n      less description for POLSC-AD  113 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 114",
            "course_name": "",
            "description": "POLSC-AD  114\n\n   Behavioral Social Science\n\nThis course offers a broad overview of behavioral social science, a field that uses experimental methods and theoretical ideas from psychology as tools to help understand social processes. The course introduces important concepts from psychology, offering new ways of thinking about subjects as varied as personality, the dynamics of social groups, and the ways in which emotion affects decision-making. The course is divided into two parts, the first concentrating on the psychology of individual decision-making and the second emphasizing the social psychology of group behavior. In each case, the ...\n\n      more description for POLSC-AD  114 »\n\n      \n\n\n\nThis course offers a broad overview of behavioral social science, a field that uses experimental methods and theoretical ideas from psychology as tools to help understand social processes. The course introduces important concepts from psychology, offering new ways of thinking about subjects as varied as personality, the dynamics of social groups, and the ways in which emotion affects decision-making. The course is divided into two parts, the first concentrating on the psychology of individual decision-making and the second emphasizing the social psychology of group behavior. In each case, the focus is on how behavioral research might potentially enrich “classical” theories, such as the choice-based theory of revealed preference. The course then applies these concepts to various topics within social science, including the study of systematic biases in group decision-making, the role of the media and political advertising, race relations, the legitimacy of government institutions, and the formation of opinions and ideologies.\n\n      less description for POLSC-AD  114 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 115",
            "course_name": "Political Psychology",
            "description": "POLSC-AD  115 Political Psychology \nThis course addresses key theoretical and empirical topics in political psychology, drawing in both the experimental tradition of social psychology and the survey-based tradition of political science. Consideration is given to the political psychology of collective public behavior, including issues of social identity, intergroup relations, and group interaction, as well as individual political attitude formation and decision-making. Social and psychological antecedents and consequences of political orientation and ideological opinions\nare also addressed.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 116",
            "course_name": "",
            "description": "POLSC-AD  116\n\n   Experimental Research in the Social Sciences\n\nIn recent years, scholars and policy practitioners have begun to use experimental methods, imported from the natural sciences, as a new means of evaluating public policies and learning about political processes more generally. This course offers an accessible introduction to the principles of social scientific experimentation and its uses, with a particular emphasis on issues related to economic and political development, including the use of randomized control trials to evaluate the effectiveness of aid programs, methods of improving citizen representation and local governance in development ...\n\n      more description for POLSC-AD  116 »\n\n      \n\n\n\nIn recent years, scholars and policy practitioners have begun to use experimental methods, imported from the natural sciences, as a new means of evaluating public policies and learning about political processes more generally. This course offers an accessible introduction to the principles of social scientific experimentation and its uses, with a particular emphasis on issues related to economic and political development, including the use of randomized control trials to evaluate the effectiveness of aid programs, methods of improving citizen representation and local governance in development contexts, and issues of intergroup relations and conflict resolution.\n\n      less description for POLSC-AD  116 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 130",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12916",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "WEST_ADMIN 005",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Jensen, Jeffrey"
                },
                {},
                {
                    "format": "Seminar",
                    "class_id": "12917",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "WEST_ADMIN 005",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Jensen, Jeffrey"
                },
                {}
            ],
            "course_name": "",
            "description": "POLSC-AD  130\n\n   Introduction to Political Thinking\n\nStudents learn how political scientists look at the world and approach problems. The course focuses on individual decision makers in the world of politics (citizens, voters, legislators, executives, judges) and explores how they are linked together and how their decisions shape political outcomes. Students study the formal modeling of political behavior and analyze the theories of social choice (how groups of rational individuals make decisions) and collective action (how groups of rational individuals take action). The course also explores how political institutions, such as electoral rules o...\n\n      more description for POLSC-AD  130 »\n\n      \n\n\n\nStudents learn how political scientists look at the world and approach problems. The course focuses on individual decision makers in the world of politics (citizens, voters, legislators, executives, judges) and explores how they are linked together and how their decisions shape political outcomes. Students study the formal modeling of political behavior and analyze the theories of social choice (how groups of rational individuals make decisions) and collective action (how groups of rational individuals take action). The course also explores how political institutions, such as electoral rules or the design of legislatures, can structure the interactions of these actors. The course relies on cases and examples and incorporates readings from classical and contemporary sources to illustrate how these models of political behavior and institutions can shed light on current political events.\n\n      less description for POLSC-AD  130 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 131",
            "course_name": "",
            "description": "POLSC-AD  131\n\n   Elections and Voting\n\nIn this course we draw on both theory and evidence to investigate the interplay between voters’ preferences and electoral rules in modern democracies. We begin by thinking about voters’ utility functions: what kinds of returns do citizens\nget from voting? How do voters in different democracies weigh candidates’ policy positions, information about economic performance, and their partisan affiliations? We then consider how different electoral institutions aggregate voters’ preferences and the effects of varying electoral rules on party competition, including the number and ideological character ...\n\n      more description for POLSC-AD  131 »\n\n      \n\n\n\nIn this course we draw on both theory and evidence to investigate the interplay between voters’ preferences and electoral rules in modern democracies. We begin by thinking about voters’ utility functions: what kinds of returns do citizens\nget from voting? How do voters in different democracies weigh candidates’ policy positions, information about economic performance, and their partisan affiliations? We then consider how different electoral institutions aggregate voters’ preferences and the effects of varying electoral rules on party competition, including the number and ideological character of parties, and the responsiveness of elected officials to voter preferences.\n\n      less description for POLSC-AD  131 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 132",
            "course_name": "",
            "description": "POLSC-AD  132\n\n   Courts\n\nThis course examines several important questions about judicial institutions. Looking at both theory and evidence, we ask how judges in different institutional settings decide cases. In what ways, if any, are judges different from legislators?\nHow do judges interact on multimember courts? How do judges weigh legal, policy, and political actors? We also ask about the consequences of different judicial institutions for policy outcomes. For example, we examine the consequences of varying degrees of judicial independence, including elected vs. appointed judges, fixed terms vs. life terms, and con...\n\n      more description for POLSC-AD  132 »\n\n      \n\n\n\nThis course examines several important questions about judicial institutions. Looking at both theory and evidence, we ask how judges in different institutional settings decide cases. In what ways, if any, are judges different from legislators?\nHow do judges interact on multimember courts? How do judges weigh legal, policy, and political actors? We also ask about the consequences of different judicial institutions for policy outcomes. For example, we examine the consequences of varying degrees of judicial independence, including elected vs. appointed judges, fixed terms vs. life terms, and constitutional vs. statutory grants\nof jurisdiction.\n\n      less description for POLSC-AD  132 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 133",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17898",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 016",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Rogowski, Ronald"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  133\n\n   Political Economy of Institutions\n\nCrosslisted with Social Research and Public Policy. The course explores recent research on the economic causes and consequences of differences in political institutions:  authoritarian vs. democratic in general, and various kinds of authoritarian (military, personalistic, etc.) and democratic (chiefly proportional vs. majoritarian and parliamentary vs. presidential) regimes.  Among the economic aspects to be considered are:  the wealth and economic inequality in the given society; who garners the rents that the given regime offers; and the degree of oligopoly vs. competition that characterizes...\n\n      more description for POLSC-AD  133 »\n\n      \n\n\n\nCrosslisted with Social Research and Public Policy. The course explores recent research on the economic causes and consequences of differences in political institutions:  authoritarian vs. democratic in general, and various kinds of authoritarian (military, personalistic, etc.) and democratic (chiefly proportional vs. majoritarian and parliamentary vs. presidential) regimes.  Among the economic aspects to be considered are:  the wealth and economic inequality in the given society; who garners the rents that the given regime offers; and the degree of oligopoly vs. competition that characterizes economic policy.\n\n      less description for POLSC-AD  133 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 134",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17897",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 016",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "van der Windt, Peter"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  134\n\n   Political Economy of Development\n\nIt is now widely acknowledged that politics plays a central role in influencing economic development. This makes the political economy of development a central area of research. While a student with an introductory background to political economy will have familiarity with theories based on voting, this course stresses a variety of other factors, such as the security of property rights, the creation of market and non-market institutions, lobbying and rent-seeking, collective action, social conflict, corruption, and the political economy of redistribution. Examples from historical experience as...\n\n      more description for POLSC-AD  134 »\n\n      \n\n\n\nIt is now widely acknowledged that politics plays a central role in influencing economic development. This makes the political economy of development a central area of research. While a student with an introductory background to political economy will have familiarity with theories based on voting, this course stresses a variety of other factors, such as the security of property rights, the creation of market and non-market institutions, lobbying and rent-seeking, collective action, social conflict, corruption, and the political economy of redistribution. Examples from historical experience as well as modern developing countries would be used throughout the course.\n\n      less description for POLSC-AD  134 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 135",
            "course_name": "Politics and Finance",
            "description": "POLSC-AD  135 Politics and Finance \nThis course examines how legislation and regulation influence the structure of financial markets, and how players in these markets intervene in the political process to create or modify legislative and regulatory outcomes. Particular emphasis will be placed on the United States, although international comparisons will also be present. The approach will be similar to that used in microeconomics, except that transactions will be made through voting institutions rather than through economic exchange.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 136",
            "course_name": "",
            "description": "POLSC-AD  136\n\n   Political Economy of Cities\n\nThis course provides an introduction to political economy and policymaking in large cities and metropolitan areas. The course examines the institutional, economic, political, and demographic settings that distinguish urban policymaking, primarily in the United States. We begin by analyzing the institutions of local government and their role in the U.S. federal system, the sources of urban growth, competition among cities, and the importance of\nreal estate markets in shaping local politics. We next study several specific urban issues including concentrated poverty, racial conflict, housing,\ngov...\n\n      more description for POLSC-AD  136 »\n\n      \n\n\n\nThis course provides an introduction to political economy and policymaking in large cities and metropolitan areas. The course examines the institutional, economic, political, and demographic settings that distinguish urban policymaking, primarily in the United States. We begin by analyzing the institutions of local government and their role in the U.S. federal system, the sources of urban growth, competition among cities, and the importance of\nreal estate markets in shaping local politics. We next study several specific urban issues including concentrated poverty, racial conflict, housing,\ngovernmental fragmentation, and sprawl. Although the course focuses on large central cities, we pay attention to the suburbanization of population and\nemployment, politics in suburbia, and citysuburb relations. Finally, students are introduced to the latest research on social interactions in cities— with a focus on social capital, neighborhood and peer effects, and human capital spillovers.\n\n      less description for POLSC-AD  136 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 138",
            "course_name": "Bureaucracies",
            "description": "POLSC-AD  138 Bureaucracies \nIn this course, we examine the major questions political scientists ask about public bureaucracies: How have they evolved to their current form? Why do bureaucrats engage in behavior that many of us consider pathological or arbitrary? What are the causes and consequences of bureaucratic corruption, and how can it be minimized? How can unelected government officials be made more accountable to their elected counterparts and to citizens? In addressing these questions and others, we draw on cases of government in action in a number of different public policy areas.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 139",
            "course_name": "",
            "description": "POLSC-AD  139\n\n   Civic Culture and Democracy\n\nPolitical culture is one of the central research themes in contemporary political science. Eckstein considers the political culture approach as “one of the two still viable general approaches to political theory and explanation…the other still being political rational choice theory.” This course examines major approaches to political culture and their relationship to democratic development. We discuss\nquestions of how to define political culture, how political culture can be studied, and how it relates to democratic politics and political performance.\nThe pros and cons of the political culture...\n\n      more description for POLSC-AD  139 »\n\n      \n\n\n\nPolitical culture is one of the central research themes in contemporary political science. Eckstein considers the political culture approach as “one of the two still viable general approaches to political theory and explanation…the other still being political rational choice theory.” This course examines major approaches to political culture and their relationship to democratic development. We discuss\nquestions of how to define political culture, how political culture can be studied, and how it relates to democratic politics and political performance.\nThe pros and cons of the political culture approach will be discussed in the concluding session.\n\n      less description for POLSC-AD  139 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 140",
            "course_name": "J",
            "description": "POLSC-AD  140J\n\n   Introduction to Machiavelli\n\nOften described as the founder of the modern science of politics, Niccolò Machiavelli (1469–1527) was also a Florentine diplomat and civil servant who\ndrew upon his deep understanding of Roman history to interpret the colorful, tumultuous, duplicitous, and often violent politics of Renaissance Italy. This class involves a careful reading and analysis of his masterpiece, The Prince, in its historical context, with a focus on its principal theme, namely how\nand why political leaders gain and lose power. Students also study selected portions of The Discourses, in order to understand the nature of...\n\n      more description for POLSC-AD  140J »\n\n      \n\n\n\nOften described as the founder of the modern science of politics, Niccolò Machiavelli (1469–1527) was also a Florentine diplomat and civil servant who\ndrew upon his deep understanding of Roman history to interpret the colorful, tumultuous, duplicitous, and often violent politics of Renaissance Italy. This class involves a careful reading and analysis of his masterpiece, The Prince, in its historical context, with a focus on its principal theme, namely how\nand why political leaders gain and lose power. Students also study selected portions of The Discourses, in order to understand the nature of Machiavelli’s “republicanism” and how it relates to the advice and warnings he gave to princes. Our readings and discussions are supplemented by visits to Machiavelli’s tomb in Santa Croce; the David of Verrocchio in the Bargello (a statue that Machiavelli saw every day on his way to his office); and the estate at Sant’Andrea in Percussina, near San Casciano in Val di Pesa, where Machiavelli\nretired to write The Prince.\n\n      less description for POLSC-AD  140J «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 141",
            "course_name": "X",
            "description": "POLSC-AD  141X\n\n   Ibn Khaldun and Political Theory\n\nWritten by the Maghrebian Muslim historian Ibn Khaldun and usually dated around 1377, the Muqaddimah is often described as the founding text of the philosophy of history and the history of civilizations. Its themes include the\nsecular and religious sources of social solidarity, why individuals identify with their group and subordinate their interests to its norms, why they accept the authority of their political leaders, the tensions between nomadic and sedentary or desert and urban societies, organizational and tactical factors in military success, the division of labor and the economic trans...\n\n      more description for POLSC-AD  141X »\n\n      \n\n\n\nWritten by the Maghrebian Muslim historian Ibn Khaldun and usually dated around 1377, the Muqaddimah is often described as the founding text of the philosophy of history and the history of civilizations. Its themes include the\nsecular and religious sources of social solidarity, why individuals identify with their group and subordinate their interests to its norms, why they accept the authority of their political leaders, the tensions between nomadic and sedentary or desert and urban societies, organizational and tactical factors in military success, the division of labor and the economic transition from subsistence\nto surplus, demographic expansion and collapse, luxury and the decay of tribal solidarity in urban conglomerations, and the social conditions of scientific and artistic flourishing. The course involves a close reading of six chapters of the\nMuqaddimah (on general social theory, the theory of Bedouin society, the theory of political authority, the theory of urban society, the theory of economic development, and the sociology of science) and draws upon Western political and social theorists, such as Adam Smith and Emile Durkheim, for\nclarification and perspective.\n\n      less description for POLSC-AD  141X «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 142",
            "course_name": "",
            "description": "POLSC-AD  142\n\n   Justice: Political Theory & Practice\n\nThis course invites students to engage with several classic treatises of political thinking about a universal concern: justice. In John Rawls’s words, justice “is the first virtue of social institutions, as truth is of systems of thought. A theory however elegant and economical must be rejected or revised if it is untrue; likewise laws and institutions no matter how efficient or well-­‐arranged must be reformed or abolished if they are unjust.” To what extent are our contemporary social, political, and economic institutions just? How would we know?\nIn this course, we explore three fundamental ...\n\n      more description for POLSC-AD  142 »\n\n      \n\n\n\nThis course invites students to engage with several classic treatises of political thinking about a universal concern: justice. In John Rawls’s words, justice “is the first virtue of social institutions, as truth is of systems of thought. A theory however elegant and economical must be rejected or revised if it is untrue; likewise laws and institutions no matter how efficient or well-­‐arranged must be reformed or abolished if they are unjust.” To what extent are our contemporary social, political, and economic institutions just? How would we know?\nIn this course, we explore three fundamental questions about the ideal of a just society and what place the values of liberty and equality occupy in such a society:\n1. Which liberties must a just society protect? Liberty of expression? Liberty of religion? Sexual liberty? Economic liberty? Political liberty?\n2. What sorts of equality should a just society ensure? Equality of opportunity? Of economic outcome? Political equality? Equality for different religious and cultural groups?\n3. Can a society ensure both liberty and equality? Or are these warring political values?\n\n      less description for POLSC-AD  142 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 143",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20450",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "WEST_ADMIN 005",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Abdulkadir, Rahma"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  143\n\n   Gender Parity\n\nThis course introduces students to the basic theories, empiricism and methodological concepts of women's and gender studies within political science. Following an overview session about global and regional patterns, each of the subsequent weeks will tackle a series of key gender and politics topics in turn. The course goes beyond gender inequality in the labor market to explore patterns of violence and political participation, among others. Lastly, the course provides basis for research, practical action and policy formulation and for evaluating directions and strategies for social change from...\n\n      more description for POLSC-AD  143 »\n\n      \n\n\n\nThis course introduces students to the basic theories, empiricism and methodological concepts of women's and gender studies within political science. Following an overview session about global and regional patterns, each of the subsequent weeks will tackle a series of key gender and politics topics in turn. The course goes beyond gender inequality in the labor market to explore patterns of violence and political participation, among others. Lastly, the course provides basis for research, practical action and policy formulation and for evaluating directions and strategies for social change from a gender perspective.\n\n      less description for POLSC-AD  143 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 150",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13067",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP E049",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Chacon, Mario"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  150\n\n   Introduction to Comparative Politics\n\nThis course introduces students to the study of comparative politics and the study of domestic political institutions around the world. The course emphasizes the use of theory and evidence to generate and test hypotheses about both the\ncauses and the consequences of the observed variation in domestic political institutions. For example, the course investigates the factors that lead some countries to democratize, and others to institute authoritarian governments, as well as the consequences of those institutional choices for policy outcomes. The course also looks at the variations in institutio...\n\n      more description for POLSC-AD  150 »\n\n      \n\n\n\nThis course introduces students to the study of comparative politics and the study of domestic political institutions around the world. The course emphasizes the use of theory and evidence to generate and test hypotheses about both the\ncauses and the consequences of the observed variation in domestic political institutions. For example, the course investigates the factors that lead some countries to democratize, and others to institute authoritarian governments, as well as the consequences of those institutional choices for policy outcomes. The course also looks at the variations in institutional arrangements within both democratic and non-democratic governments.\nRecommended Prerequisites are: SOCSC-AD 110 Statistics for the Social and Behavioral Sciences and POLSC-AD 130 Introduction to Political Thinking\n\n      less description for POLSC-AD  150 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 151",
            "course_name": "Global Gulf",
            "description": "POLSC-AD  151 Global Gulf \nThis course aims to foster a better understanding of the Gulf region and a deep appreciation of its global significance. We focus on the sociopolitical issues of the global moment and the impact of globalization of Gulf politics, society and culture. Special attention is given to the impact of the Arab Spring of 2011 on the 6 Arab Gulf States. Students are expected to participate in rigorous discussions that critically address the various topics.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 152",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19964",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "X",
            "description": "POLSC-AD  152X\n\n   Comparative Politics of the Middle East\n\nA focus on the “Arab Middle East” presupposes that regional culture is a significant factor in explaining political outcomes in the region. For decades the\nArab Middle East has been largely impervious to the process of democratization. This had led to a widespread academic and journalistic perception of “Arab exceptionalism”. This course explores the dynamics of authoritarianism and democracy in the Arab region, the weight of its professional and entrepreneurial middle classes, and the role of youth and the unemployed in maintaining or challenging the regime. We examine the organization of the...\n\n      more description for POLSC-AD  152X »\n\n      \n\n\n\nA focus on the “Arab Middle East” presupposes that regional culture is a significant factor in explaining political outcomes in the region. For decades the\nArab Middle East has been largely impervious to the process of democratization. This had led to a widespread academic and journalistic perception of “Arab exceptionalism”. This course explores the dynamics of authoritarianism and democracy in the Arab region, the weight of its professional and entrepreneurial middle classes, and the role of youth and the unemployed in maintaining or challenging the regime. We examine the organization of the state, including the military and the intelligence services, the interrelation of political organization with economic change, and the distribution of wealth. The course seeks to link the Arab Middle East to broader questions of political organization and accountability.\nRecommended Prerequisites: Introduction to Comparative Politics (POLSC-AD 150)\n\n      less description for POLSC-AD  152X «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 153",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12918",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 016",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Brule, Rachel"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  153\n\n   Comparative Politics of South Asia\n\nHow did the borders of South Asian countries come to be formed? What explains the variation in the types of regimes—democratic and authoritarian—\nacross South Asia? To what extent do these countries vary in the structure of their states as well as regimes? How does ethnic diversity affect the politics of South Asian countries? What is the pattern of economic growth across these\ncountries, and their human development record and why? What explains the high levels of violence in some South Asian countries and patterns of\nvariation across these countries? These are some of the questions that this ...\n\n      more description for POLSC-AD  153 »\n\n      \n\n\n\nHow did the borders of South Asian countries come to be formed? What explains the variation in the types of regimes—democratic and authoritarian—\nacross South Asia? To what extent do these countries vary in the structure of their states as well as regimes? How does ethnic diversity affect the politics of South Asian countries? What is the pattern of economic growth across these\ncountries, and their human development record and why? What explains the high levels of violence in some South Asian countries and patterns of\nvariation across these countries? These are some of the questions that this course addresses, with a primary focus on India and a secondary focus on\nPakistan, Bangladesh, Sri Lanka, Nepal, Burma, and Bhutan. Although students learn a vast number of facts about the history and politics of the region,\nthe primary purpose of the course is to identify overarching patterns that characterize the politics of these regions—and to teach students to think analytically and comparatively about these patterns.\nRecommended Prerequisites: Introduction to Comparative Politics (POLSC-AD 150)\n\n      less description for POLSC-AD  153 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 154",
            "course_name": "Topics in Comparative Politics",
            "description": "POLSC-AD  154 Topics in Comparative Politics",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 155",
            "course_name": "J",
            "description": "POLSC-AD  155J\n\n   Politics in Modern Europe\n\nThis course explores the politics of the EU, of central and eastern Europe, and of western Europe. With regard to the EU, classical governance issues of popular representation and accountable elite decision-making are both sharply drawn and the subject of explicit agreements between states. These same issues were explicitly confronted in the recent past by those involved in democratization\nand democratic consolidation central and eastern Europe. Western Europe is the intellectual “home” to many of the classical models of popular representation\nand accountable elite decision-making, yet all cou...\n\n      more description for POLSC-AD  155J »\n\n      \n\n\n\nThis course explores the politics of the EU, of central and eastern Europe, and of western Europe. With regard to the EU, classical governance issues of popular representation and accountable elite decision-making are both sharply drawn and the subject of explicit agreements between states. These same issues were explicitly confronted in the recent past by those involved in democratization\nand democratic consolidation central and eastern Europe. Western Europe is the intellectual “home” to many of the classical models of popular representation\nand accountable elite decision-making, yet all countries, and especially smaller countries, are now forced to adapt these models in a setting where the traditional notion of the “stand alone” nation-state is becoming ever less relevant.\nRecommended Prerequisite: POLSC-AD 150 Introduction to Comparative Politics\n\n      less description for POLSC-AD  155J «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 156",
            "course_name": "Power and Politics in America",
            "description": "POLSC-AD  156 Power and Politics in America \nThis course has as a central focus the political institutions of the United States and the effects of those institutions on policy outcomes. The course also places these institutions in the context of those of other wealthy democracies, as a means of illustrating several of the unique features of American political institutions. Topics covered in the course include separation of powers, federalism, and single-member district electoral rules.\nRecommended Prerequisites: Statistics for the Social and Behavioral Sciences (SOCSC-AD 110), Introduction to Political Thinking (POLSC-AD 130)",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 157",
            "course_name": "JX",
            "description": "POLSC-AD  157JX\n\n   Bridging the Divide Between the Arab World and the West\n\nThe course provides students with an opportunity to engage in a multifaceted examination of Arab perceptions of the U.S. and the West, and Western perceptions of the Arab world. Students review literature and press examples of how Arab and Western media, popular culture, and political commentary portray each other. They design and execute a public opinion survey of U.S. and Arab\nattitudes in order to better understand how each side sees the other—using the poll-driven data to measure the gaps in understanding. The course also includes a televised town hall discussion with the students as parti...\n\n      more description for POLSC-AD  157JX »\n\n      \n\n\n\nThe course provides students with an opportunity to engage in a multifaceted examination of Arab perceptions of the U.S. and the West, and Western perceptions of the Arab world. Students review literature and press examples of how Arab and Western media, popular culture, and political commentary portray each other. They design and execute a public opinion survey of U.S. and Arab\nattitudes in order to better understand how each side sees the other—using the poll-driven data to measure the gaps in understanding. The course also includes a televised town hall discussion with the students as participants engaging each other and peers from across the region in an examination of the topic.\n\n      less description for POLSC-AD  157JX «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 158",
            "course_name": "",
            "description": "POLSC-AD  158\n\n   Comparative Legislatures\n\nPrerequisites: Introduction to Comparative Politics. This course introduces students to many aspects of legislative politics across the democratic world, addressing the questions of what legislatures do during a given legislative period and why they do this. The course provides students with a set of tools for understanding how legislatures are organized and how legislators behave. Topics examined include: congressional and parliamentary elections; the role of political parties and interest groups in lawmaking and elections; the impact of internal organization of legislatures on lawmaking; and...\n\n      more description for POLSC-AD  158 »\n\n      \n\n\n\nPrerequisites: Introduction to Comparative Politics. This course introduces students to many aspects of legislative politics across the democratic world, addressing the questions of what legislatures do during a given legislative period and why they do this. The course provides students with a set of tools for understanding how legislatures are organized and how legislators behave. Topics examined include: congressional and parliamentary elections; the role of political parties and interest groups in lawmaking and elections; the impact of internal organization of legislatures on lawmaking; and “policy space” within which legislative decision making takes place.\n\n      less description for POLSC-AD  158 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 159",
            "course_name": "X",
            "description": "POLSC-AD  159X\n\n   Public Policy Challenges in the Middle East\n\nPublic policy is a major facet of the political economy of states and societies. It comprises the instruments by which public authorities shape incentives to push and prod their societies and economies in desired directions. This course has two main objectives: to introduce students to major policy issues that face virtually all political systems and to understand them through the prism of Arab politics and society.  Successful political systems are those that adjust best and most quickly to unexpected reactions to specific incentives. In the Arab Middle East political authorities in several r...\n\n      more description for POLSC-AD  159X »\n\n      \n\n\n\nPublic policy is a major facet of the political economy of states and societies. It comprises the instruments by which public authorities shape incentives to push and prod their societies and economies in desired directions. This course has two main objectives: to introduce students to major policy issues that face virtually all political systems and to understand them through the prism of Arab politics and society.  Successful political systems are those that adjust best and most quickly to unexpected reactions to specific incentives. In the Arab Middle East political authorities in several regimes have relied on implicit social contracts to hold their populations politically inactive. Since the winter of 2011 social contract incentives have broken down, and no Arab regime has successfully coped with the break down.  This course considers the subsequent public policy challenges.\n\n      less description for POLSC-AD  159X «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 160",
            "course_name": "J",
            "description": "POLSC-AD  160J\n\n   Social Media and Political Participation\n\nIn recent years, social media usage (Facebook, Twitter, Linked In, Tumbler, etc.) has exploded to such an extent that it is impossible to believe it does not have an effect on the political behavior of citizens. The question remains, though, of\nhow exactly does it matter? This is the focus of our course. In the morning sessions, student are first introduced to the most important topics of political behavior—voting, turnout, partisanship, public opinion formation, and protests and social movements—and then to the much newer literature on the usage of social media. In the afternoon sessions, stu...\n\n      more description for POLSC-AD  160J »\n\n      \n\n\n\nIn recent years, social media usage (Facebook, Twitter, Linked In, Tumbler, etc.) has exploded to such an extent that it is impossible to believe it does not have an effect on the political behavior of citizens. The question remains, though, of\nhow exactly does it matter? This is the focus of our course. In the morning sessions, student are first introduced to the most important topics of political behavior—voting, turnout, partisanship, public opinion formation, and protests and social movements—and then to the much newer literature on the usage of social media. In the afternoon sessions, students both visit social media\ncompanies located in New York City, and are taught the necessary tools to work on their own original research projects. These research projects are\nconducted in conjunction with NYU’s new Social Media and Political Participation laboratory (smapp.nyu.edu).\n\n      less description for POLSC-AD  160J «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 161",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20145",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 018",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "van der Windt, Peter"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  161\n\n   Comparative Politics of Africa\n\nThe goal of this course is to introduce participants to the study of African politics\nfrom multiple methodological approaches and in a number of African contexts.\nThe course begins with the historical roots of contemporary African politics,\nexploring how pre-colonial institutions and colonialism shaped African politics at independence. Then, we survey the political and economic strategies of leaders post-independence and the factors shaping those strategies. We examine the causes and consequences of poor governance, and evaluate the recent patterns of redemocratization on the continent. The co...\n\n      more description for POLSC-AD  161 »\n\n      \n\n\n\nThe goal of this course is to introduce participants to the study of African politics\nfrom multiple methodological approaches and in a number of African contexts.\nThe course begins with the historical roots of contemporary African politics,\nexploring how pre-colonial institutions and colonialism shaped African politics at independence. Then, we survey the political and economic strategies of leaders post-independence and the factors shaping those strategies. We examine the causes and consequences of poor governance, and evaluate the recent patterns of redemocratization on the continent. The course closes with a discussion of present-day challenges: electoral malfeasance, public health crises, the “new” populism, and China in Africa.\n\n      less description for POLSC-AD  161 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 170",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17871",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "CAMP E050"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  170\n\n   Introduction to International Politics\n\nThe goal of this course is to introduce the basic analytical concepts and techniques that are essential for understanding international politics.\nWe are especially concerned with analytically exploring major issues in international politics, such as the causes of war, the emergence of cooperative\ntrade relations between states, the origins and functioning of international organizations such as the United Nations, and the political determinants\nof financial crises. The focus of the course is neither historical nor descriptive; rather, it requires students to exercise skills in logic and to thin...\n\n      more description for POLSC-AD  170 »\n\n      \n\n\n\nThe goal of this course is to introduce the basic analytical concepts and techniques that are essential for understanding international politics.\nWe are especially concerned with analytically exploring major issues in international politics, such as the causes of war, the emergence of cooperative\ntrade relations between states, the origins and functioning of international organizations such as the United Nations, and the political determinants\nof financial crises. The focus of the course is neither historical nor descriptive; rather, it requires students to exercise skills in logic and to think of\nimaginative ways to apply subtle techniques to gain a clearer grasp of the above political issues.\nIt is recommended that students complete SOCSC-AD 110 and POLSC-AD 130 prior to taking this course.\n\n      less description for POLSC-AD  170 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 171",
            "course_name": "",
            "description": "POLSC-AD  171\n\n   International Conflict\n\nPrerequisites: Introduction to International Politics. This course explores the conditions that lead to the initiation, escalation, spread, termination,\nand consequences of international conflict as well as the circumstances that promote, preserve, or restore peace. The main objective is to identify strategies that promote cooperative solutions to international disputes and to evaluate those strategies in terms of their historical effectiveness. The course emphasizes the application of models of strategic rational action as tools for assessing relations between nations, coupled with statistic...\n\n      more description for POLSC-AD  171 »\n\n      \n\n\n\nPrerequisites: Introduction to International Politics. This course explores the conditions that lead to the initiation, escalation, spread, termination,\nand consequences of international conflict as well as the circumstances that promote, preserve, or restore peace. The main objective is to identify strategies that promote cooperative solutions to international disputes and to evaluate those strategies in terms of their historical effectiveness. The course emphasizes the application of models of strategic rational action as tools for assessing relations between nations, coupled with statistical and historical analysis of classes of events.\n\n      less description for POLSC-AD  171 «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 172",
            "course_name": "International Organization",
            "description": "POLSC-AD  172 International Organization \nPrerequisites: Introduction to International Politics.  This course covers the formal theory of international cooperation, including the reasons why countries choose to cooperate, bargaining over and enforcement of international agreements, and multilateralism. The remainder of the course discusses empirical examples including peacekeeping, collective security, economic and environmental cooperation, human rights treaties, and arms control.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 173",
            "course_name": "International Political Economy",
            "description": "POLSC-AD  173 International Political Economy \nThis course serves as an introduction to the workings of the contemporary international political-economic system and introduces students to some of the main analytical frameworks that political economists use to understand this\nsystem. The course seeks to familiarize students with analytical tools that help them gain a better understanding of the current problems and opportunities\nfacing actors in today’s international political economy.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 174",
            "course_name": "Domestic Determinants of International Relations",
            "description": "POLSC-AD  174 Domestic Determinants of International Relations \nPrerequisites: Introduction to International Politics.  Domestic political circumstances affect the policy incentives of leaders. Hence domestic political institutions, economic performance, and popularity all influence foreign policy. In turn, international outcomes influence the domestic survival of leaders. This course explores the theoretical linkages between domestic and international events.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 175",
            "course_name": "Topics in International Politics",
            "description": "POLSC-AD  175 Topics in International Politics",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 176",
            "course_name": "J",
            "description": "POLSC-AD  176J\n\n   Nation-Building\n\nNation-Building explores the range of strategies which strong states use in order to build the capacity of weak ones. This is a matter, not of morality, but of national security. Thanks to globalization, the poisons which brew inside weak\nor failing states can now infect neighbors, or countries halfway across the globe; the terrorist attacks of 9/11 reinforced this lesson with terrible force. But is it really possible for outsiders to help build solid economic and political structures\nin fragile states? Is “democracy promotion” a contradiction in terms? Experience in places like Afghanistan or...\n\n      more description for POLSC-AD  176J »\n\n      \n\n\n\nNation-Building explores the range of strategies which strong states use in order to build the capacity of weak ones. This is a matter, not of morality, but of national security. Thanks to globalization, the poisons which brew inside weak\nor failing states can now infect neighbors, or countries halfway across the globe; the terrorist attacks of 9/11 reinforced this lesson with terrible force. But is it really possible for outsiders to help build solid economic and political structures\nin fragile states? Is “democracy promotion” a contradiction in terms? Experience in places like Afghanistan or Haiti is hardly encouraging. The class asks what can be done, and by whom, and in what kind of setting. We visit UN officials in New York and government officials in Washington, as well as experts in both places.\n\n      less description for POLSC-AD  176J «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 177",
            "course_name": "Civil War and International Intervention",
            "description": "POLSC-AD  177 Civil War and International Intervention \nCivil war continues to be one of the most vexing problems in comparative and international politics. Why do civil wars break out? Aside from the obvious physical destruction caused by civil conflict what are the effects of civil conflict on\nsociety? How can the international community help end civil conflicts? We address these questions in this course. The course is broken into two parts\nstarting with the causes of civil conflict, then moving on to what, if anything, the international community can do to ameliorate this problem.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 178",
            "course_name": "J Understanding Insurgency and Counterinsurgency",
            "description": "POLSC-AD  178J Understanding Insurgency and Counterinsurgency \nInsurgencies continue to be a major threat to peace in developing countries. How do insurgencies arise? Why do people join insurgent movements?\nWhat strategies do insurgent movements pursue? What can states do to address insurgent movements most effectively? This course addresses these questions. It begins with a review of the scholarly literature on insurgency. Students then travel to Kathmandu, Nepal to meet with participants in Nepal's 10-year civil war from 1996 to 2006 and learn their perspectives on these questions obtained from their experiences.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 179",
            "course_name": "J",
            "description": "POLSC-AD  179J\n\n   Political Conflict and Economic Development\n\nIt is now widely acknowledged that political conflicts play a major role in driving economic development trajectories.  We will study how political conflicts impact economic development, using examples from Latin America’s rich political and economic history to better understand the conflict-development relationship.  The course will follow a seminar format and students will be encouraged to compare the conflict-development relationship in Latin America with that of their own country, and come up with explanations for differences between the two.  The course will include multiple field trips t...\n\n      more description for POLSC-AD  179J »\n\n      \n\n\n\nIt is now widely acknowledged that political conflicts play a major role in driving economic development trajectories.  We will study how political conflicts impact economic development, using examples from Latin America’s rich political and economic history to better understand the conflict-development relationship.  The course will follow a seminar format and students will be encouraged to compare the conflict-development relationship in Latin America with that of their own country, and come up with explanations for differences between the two.  The course will include multiple field trips to significant sites for Argentina’s political conflicts.\n\n      less description for POLSC-AD  179J «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 180",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12825",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Rogowski, Ronald"
                }
            ],
            "course_name": "Political Economy of International Trade",
            "description": "POLSC-AD  180 Political Economy of International Trade \nThis course covers five major topics in international political economy: international trade and trade policy (tariffs, quotas, trade agreements); international migration and remittances; offshoring and outsourcing; international finance (exchange rates, cross-border investment, central bank\npolicy); crises of the international economy: the 1930s, 2007–2009, and the current crises of the Euro and of European sovereign debt.",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 181",
            "course_name": "Ethnicity and Violence",
            "description": "POLSC-AD  181 Ethnicity and Violence \nA seminar devoted to investigating (1) where ethnic division comes from (2) how ethnicity relates to politics, and (3) why politics often turn violent. This course covers seminal papers and readings that have helped academics and policymakers understand the root causes of ethnic conflict and other specific forms of violence including civil war, insurgency, revolution, and terrorism.",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 183",
            "course_name": "J",
            "description": "POLSC-AD  183J\n\n   Emerging Powers\n\nAre Emerging Powers emerging, and are they powers? The course will consider the emerging \"market\" or economic discussion, reviewing what academics, the press, financial institutions, etc., mean when they speak of these countries, with acronyms such as BRICs, BRICS, MINT, and others.  What is the key factor: size, growth, novelty,  potential or promise? Which of all of these questions is truly relevant and important?  The second part of the class will examine regional, geopolitical issues: are these countries important actors in their regions? Why or why not, and how does their economic perform...\n\n      more description for POLSC-AD  183J »\n\n      \n\n\n\nAre Emerging Powers emerging, and are they powers? The course will consider the emerging \"market\" or economic discussion, reviewing what academics, the press, financial institutions, etc., mean when they speak of these countries, with acronyms such as BRICs, BRICS, MINT, and others.  What is the key factor: size, growth, novelty,  potential or promise? Which of all of these questions is truly relevant and important?  The second part of the class will examine regional, geopolitical issues: are these countries important actors in their regions? Why or why not, and how does their economic performance influence their regional political action (domestic ideological and institutional issues would also be rapidly addressed here)? The third part of the class will turn to international and multilateral factors: are \"emerging powers\" truly powers? Are they all the same? Do others see them as powers? How do they express their economic success or geographic and demographic clout in the international arena?\n\n      less description for POLSC-AD  183J «",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 184",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19120",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 016",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Kazmi, Shakeel"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  184\n\n   UN: Negotiation towards A New Binding & Universal Agreement on Climate Change in Paris in Dec 2015\n\nThe United Nations (UN) provides the forum where states come together to discuss mutual problems. In our rapidly globalized world, the enormous and complex challenges to humankind are making UN indispensable. This course will provide an overview of the various UN departments and programs encompassed within it and treaty negotiation process. The main concentration of this course will remain climate change negotiations. We will take climate change as a case study and consider many aspects of international policy response to this environmental and social crisis. The purpose of this course is to p...\n\n      more description for POLSC-AD  184 »\n\n      \n\n\n\nThe United Nations (UN) provides the forum where states come together to discuss mutual problems. In our rapidly globalized world, the enormous and complex challenges to humankind are making UN indispensable. This course will provide an overview of the various UN departments and programs encompassed within it and treaty negotiation process. The main concentration of this course will remain climate change negotiations. We will take climate change as a case study and consider many aspects of international policy response to this environmental and social crisis. The purpose of this course is to provide students with a general understanding of how climate change issues have been addressed at the UN. The class will be invited to study ongoing process of the new climate change agreement, which will be adopted in Paris in December 2015, at the 21st Conference of the Parties (COP21). The meeting will mark a decisive stage in negotiations on the future international agreement on a post-2020 regime. The course will closely investigate the pertinent challenges currently facing diplomats and international decision makers in making progress with what is currently on the negotiating table. We will try to seek the answer of the following questions: Will all the nations of the world, including the biggest emitters of greenhouse gases, be bound by a universal agreement on climate change for the first time in over 20 years of UN negotiations? Will it take the form of a protocol, another legal instrument or 'an agreed outcome with legal force', and will it be applicable to all Parties including US and China? In a treaty negotiation simulation, the students will play the roles of major green house gas emitting nations and will negotiate proposals to reduce emissions. The in-class negotiation exercise will be modeled on the real negotiations under the UNFCCC.\n\n      less description for POLSC-AD  184 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 198",
            "course_name": "Directed Study",
            "description": "POLSC-AD  198 Directed Study",
            "offering": false
        },
        {
            "course_id": "POLSC-AD 209",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13068",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Harris, Jonathan Andrew"
                }
            ],
            "course_name": "",
            "description": "POLSC-AD  209\n\n   Data Analysis\n\nSocial scientists and policy analysts rely heavily on research drawing on observational data. Students learn to manage and analyze such data and to deploy statistical techniques that are common in these applications, with an emphasis on how to translate social science theory into empirical research. Topics include review of basic regression analysis, building multivariate analytical models, and regression analysis with limited dependent variables. The course emphasizes practical training in these skills as well as evaluation, replication, and critical analysis of research conducted in the soci...\n\n      more description for POLSC-AD  209 »\n\n      \n\n\n\nSocial scientists and policy analysts rely heavily on research drawing on observational data. Students learn to manage and analyze such data and to deploy statistical techniques that are common in these applications, with an emphasis on how to translate social science theory into empirical research. Topics include review of basic regression analysis, building multivariate analytical models, and regression analysis with limited dependent variables. The course emphasizes practical training in these skills as well as evaluation, replication, and critical analysis of research conducted in the social science literature. The course assumes knowledge of the material covered in Statistics for Social and Behavioral Sciences and is designed as alternative for students in the social sciences who are not taking Introduction to Econometrics.\n\n      less description for POLSC-AD  209 «",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 400",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12841",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 018",
                    "time": "Tue 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": "Harris, Jonathan Andrew"
                },
                {
                    "format": "Seminar",
                    "class_id": "12915",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 019",
                    "time": "Tue 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": "Peisakhin, Leonid"
                }
            ],
            "course_name": "Senior Capstone Research Project",
            "description": "POLSC-AD  400 Senior Capstone Research Project \nStudents develop a research question, construct a research design that allows them to test potential answers to that question, collect relevant data, analyze the results, and write a senior thesis.",
            "offering": true
        },
        {
            "course_id": "POLSC-AD 401",
            "course_name": "Senior Capstone Research Project",
            "description": "POLSC-AD  401 Senior Capstone Research Project \nStudents develop a research question, construct a research design that allows them to test potential answers to that question, collect relevant data, analyze the results, and write a senior thesis.",
            "offering": false
        }
    ]
}