{
    "major_id": "PSYCH-AD",
    "file": "./2015-2016/Psychology_(PSYCH-AD).html",
    "courses": [
        {
            "course_id": "PSYCH-AD 100",
            "course_name": "",
            "description": "PSYCH-AD  100\n\n   Introduction to Linguistics\n\nThis course offers an introduction to linguistics, the scientific study of language. The focus of linguistics within the cognitive sciences is to understand how it is that  humans are able to speak and understand natural language, how they acquire this ability, and how they put it to use. The ability to speak and understand language is unique to humans and universally represented within the species. It affords us, together with other faculties of the mind, the ability to achieve levels of abstract thinking as well as social organization, which is unprecedented in the animal kingdom. Language i...\n\n      more description for PSYCH-AD  100 »\n\n      \n\n\n\nThis course offers an introduction to linguistics, the scientific study of language. The focus of linguistics within the cognitive sciences is to understand how it is that  humans are able to speak and understand natural language, how they acquire this ability, and how they put it to use. The ability to speak and understand language is unique to humans and universally represented within the species. It affords us, together with other faculties of the mind, the ability to achieve levels of abstract thinking as well as social organization, which is unprecedented in the animal kingdom. Language is therefore one of the most characteristic features that we have as a species, and its study is of central importance to understanding what it is to be human. This course is open to all students but will not count towards the Psychology major.\n\n      less description for PSYCH-AD  100 «",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12735",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP E050",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Bilali, Rezarta"
                }
            ],
            "course_name": "Introduction to Psychology",
            "description": "PSYCH-AD  101 Introduction to Psychology \nIntroduction to the fundamental principles of psychology, emphasizing both the unity and diversity of a field that spans major theoretical and research areas, including biological bases of human behavior, learning, development, motivation, as well as social and abnormal behavior. Opportunities to apply knowledge gained in lectures and readings are available through computer-based demonstrations, in-class exercises, and required field experiences.",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 102",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19229",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W008",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Eyssel, Friederike"
                }
            ],
            "course_name": "Research Methods in Psychology",
            "description": "PSYCH-AD  102 Research Methods in Psychology \nThis course offers an overview of diverse research designs involving quantitative and qualitative methods. It is an introduction to essential elements of psychological research, including the formulation of questions and hypotheses, identification of variables and operational definitions, participant sampling, data collection, and basic analytical techniques. Students get to know the main elements and logic of psychological research and develop a conceptual and critical understanding of rigorous analysis.",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 105",
            "course_name": "",
            "description": "PSYCH-AD  105\n\n   Introduction to Biopsychology\n\nBiopsychology is concerned with the biological basis of behaviors. An understanding of how behavior is implemented in different organisms is critical for a full appreciation of the connection between mind and action. In this course, students discover connections between psychology and biology, pharmacology, endocrinology, and genetics. In particular, students explore the structure, function and development of the human nervous system and discuss how they give rise to basic sensory, motor, cognitive and motivational processes that characterize the human mind. Students develop a basic understand...\n\n      more description for PSYCH-AD  105 »\n\n      \n\n\n\nBiopsychology is concerned with the biological basis of behaviors. An understanding of how behavior is implemented in different organisms is critical for a full appreciation of the connection between mind and action. In this course, students discover connections between psychology and biology, pharmacology, endocrinology, and genetics. In particular, students explore the structure, function and development of the human nervous system and discuss how they give rise to basic sensory, motor, cognitive and motivational processes that characterize the human mind. Students develop a basic understanding of the methodologies used in biopsychology and important scientific findings in the field, allowing them to gain insights on how thoughts and behaviors can be rooted in physiological causes.\n\n      less description for PSYCH-AD  105 «",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 106",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20146",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 001",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Volcic, Robert"
                }
            ],
            "course_name": "Statistics for Psychologists",
            "description": "PSYCH-AD  106 Statistics for Psychologists \nStatistics form a critical component of research, and this course is designed to introduce students to the foundations of statistical principles in psychological science. This course will cover basic level statistics concepts such as central tendency and variability; the theory and logic underlying hypothesis testing and statistical decision making; the basic principles behind linear models commonly used in psychology,  including correlations, t-tests, analysis of variance, and basic regression. The course will also introduce student to basic statistical computer programs.",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 110",
            "course_name": "",
            "description": "PSYCH-AD  110\n\n   Cognition\n\nCognitive psychology is the scientific study of the human mind and human thinking. This course provides a better understanding of how we humans perceive and think about ourselves and about the world. This is relevant to psychology because our perception and thought processes are fraught with biases that nonetheless routinely inform human actions. Knowing about these biases and understanding their effects is crucial in a world in which human societies are becoming increasingly more interconnected. The course covers perception, attention, memory, language, concepts, reasoning, problem solving, e...\n\n      more description for PSYCH-AD  110 »\n\n      \n\n\n\nCognitive psychology is the scientific study of the human mind and human thinking. This course provides a better understanding of how we humans perceive and think about ourselves and about the world. This is relevant to psychology because our perception and thought processes are fraught with biases that nonetheless routinely inform human actions. Knowing about these biases and understanding their effects is crucial in a world in which human societies are becoming increasingly more interconnected. The course covers perception, attention, memory, language, concepts, reasoning, problem solving, expertise, creativity, and decision-making, while emphasizing how psychologists use experiments to learn about the structure of the human mind, including how the mind and human thinking works, with all its successes and pitfalls.\n\n      less description for PSYCH-AD  110 «",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 111",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19227",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EAST_ADMIN 006",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "von Suchodoletz, Antje"
                }
            ],
            "course_name": "",
            "description": "PSYCH-AD  111\n\n   Developmental Psychology\n\nThis course provides an introduction to the major theoretical issues and research in developmental psychology. It focuses on developmental processes and milestones from infancy through adolescence. Lectures interweave theory, methods, and findings about how we develop as perceiving, thinking, and feeling beings. The course covers physical development, cognitive processes, social and emotional development, language development, family contexts, risk and resilience, and nature/nurture issues. The course will explore the origins and development of human knowledge in the individual child with a fo...\n\n      more description for PSYCH-AD  111 »\n\n      \n\n\n\nThis course provides an introduction to the major theoretical issues and research in developmental psychology. It focuses on developmental processes and milestones from infancy through adolescence. Lectures interweave theory, methods, and findings about how we develop as perceiving, thinking, and feeling beings. The course covers physical development, cognitive processes, social and emotional development, language development, family contexts, risk and resilience, and nature/nurture issues. The course will explore the origins and development of human knowledge in the individual child with a focus on two core domains: knowledge of the physical world and knowledge of the social world. Within each domain, the course focuses on experimental data from developmental psychology but also draws on evidence from other disciplines, including comparative psychology, behavioral ecology, and cultural anthropology.\n\n      less description for PSYCH-AD  111 «",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 112",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19228",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W008",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Watson, Andrew"
                }
            ],
            "course_name": "Perception",
            "description": "PSYCH-AD  112 Perception \nHow do we construct a conception of physical reality based on sensory experience? This course provides a survey of basic facts, theories, and methods for studying sensation and perception. The major emphasis is on vision and audition, but other modalities may be covered. Representative topics include: receptor function and physiology; color; motion; depth; psycho physics of detection, discrimination, and appearance; perceptual constancies; adaptation, pattern recognition, and the interaction of knowledge and perception.",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 150",
            "course_name": "",
            "description": "PSYCH-AD  150\n\n   Social Psychology\n\nSocial psychology is concerned with how our thoughts, emotions, and behaviors are affected by the presence of others. Because humans are fundamentally social animals, understanding social psychology is important for understanding human psychology more generally. This course provides a comprehensive survey of research and theory in the psychology of social behaviors, emotions, motivations, and cognitions of individuals, including the  study of perceiving others, attitude formation, decision making, group processes, altruism and helping, aggression, social influence, the self, attraction, affili...\n\n      more description for PSYCH-AD  150 »\n\n      \n\n\n\nSocial psychology is concerned with how our thoughts, emotions, and behaviors are affected by the presence of others. Because humans are fundamentally social animals, understanding social psychology is important for understanding human psychology more generally. This course provides a comprehensive survey of research and theory in the psychology of social behaviors, emotions, motivations, and cognitions of individuals, including the  study of perceiving others, attitude formation, decision making, group processes, altruism and helping, aggression, social influence, the self, attraction, affiliation, moral thought and action, and intergroup relations.\n\n      less description for PSYCH-AD  150 «",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 151",
            "course_name": "Personality",
            "description": "PSYCH-AD  151 Personality \nIntroduction to the major theories of personality and research in personality, including such topics as the self-concept; unconscious processes; how we relate to others; and stress, anxiety, and depression. The work of various theorists is discussed as it relates to personality development throughout the life span.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 152",
            "course_name": "Culture and Context",
            "description": "PSYCH-AD  152 Culture and Context \nIn-depth examination of the cultural and contextual factors and how these factors influence every aspect of psychological theory, practice and research. Major theories, assessment approaches, practice and research in psychology are critiqued by investigating universalistic principles, behavior and experience as it occurs in multiple cultures, as well as issues such as oppression, racism, prejudice, social class and value differences.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 153",
            "course_name": "J Culture, Context, and Psychology",
            "description": "PSYCH-AD  153J Culture, Context, and Psychology \nThe aim of this class is to explore and analyze classic theories of culture and context in the field of psychology, with a specific emphasis on understanding how these processes shape human development. We also examine research that focuses on cultural and contextual variability and similarity among youth and families from different parts of the world and how different forms of oppression and prejudice shape the developmental trajectories of youth.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 190",
            "course_name": "Special Topics in Psychology",
            "description": "PSYCH-AD  190 Special Topics in Psychology \nThese courses are high-level seminars offered on a wide variety of topics, including the history of psychology, emotion, motivation, social influence, intergroup relations, clinical and counseling psychology, and other focal themes. The topics will change to reflect the areas of research of the faculty at NYUAD and the affiliated faculty from NYUNY.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 298",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12900",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PSYCH-AD  298\n\n   Directed Study | Directed Study in Psychology\n\nThis course is intended for students who are highly motivated and seek a deeper understanding of a specific literature in psychology, with a faculty sponsor from the NYUAD Program in Psychology. Students with the necessary background in course work and who, in the opinion of a faculty sponsor, possess intellectual independence and ability may register for this course. The student must approach a faculty member in his or her field of interest to obtain sponsorship. Typically, this course is only open to students with a minimum overall GPA of 3.3 and a minimum major GPA of 3.5, and registration ...\n\n      more description for PSYCH-AD  298 »\n\n      \n\n\n\nThis course is intended for students who are highly motivated and seek a deeper understanding of a specific literature in psychology, with a faculty sponsor from the NYUAD Program in Psychology. Students with the necessary background in course work and who, in the opinion of a faculty sponsor, possess intellectual independence and ability may register for this course. The student must approach a faculty member in his or her field of interest to obtain sponsorship. Typically, this course is only open to students with a minimum overall GPA of 3.3 and a minimum major GPA of 3.5, and registration requires permission of the sponsoring faculty member. Forms for Guided Study in Research in Psychology are available from the Office of the Dean of Science.\n\n      less description for PSYCH-AD  298 «",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 299",
            "course_name": "",
            "description": "PSYCH-AD  299\n\n   Directed Research in Psychology | Directed Study\n\nThis course is intended for students who are highly motivated and seek the opportunity to work in field or laboratory research with a faculty sponsor from the NYUAD Program in Psychology. Students with the necessary background in course work and who, in the opinion of a faculty sponsor, possess intellectual independence and ability may register for this course. The student must approach a faculty member in his or her field of interest to obtain sponsorship. Typically, this course is only open to students with a minimum overall GPA of 3.3 and a minimum major GPA of 3.5, and registration require...\n\n      more description for PSYCH-AD  299 »\n\n      \n\n\n\nThis course is intended for students who are highly motivated and seek the opportunity to work in field or laboratory research with a faculty sponsor from the NYUAD Program in Psychology. Students with the necessary background in course work and who, in the opinion of a faculty sponsor, possess intellectual independence and ability may register for this course. The student must approach a faculty member in his or her field of interest to obtain sponsorship. Typically, this course is only open to students with a minimum overall GPA of 3.3 and a minimum major GPA of 3.5, and registration requires permission of the sponsoring faculty member. Forms for Guided Study in Research in Psychology are available from the Office of the Dean of Science.\n\n      less description for PSYCH-AD  299 «",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 311",
            "course_name": "Cognitive Neuroscience",
            "description": "PSYCH-AD  311 Cognitive Neuroscience \nThe frontal cortex is thought to be a key cortical area important for the integration of sensory and motor information. Many cognitive and emotional facets of our behavior that make us unique as humans are thought to depend on the frontal cortex, which accounts for almost 1/3 of the cortical surface of the entire brain. In this course we cover important neuropsychological patient studies and theories as well as human and animal empirical studies into the structure and physiology of the frontal lobes as they relate to higher cognitive functions.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 312",
            "course_name": "Decision Making | Decisionmaking",
            "description": "PSYCH-AD  312 Decision Making | Decisionmaking \nThis course focuses in depth on a single aspect of thinking: decision-making. Decision-making is a critical part of every person’s life, as we make decisions about major life events such as what college to go to (if any), whether to get married, or what career to follow, down to trivial decisions about which bagel to order or where to sit in a class. We examine formal theories of how people make decisions, as well as many studies on whether people are good or even rational decision maker.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 315",
            "course_name": "Psychology of Language",
            "description": "PSYCH-AD  315 Psychology of Language \nExamines theories and research concerning the cognitive processes and linguistic representations that enable language comprehension and production. Topics include speech perception, visual processes during reading, word recognition, syntactic processing, and semantic/discourse processing.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 316",
            "course_name": "Motivation and Volition",
            "description": "PSYCH-AD  316 Motivation and Volition \nThe course provides an overview of the major theories and findings in research on motivation and volition. It addresses the history of research on motivation and volition, classic phenomena of being motivated versus lacking motivation and willpower, the psychology of goals (goal setting, goal implementation, effortful goal pursuits, disengagement, content and structure of goals, the mental representation of goals), disorders of self-regulation, and cognitive-neuropsychological research as well as the perspective of economics on motivation and volition.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 317",
            "course_name": "Prejudice and Stereotyping",
            "description": "PSYCH-AD  317 Prejudice and Stereotyping \nThis course covers historical and contemporary scientific approaches to understanding prejudice, specifically prejudice that exists between social groups (for example, ethnic prejudice, religious prejudice, etc.) across different cultures. Readings cover topics including the origins of prejudice, the justification of prejudice, the different forms of prejudicial expression, the identification of prejudice in individuals and institutions, the consequences of being a victim of prejudice, and the value (or not) of different prejudice reduction strategies.",
            "offering": false
        },
        {
            "course_id": "PSYCH-AD 321",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19226",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W008",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Sreenivasan, Kartik"
                }
            ],
            "course_name": "",
            "description": "PSYCH-AD  321\n\n   Lab in Cognitive Control\n\nThis course examines the mind and brain of cognitive control - the ability to flexibly adapt our behaviors to achieve our goals. Students will be introduced to key psychological and neuroscientific concepts in the fields of attention, memory, decision-making, and motor control. Discussions will focus on original research, and will involve interactive demonstrations and/or data collection to reproduce seminal research findings. Additionally, the course will cover the brain systems involved in cognitive control, as well as the various tools that researchers use to investigate cognition. As part ...\n\n      more description for PSYCH-AD  321 »\n\n      \n\n\n\nThis course examines the mind and brain of cognitive control - the ability to flexibly adapt our behaviors to achieve our goals. Students will be introduced to key psychological and neuroscientific concepts in the fields of attention, memory, decision-making, and motor control. Discussions will focus on original research, and will involve interactive demonstrations and/or data collection to reproduce seminal research findings. Additionally, the course will cover the brain systems involved in cognitive control, as well as the various tools that researchers use to investigate cognition. As part of the course, students will present and critique research from primary sources, and will write a research proposal aimed at answering novel questions about cognitive control.\n\n      less description for PSYCH-AD  321 «",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 390",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12985",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue 5.00 PM - 6.00 PM",
                    "open": true,
                    "professor": "COMP_RES 001"
                }
            ],
            "course_name": "",
            "description": "PSYCH-AD  390\n\n   Psychology Capstone Seminar\n\nThe capstone seminar provides students with an overview of the diverse multidisciplinary research areas that have captured the interest and fascination of NYUAD psychologiosts and others in related fields. Through exposure to NYUAD faculty research, students will identify potential areas of interest for their own capstone research, and over the course of the semester develop and put into writing an in-depth biology capstone proposal. The final capstone proposal is due at the end of the seminar so that students can begin the Capstone Project by the fall semester of their senior year.  Beginning...\n\n      more description for PSYCH-AD  390 »\n\n      \n\n\n\nThe capstone seminar provides students with an overview of the diverse multidisciplinary research areas that have captured the interest and fascination of NYUAD psychologiosts and others in related fields. Through exposure to NYUAD faculty research, students will identify potential areas of interest for their own capstone research, and over the course of the semester develop and put into writing an in-depth biology capstone proposal. The final capstone proposal is due at the end of the seminar so that students can begin the Capstone Project by the fall semester of their senior year.  Beginning in 2014-15 all science majors are expected to take this course in the junior year; it will be offered every semester.\n\n      less description for PSYCH-AD  390 «",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 400",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13045",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PSYCH-AD  400\n\n   Senior Capstone Research Project\n\nThe senior Capstone Experience requires students to engage in a long-term, mentored learning experience that cumulates in a piece of original research and/or scientific theory. The specific project is developed during junior year as part of the Capstone Seminar. During the Capstone Project, the proposed work will come to fruition in the form of a research thesis that should comprise 4000 to 5000 words and must comply with formatting standards as outlined by the American Psychological Association. In addition, students are expected to present their work as part of the capstone festival, either ...\n\n      more description for PSYCH-AD  400 »\n\n      \n\n\n\nThe senior Capstone Experience requires students to engage in a long-term, mentored learning experience that cumulates in a piece of original research and/or scientific theory. The specific project is developed during junior year as part of the Capstone Seminar. During the Capstone Project, the proposed work will come to fruition in the form of a research thesis that should comprise 4000 to 5000 words and must comply with formatting standards as outlined by the American Psychological Association. In addition, students are expected to present their work as part of the capstone festival, either as a poster or an oral presentation.\n\n      less description for PSYCH-AD  400 «",
            "offering": true
        },
        {
            "course_id": "PSYCH-AD 401",
            "course_name": "",
            "description": "PSYCH-AD  401\n\n   Senior Capstone Research Project\n\nThe senior Capstone Experience requires students to engage in a long-term, mentored learning experience that cumulates in a piece of original research and/or scientific theory. The specific project is developed during junior year as part of the Capstone Seminar. During the Capstone Project, the proposed work will come to fruition in the form of a research thesis that should comprise 4000 to 5000 words and must comply with formatting standards as outlined by the American Psychological Association. In addition, students are expected to present their work as part of the capstone festival, either ...\n\n      more description for PSYCH-AD  401 »\n\n      \n\n\n\nThe senior Capstone Experience requires students to engage in a long-term, mentored learning experience that cumulates in a piece of original research and/or scientific theory. The specific project is developed during junior year as part of the Capstone Seminar. During the Capstone Project, the proposed work will come to fruition in the form of a research thesis that should comprise 4000 to 5000 words and must comply with formatting standards as outlined by the American Psychological Association. In addition, students are expected to present their work as part of the capstone festival, either as a poster or an oral presentation.\n\n      less description for PSYCH-AD  401 «",
            "offering": false
        }
    ]
}