{
    "major_id": "SOCED-GE",
    "file": "./2015-2016/Social_Studies_Education_(SOCED-GE).html",
    "courses": [
        {
            "course_id": "SOCED-GE 2003",
            "course_name": "Intl Internshp in Overseas French Enterp",
            "description": "SOCED-GE 2003 Intl Internshp in Overseas French Enterp",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2026",
            "course_name": "Recent World History",
            "description": "SOCED-GE 2026 Recent World History",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2037",
            "course_name": "",
            "description": "SOCED-GE 2037\n\n   Teach Soc Std in Middle Sch (Mthds I)\n\nExplores the theory and practice of effective social studies teaching in a middle school setting, with specific attention paid to the socio-behavioral needs of early adolescent students on the cusp of adulthood.  Through observation, practice, and evaluation of models, students will consider various strategies to: organize a course, conceptualize a unit, prepare lesson plans, implement effective and varied, including technology based, teaching practices, devise and evaluate assessments, and reach students of varying levels, abilities, and intelligences in an interactive, dynamic, team-oriented...\n\n      more description for SOCED-GE 2037 »\n\n      \n\n\n\nExplores the theory and practice of effective social studies teaching in a middle school setting, with specific attention paid to the socio-behavioral needs of early adolescent students on the cusp of adulthood.  Through observation, practice, and evaluation of models, students will consider various strategies to: organize a course, conceptualize a unit, prepare lesson plans, implement effective and varied, including technology based, teaching practices, devise and evaluate assessments, and reach students of varying levels, abilities, and intelligences in an interactive, dynamic, team-oriented environment. Offers integrated instruction in how to teach literacy skills to secondary school students.\n\n      less description for SOCED-GE 2037 «",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2038",
            "course_name": "",
            "description": "SOCED-GE 2038\n\n   Teach Soc Std/Secondary Sch( Mthds II)\n\nExplores the theory and practice of effective social studies teaching in a secondary school setting, with specific attention paid to the socio-behavioral needs of early adolescent students on the cusp of adulthood.  Through observation, practice, and evaluation of models, students will consider various strategies to: organize a course, conceptualize a unit, prepare lesson plans, implement effective and varied, including technology based, teaching practices, devise and evaluate assessments, and reach students of varying levels, abilities, and intelligences in an interactive, dynamic, team-orien...\n\n      more description for SOCED-GE 2038 »\n\n      \n\n\n\nExplores the theory and practice of effective social studies teaching in a secondary school setting, with specific attention paid to the socio-behavioral needs of early adolescent students on the cusp of adulthood.  Through observation, practice, and evaluation of models, students will consider various strategies to: organize a course, conceptualize a unit, prepare lesson plans, implement effective and varied, including technology based, teaching practices, devise and evaluate assessments, and reach students of varying levels, abilities, and intelligences in an interactive, dynamic, team-oriented environment. Offers integrated instruction in how to teach literacy skills to secondary school students.\n\n      less description for SOCED-GE 2038 «",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2042",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3382",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 384",
                    "time": "Mon 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Jacobs, Benjamin"
                }
            ],
            "course_name": "",
            "description": "SOCED-GE 2042\n\n   Teaching Soc Std in The Middle/Secondary Sch\n\nExplores theory and practice of effective teaching in middle and secondary school settings with specific attention paid to the socio-behavioral needs of early adolescent and adolescent students. Through observation, practice, and evaluation of models, students will consider various strategies to: organize a course; conceptualize a unit; prepare lesson plans; implement effective and varied, including technology-based teaching practices; devise and evaluate assessments; and reach students of varying levels, abilities, and intelligence in an interactive, dynamic, team-oriented environment. Offers...\n\n      more description for SOCED-GE 2042 »\n\n      \n\n\n\nExplores theory and practice of effective teaching in middle and secondary school settings with specific attention paid to the socio-behavioral needs of early adolescent and adolescent students. Through observation, practice, and evaluation of models, students will consider various strategies to: organize a course; conceptualize a unit; prepare lesson plans; implement effective and varied, including technology-based teaching practices; devise and evaluate assessments; and reach students of varying levels, abilities, and intelligence in an interactive, dynamic, team-oriented environment. Offers integrated instruction on how to teach literacy skills to middle and secondary level students.\n\n      less description for SOCED-GE 2042 «",
            "offering": true
        },
        {
            "course_id": "SOCED-GE 2047",
            "course_name": "",
            "description": "SOCED-GE 2047\n\n   Social Stud Curr I\n\nThis required course for social studies majors introduces major models of teaching U.S. history based on the national standards for U.S. history.  Major periods of U.S. history from Native American civilizations to contemporary culture are studied.  Emphasis is on major writers of American history and the application of this scholarship in classroom teaching. The important interpretations of significant topics such as constitutionalism, the frontier, the Civil War and Reconstruction, Progressivism, and the New Deal are analyzed for their relevance to teaching social studies.  Students construc...\n\n      more description for SOCED-GE 2047 »\n\n      \n\n\n\nThis required course for social studies majors introduces major models of teaching U.S. history based on the national standards for U.S. history.  Major periods of U.S. history from Native American civilizations to contemporary culture are studied.  Emphasis is on major writers of American history and the application of this scholarship in classroom teaching. The important interpretations of significant topics such as constitutionalism, the frontier, the Civil War and Reconstruction, Progressivism, and the New Deal are analyzed for their relevance to teaching social studies.  Students construct their own organization and units of U.S. history.\n\n      less description for SOCED-GE 2047 «",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2048",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4104",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "SILV 407"
                }
            ],
            "course_name": "Social Studies Curric: World History to 1400",
            "description": "SOCED-GE 2048 Social Studies Curric: World History to 1400 \nThis required course for social studies majors introduces major models of teaching world history consistent with the National Standards for World History.  Organization and conceptualization of world history is stressed including urbanization, nomadic invasions, cross-cultural interactions, empires, and major religious and philosophical world views.  Emphasis on significant models and interpretations of world history.",
            "offering": true
        },
        {
            "course_id": "SOCED-GE 2049",
            "course_name": "Social Studies Curric: World History Since 1400",
            "description": "SOCED-GE 2049 Social Studies Curric: World History Since 1400 \nThis required course deals with the era of western dominance beginning with the age of European conquest of the Americas. Focus is on development of global system, rise of major European movements such as industrialism, colonialism, democracy and socialism and the interaction of Europe with the rest of the world. Course ends with analysis of post-cold war and postcolonial world.",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2052",
            "course_name": "Teach Pract :Social Std in The Middle School",
            "description": "SOCED-GE 2052 Teach Pract :Social Std in The Middle School \nA practical examination of teaching problems and practices as they relate to actual classroom teaching of social studies in the middle school. Class sessions are based on student teaching experiences.",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2053",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4105",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 288",
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "FitzGerald, Maura"
                }
            ],
            "course_name": "Teach Pract:Social Std Middle/Secondary School",
            "description": "SOCED-GE 2053 Teach Pract:Social Std Middle/Secondary School \nA practical examination of teaching problems and practices as they relate to actual classroom teaching of social studies in secondary school. Class sessions are based on student teaching experiences.",
            "offering": true
        },
        {
            "course_id": "SOCED-GE 2055",
            "course_name": "Social History of Russia",
            "description": "SOCED-GE 2055 Social History of Russia \nExamination of  fundamental aspects of Russian social and cultural history. Economic life and development strategies are the primary focus. Case studies in economic and educational policies are analyzed.",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2078",
            "course_name": "Whole Lang Apprch to Lang/Lit 4-6",
            "description": "SOCED-GE 2078 Whole Lang Apprch to Lang/Lit 4-6",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2102",
            "course_name": "Biling Except Child: Id, Asses & Interv",
            "description": "SOCED-GE 2102 Biling Except Child: Id, Asses & Interv",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2133",
            "course_name": "Educ for Tchg Overseas",
            "description": "SOCED-GE 2133 Educ for Tchg Overseas",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2138",
            "course_name": "Adv Oral Written  French",
            "description": "SOCED-GE 2138 Adv Oral Written  French",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2140",
            "course_name": "",
            "description": "SOCED-GE 2140\n\n   Culm Research Sem:Hist Soc Std Workshop\n\nProject-based research course that integrates educational research with social studies classroom practice. Aims to broaden students understanding of what constituters appropriate data for scholarly inquiry. Focusing on particular research methods and drawing from the rich offerings of New York City's various collections, students explore strategies for locating, analyzing, and incorporating a broad array of sources into their doing, writing, and teaching of history and social studies. Also includes exploration of economics in the contemporary world and historically. Offers models and approache...\n\n      more description for SOCED-GE 2140 »\n\n      \n\n\n\nProject-based research course that integrates educational research with social studies classroom practice. Aims to broaden students understanding of what constituters appropriate data for scholarly inquiry. Focusing on particular research methods and drawing from the rich offerings of New York City's various collections, students explore strategies for locating, analyzing, and incorporating a broad array of sources into their doing, writing, and teaching of history and social studies. Also includes exploration of economics in the contemporary world and historically. Offers models and approaches for conducting research in and on social studies classrooms.\n\n      less description for SOCED-GE 2140 «",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2145",
            "course_name": "",
            "description": "SOCED-GE 2145\n\n   Human and Social Studies\n\nExplores the theory and practice of interdisciplinary teaching in the humanities, focusing primarily on integrating English and History - using novels, short stories, folklore, historical scholarship and primary sources. Involves designing thematic humanities unites that enable adolescents to develop an understanding of the relationship between literature and the historical eras in which it emerged. Explores the role of language and literacy in teaching and learning both disciplines and developing students writing skills. Considers the benefits and potential problems involved in trying to crea...\n\n      more description for SOCED-GE 2145 »\n\n      \n\n\n\nExplores the theory and practice of interdisciplinary teaching in the humanities, focusing primarily on integrating English and History - using novels, short stories, folklore, historical scholarship and primary sources. Involves designing thematic humanities unites that enable adolescents to develop an understanding of the relationship between literature and the historical eras in which it emerged. Explores the role of language and literacy in teaching and learning both disciplines and developing students writing skills. Considers the benefits and potential problems involved in trying to create and enact an integrated curriculum.\n\n      less description for SOCED-GE 2145 «",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2146",
            "course_name": "Master Sem in Soc Std",
            "description": "SOCED-GE 2146 Master Sem in Soc Std \nAn introduction to the history, theory and practice of social studies education. Using approaches drawn from history, the humanities, cultural studies, and political science, it aims to guide students through a study of the social studies curriculum; pedagogical theories and goals; educational methods and practices, including technology-based skills; and assessment philosophies and strategies. In doing so, the course seeks to provide students with the resources, tools, and support necessary for them to develop effective educational practices of their own.",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2147",
            "course_name": "",
            "description": "SOCED-GE 2147\n\n   Literacy and Social Studies\n\nThe acquisition of literacy and writing is essential for meeting state standards in social studies. This class will prepare pre-service or in-service teachers to assist students in the acquisition of discipline of specific literacy skills including listening, speaking, reading and writing. To this end students will learn to use a set of techniques for approaching historical documents and history textbooks with high school students. Writing in the social studies is a specific genre that is integrated to the state's assessment of domain competency. Students will explore the genre of social studi...\n\n      more description for SOCED-GE 2147 »\n\n      \n\n\n\nThe acquisition of literacy and writing is essential for meeting state standards in social studies. This class will prepare pre-service or in-service teachers to assist students in the acquisition of discipline of specific literacy skills including listening, speaking, reading and writing. To this end students will learn to use a set of techniques for approaching historical documents and history textbooks with high school students. Writing in the social studies is a specific genre that is integrated to the state's assessment of domain competency. Students will explore the genre of social studies writing, including: class notes, thematic essays, document based questions, and research papers\n\n      less description for SOCED-GE 2147 «",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2189",
            "course_name": "Great Cncpts in Soc SCI",
            "description": "SOCED-GE 2189 Great Cncpts in Soc SCI",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2190",
            "course_name": "Great Cncpts in Soc SCI",
            "description": "SOCED-GE 2190 Great Cncpts in Soc SCI",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2217",
            "course_name": "Early Civilization: The Greeks",
            "description": "SOCED-GE 2217 Early Civilization: The Greeks",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2223",
            "course_name": "Tesol: Diff Ling & Cult Environment",
            "description": "SOCED-GE 2223 Tesol: Diff Ling & Cult Environment",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2252",
            "course_name": "Biography in American History",
            "description": "SOCED-GE 2252 Biography in American History \nThis course uses biography and autobiography to explore the history of dissent and social protest in recent American history. The primary chronological focus is on the turbulent 1960s, but we also assess the aftermath of that pivotal decade. The biographical and autobiographical subjects include: Mary King, Robert Kennedy, Lyndon Johnson, Tom Hayden, Todd Gitlin, Martin Luther King, Jr., Abbie Hoffman, J. Edgar Hoover, George Wallace, Margot Adler, David Harris, John Lewis, and others. The course also asses the strength and limitations of biography and autobiography as historical sources.",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2271",
            "course_name": "India:Geog & Hist Fndts",
            "description": "SOCED-GE 2271 India:Geog & Hist Fndts",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2273",
            "course_name": "India:Culture & Civil",
            "description": "SOCED-GE 2273 India:Culture & Civil",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2275",
            "course_name": "Mod India:Eco+Soc Dev",
            "description": "SOCED-GE 2275 Mod India:Eco+Soc Dev",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2276",
            "course_name": "Survey Indian Soc Instit",
            "description": "SOCED-GE 2276 Survey Indian Soc Instit",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2293",
            "course_name": "Culture & Civil of China",
            "description": "SOCED-GE 2293 Culture & Civil of China",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2294",
            "course_name": "Culture&Civil of Japan",
            "description": "SOCED-GE 2294 Culture&Civil of Japan",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2297",
            "course_name": "Chinese Ec Dev Since Rev",
            "description": "SOCED-GE 2297 Chinese Ec Dev Since Rev",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3384",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4336",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4348",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Fraser, James",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4349",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Jacobs, Benjamin",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4350",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Malczewski, Joan",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "SOCED-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "SOCED-GE 2301",
            "course_name": "Development of Urban American",
            "description": "SOCED-GE 2301 Development of Urban American",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2304",
            "course_name": "The City as Resource in Historical Research",
            "description": "SOCED-GE 2304 The City as Resource in Historical Research \nCourse broadens student's understanding of what constitutes available data for historical inquiry.  Focusing on documents, places and people and drawing from the rich offerings of New York City's various collections, class explores stategies for locating, analyzing, and incorporating a broad array of sources in our thinking, learning, and teaching of history and social studies.",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2307",
            "course_name": "Ethnicity in Urban Amer",
            "description": "SOCED-GE 2307 Ethnicity in Urban Amer",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2309",
            "course_name": "Sem:Tchng Urban Students",
            "description": "SOCED-GE 2309 Sem:Tchng Urban Students",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2343",
            "course_name": "Modern French Thinkers",
            "description": "SOCED-GE 2343 Modern French Thinkers",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2363",
            "course_name": "Fr Lit Theor in 20th Century",
            "description": "SOCED-GE 2363 Fr Lit Theor in 20th Century",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2364",
            "course_name": "20th C French Literature",
            "description": "SOCED-GE 2364 20th C French Literature",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2369",
            "course_name": "Cours Avance De Civlstn",
            "description": "SOCED-GE 2369 Cours Avance De Civlstn",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2371",
            "course_name": "Phonetique, Diction: Adv",
            "description": "SOCED-GE 2371 Phonetique, Diction: Adv",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2372",
            "course_name": "Cult & Ed Aspects of Puerto Rico Through Lit",
            "description": "SOCED-GE 2372 Cult & Ed Aspects of Puerto Rico Through Lit",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2409",
            "course_name": "Lang/Cult Span Spkg Groups in US I",
            "description": "SOCED-GE 2409 Lang/Cult Span Spkg Groups in US I",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2410",
            "course_name": "Lang/Cult Span Spkg Groups in US II",
            "description": "SOCED-GE 2410 Lang/Cult Span Spkg Groups in US II",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2423",
            "course_name": "Civilization of India in Historic Perspective",
            "description": "SOCED-GE 2423 Civilization of India in Historic Perspective",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2429",
            "course_name": "Adv Span Conv, Comp I",
            "description": "SOCED-GE 2429 Adv Span Conv, Comp I",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2453",
            "course_name": "Hispanoamer Espana:Hoy",
            "description": "SOCED-GE 2453 Hispanoamer Espana:Hoy",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2463",
            "course_name": "Spanish Life-Span Press",
            "description": "SOCED-GE 2463 Spanish Life-Span Press",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2800",
            "course_name": "Sem Frn Lang & Biling Ed",
            "description": "SOCED-GE 2800 Sem Frn Lang & Biling Ed",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2801",
            "course_name": "Research in Internat Ed",
            "description": "SOCED-GE 2801 Research in Internat Ed",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2805",
            "course_name": "African Seminar",
            "description": "SOCED-GE 2805 African Seminar",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2845",
            "course_name": "Understanding France Through Film",
            "description": "SOCED-GE 2845 Understanding France Through Film",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2855",
            "course_name": "Intern Underst-Films I",
            "description": "SOCED-GE 2855 Intern Underst-Films I",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2885",
            "course_name": "People & Cult of France",
            "description": "SOCED-GE 2885 People & Cult of France",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2886",
            "course_name": "People and Culture of France",
            "description": "SOCED-GE 2886 People and Culture of France",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2891",
            "course_name": "People & Culture of Puerto Rico",
            "description": "SOCED-GE 2891 People & Culture of Puerto Rico",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2892",
            "course_name": "People+Culture Pr II",
            "description": "SOCED-GE 2892 People+Culture Pr II",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2911",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3385",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 265",
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Wagner, Carolyn; O'Keefe, Bernadette; FitzGerald, Maura"
                }
            ],
            "course_name": "Student Teaching in Social Studies: Middle and High School I",
            "description": "SOCED-GE 2911 Student Teaching in Social Studies: Middle and High School I \nOne semester supervised student teaching in a social studies education classroom in middle school a minimum of 180 hours within 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": true
        },
        {
            "course_id": "SOCED-GE 2915",
            "course_name": "Wkshp Foreign Lang Ed II",
            "description": "SOCED-GE 2915 Wkshp Foreign Lang Ed II",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2916",
            "course_name": "Admin&Superv-Foreign Lang Instr & Biling Ed",
            "description": "SOCED-GE 2916 Admin&Superv-Foreign Lang Instr & Biling Ed",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2917",
            "course_name": "Admin & Supv-Foreign Lang Instr & Biling Ed",
            "description": "SOCED-GE 2917 Admin & Supv-Foreign Lang Instr & Biling Ed",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2921",
            "course_name": "Prep+Use Curr Mat Aids in Forgn Lang Inst.",
            "description": "SOCED-GE 2921 Prep+Use Curr Mat Aids in Forgn Lang Inst.",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2922",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3386",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Malczewski, Joan; Ingerman, Rosalie; Noble, Bruce I",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Student Teaching in Social Studies: Middle and High School II",
            "description": "SOCED-GE 2922 Student Teaching in Social Studies: Middle and High School II \nOne semester supervised student teaching in a social studies education classroom in high school a minimum of 180 hours within 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": true
        },
        {
            "course_id": "SOCED-GE 2923",
            "course_name": "Teach W/Bil Aprch: Lang Arts",
            "description": "SOCED-GE 2923 Teach W/Bil Aprch: Lang Arts",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2924",
            "course_name": "Teach School Subjects With a Bilingual App SCI",
            "description": "SOCED-GE 2924 Teach School Subjects With a Bilingual App SCI",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2925",
            "course_name": "Biling Approach: Soc Std",
            "description": "SOCED-GE 2925 Biling Approach: Soc Std",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2926",
            "course_name": "Biling Approach: Math",
            "description": "SOCED-GE 2926 Biling Approach: Math",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2928",
            "course_name": "Biling Ed Theory & Pract",
            "description": "SOCED-GE 2928 Biling Ed Theory & Pract",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2931",
            "course_name": "Meth/Mat Biling Class (Span-Eng)",
            "description": "SOCED-GE 2931 Meth/Mat Biling Class (Span-Eng)",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2933",
            "course_name": "Meth/Mat Biling Class (French-Eng)",
            "description": "SOCED-GE 2933 Meth/Mat Biling Class (French-Eng)",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2935",
            "course_name": "Biling Ed&Minority Cult",
            "description": "SOCED-GE 2935 Biling Ed&Minority Cult",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 2937",
            "course_name": "Meth/Mat Biling Class (Asian-Eng) N6",
            "description": "SOCED-GE 2937 Meth/Mat Biling Class (Asian-Eng) N6",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 3009",
            "course_name": "Thesis Sem Hum Dev+Rel",
            "description": "SOCED-GE 3009 Thesis Sem Hum Dev+Rel",
            "offering": false
        },
        {
            "course_id": "SOCED-GE 3111",
            "course_name": "Software Tools for Quali Research",
            "description": "SOCED-GE 3111 Software Tools for Quali Research",
            "offering": false
        }
    ]
}