{
    "major_id": "HSBSU-UC",
    "file": "./2015-2016/SPS_Undergraduate_Bootcamp_(HSBSU-UC).html",
    "courses": [
        {
            "course_id": "HSBSU-UC 1",
            "course_name": "Creative Technologies Career/Portfolio Development",
            "description": "HSBSU-UC    1 Creative Technologies Career/Portfolio Development",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 2",
            "course_name": "Big Data Visualization and Infographics",
            "description": "HSBSU-UC    2 Big Data Visualization and Infographics",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 3",
            "course_name": "The Digital Newsroom",
            "description": "HSBSU-UC    3 The Digital Newsroom",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 4",
            "course_name": "",
            "description": "HSBSU-UC    4\n\n   An Introduction to The Economics and Finance of Energy\n\nThe energy sector has become a major driver in the global economy. Further growth is inevitable, as developing economies struggle to reach parity with the developed world, magnifying both the demand for energy and the need for innovations in renewables and alternative exploration methods. Those interested in working in this sector must understand this changing landscape and its potential outcomes over the coming decades.\n\nAs a student enrolled in this immersive course taught by industry experts, you will examine topics such as energy policy, the geopolitics of energy, and power generation, whi...\n\n      more description for HSBSU-UC    4 »\n\n      \n\n\n\nThe energy sector has become a major driver in the global economy. Further growth is inevitable, as developing economies struggle to reach parity with the developed world, magnifying both the demand for energy and the need for innovations in renewables and alternative exploration methods. Those interested in working in this sector must understand this changing landscape and its potential outcomes over the coming decades.\n\nAs a student enrolled in this immersive course taught by industry experts, you will examine topics such as energy policy, the geopolitics of energy, and power generation, while strengthening critical skills—risk analysis, project financing and modeling, futures, and data interpretation and analysis—that are necessary for working in this sector.\n\nThis professionally oriented course is recommended for individuals with an interest in the energy sector who are preparing for, or are interested in, careers in finance, trading, journalism, energy systems management, engineering, risk management, chemistry, or geoscience.\n\nThe learning outcomes for the course include: a historical overview of energy production; basic understanding of all forms of energy production and electricity, including an overview of the advantages and shortcomings of each form of energy; understanding of the energy sector in regards to finance and project development; comprehension of the influence energy has on politics, the global economy, and society; foundational knowledge of project financing and modeling, and data interpretation and analysis; the ability to apply principles of economics to the energy sector in a meaningful way; and the capacity to identify the principal drivers that determine the development of various forms of energy extraction and production.\n\n      less description for HSBSU-UC    4 «",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 5",
            "course_name": "Project Management Intensive",
            "description": "HSBSU-UC    5 Project Management Intensive",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 6",
            "course_name": "Real Estate",
            "description": "HSBSU-UC    6 Real Estate",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 7",
            "course_name": "The Essentials of User Experience (UX) Design",
            "description": "HSBSU-UC    7 The Essentials of User Experience (UX) Design",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 8",
            "course_name": "Business Skills: Professional Writing and Public Speaking",
            "description": "HSBSU-UC    8 Business Skills: Professional Writing and Public Speaking",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 9",
            "course_name": "Introduction to Programming with Python",
            "description": "HSBSU-UC    9 Introduction to Programming with Python",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 10",
            "course_name": "Managing Projects through Agile Methods",
            "description": "HSBSU-UC   10 Managing Projects through Agile Methods",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 11",
            "course_name": "Introduction to NoSQL",
            "description": "HSBSU-UC   11 Introduction to NoSQL",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 12",
            "course_name": "Marketing",
            "description": "HSBSU-UC   12 Marketing",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 13",
            "course_name": "Virtual Leadership for Global Businesses",
            "description": "HSBSU-UC   13 Virtual Leadership for Global Businesses",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 14",
            "course_name": "",
            "description": "HSBSU-UC   14\n\n   Integrated Marketing & Public Relations Strategies\n\nEvery industry—healthcare, consumer goods, manufacturing, fashion, entertainment, nonprofit, and financial services—needs skilled public relations and marketing strategists to design campaigns that appeal to the minds that matter most: their customers. Campaigns must be innovative, timely yet enduring, and must speak to the image a \"brand\" endeavors to portray. In this two-week intensive course, students will discover how the disciplines of public relations and marketing work both independently and together, and how they often overlap (sometimes at cross purposes), but ideally combine forces t...\n\n      more description for HSBSU-UC   14 »\n\n      \n\n\n\nEvery industry—healthcare, consumer goods, manufacturing, fashion, entertainment, nonprofit, and financial services—needs skilled public relations and marketing strategists to design campaigns that appeal to the minds that matter most: their customers. Campaigns must be innovative, timely yet enduring, and must speak to the image a \"brand\" endeavors to portray. In this two-week intensive course, students will discover how the disciplines of public relations and marketing work both independently and together, and how they often overlap (sometimes at cross purposes), but ideally combine forces to have the greatest positive impact on reaching the customer. Some industry experts have coined a new phrase for the growing synergy between the two: PRarketing. In just two weeks, you will learn through classroom lectures, from experienced industry guest speakers, and through individual and team projects, with the opportunity to explore, analyze, observe, and apply industry best practices.\n\nThis course is for individuals who are interested in expanding on their insights into the roles and responsibilities of PR and marketing professionals. Whether considering a full-fledged career in public relations or marketing, or enhancing your career in any other related field, it is crucial that all professionals understand and embrace the symbiosis between these two powerful practices. This course also will highlight the new role of interactive marketing and digital media, as well as its critical role in today's business environment.\n\nThe learning outcomes of the course include: an understanding of the scope of the marketing mix in the 21st century; the ability to identify professional opportunities and academic advancement in brand management, analytics, and digital marketing; the command of the components of integrated marketing and their relationship to the promotional mix: advertising, public relations, sales promotion, personal branding, and how to successfully select and balance these elements; the knowledge necessary to develop a strategic marketing plan; and understanding of the business acumen required to be effective in the communication industry.\n\n      less description for HSBSU-UC   14 «",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 15",
            "course_name": "Finance Primer for Graduate Students",
            "description": "HSBSU-UC   15 Finance Primer for Graduate Students",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 16",
            "course_name": "Preparing for a Career in Finance",
            "description": "HSBSU-UC   16 Preparing for a Career in Finance",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 17",
            "course_name": "Law School Prep",
            "description": "HSBSU-UC   17 Law School Prep",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 18",
            "course_name": "Applied Politics",
            "description": "HSBSU-UC   18 Applied Politics",
            "offering": false
        },
        {
            "course_id": "HSBSU-UC 19",
            "course_name": "",
            "description": "HSBSU-UC   19\n\n   Foundations in Sports Busines\n\nAn intensive survey of the basic economic, legal, marketing, media, and management principles and practices in today's business of sports. Topics to be covered include: the economics of the NCAA, professional sports leagues, the Olympics and other governing organizations, legal issues, marketing and media strategies and tactics, major event planning/development, ethical perspectives, and career counseling. Students will hear from industry leaders and will participate in site visits. They also will respond to current industry business challenges through written assignments.\n\nThis course is idea...\n\n      more description for HSBSU-UC   19 »\n\n      \n\n\n\nAn intensive survey of the basic economic, legal, marketing, media, and management principles and practices in today's business of sports. Topics to be covered include: the economics of the NCAA, professional sports leagues, the Olympics and other governing organizations, legal issues, marketing and media strategies and tactics, major event planning/development, ethical perspectives, and career counseling. Students will hear from industry leaders and will participate in site visits. They also will respond to current industry business challenges through written assignments.\n\nThis course is ideal for individuals who are seeking exposure to the fundamentals of sports business. A combination of career development and academic content makes this course the perfect choice for those who are interested in exploring a career in the field.\nThe learning outcomes of the course include: an understanding of the basic economic principles of the NCAA, professional sports leagues, franchises, governing organizations, and the Olympics; the ability to identify and assess key legal issues in sports; the capacity to define and apply marketing strategies and tactics in sports; basic knowledge of major event planning/development; the ability to explain the role and the value of media in sports; the development of an awareness of ethical issues in the sports business; and the acquisition of the skills and techniques for career advancement in sports.\n\n      less description for HSBSU-UC   19 «",
            "offering": false
        }
    ]
}