{
    "major_id": "SABR1-UC",
    "file": "./2015-2016/Study_Abroad_(SABR1-UC).html",
    "courses": [
        {
            "course_id": "SABR1-UC 2675",
            "course_name": "Bermuda: Field Studies; Marine and Terrestial",
            "description": "SABR1-UC 2675 Bermuda: Field Studies; Marine and Terrestial",
            "offering": false
        },
        {
            "course_id": "SABR1-UC 2679",
            "course_name": "Costa Rica: Field Study",
            "description": "SABR1-UC 2679 Costa Rica: Field Study",
            "offering": false
        },
        {
            "course_id": "SABR1-UC 3232",
            "course_name": "Field Studies: East Africa (Kenya)",
            "description": "SABR1-UC 3232 Field Studies: East Africa (Kenya)",
            "offering": false
        },
        {
            "course_id": "SABR1-UC 5818",
            "course_name": "",
            "description": "SABR1-UC 5818\n\n   From Commune to City - State in Tuscany\n\nThis trip-seminar will explore the rich historical mosaic of the Italian peninsula that inspired and guided the artists, architects, engineers, statesmen, popes, salaried-workers, and women, toward naturalism and human dignity, thus, setting the stage for the modern world. \n\nThe cities of New York, Florence and Siena are an incomparable stage for this intensive interdisciplinary seminar on the Middle Ages and the Renaissance. Most lectures will be delivered in Tuscany at artistic, historical, and monumental sites, as well as in galleries and museums, churches and piazze. Extended study tours t...\n\n      more description for SABR1-UC 5818 »\n\n      \n\n\n\nThis trip-seminar will explore the rich historical mosaic of the Italian peninsula that inspired and guided the artists, architects, engineers, statesmen, popes, salaried-workers, and women, toward naturalism and human dignity, thus, setting the stage for the modern world. \n\nThe cities of New York, Florence and Siena are an incomparable stage for this intensive interdisciplinary seminar on the Middle Ages and the Renaissance. Most lectures will be delivered in Tuscany at artistic, historical, and monumental sites, as well as in galleries and museums, churches and piazze. Extended study tours to Florence, Siena, Volterra, Pienza, Spoleto, Orvieto, San Gimignano, Assisi, and Perugia will be taken. \n\nWe will focus on central issues and ideas that comprised the consciousness of the masters of aesthetics of the Middle Ages and Italian Renaissance and their passion for beauty. Artistic and literary expressions essentially embedded in the realms of metaphysics and society, sometimes become indelible by their transformation of pure thought into a pattern of human behavior.\n\nStudents must be covered by health insurance prior to traveling abroad.\n\n      less description for SABR1-UC 5818 «",
            "offering": false
        },
        {
            "course_id": "SABR1-UC 5823",
            "course_name": "",
            "description": "SABR1-UC 5823\n\n   Al-Andalus: The Muslim Legacy of Medieval Spain\n\nThis trip to Spain will explore the influence of Muslim civilization on Medieval Spain. The contribution of Muslim Spain to the preservation of classical learning during the Dark Ages, and to the first flowerings of the Renaissance, has long been recognized. Not only did Muslim Spain gather and preserve the intellectual content of ancient Greek and Roman civilization, it also interpreted and expanded upon that civilization, and made a vital contribution of its own in so many fields of human endeavor - in science, astronomy, mathematics, algebra, law, history, medicine, pharmacology, optics, ag...\n\n      more description for SABR1-UC 5823 »\n\n      \n\n\n\nThis trip to Spain will explore the influence of Muslim civilization on Medieval Spain. The contribution of Muslim Spain to the preservation of classical learning during the Dark Ages, and to the first flowerings of the Renaissance, has long been recognized. Not only did Muslim Spain gather and preserve the intellectual content of ancient Greek and Roman civilization, it also interpreted and expanded upon that civilization, and made a vital contribution of its own in so many fields of human endeavor - in science, astronomy, mathematics, algebra, law, history, medicine, pharmacology, optics, agriculture, architecture, theology, music. The first part of the course will be conducted in New York and some lectures will be delivered in situ, at cathedrals, museums, and cloisters. The second part of the course will be conducted in Spain during Spring Recess: March 17 to March 23. Most lectures will be delivered in Spain at artistic, historical, and monumental sites, as well as in galleries and museums, mosques, synagogues, churches and archeological locations. Extended study tours to Toledo, Seville, Cordoba, and Granada will be taken. Through lectures and discussion sessions this course will examine the impact of Moslem  civilization on 11th and 12th century Iberian Peninsula. The class will also explore the influence of individuals like Averroe, Maimonides, and Alfonso El Sabio on the Spanish medieval period.\n\nStudents must be covered by health insurance prior to traveling abroad.\n\n      less description for SABR1-UC 5823 «",
            "offering": false
        },
        {
            "course_id": "SABR1-UC 6212",
            "course_name": "Shakespeare On Stage & On Screen (London)",
            "description": "SABR1-UC 6212 Shakespeare On Stage & On Screen (London)",
            "offering": false
        },
        {
            "course_id": "SABR1-UC 6213",
            "course_name": "",
            "description": "SABR1-UC 6213\n\n   Modern British Theatre in London\n\nNow in its 16th season, this program is a thrilling experience for anyone who loves theater. In the morning, learn about the history of Great Britain's exciting theater scene from World War II until the present—the golden age when audiences were introduced to some of the world’s most influential playwrights. In the evening, attend new productions in London's West End and the occasional off-West End and/or Fringe playhouses (at least nine productions). Previous classes were the first to see such award-winning international hits as War Horse; One Man, Two Guvnors; Twelfth Night featuring Mark Ry...\n\n      more description for SABR1-UC 6213 »\n\n      \n\n\n\nNow in its 16th season, this program is a thrilling experience for anyone who loves theater. In the morning, learn about the history of Great Britain's exciting theater scene from World War II until the present—the golden age when audiences were introduced to some of the world’s most influential playwrights. In the evening, attend new productions in London's West End and the occasional off-West End and/or Fringe playhouses (at least nine productions). Previous classes were the first to see such award-winning international hits as War Horse; One Man, Two Guvnors; Twelfth Night featuring Mark Rylance; and the critically acclaimed play, The Curious Incident of the Dog in the Night-Time.\n\nAreas Covered\n-The history of post-World War II British theater\n-More than a dozen major playwrights and more than 20 plays\n-The present-day theater scene and its influence on U.S. theater\n\n      less description for SABR1-UC 6213 «",
            "offering": false
        },
        {
            "course_id": "SABR1-UC 7800",
            "course_name": "Bauhaus Design in Weimar Germany",
            "description": "SABR1-UC 7800 Bauhaus Design in Weimar Germany",
            "offering": false
        }
    ]
}