{
    "major_id": "HSASU-UC",
    "file": "./2015-2016/Summer_High_School_Academy_(HSASU-UC).html",
    "courses": [
        {
            "course_id": "HSASU-UC 1",
            "course_name": "Finance NYC - an Insider's View",
            "description": "HSASU-UC    1 Finance NYC - an Insider's View",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 2",
            "course_name": "Digital Filmmaking - Telling the Story through Technology",
            "description": "HSASU-UC    2 Digital Filmmaking - Telling the Story through Technology",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 3",
            "course_name": "Mandarin Chinese-Communication and Culture",
            "description": "HSASU-UC    3 Mandarin Chinese-Communication and Culture",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 4",
            "course_name": "International Conflict and Security",
            "description": "HSASU-UC    4 International Conflict and Security",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 5",
            "course_name": "Motion Comics and Illustration - Transforming the Tale",
            "description": "HSASU-UC    5 Motion Comics and Illustration - Transforming the Tale",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 6",
            "course_name": "Screenwriting: Visual Story Telling - Short to Feature-Length Films",
            "description": "HSASU-UC    6 Screenwriting: Visual Story Telling - Short to Feature-Length Films",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 7",
            "course_name": "From Writer to Reader: The Art of Editing Books",
            "description": "HSASU-UC    7 From Writer to Reader: The Art of Editing Books",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 8",
            "course_name": "College 101 - Planning and Prep",
            "description": "HSASU-UC    8 College 101 - Planning and Prep",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 9",
            "course_name": "Express Yourself - Writing for College and Career",
            "description": "HSASU-UC    9 Express Yourself - Writing for College and Career",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 10",
            "course_name": "Real Estate NYC: From Design to Development",
            "description": "HSASU-UC   10 Real Estate NYC: From Design to Development",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 11",
            "course_name": "Arabic - Communication and Culture",
            "description": "HSASU-UC   11 Arabic - Communication and Culture",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 12",
            "course_name": "Economic Development, Resource Conflicts & Emerging Economies",
            "description": "HSASU-UC   12 Economic Development, Resource Conflicts & Emerging Economies",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 13",
            "course_name": "",
            "description": "HSASU-UC   13\n\n   Digital Journalism - Spreading the News through New Media\n\nJournalists are no longer just writers. Working across digital mediums, journalists are now digital photographers, videographers, bloggers, and social media community managers in addition to polished and professional writers. Gain an introduction to this fascinating field where you can learn about exciting new ways for innovative reporting. This hands-on workshop provides you with skills for using digital tools to research, write, and produce digital videos, including news stories and human-interest profiles. Develop a foundation in the basics of producing and editing digital video, audio, and...\n\n      more description for HSASU-UC   13 »\n\n      \n\n\n\nJournalists are no longer just writers. Working across digital mediums, journalists are now digital photographers, videographers, bloggers, and social media community managers in addition to polished and professional writers. Gain an introduction to this fascinating field where you can learn about exciting new ways for innovative reporting. This hands-on workshop provides you with skills for using digital tools to research, write, and produce digital videos, including news stories and human-interest profiles. Develop a foundation in the basics of producing and editing digital video, audio, and photos for use in online news sites, blogs, and social media sites.\n\nDuring this class you will learn the fundamentals of researching, writing, and producing journalistic stories, while gaining technical proficiency in taking photos and capturing/editing audio and video. You also will learn how to use social media to research breaking news, to gather sources, and to gain readership. Site visits include filming in Union Square on multiple dates.\n\n      less description for HSASU-UC   13 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 14",
            "course_name": "Building Interactive Game Environments - Harnessing 3D",
            "description": "HSASU-UC   14 Building Interactive Game Environments - Harnessing 3D",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 15",
            "course_name": "Creative Writing: Finding Your Muse in the Metropolis",
            "description": "HSASU-UC   15 Creative Writing: Finding Your Muse in the Metropolis",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 16",
            "course_name": "Photographing NYC - Through the Mind's Eye & the Camera Lens",
            "description": "HSASU-UC   16 Photographing NYC - Through the Mind's Eye & the Camera Lens",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 17",
            "course_name": "3D Printing & Product Design - The Creative and Business Aspects",
            "description": "HSASU-UC   17 3D Printing & Product Design - The Creative and Business Aspects",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 18",
            "course_name": "Design for Mobile & Tablet - Communicating Visually/Adobe DPS",
            "description": "HSASU-UC   18 Design for Mobile & Tablet - Communicating Visually/Adobe DPS",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 19",
            "course_name": "Improv and Sketch Comedy - Developing Your Craft",
            "description": "HSASU-UC   19 Improv and Sketch Comedy - Developing Your Craft",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 20",
            "course_name": "Welcome to the Real World - Skills for College & Business Success",
            "description": "HSASU-UC   20 Welcome to the Real World - Skills for College & Business Success",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 21",
            "course_name": "Doing Well by Doing Good, Philanthropy & Social enterprise in NYC",
            "description": "HSASU-UC   21 Doing Well by Doing Good, Philanthropy & Social enterprise in NYC",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 22",
            "course_name": "Applied Politics",
            "description": "HSASU-UC   22 Applied Politics",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 23",
            "course_name": "City Lab: Building Tomorrow’s Cities Today",
            "description": "HSASU-UC   23 City Lab: Building Tomorrow’s Cities Today",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 24",
            "course_name": "Hit Songwriting: Creating, Recording, and Marketing Your Music",
            "description": "HSASU-UC   24 Hit Songwriting: Creating, Recording, and Marketing Your Music",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 25",
            "course_name": "",
            "description": "HSASU-UC   25\n\n   Debates in Global Affairs: The Ethics of Conflict\n\nWhy do nations and nonstate actors enter into conflict? What is the \"responsibility to protect\" and how does the global community respond to this mandate? How have advances in weaponry affected engagement in conflict? If you are considering a career in global affairs, this course will provide you with a basic understanding of international relations theory. Historical and current case studies introduce you to the special considerations required to address complex peace and security issues. Written and verbal exercises will help you to develop the necessary skills to construct and to deliver co...\n\n      more description for HSASU-UC   25 »\n\n      \n\n\n\nWhy do nations and nonstate actors enter into conflict? What is the \"responsibility to protect\" and how does the global community respond to this mandate? How have advances in weaponry affected engagement in conflict? If you are considering a career in global affairs, this course will provide you with a basic understanding of international relations theory. Historical and current case studies introduce you to the special considerations required to address complex peace and security issues. Written and verbal exercises will help you to develop the necessary skills to construct and to deliver coherent and effective position statements, which are essential to excellent essay writing. This course serves as the perfect entrée into the continually evolving world of global affairs and offers insight into the many pressing issues that affect our daily lives and the lives of people around the world.\n\n      less description for HSASU-UC   25 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 26",
            "course_name": "",
            "description": "HSASU-UC   26\n\n   Interactive Marketing Campaigns: The Power of Public Relations and Social Media\n\nEvery industry - from healthcare, finance, consumer goods, and manufacturing to fashion, beauty, entertainment, travel, and the nonprofit sector - requires skilled marketing and public relations strategists to design campaigns that appeal to the minds that matter most: consumers and the media. Interactive marketing campaigns, infused with public relations must be innovative and timely yet enduring. They must speak to the image a \"brand\" endeavors to portray, while evoking an emotional response. During these four intensive sessions, discover how the marketing discipline works independently and ...\n\n      more description for HSASU-UC   26 »\n\n      \n\n\n\nEvery industry - from healthcare, finance, consumer goods, and manufacturing to fashion, beauty, entertainment, travel, and the nonprofit sector - requires skilled marketing and public relations strategists to design campaigns that appeal to the minds that matter most: consumers and the media. Interactive marketing campaigns, infused with public relations must be innovative and timely yet enduring. They must speak to the image a \"brand\" endeavors to portray, while evoking an emotional response. During these four intensive sessions, discover how the marketing discipline works independently and in conjunction with public relations initiatives to combine forces that will have the greatest impact on the consumer and the media. Guest lecturers from a variety of industries visit class and provide their perspectives on the most effective ways to reach and to influence target audiences. Work with your fellow classmates to develop marketing strategies and campaigns for some of your favorite brands by conducting research, writing creative content, and developing innovative social and digital media plans. Complete the course with a working knowledge of how the practices of marketing and public relations coalesce to create a strong, innovative, enduring, and measurable communications strategy that can be delivered through a broad array of social media platforms.\n\n      less description for HSASU-UC   26 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 27",
            "course_name": "",
            "description": "HSASU-UC   27\n\n   Songwriting: Learn How to Do What You Love\n\nThese days, the almost universally agreed-upon assumption about becoming a songwriter/producer or a recording star is that it takes luck, timing, and having the right connections. A common refrain regarding the road to stardom is that it is organic, and that success is achieved through the process of \"paying your dues.\" There is often very little formal academic training besides basic instrumental or vocal lessons to prepare oneself for a career writing songs in the Spotify or the iHeartRadio-style popular music genres. Larry Dvoskin, who has earned gold and platinum hit records writing for a ...\n\n      more description for HSASU-UC   27 »\n\n      \n\n\n\nThese days, the almost universally agreed-upon assumption about becoming a songwriter/producer or a recording star is that it takes luck, timing, and having the right connections. A common refrain regarding the road to stardom is that it is organic, and that success is achieved through the process of \"paying your dues.\" There is often very little formal academic training besides basic instrumental or vocal lessons to prepare oneself for a career writing songs in the Spotify or the iHeartRadio-style popular music genres. Larry Dvoskin, who has earned gold and platinum hit records writing for a wide range of iconic music stars, will teach you the creative process of taking poems and translating them into lyrics. Transforming unfinished musical or melodic ideas into complete songs also will be covered. Learn how to be heard, to get your foot in the right doors, to build your musical \"brand\" on social media platforms, and the difference between networking and \"connecting\" to meet the right people and to achieve your goals and objectives. This course is for all levels of musicians, singers, and lyricists, as well as for those who are simply interested in learning more about music. Topics include analysis of timeless lyrics, tension and release structure in melody, and the most current and popular chord patterns and arrangements. Come away with at least one finished or reworked new song and a greater understanding of the step-by-step process of transforming a passion for music into a career.\n\n      less description for HSASU-UC   27 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 28",
            "course_name": "",
            "description": "HSASU-UC   28\n\n   Fantastical Fiction: Building Worlds with Words\n\nFrom chart-topping masterpieces like Harry Potter, Eragon, Twilight, and The Lord of the Rings, to the more recent Doors of Stone, Fool's Assassin, and The Magician's Land, fantasy fiction has become wildly popular in the U.S. and abroad. In this highly interactive course, you will learn to build worlds with your words. Consider varying types of fantasy fiction that construct realities very different from our own, including fairy tales, myths and fables, science fiction, and grim dystopian universes. Unleash your creativity to transform your ideas and stories into compelling writing. Explore t...\n\n      more description for HSASU-UC   28 »\n\n      \n\n\n\nFrom chart-topping masterpieces like Harry Potter, Eragon, Twilight, and The Lord of the Rings, to the more recent Doors of Stone, Fool's Assassin, and The Magician's Land, fantasy fiction has become wildly popular in the U.S. and abroad. In this highly interactive course, you will learn to build worlds with your words. Consider varying types of fantasy fiction that construct realities very different from our own, including fairy tales, myths and fables, science fiction, and grim dystopian universes. Unleash your creativity to transform your ideas and stories into compelling writing. Explore techniques that are fundamental to all genres of fiction, focusing on story structure, character development, description, and dialogue. By participating in interactive writing exercises, discussing the works of published authors, and sharing writing with your peers, you will complete a polished short story in the genre of your choice by the end of the course. The final session will include an afternoon of literary reading, which friends and parents are welcome to attend.\n\n      less description for HSASU-UC   28 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 29",
            "course_name": "",
            "description": "HSASU-UC   29\n\n   Investing Fundamentals: Shaping Your Financial Future\n\nEveryone has heard of the stock market, but how does it work? What is a “bull” or “bear” market? How does anyone make money through investing? This course answers these questions and more, exploring how careful investment can shape your financial future. Learn the basics of investing and what it takes to stay afloat in a turbulent market. Gain an understanding of investment vehicles, how to choose investments wisely, and how world events and other factors play a part in investment strategy. Participate in a stock market game that will allow you and your classmates to choose investments based u...\n\n      more description for HSASU-UC   29 »\n\n      \n\n\n\nEveryone has heard of the stock market, but how does it work? What is a “bull” or “bear” market? How does anyone make money through investing? This course answers these questions and more, exploring how careful investment can shape your financial future. Learn the basics of investing and what it takes to stay afloat in a turbulent market. Gain an understanding of investment vehicles, how to choose investments wisely, and how world events and other factors play a part in investment strategy. Participate in a stock market game that will allow you and your classmates to choose investments based upon the factors discussed in class and then follow those picks throughout the week between sessions.\n\n      less description for HSASU-UC   29 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 30",
            "course_name": "",
            "description": "HSASU-UC   30\n\n   Journalism: Reporting, Researching, and Writing News and Features\n\nLearn the who, what, where, why, and how of writing stories and articles for journalism. In this practical, hands-on workshop, learn the essential skills of print-based journalism, by mastering techniques that are applicable to all forms of journalism (including newspaper, magazine, digital, and broadcast). Gain experience in identifying ideas for stories, conducting research, and interviewing subjects. Hone your writing skills to craft clear and concise yet engaging stories. Discuss journalism ethics, including plagiarism and libel. Participate in a newsroom environment and engage in weekly e...\n\n      more description for HSASU-UC   30 »\n\n      \n\n\n\nLearn the who, what, where, why, and how of writing stories and articles for journalism. In this practical, hands-on workshop, learn the essential skills of print-based journalism, by mastering techniques that are applicable to all forms of journalism (including newspaper, magazine, digital, and broadcast). Gain experience in identifying ideas for stories, conducting research, and interviewing subjects. Hone your writing skills to craft clear and concise yet engaging stories. Discuss journalism ethics, including plagiarism and libel. Participate in a newsroom environment and engage in weekly editorial meetings.\n\n      less description for HSASU-UC   30 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 31",
            "course_name": "",
            "description": "HSASU-UC   31\n\n   College Writing: Understanding Grammar Through Writing - The Ultimate Connection\n\nThese five comprehensive sessions are designed to help you write well and to better understand that good grammar is instrumental to the creative process. Each week's work will build upon the previous, providing a solid base to develop writing that speaks to your audience in a clear and engaging way. Topics include How to Fall in Love (with the Sentence), Doing and Being: Verbs in Thought and Deed, Who's Doing What to Whom: Working with Pronouns, Full Stop or Not: Punctuation as a Road Map, and Delighting the Reader: Creating an Online Journal. Acquire a better understanding of the connection b...\n\n      more description for HSASU-UC   31 »\n\n      \n\n\n\nThese five comprehensive sessions are designed to help you write well and to better understand that good grammar is instrumental to the creative process. Each week's work will build upon the previous, providing a solid base to develop writing that speaks to your audience in a clear and engaging way. Topics include How to Fall in Love (with the Sentence), Doing and Being: Verbs in Thought and Deed, Who's Doing What to Whom: Working with Pronouns, Full Stop or Not: Punctuation as a Road Map, and Delighting the Reader: Creating an Online Journal. Acquire a better understanding of the connection between grammar and meaning, and you will be able to use grammar and punctuation to help formulate ideas and shape the reader experience.\n\n      less description for HSASU-UC   31 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 32",
            "course_name": "",
            "description": "HSASU-UC   32\n\n   Studio Art:  Drawing\n\nUnleash your creativity and discover your inner artist in this studio art workshop, appropriate for students with experience drawing, as well as for beginners. Hone your skills of observation by drawing composed still life scenes, live models, and nearby New York City parks and buildings. Learn to develop your creativity and to draw from your imagination. Master techniques that enhance basic drawing skills, including light, form, line, and composition. Gain inspiration from experimenting with a wide variety of drawing materials, including charcoal, graphite, and ink, and discover the effects t...\n\n      more description for HSASU-UC   32 »\n\n      \n\n\n\nUnleash your creativity and discover your inner artist in this studio art workshop, appropriate for students with experience drawing, as well as for beginners. Hone your skills of observation by drawing composed still life scenes, live models, and nearby New York City parks and buildings. Learn to develop your creativity and to draw from your imagination. Master techniques that enhance basic drawing skills, including light, form, line, and composition. Gain inspiration from experimenting with a wide variety of drawing materials, including charcoal, graphite, and ink, and discover the effects that various papers and surfaces have on drawings.\n\n      less description for HSASU-UC   32 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 33",
            "course_name": "",
            "description": "HSASU-UC   33\n\n   Performing Arts: Improvisation Workshop\n\nWhether you're an aspiring actor or you simply want to explore your creativity, this course is for you. Have fun learning the rules and the structure of improvisational performance. Through in-class exercises and traditional improv games, work on timing, interactions, reactions, and narrative structure. Become more sure of yourself and comfortable in your own skin - whether on stage or in everyday life. Develop trust in your fellow performers and learn how to engage the audience. Laugh a lot and come away with improved confidence and the ability to express yourself verbally and physically. The...\n\n      more description for HSASU-UC   33 »\n\n      \n\n\n\nWhether you're an aspiring actor or you simply want to explore your creativity, this course is for you. Have fun learning the rules and the structure of improvisational performance. Through in-class exercises and traditional improv games, work on timing, interactions, reactions, and narrative structure. Become more sure of yourself and comfortable in your own skin - whether on stage or in everyday life. Develop trust in your fellow performers and learn how to engage the audience. Laugh a lot and come away with improved confidence and the ability to express yourself verbally and physically. The course emphasizes creativity as well as the ability to work in teams and to think on your feet. It culminates in a performance given in front of fellow students and instructors.\n\n      less description for HSASU-UC   33 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 34",
            "course_name": "Creative Approaches to Writing the College Application Essay",
            "description": "HSASU-UC   34 Creative Approaches to Writing the College Application Essay \nWriting a compelling college application essay is a significant challenge for many students. This two-day course employs a variety of experiences, prompts, and writing exercises to help students write essays that are narratively compelling, audience-directed, persuasive, and unique to each writer. You will learn strategies for overcoming writer's block, identifying audience needs, and solving problems that will serve you as you draft your essay and as you continue with your schoolwork. By the end of the session, you will have written a complete draft of an application essay.",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 35",
            "course_name": "",
            "description": "HSASU-UC   35\n\n   Launching Your Own Digital Business\n\nIn business, web presence is key. From building and managing a website, to creating a solid social media network, participating in this course will provide you with the necessary tools you need to succeed in maintaining a powerful and relevant online identity. You will learn to develop a product idea into a business plan, and how to build a website tailored to the specific needs of that business proposal. You will create simple web pages and will learn to structure content using correct HTML tags. You also will choose and secure a web address or domain name and will publish your site using a f...\n\n      more description for HSASU-UC   35 »\n\n      \n\n\n\nIn business, web presence is key. From building and managing a website, to creating a solid social media network, participating in this course will provide you with the necessary tools you need to succeed in maintaining a powerful and relevant online identity. You will learn to develop a product idea into a business plan, and how to build a website tailored to the specific needs of that business proposal. You will create simple web pages and will learn to structure content using correct HTML tags. You also will choose and secure a web address or domain name and will publish your site using a free or low-cost web host, expanding the site by adding graphic elements using CSS. In addition, you will become familiar with the tools to optimize your social media presence and will gain a clear understanding of how to market deliverables to the right audience. \n\nBy the end of the course, you will be able to pitch an idea and develop a business plan; \ncreate a webpage using HTML; add color and graphic elements to enhance your page; upload and maintain a website on a remote server; create, maintain, and control your online presence and/or personal brand; market a product and/or company online; understand the basics of SEO; and gain a command of the underlying principles of running your own online business.\n\nYou are encouraged to develop a business idea prior to the first day of class.\n\n      less description for HSASU-UC   35 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 36",
            "course_name": "",
            "description": "HSASU-UC   36\n\n   Fundamentals of Sports Management  - The Game Beyond the Playing Field\n\nWe all know what happens on the baseball diamonds, football fields, and basketball courts.  However, are you aware of the countless logistics that take place to get your favorite athlete into the game?  This class will immerse you in all aspects of the sports industry—including all that happens behind the scenes. Learn about sports management through an examination of diverse business structures, management theories, and leadership philosophies. As a cultural phenomenon, sports have had a profound influence on all aspects of society. This course provides an opportunity to explore the historica...\n\n      more description for HSASU-UC   36 »\n\n      \n\n\n\nWe all know what happens on the baseball diamonds, football fields, and basketball courts.  However, are you aware of the countless logistics that take place to get your favorite athlete into the game?  This class will immerse you in all aspects of the sports industry—including all that happens behind the scenes. Learn about sports management through an examination of diverse business structures, management theories, and leadership philosophies. As a cultural phenomenon, sports have had a profound influence on all aspects of society. This course provides an opportunity to explore the historical significance of how sports have evolved from leisure activities into a multibillion-dollar industry with complex and diverse models of business. Topics covered include: the evolution of sports; the scope of sports and its relevance to our global society; models of leadership; the structure and design of amateur and professional sports entities; pioneers, innovators, and events of historical significance; and opportunities and challenges on the horizon in the business of sports.     \n\nBy the end of the semester, you will be able to: identify various aspects of the sports industry, describe the development of sports as a modern business, explain the nature of management theories in professional and amateur sports, understand the business structures of various sports organizations, examine ways in which sports have become and remain integrated in society, and identify career options in the sports industry.\n\n      less description for HSASU-UC   36 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 37",
            "course_name": "Writing for Television:  Creating and Writing a New Series",
            "description": "HSASU-UC   37 Writing for Television:  Creating and Writing a New Series",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 38",
            "course_name": "Seeking Cybersecurity:  Exploring Crime, Terrorism, Espionage/ Weapons in Cyberspace",
            "description": "HSASU-UC   38 Seeking Cybersecurity:  Exploring Crime, Terrorism, Espionage/ Weapons in Cyberspace",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 39",
            "course_name": "",
            "description": "HSASU-UC   39\n\n   Web Apps Design Studio: Beyond Coding\n\nHave you ever been struck with a great idea for a web or mobile web app? A real-time voting app? A video-sharing social network? A Craigslist-type marketplace? A turn-based storytelling game? You want it to be the next Uber or Seamless, but you don’t know how to code. This course is intended for those with little to no experience in programming, to help translate their ideas into reality. \n\nHow is what you learn in this course different from the tools—Wordpress, SquareSpace, Wix, and GoDaddy—which allow you to build a website without knowing HTML? What those tools generally don't do is give yo...\n\n      more description for HSASU-UC   39 »\n\n      \n\n\n\nHave you ever been struck with a great idea for a web or mobile web app? A real-time voting app? A video-sharing social network? A Craigslist-type marketplace? A turn-based storytelling game? You want it to be the next Uber or Seamless, but you don’t know how to code. This course is intended for those with little to no experience in programming, to help translate their ideas into reality. \n\nHow is what you learn in this course different from the tools—Wordpress, SquareSpace, Wix, and GoDaddy—which allow you to build a website without knowing HTML? What those tools generally don't do is give you control over your application's flow. Let's say you're building a photo-sharing website, and you want your users to upload a photo, and then select some friends to send it to. You also want an e-mail to go to those friends, and you want that e-mail to have a link they can click on to rate the photo. And, let's say you want a page that shows each users' top-rated photos. Using popular website builders, something like this would be impossible. This course will teach you how to gain complete control over exactly what happens on your website, by defining custom categories of data (like \"ratings\" or \"photos\") and by specifying situation-specific logic (\"if the photo's rating is greater than 3, make this headline red...\").\n\nYou will spend time thinking about the functionality, design, and business considerations of your site, rather than the specific coding syntax. Taught by experienced software engineers and entrepreneurs, it will provide you with a real-world experience that will allow you to: transform your idea into a web or mobile app; develop the app without getting bogged down in the programming language syntax; and learn to create one-click integrations with services including social networks (Facebook, LinkedIn), analytics (Mixpanel), payments (Stripe), and interesting sources of data (iTunes Songs, Google Books). \n\nUpon completion of this course, you will be able to build an interactive, multi-user app for laptop web browsers and mobile web browsers. You also will visit several tech companies that may include Pivotal Labs and Google during the week to ground yourself in the high-tech environment.\n\n      less description for HSASU-UC   39 «",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 40",
            "course_name": "Video Game Design: From Concept to Completion",
            "description": "HSASU-UC   40 Video Game Design: From Concept to Completion",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 41",
            "course_name": "Integrated Marketing: Innovation and Strategy",
            "description": "HSASU-UC   41 Integrated Marketing: Innovation and Strategy",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 42",
            "course_name": "Creative Approaches to Difficult Problems:  Art-Based Practices for Social Change/Justice",
            "description": "HSASU-UC   42 Creative Approaches to Difficult Problems:  Art-Based Practices for Social Change/Justice",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 43",
            "course_name": "Introduction to Programming Using Javascript: Decoding the Mystery",
            "description": "HSASU-UC   43 Introduction to Programming Using Javascript: Decoding the Mystery",
            "offering": false
        },
        {
            "course_id": "HSASU-UC 44",
            "course_name": "Aspire College Transition Intensive",
            "description": "HSASU-UC   44 Aspire College Transition Intensive",
            "offering": false
        }
    ]
}