{
    "major_id": "VISAR-AD",
    "file": "./2015-2016/Visual_Arts_(VISAR-AD).html",
    "courses": [
        {
            "course_id": "VISAR-AD 102",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12824",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 002",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Teece, Denise; Falkenburg, Reindert"
                }
            ],
            "course_name": "| VISAR-AD  166",
            "description": "VISAR-AD  102 | VISAR-AD  166\n\n   Foundations of Art History I\n\nThese courses offer detailed engagements with key works of art -- masterpieces to material culture across a range of media from different times and places -- to develop the critical apparatus of visual analysis. They introduce the methods and fundamental concepts of art history by taking one work of art and constructing around it a web of diverse objects and practices that allow us to grapple with the meanings of art and its histories within global and trans-historical perspectives. Among the questions we ask throughout the course are: What is art? What is art history? What are the institution...\n\n      more description for VISAR-AD  102 | VISAR-AD  166 »\n\n      \n\n\n\nThese courses offer detailed engagements with key works of art -- masterpieces to material culture across a range of media from different times and places -- to develop the critical apparatus of visual analysis. They introduce the methods and fundamental concepts of art history by taking one work of art and constructing around it a web of diverse objects and practices that allow us to grapple with the meanings of art and its histories within global and trans-historical perspectives. Among the questions we ask throughout the course are: What is art? What is art history? What are the institutions that shape the practice and dissemination of art? How is art affected by histories of cultural exchange? What is the nature of tradition? Visits to local museums. Lecture/discussion. Evaluation will be through written assignments, powerpoint presentations, and active class participation. No previous knowledge of art history required. This course fulfills Art and Art History requirements.\n\n      less description for VISAR-AD  102 | VISAR-AD  166 «",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 103",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19564",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 002",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Hudson, Dale"
                }
            ],
            "course_name": "X",
            "description": "VISAR-AD  103X\n\n   Introduction to Visual Culture\n\nVisual Culture Studies branches away from the traditional preoccupations of Art History towards new subjects and methodologies. It takes as its primary area of interest not works of art but other forms of visuality, such as advertising, fashion, comics and graphic novels, television, the internet, graffiti and tattooing, as well as the visual formulations of cultural, racial, and gender difference. Today, the study of visual culture is the focus of a vast body of scholarly investigation and continues to raise new questions in the wake of technological advances and a demand for visual satisfact...\n\n      more description for VISAR-AD  103X »\n\n      \n\n\n\nVisual Culture Studies branches away from the traditional preoccupations of Art History towards new subjects and methodologies. It takes as its primary area of interest not works of art but other forms of visuality, such as advertising, fashion, comics and graphic novels, television, the internet, graffiti and tattooing, as well as the visual formulations of cultural, racial, and gender difference. Today, the study of visual culture is the focus of a vast body of scholarly investigation and continues to raise new questions in the wake of technological advances and a demand for visual satisfaction. This class offers an introduction to visual analysis in a world increasingly dominated by the graphic transmission of information, knowledge, and aesthetic experience.\n\n      less description for VISAR-AD  103X «",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 104",
            "course_name": "| VISAR-AD  176",
            "description": "VISAR-AD  104 | VISAR-AD  176\n\n   Foundations of Art History II\n\nThese courses offer detailed engagements with key works of art -- masterpieces to material culture across a range of media from different times and places -- to develop the critical apparatus of visual analysis. They introduce the methods and fundamental concepts of art history by taking one work of art and constructing around it a web of diverse objects and practices that allow us to grapple with the meanings of art and its histories within global and trans-historical perspectives. Among the questions we ask throughout the course are: What is art? What is art history? What are the institution...\n\n      more description for VISAR-AD  104 | VISAR-AD  176 »\n\n      \n\n\n\nThese courses offer detailed engagements with key works of art -- masterpieces to material culture across a range of media from different times and places -- to develop the critical apparatus of visual analysis. They introduce the methods and fundamental concepts of art history by taking one work of art and constructing around it a web of diverse objects and practices that allow us to grapple with the meanings of art and its histories within global and trans-historical perspectives. Among the questions we ask throughout the course are: What is art? What is art history? What are the institutions that shape the practice and dissemination of art? How is art affected by histories of cultural exchange? What is the nature of tradition? Visits to local museums. Lecture/discussion. Evaluation will be through written assignments, powerpoint presentations, and active class participation. No previous knowledge of art history required. This course fulfills Art and Art History requirements.\n\n      less description for VISAR-AD  104 | VISAR-AD  176 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 110",
            "course_name": "",
            "description": "VISAR-AD  110\n\n   Drawing by Seeing\n\nThis workshop class is open to all levels of artistic experience. The premise is that customary perception (drawing what you “know”) is in conflict with aesthetic perception (drawing what you actually “see”). Each exercise reinforces an essential principle such as: “the whole is greater then the sum of its parts” and “dynamic perception results in an integrated, dynamic drawing.” Students learn how to maintain a unified drawing while at the same time articulate detail. Later sessions address how to apply this experience to individual artistic goals. There are PowerPoint discussions of relevant...\n\n      more description for VISAR-AD  110 »\n\n      \n\n\n\nThis workshop class is open to all levels of artistic experience. The premise is that customary perception (drawing what you “know”) is in conflict with aesthetic perception (drawing what you actually “see”). Each exercise reinforces an essential principle such as: “the whole is greater then the sum of its parts” and “dynamic perception results in an integrated, dynamic drawing.” Students learn how to maintain a unified drawing while at the same time articulate detail. Later sessions address how to apply this experience to individual artistic goals. There are PowerPoint discussions of relevant examples of drawing from the history of drawing.\n\n      less description for VISAR-AD  110 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 111",
            "course_name": "Approaches to Painting",
            "description": "VISAR-AD  111 Approaches to Painting \nAn introduction to painting tools and techniques. This course presents historical and contemporary examples of the use of paint as a means of artistic expression with an emphasis on the relationships between color and aesthetic concept.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 112",
            "course_name": "Foundations of Photography & Lens-Based Images | Photography and Lens-Based Images",
            "description": "VISAR-AD  112 Foundations of Photography & Lens-Based Images | Photography and Lens-Based Images \nIntroduction to camera- and lens-based approaches to image making. A range of techniques are covered including film and wet chemistry, digital and data-based imaging, and spatial and installation based uses of cameras and lenses. These techniques are grounded within a thematic survey of issues that have emerged out of photographic media’s transformation of society.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 113",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12905",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 124 with Alghusein, Tarek08/30/2015 - 12/17/2015 Mon 3.35 PM - 4.50 PM at ARTS_CENT 124",
                    "time": "Wed 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Alghusein, Tarek"
                }
            ],
            "course_name": "Photography as Art and Practice",
            "description": "VISAR-AD  113 Photography as Art and Practice \nStudents learn the history, criticism, and variety of theoretical approaches to photography while developing their own skills in the photographic media. The course begins with the origins of the medium in France, England, and the U.S. in the 1830s, and proceeds to a broader look at photography throughout the world. Photography is considered as art, medium of communication, formulator of political and propaganda concepts, advertising tool, and aspect of popular culture, and students produce a portfolio of their photographs.",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 114",
            "course_name": "Digital Art Strategies",
            "description": "VISAR-AD  114 Digital Art Strategies \nThis course explores an integrated theory for digital media production through a historical examination of contemporary efforts to blend diverse media forms. This practical project-based class explores how personal digital media production suggests one way of supporting that integration. Students survey a range of software-based digital media tools, the goal of which is the development of each student’s artistic voice.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 117",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17730",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 153 with Torreano, John08/30/2015 - 12/17/2015 Tue 9.15 AM - 11.55 AM at ARTS_CENT 153",
                    "time": "Sun 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Torreano, John"
                }
            ],
            "course_name": "",
            "description": "VISAR-AD  117\n\n   Projects in Painting: Painting by Seeing\n\nThis course will address many of the processes and techniques that inform how one “paints.” The intelligence of painting is rooted in our relationship to the visual and the paradox of “seeing” versus “knowing.” For our purposes all painting, from the earliest caves to present day Art Galleries, will be seen as “contemporary.” It is legitimate to be influenced by any and all painting be it Ancient Egyptian, DaVinci, Picasso, Warhol, etc. Therefore all styles and techniques that emerge from student projects will be addressed. Our goal is to help students develop the skills of painting and experi...\n\n      more description for VISAR-AD  117 »\n\n      \n\n\n\nThis course will address many of the processes and techniques that inform how one “paints.” The intelligence of painting is rooted in our relationship to the visual and the paradox of “seeing” versus “knowing.” For our purposes all painting, from the earliest caves to present day Art Galleries, will be seen as “contemporary.” It is legitimate to be influenced by any and all painting be it Ancient Egyptian, DaVinci, Picasso, Warhol, etc. Therefore all styles and techniques that emerge from student projects will be addressed. Our goal is to help students develop the skills of painting and experience it as an art form rich in possibilities for the direct expression of feelings, perceptions and ideas.\n\n      less description for VISAR-AD  117 «",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 118",
            "course_name": "",
            "description": "VISAR-AD  118\n\n   Types of Art:  From Calligraphy and Stone Carving to Digital Type\n\nType Design is the art and craft of designing typefaces. From calligraphy and stone carving to digital type, the history of type recounts the discoveries and technological progress made through human inventions. While some typefaces are insignificant and forgotten, others will survive mankind, such as Futura engraved on the Apollo 11 plaque, left on the Moon. Some of typefaces were revolutionary, others reactionary. But behind each of them there was an inventor. Students will follow the 'traces' and the stories of the type masters who shaped our visual typographical landscapes. Western and Ara...\n\n      more description for VISAR-AD  118 »\n\n      \n\n\n\nType Design is the art and craft of designing typefaces. From calligraphy and stone carving to digital type, the history of type recounts the discoveries and technological progress made through human inventions. While some typefaces are insignificant and forgotten, others will survive mankind, such as Futura engraved on the Apollo 11 plaque, left on the Moon. Some of typefaces were revolutionary, others reactionary. But behind each of them there was an inventor. Students will follow the 'traces' and the stories of the type masters who shaped our visual typographical landscapes. Western and Arabic versions of typefaces will be examined and students will learn to identify and combine fonts on real visual design layouts. We will see how typefaces can become visual metaphors of towns and nations - Johnston Underground is London - or marketing tools for the advertising industry. Typography and type design in the digital age will be investigated via practical exercises and printing workshops.  The course will include calligraphy classes with the U.A.E. State calligrapher Mohammed Mandi at the National Theater Art Workshop, Abu Dhabi.\n\n      less description for VISAR-AD  118 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 119",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17225",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 002",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Mikdadi, Salwa"
                }
            ],
            "course_name": "",
            "description": "VISAR-AD  119\n\n   Contemporary Global Art\n\nSince the 1960s rise of conceptual art, artists around the world continue to create idea-based art using popular imagery, mixed media, photography and new technologies. Considered as the true global art form of the twentieth century, conceptual art manifests itself in ideas that challenge the current sociopolitical forces of our times and the commonly held notions of what art is about. The course will examine contemporary art from the lens of conceptual art focusing on key works by international artists. Student will examine the definition/s of ‘contemporary’ and the current debates around the...\n\n      more description for VISAR-AD  119 »\n\n      \n\n\n\nSince the 1960s rise of conceptual art, artists around the world continue to create idea-based art using popular imagery, mixed media, photography and new technologies. Considered as the true global art form of the twentieth century, conceptual art manifests itself in ideas that challenge the current sociopolitical forces of our times and the commonly held notions of what art is about. The course will examine contemporary art from the lens of conceptual art focusing on key works by international artists. Student will examine the definition/s of ‘contemporary’ and the current debates around the modern and contemporary in relation to Western and non-Western art. Course complemented with field trips to museums and collections.\n\n      less description for VISAR-AD  119 «",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 121",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12822",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 011 with Puccetti, Goffredo08/30/2015 - 12/17/2015 Wed 9.15 AM - 11.55 AM at SOC_SCI 011",
                    "time": "Mon 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Puccetti, Goffredo"
                }
            ],
            "course_name": "Graphic Design Studio",
            "description": "VISAR-AD  121 Graphic Design Studio \nThis immersive studio course in graphic design combines practice and reflection through a project-based approach to graphic design. Students develop creative and collaborative design skills for problem solving. Lectures and readings address western design history, contemporary Arabic graphic design, and cross-cultural design issues. Assignments focus on the design process from conception to distribution. Students will acquire proficiency with the Adobe Creative Suite.",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 122",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12975",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 153 with Torreano, John08/30/2015 - 12/17/2015 Tue 2.10 PM - 3.25 PM at ARTS_CENT 153",
                    "time": "Sun 9.15 AM - 11.55 AM",
                    "open": true,
                    "professor": "Torreano, John"
                }
            ],
            "course_name": "Foundations 1 - 2D",
            "description": "VISAR-AD  122 Foundations 1 - 2D \nThis course introduces students to 2D media (e.g., painting, drawing, printmaking, calligraphy), materials and design. Areas of study include plane, figure/ground relationships, scale and proportional transformation, patterning, composition, value, color, methods for conveying time, and spatial illusion. Using a wide variety of traditional and nontraditional materials and methods, the course emphasizes content issues and the historical and cultural context in which works of art are produced.",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 123",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12976",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "ARTS_CENT 15308/30/2015 - 12/17/2015 Thu 2.10 PM - 4.50 PM at ARTS_CENT 153"
                }
            ],
            "course_name": "Foundations of 3D",
            "description": "VISAR-AD  123 Foundations of 3D \nThis course explores the medium of sculpture and other 3D forms through the principles of three-dimensional design and the concepts that drive developments in contemporary art. Projects may include mold making, ceramics, and the use of wood working tools, as well as the use of sculpture as costume, performance, environment, or kinetic form. Students use a variety of materials from wood and cardboard to metal, plaster, paper, cloth and found objects to expand their understanding of form and space.",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 124",
            "course_name": "Foundations of 4D",
            "description": "VISAR-AD  124 Foundations of 4D \nThis course offers an intensive exploration of analog and digital media. Students are introduced to aesthetic, conceptual, and historical aspects of contemporary art by interfacing with a variety of imaging, audio, and communication applications. Students work in photography, video, digital art, performance, gaming, sound, and emerging practices.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 125",
            "course_name": "",
            "description": "VISAR-AD  125\n\n   Finding The Way: Wayfinding and Graphic Design in the Built Environment\n\nWayfinding encompasses all of the ways in which people orient themselves via the organization and usage of sensory cues from the external environment. In visual communication studies nowadays - informed by the constant advance of technologies, the demand for sustainable models and the inputs from cognitive scientists - the concept of wayfinding has grown to the point that it has become a broad field of research in its own, encompassing interdisciplinary relationship with architecture and design.\nThe course will explore the visual design component of wayfinding, and include lab classes and work...\n\n      more description for VISAR-AD  125 »\n\n      \n\n\n\nWayfinding encompasses all of the ways in which people orient themselves via the organization and usage of sensory cues from the external environment. In visual communication studies nowadays - informed by the constant advance of technologies, the demand for sustainable models and the inputs from cognitive scientists - the concept of wayfinding has grown to the point that it has become a broad field of research in its own, encompassing interdisciplinary relationship with architecture and design.\nThe course will explore the visual design component of wayfinding, and include lab classes and workshops around the Saadyat Campus signage system, with specific attention to multilingual display and accessible design for people with cognitive or physical disabilities. Students will study and compare sign systems implemented in western capitals and elaborate on the application (and misapplications) of these system in the U.A.E.\n\n      less description for VISAR-AD  125 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 126",
            "course_name": "",
            "description": "VISAR-AD  126\n\n   Interventions: Three-Dimensional Thinking\n\nIn this seminar we will study the new NYU Campus in Abu Dhabi and use the campus grounds as a site to develop temporary sculptural interventions in this public or semipublic space. We will begin by coming to terms with conceptualisations of sculpture since the 1960s that have understood the physical location of the work of art as a integral to our perception of it. The evolution of context-related sculpture since the 1960s led in the 1980s and 1990s to the need to distinguish between site-dominating, site-adapted, site-specific, and site-determined approaches. We will discuss the differences b...\n\n      more description for VISAR-AD  126 »\n\n      \n\n\n\nIn this seminar we will study the new NYU Campus in Abu Dhabi and use the campus grounds as a site to develop temporary sculptural interventions in this public or semipublic space. We will begin by coming to terms with conceptualisations of sculpture since the 1960s that have understood the physical location of the work of art as a integral to our perception of it. The evolution of context-related sculpture since the 1960s led in the 1980s and 1990s to the need to distinguish between site-dominating, site-adapted, site-specific, and site-determined approaches. We will discuss the differences between them in class and ask how the interventions developed in class relate to the architectural, institutional, social, and cultural circumstances of the campus. This includes questioning what sort of public a sculptural intervention should take into account and how this public differs from the audience at an art gallery. What qualities does public space have that are distinct from those of private space and what characterizes a semipublic space? Over the course of the seminar, we will work out the basic conditions within which we will be allowed to make sculptural interventions on campus. The selected sites will be analyzed in detail. The students will develop their proposals for interventions with the aid of photographic documentation, models, and a project description before realizing the interventions in coordination with the university administration and presenting them to the public for a limited time.\n\n      less description for VISAR-AD  126 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 127",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19149",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 124 with Darts, David08/30/2015 - 12/17/2015 Wed 9.15 AM - 11.55 AM at ARTS_CENT 124",
                    "time": "Mon 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Darts, David"
                }
            ],
            "course_name": "Projects in Sculpture: Wood Fabrication Studio",
            "description": "VISAR-AD  127 Projects in Sculpture: Wood Fabrication Studio \nStudents in this class will engage in a critical discourse about the material world with an emphasis on wood-based forms, materials and fabrication tools. Students will experiment with contemporary ideas, techniques, and technologies and will be introduced to contemporary artists and designers who work with wood and wood-based materials. Students will learn historic and contemporary woodworking techniques and will experiment with digital fabrication tools including the laser cutter and CNC router. Emphasis will be placed on independent investigations and creative problem solving.",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 150",
            "course_name": "X Islamic Art and Architecture",
            "description": "VISAR-AD  150X Islamic Art and Architecture \nThis course surveys the architecture, painting, and decorative arts of the Islamic world, from North Africa to central Asia, between the 7th and 18th centuries. The highlights of Islamic art are presented chronologically and thematically in order to provide a basic understanding of the historical evolution and regional variation of Islamic art and a deeper appreciation of its major themes and concepts, including sacred space, palace culture, mysticism, calligraphy, and ornament. (This course fulfills the requirement of an elective in pre-1800 Islamic art).",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 151",
            "course_name": "Design and Ornament in Islamic Art",
            "description": "VISAR-AD  151 Design and Ornament in Islamic Art \nThis course outlines the main principles of design in Islamic art and examines its various ornamental modes, including the vegetal, geometric, chromatic, and calligraphic. Drawing on recent studies of Islamic ornament and on a variety of sacred, philosophical, and scientific texts, the course examines the visual and semiotic role of Islamic ornament under specific historical conditions. (This course fulfills the requirement of an elective in pre-1800 Islamic art).",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 152",
            "course_name": "Orientalist Art",
            "description": "VISAR-AD  152 Orientalist Art \nThis seminar investigates the rich tradition of Orientalism in Western art as it culminates in French and British painting of the 19th century. The misrepresentation of Arab culture in Orientalist art and the role of this art in critiques of the social and political norms of European society are the primary themes of the seminar.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 155",
            "course_name": "The Exhibition Industry",
            "description": "VISAR-AD  155 The Exhibition Industry \nThe success of Frank Gehry’s Bilbao Guggenheim may be seen as the culmination of a paradigm shift away from the old idea of the museum as an\nart vault to a new conception of the museum as a programming center, a venue for high-profile temporary exhibitions, and a tourist attraction. This course explores the consequences for art and scholarship of the recent museum boom and asks what might it take to produce a change of direction.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 156",
            "course_name": "Topics in East Asian Art",
            "description": "VISAR-AD  156 Topics in East Asian Art \nThese courses focus on topics that are central to the study of the art and culture of China, Korea, and/or Japan. These courses investigate the social and historical contexts of artistic practice, as well as the construction of national or geographical conceptions of artistic traditions. These courses may also offer comparative perspectives that forge links to other areas of the curriculum.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 157",
            "course_name": "Topics in Southeast Asian Art",
            "description": "VISAR-AD  157 Topics in Southeast Asian Art \nThis course focuses on topics that are central to the study of the art and culture of such countries as Cambodia, Indonesia, Laos, Myanmar, the Philippines, Singapore, Thailand, or Vietnam. The course investigates the social and historical contexts of artistic practice, as well as the construction of national or geographical conceptions of artistic traditions. The course may also offer comparative perspectives that forge links to other areas of the curriculum.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 158",
            "course_name": "Topics in South Asian Art",
            "description": "VISAR-AD  158 Topics in South Asian Art \nThis course focuses on topics that are central to the study of the art and culture primarily of India, Pakistan, Bangladesh, and/or Sri Lanka. Traditions from other parts of the region (Afghanistan, Bhutan, Maldives, and Nepal) may also be considered. The course investigates the social and historical contexts of artistic practice, as well as the construction of national or geographical conceptions of artistic traditions. The course may also offer comparative perspectives that forge links to other areas of the curriculum.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 160",
            "course_name": "Epic Architecture",
            "description": "VISAR-AD  160 Epic Architecture \nThis course investigates the social, political, and imaginative roles played by grand architecture from ancient times to the present day. Through such case studies as the Temple of Luxor, Stonehenge, the Taj Mahal, the Hagia Sophia,\nthe Eiffel Tower, the Empire State Building, and the Sheikh Zayed Mosque, students investigate the historical contexts of monumental buildings and other structures that have been erected to serve as emblems of a national culture, as well as the ways that these monuments take on new life in literature and other forms of culture.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 161",
            "course_name": "Topics in Architecture and the Urban Environment from Antiquity to the Present",
            "description": "VISAR-AD  161 Topics in Architecture and the Urban Environment from Antiquity to the Present \nThis course focuses on topics that are central to the study of architecture and its relation to the urban environment. Students investigate architecture in its urban setting from the different perspectives of architectural history, engineering, and urban planning, taking into account technological and environmental factors, as well as construction and transportation systems.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 163",
            "course_name": "J",
            "description": "VISAR-AD  163J\n\n   Designing Abu Dhabi\n\nThis course guides students through the many facets of graphic design and visual communication, with a focus on the cross-cultural visual environment\nof Abu Dhabi and the Emirates. Students explore multiple aspects of visual design from aesthetics to user interfaces and usability, with special consideration of signage in Abu Dhabi. They also develop graphic designs that respond to the Abu Dhabi environment. Practical exercises that emphasize visual communication skills are central to the class. Students become familiar with the design procedures at the core of successful visual identity system...\n\n      more description for VISAR-AD  163J »\n\n      \n\n\n\nThis course guides students through the many facets of graphic design and visual communication, with a focus on the cross-cultural visual environment\nof Abu Dhabi and the Emirates. Students explore multiple aspects of visual design from aesthetics to user interfaces and usability, with special consideration of signage in Abu Dhabi. They also develop graphic designs that respond to the Abu Dhabi environment. Practical exercises that emphasize visual communication skills are central to the class. Students become familiar with the design procedures at the core of successful visual identity systems, thus developing their skills in research methodologies, data gathering, analysis,\ndecision making, brainstorming and creative solutions, team work and monitoring. Above all, the practical aspects of the course allow NYUAD\nstudents to contribute to the emerging Abu Dhabi design style.\n\n      less description for VISAR-AD  163J «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 164",
            "course_name": "J Photographic Practice",
            "description": "VISAR-AD  164J Photographic Practice \nThe class will challenge students to look at and photograph the local environment/society, and to reflect on their images as a way of understanding how the broader world of photography operates in constructing our image of the world. Any theme/subject and photographic style may be chosen as long as some access to that subject can be gained. Students will explore how to approach their subject, develop a theme, and how to choose images that reflect their experiences. They will keep a journal, and a final presentation will include a group of photographs and a short personal essay.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 165",
            "course_name": "J",
            "description": "VISAR-AD  165J\n\n   Gardens of Eden in the History of Art\n\nThe garden is one of the oldest modes of human intervention in the environment. This course explores the garden as a major art form by focusing on pictorial and spatial representations of the Garden of Eden. The Edenic Paradise of Genesis and the Qu’ran where Adam and Eve transgressed against God gives access to thought about gardens in the ancient Middle East. As a foundational figure in Judaic, Christian, and Islamic theology, the Garden of Eden spawned a history of interpretation that helped differentiate these religions. The history of Eden in the art of the peoples of the book is closely ...\n\n      more description for VISAR-AD  165J »\n\n      \n\n\n\nThe garden is one of the oldest modes of human intervention in the environment. This course explores the garden as a major art form by focusing on pictorial and spatial representations of the Garden of Eden. The Edenic Paradise of Genesis and the Qu’ran where Adam and Eve transgressed against God gives access to thought about gardens in the ancient Middle East. As a foundational figure in Judaic, Christian, and Islamic theology, the Garden of Eden spawned a history of interpretation that helped differentiate these religions. The history of Eden in the art of the peoples of the book is closely entwined with that of garden design, and the seminar examines both. We will study gardens in ancient Mesopotamia, early Christian monasteries, Syrian and Andalusian courtyards, Renaissance altarpieces, Enlightenment cities, Persian court miniatures, Mughal tomb complexes, and early American towns. To analyze these works, the course introduces fundamental methods of art history as an academic discipline. The seminar includes fieldtrips to gardens and collections in the UAE and India, and concludes with a collaborative garden design project in Abu Dhabi.\n\n      less description for VISAR-AD  165J «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 167",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17183",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 002",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Mochizuki, Mia Margaret"
                }
            ],
            "course_name": "",
            "description": "VISAR-AD  167\n\n   Global Renaissance\n\nWhat did early modern globalization and material exchange across cultures and contact zones look like ? This interdisciplinary seminar will study the material culture produced by Europe’s first sustained overseas contact with the rest of the world by following the Portuguese, Spanish, Dutch and British maritime trade routes from the sixteenth through eighteenth centuries. Topics will include formal languages of artistic world-making; interwoven histories of exploration, collecting, and surveillance; technologies of personal or communal identities; and visual aspects of political diplomacy and ...\n\n      more description for VISAR-AD  167 »\n\n      \n\n\n\nWhat did early modern globalization and material exchange across cultures and contact zones look like ? This interdisciplinary seminar will study the material culture produced by Europe’s first sustained overseas contact with the rest of the world by following the Portuguese, Spanish, Dutch and British maritime trade routes from the sixteenth through eighteenth centuries. Topics will include formal languages of artistic world-making; interwoven histories of exploration, collecting, and surveillance; technologies of personal or communal identities; and visual aspects of political diplomacy and subversion. Active class participation, brief powerpoint presentations and a research project. An art history course is preferred, but not required.\n\n      less description for VISAR-AD  167 «",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 170",
            "course_name": "Contemporary Photography from the Middle East, South Asia, and the Far East",
            "description": "VISAR-AD  170 Contemporary Photography from the Middle East, South Asia, and the Far East \nThis course will introduce students to a wide range of contemporary photographic practices in the Middle East, South Asia, and the Far East. Through slide lectures, readings, museum visits and presentations by local artists, students will explore the issues that artists, photography collectives and competitions of the region have concerned themselves with. The course will cover a range of genres, including Landscape, Performance, Portraiture, Documentary.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 171",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12934",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "EAST_ADMIN 006"
                }
            ],
            "course_name": "X Modern Art of the Arab World",
            "description": "VISAR-AD  171X Modern Art of the Arab World \nIn the short period of thirty years art of the Arab world moved from the periphery of the international art world to the center of global visual art production. The course examines the systems that have prompted this change and the theoretical\nframework that currently situates Arab art within the global discourse on visual art. Focusing on selected artists, the course explores the impact of\npolitical, social and market forces on the region’s art and the recent discourse on Islamic art and its links to modern and contemporary art of the region.",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 173",
            "course_name": "",
            "description": "VISAR-AD  173\n\n   The Sensory Baroque\n\nWhat is “baroque”? This course attempts to understand the trials and tribulations of an intellectual ideal via recent work in sensory studies, the art of excess understood  in terms of the body’s corporeal and spiritual senses. The masterpieces of seventeenth-century Baroque art — the work of Bernini, Rembrandt, Rubens, Velázquez and Vermeer — will be considered from the perspective of style, iconology, allegory, philosophy, and social theory. Topics will include unity and overflow, the sensual economy and its limits, continuity and disruption, anecdote and anachronism, subjectivity and object...\n\n      more description for VISAR-AD  173 »\n\n      \n\n\n\nWhat is “baroque”? This course attempts to understand the trials and tribulations of an intellectual ideal via recent work in sensory studies, the art of excess understood  in terms of the body’s corporeal and spiritual senses. The masterpieces of seventeenth-century Baroque art — the work of Bernini, Rembrandt, Rubens, Velázquez and Vermeer — will be considered from the perspective of style, iconology, allegory, philosophy, and social theory. Topics will include unity and overflow, the sensual economy and its limits, continuity and disruption, anecdote and anachronism, subjectivity and objectivity, reason and the problem of saturated phenomena. Active class participation, brief powerpoint presentations and a research project. An art history course is preferred, but not required.\n\n      less description for VISAR-AD  173 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 174",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19696",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 002",
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Stemmrich, Gregor"
                }
            ],
            "course_name": "",
            "description": "VISAR-AD  174\n\n   Modernism: An Art Historical Introduction\n\nThe term modernism encompasses the activities and creations of those who have felt since the late nineteenth century that traditional forms of art, architecture, literature, religious habit, social organization and ways of living are inadequate to the realities of an industrialized world. Such activities and creations have sought to initiate an understanding of the world that would ultimately lead to new cultural, economic, social, and political environments. This has involved experimentation and, the creation of an awareness of possibilities never thought of before, as well as a sense of cons...\n\n      more description for VISAR-AD  174 »\n\n      \n\n\n\nThe term modernism encompasses the activities and creations of those who have felt since the late nineteenth century that traditional forms of art, architecture, literature, religious habit, social organization and ways of living are inadequate to the realities of an industrialized world. Such activities and creations have sought to initiate an understanding of the world that would ultimately lead to new cultural, economic, social, and political environments. This has involved experimentation and, the creation of an awareness of possibilities never thought of before, as well as a sense of constant change and competition, especially in the arts. The course will provide an art historical survey from the late 19th century to the late 1960s. It will focus primarily on Europe and the United States and will explore art movements, ideas and exemplary individual artworks, but also the dynamics of art historical development as a whole.\n\n      less description for VISAR-AD  174 «",
            "offering": true
        },
        {
            "course_id": "VISAR-AD 201",
            "course_name": "",
            "description": "VISAR-AD  201\n\n   Interdisciplinary Projects in the Visual Arts\n\nThis class for experienced students is constructed around a series of projects realized in any available media or medium. How the mind constructs pictures from visual data is an extremely complicated set of behaviors that are biological, psychological, social, and cultural. Students are given in-depth exposure to the conditions that are necessary for artworks to “read” and how these conditions have a profound effect on the way people engage with art. This exposure allows students to explore ideas of limits and how the limit or horizon of what is possible can be elaborated and expanded on in ar...\n\n      more description for VISAR-AD  201 »\n\n      \n\n\n\nThis class for experienced students is constructed around a series of projects realized in any available media or medium. How the mind constructs pictures from visual data is an extremely complicated set of behaviors that are biological, psychological, social, and cultural. Students are given in-depth exposure to the conditions that are necessary for artworks to “read” and how these conditions have a profound effect on the way people engage with art. This exposure allows students to explore ideas of limits and how the limit or horizon of what is possible can be elaborated and expanded on in art. Students engage in group and one-on-one discussions of projects made in response to readings and assignments whose goal is to foster ideas of exploration and consistency in a creative practice.\n\n      less description for VISAR-AD  201 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 202",
            "course_name": "Form and Space or Concepts in Three-Dimensional Thinking",
            "description": "VISAR-AD  202 Form and Space or Concepts in Three-Dimensional Thinking \nThis studio course explores materials, concepts and tools used in contemporary sculptural practices. An intensive, hands-on course, it provides a foundation\nin three-dimensional thinking that enables students to see and conceive of space in a new and critical way. Students move towards self-directed\nsolutions for the creative problems posed by their own art works.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 234",
            "course_name": "Experiential Video Art",
            "description": "VISAR-AD  234 Experiential Video Art \nThe advent of video heralded a new, mediated form of expression, quickly embraced by artists, journalists, and provocateurs. This course provides an overview of video art since its inception in the late 1960s and is designed to trace the path of the medium to contemporary practices. Emerging methods of video interaction in the context of performance and installation will be applied. Students will develop their own work while examining technical and aesthetic concepts\nembedded in existing pieces.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 298",
            "course_name": "Directed Study",
            "description": "VISAR-AD  298 Directed Study \nClosely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 300",
            "course_name": "",
            "description": "VISAR-AD  300\n\n   Thinking Art\n\nThis course offers engagements with the problems and methods of Art History at an advanced level. It examines in detail works of art that reflect upon tradition, aesthetic experience and art practice in complex ways and does so by situating these examinations in rich historical and theoretical frameworks. The course is open to anyone who has completed either Foundations of Art History I or II and at least one Art History elective but it is designed with Art History juniors especially in mind because the course is, in part, a useful preparation for Capstone work in the senior year. The course i...\n\n      more description for VISAR-AD  300 »\n\n      \n\n\n\nThis course offers engagements with the problems and methods of Art History at an advanced level. It examines in detail works of art that reflect upon tradition, aesthetic experience and art practice in complex ways and does so by situating these examinations in rich historical and theoretical frameworks. The course is open to anyone who has completed either Foundations of Art History I or II and at least one Art History elective but it is designed with Art History juniors especially in mind because the course is, in part, a useful preparation for Capstone work in the senior year. The course is a requirement for all students pursuing the Art History track.\n\n      less description for VISAR-AD  300 «",
            "offering": false
        },
        {
            "course_id": "VISAR-AD 301",
            "course_name": "",
            "description": "VISAR-AD  301\n\n   Advanced Critique and Exhibition Studies\n\nThis course is for juniors and aims to prepare them for their Capstone project in visual arts practice through a deepening exploration of their individual work as young artists, and the contextualization of that work through the work of their peers. It is also open to visual arts majors interested in exhibition preparation. The course includes readings in critical discourses such as art history, critical theory, and exhibition criticism, both contemporary and historical, with a focus on advanced level group critique of student work. This course aims to develop a student’s sense of the context ...\n\n      more description for VISAR-AD  301 »\n\n      \n\n\n\nThis course is for juniors and aims to prepare them for their Capstone project in visual arts practice through a deepening exploration of their individual work as young artists, and the contextualization of that work through the work of their peers. It is also open to visual arts majors interested in exhibition preparation. The course includes readings in critical discourses such as art history, critical theory, and exhibition criticism, both contemporary and historical, with a focus on advanced level group critique of student work. This course aims to develop a student’s sense of the context of contemporary and historical art practices, and culminates in a student group exhibition in a professional gallery setting.\n\n      less description for VISAR-AD  301 «",
            "offering": false
        }
    ]
}