{
    "major_id": "WRTNG-UG",
    "file": "./2015-2016/Advanced_Writing_Courses_(WRTNG-UG).html",
    "courses": [
        {
            "course_id": "WRTNG-UG 1005",
            "course_name": "Elements of Performance",
            "description": "WRTNG-UG 1005 Elements of Performance",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1006",
            "course_name": "The Essayist as Critic",
            "description": "WRTNG-UG 1006 The Essayist as Critic",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1010",
            "course_name": "The Essayist as Critic",
            "description": "WRTNG-UG 1010 The Essayist as Critic",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1015",
            "course_name": "",
            "description": "WRTNG-UG 1015\n\n   The Practice of Writing: Black Fire On White Fire\n\nThis course focuses on writing as a writer's process. This practicum will be part workshop, part symposium. There will be weekly presentations of pieces and discussions about possibilities and process.  Discussions will focus on 1) the primacy of the sentence, 2) the distinction between observation and inference, and 3) the basic dynamics of successful writing. Students may work on various literary forms--fables and parables, profiles, interviews, journals and letters, autobiographical reflections and personal essays, critical reviews, and literary analyses. To share what one observes, what on...\n\n      more description for WRTNG-UG 1015 »\n\n      \n\n\n\nThis course focuses on writing as a writer's process. This practicum will be part workshop, part symposium. There will be weekly presentations of pieces and discussions about possibilities and process.  Discussions will focus on 1) the primacy of the sentence, 2) the distinction between observation and inference, and 3) the basic dynamics of successful writing. Students may work on various literary forms--fables and parables, profiles, interviews, journals and letters, autobiographical reflections and personal essays, critical reviews, and literary analyses. To share what one observes, what one deduces, and what one wants to frame for others clearly and effectively, takes skill and practice. What does it mean to bring proportion and perspective to one?s writing?\n\n      less description for WRTNG-UG 1015 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1018",
            "course_name": "The Craft of Writing",
            "description": "WRTNG-UG 1018 The Craft of Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1019",
            "course_name": "",
            "description": "WRTNG-UG 1019\n\n   The Basics and the Bold: Fundamentals of Editing Fiction and Creative Nonfiction\n\nBook editors and agents find that a great variety of submissions (including novels, short story collections, memoir and narrative nonfiction) require precisely the same kinds of editorial attention. Learning to identify and attend to these ubiquitous weaknesses in concept, narrative and prose can lift a manuscript from the “no” pile to enthusiastic acceptance and, later, from lackluster publication to strong word of mouth and review attention. This class will focus on two kinds of editing that can address those frequent, genre-crossing manuscript problems: the bold—identifying and troubleshoot...\n\n      more description for WRTNG-UG 1019 »\n\n      \n\n\n\nBook editors and agents find that a great variety of submissions (including novels, short story collections, memoir and narrative nonfiction) require precisely the same kinds of editorial attention. Learning to identify and attend to these ubiquitous weaknesses in concept, narrative and prose can lift a manuscript from the “no” pile to enthusiastic acceptance and, later, from lackluster publication to strong word of mouth and review attention. This class will focus on two kinds of editing that can address those frequent, genre-crossing manuscript problems: the bold—identifying and troubleshooting the bigger conceptual and structural problems, including the young writer’s frequent habit of not being bold at all; and the basics—sweating the small stuff by learning and using the tricks of an editor’s trade. Readings will include works by writers such as Jennifer Egan, Jeffrey Eugenides, Mary Karr, Laura Hillenbrand and others (models of successful basics and boldness), and student writings. Students will be expected to: 1) bring in one story, chapter of a novel, piece of memoir or narrative nonfiction that they have written, 2) edit (including a line edit and an editorial letter) and 3) revise their own piece of writing in response to editorial feedback from the class.\n\n      less description for WRTNG-UG 1019 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1020",
            "course_name": "Revision: from The Inside Out",
            "description": "WRTNG-UG 1020 Revision: from The Inside Out",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1021",
            "course_name": "Investigative Journalism and New Media",
            "description": "WRTNG-UG 1021 Investigative Journalism and New Media",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1022",
            "course_name": "",
            "description": "WRTNG-UG 1022\n\n   Intro to Investigative Reporting\n\nGood non-fiction narratives depend on robust, comprehensive research, and in-depth journalism often requires strong investigative reporting.  This course will introduce writers and reporters to these skills through the development of an investigative project.  Students will learn basic approaches to gathering public documents, performing background research on organizations and individuals, learning how to skillfully conduct interviews, and understanding the mechanics of storytelling.  The class will cooperatively produce an investigative project that centers on one local topic—such as looking...\n\n      more description for WRTNG-UG 1022 »\n\n      \n\n\n\nGood non-fiction narratives depend on robust, comprehensive research, and in-depth journalism often requires strong investigative reporting.  This course will introduce writers and reporters to these skills through the development of an investigative project.  Students will learn basic approaches to gathering public documents, performing background research on organizations and individuals, learning how to skillfully conduct interviews, and understanding the mechanics of storytelling.  The class will cooperatively produce an investigative project that centers on one local topic—such as looking into recent issues pertaining to the New York City Housing Authority or the Administration for Children’s Services—with students finally producing a series of polished articles that will comprise a sequence on the course topic.  To complement our writing, students will read texts about investigative reporting, and some of the best contemporary examples of investigative reporting in literary journalism. Readings may include texts by Jane Mayer, Juan Gonzalez, The Investigative Reporter's Handbook, by Brant Houston, Len Bruzzese and Steve Weinberg, A Civil Action, by Jonathan Harr, Muckraking!: The Journalism That Changed America, Judith Serrin and William Serrin, and The Journalist and the Murderer, by Janet Malcolm.\n\n      less description for WRTNG-UG 1022 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1024",
            "course_name": "",
            "description": "WRTNG-UG 1024\n\n   Magazine Writing\n\nFor more than a century the American print magazine has provided a distinct literary experience—timely subjects, a juxtaposition of text and image, a rich grab bag of styles and forms. In this seminar we’ll look at examples of reporting, profile writing, criticism and memoir from the pages of magazines past and present (from The Saturday Evening Post to Vogue to Vice). How have magazines, and their distinctive design vocabulary, driven the national conversation? How do we understand \"facts\" in these publications? What roles do voice, point-of-view, character, dialogue, and plot—the traditional...\n\n      more description for WRTNG-UG 1024 »\n\n      \n\n\n\nFor more than a century the American print magazine has provided a distinct literary experience—timely subjects, a juxtaposition of text and image, a rich grab bag of styles and forms. In this seminar we’ll look at examples of reporting, profile writing, criticism and memoir from the pages of magazines past and present (from The Saturday Evening Post to Vogue to Vice). How have magazines, and their distinctive design vocabulary, driven the national conversation? How do we understand \"facts\" in these publications? What roles do voice, point-of-view, character, dialogue, and plot—the traditional elements of fiction—play? Can criticism be the equal of art? Over the course of the semester students will be expected to generate long- and short-form magazine story ideas, to shape a magazine pitch and write and revise stories on deadline. Readings may include selections from the works of Stephen Crane, Morris Markey, James Thurber, John Hersey, Lillian Ross, James Baldwin, Tom Wolfe, Joan Didion, Hunter S. Thompson, Michael Herr, Martin Amis, Gay Talese, John Updike, David Foster Wallace, George Saunders, Michael Lewis, Denis Johnson, and Janet Malcolm.\n\n      less description for WRTNG-UG 1024 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1025",
            "course_name": "",
            "description": "WRTNG-UG 1025\n\n   Style and Substance: Tools for Writing\n\nWriting is a deliberate, conscious act. Whether it is short or long, fiction or nonfiction, the finished work is as meticulously designed and executed as a cathedral. This course examines how writers use the various elements of narrative to realize their ideas with precision and grace.  Specific craft elements?plot and structure, characterization and dialogue, and point of view?are explored through close reading of exemplary writing, in-class exercises, and take-home assignments. Class discussions analyze storytelling strategies in the published work of established writers; workshopping studen...\n\n      more description for WRTNG-UG 1025 »\n\n      \n\n\n\nWriting is a deliberate, conscious act. Whether it is short or long, fiction or nonfiction, the finished work is as meticulously designed and executed as a cathedral. This course examines how writers use the various elements of narrative to realize their ideas with precision and grace.  Specific craft elements?plot and structure, characterization and dialogue, and point of view?are explored through close reading of exemplary writing, in-class exercises, and take-home assignments. Class discussions analyze storytelling strategies in the published work of established writers; workshopping students? writing is scheduled in the second half of the term.  The readings include personal essays, journalism, excerpted fiction, and scripts. Taped interviews with writers and other professionals are screened and discussed, and information about interacting with the publishing industry is offered.\n\n      less description for WRTNG-UG 1025 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1026",
            "course_name": "",
            "description": "WRTNG-UG 1026\n\n   Lives in Brief\n\n\"I can never get enough of knowing about other people's lives,\" said William Maxwell. People love to read biography in many forms: fat books, short obituaries, newspaper feature stories, and magazine profiles. This class will explore the writing of short biography, how you can capture the spirit and shape of a person's life in a few hundred words. We will read a variety of writers, from Sigrid Nunez and Oliver Sacks to Janet Malcolm and Lawrence Weschler, to discover tools and methods. Students will write (and rewrite) four assignments, ranging from short personal snapshots to detailed book re...\n\n      more description for WRTNG-UG 1026 »\n\n      \n\n\n\n\"I can never get enough of knowing about other people's lives,\" said William Maxwell. People love to read biography in many forms: fat books, short obituaries, newspaper feature stories, and magazine profiles. This class will explore the writing of short biography, how you can capture the spirit and shape of a person's life in a few hundred words. We will read a variety of writers, from Sigrid Nunez and Oliver Sacks to Janet Malcolm and Lawrence Weschler, to discover tools and methods. Students will write (and rewrite) four assignments, ranging from short personal snapshots to detailed book reviews to an interview-derived essay. We will discuss research techniques and ethical issues.\n\n      less description for WRTNG-UG 1026 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1027",
            "course_name": "Writing a Column",
            "description": "WRTNG-UG 1027 Writing a Column",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1028",
            "course_name": "The Reviewer'S Art",
            "description": "WRTNG-UG 1028 The Reviewer'S Art",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1029",
            "course_name": "",
            "description": "WRTNG-UG 1029\n\n   The Nonfiction Narrator\n\nMuch of the most exciting and influential postwar nonfiction—magazine writing as well as longer forms—has been marked by the emergence of a first-person narrator as a character and sometimes as a protagonist. It ushered in a newly lyrical and personal body of work, making the case for nonfiction as a full-fledged literary genre. In this class students will narrate their work from inside the story, trying their hand at first-person reporting, memoir, essay, cultural coverage. We will explore opportunities for enriching reporting with memoiristic writing and composing scenes, while learning to a...\n\n      more description for WRTNG-UG 1029 »\n\n      \n\n\n\nMuch of the most exciting and influential postwar nonfiction—magazine writing as well as longer forms—has been marked by the emergence of a first-person narrator as a character and sometimes as a protagonist. It ushered in a newly lyrical and personal body of work, making the case for nonfiction as a full-fledged literary genre. In this class students will narrate their work from inside the story, trying their hand at first-person reporting, memoir, essay, cultural coverage. We will explore opportunities for enriching reporting with memoiristic writing and composing scenes, while learning to avoid preciousness and solipsism. We will also examine the way this technique changed the course of long-form journalism and nonfiction in readings from Michael Herr, Truman Capote, Wells Tower, Renata Adler, Dave Hickey, Geoff Dyer, James Baldwin and Eileen Myles.\n\n      less description for WRTNG-UG 1029 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1030",
            "course_name": "The Critical Edge: Writ/ Indicting & The Arts",
            "description": "WRTNG-UG 1030 The Critical Edge: Writ/ Indicting & The Arts",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1031",
            "course_name": "Writing Critically About The Art",
            "description": "WRTNG-UG 1031 Writing Critically About The Art",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1032",
            "course_name": "Writing About Art",
            "description": "WRTNG-UG 1032 Writing About Art",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1033",
            "course_name": "",
            "description": "WRTNG-UG 1033\n\n   Writing About Popular Music\n\nPopular music is a product of integration: the melding of Anglo-Celtic folk ballads, African-American laments and rhythms, Eastern European accordian tunes, Calypso, jazz, country, blues and more. In turn, American popular music, more than any other cultural trend in recent history, has left its mark on literature, film, classical music, art and politics. In this class, students will explore the rich world of popular music, and write responsive, critical, and research essays on the music?s form and content. Essays will engage with the politics and social forces involved in popular music as tre...\n\n      more description for WRTNG-UG 1033 »\n\n      \n\n\n\nPopular music is a product of integration: the melding of Anglo-Celtic folk ballads, African-American laments and rhythms, Eastern European accordian tunes, Calypso, jazz, country, blues and more. In turn, American popular music, more than any other cultural trend in recent history, has left its mark on literature, film, classical music, art and politics. In this class, students will explore the rich world of popular music, and write responsive, critical, and research essays on the music?s form and content. Essays will engage with the politics and social forces involved in popular music as treated by particular performers. Research may focus on the social and material forces that might have created music as we now know it, and how the music has in turn recreated us. Readings will include works by Nick Tosches, Peter Guralnick, and Greil Marcus.\n\n      less description for WRTNG-UG 1033 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1034",
            "course_name": "",
            "description": "WRTNG-UG 1034\n\n   Writing About Performance\n\nThis writing seminar will train students to become critical viewers of performance and translate their \"looking\" into descriptive and analytical prose. Students will be introduced to a variety of critical strategies and approaches—from formalist to ethnographic to various forms of sociological and cultural criticism—to develop their interpretive skills. These analyses will help students discover how various performance mediums are constituted, how they \"work,\" and how they create meaning for viewers. Assignments will include interviews, artists’ profiles, performance documentations, cultural r...\n\n      more description for WRTNG-UG 1034 »\n\n      \n\n\n\nThis writing seminar will train students to become critical viewers of performance and translate their \"looking\" into descriptive and analytical prose. Students will be introduced to a variety of critical strategies and approaches—from formalist to ethnographic to various forms of sociological and cultural criticism—to develop their interpretive skills. These analyses will help students discover how various performance mediums are constituted, how they \"work,\" and how they create meaning for viewers. Assignments will include interviews, artists’ profiles, performance documentations, cultural reviews, and critical and/or theoretical analyses. Occasional group excursions to performances will be arranged, as well as class speakers. Some of the authors, essayists, and artists whose works we may read include: Susan Sontag; Michael Kirby; Edwin Denby; Deborah Jowitt; Joan Acocella; Joyce Carol Oates; Anna Deavere Smith; Spalding Gray; and Henry Louis Gates, Jr.\n\n      less description for WRTNG-UG 1034 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1035",
            "course_name": "Writing and Politics",
            "description": "WRTNG-UG 1035 Writing and Politics",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1036",
            "course_name": "Opinionated Writing",
            "description": "WRTNG-UG 1036 Opinionated Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1037",
            "course_name": "Advocacy Writing",
            "description": "WRTNG-UG 1037 Advocacy Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1038",
            "course_name": "Writing as Social Action",
            "description": "WRTNG-UG 1038 Writing as Social Action",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1039",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12299",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 401",
                    "time": "Tue 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Petrusich, Amanda"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1039\n\n   Writing About Popular Music\n\nEffective music criticism—criticism that places a song or album within the appropriate social, political, personal, and aesthetic contexts—can be as enthralling and moving as the music it engages. In this course, we will explore different ways of writing about music, from the record review to the personal essay. We’ll consider the evolving tradition of pop music criticism (How are MP3 blogs and Web sites challenging print media? How is the critic’s role changing?) and the mysterious practice of translating sound into ideas (How do we train ourselves to be better and more thoughtful listeners?)...\n\n      more description for WRTNG-UG 1039 »\n\n      \n\n\n\nEffective music criticism—criticism that places a song or album within the appropriate social, political, personal, and aesthetic contexts—can be as enthralling and moving as the music it engages. In this course, we will explore different ways of writing about music, from the record review to the personal essay. We’ll consider the evolving tradition of pop music criticism (How are MP3 blogs and Web sites challenging print media? How is the critic’s role changing?) and the mysterious practice of translating sound into ideas (How do we train ourselves to be better and more thoughtful listeners?). Through reading, writing, and class discussion, we’ll contemplate the mysterious circuitry that causes people to embrace (or require) music—from Bob Dylan to Lil’ Wayne —and how best to explore that connection on the page. Readings will include Lester Bangs, Rob Sheffield, Carl Wilson, Sasha Frere-Jones, Robert Christgau, Ann Powers, Simon Reynolds, Chuck Klosterman, Ellen Willis, and others.\n\n      less description for WRTNG-UG 1039 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1040",
            "course_name": "Writing from The Margins",
            "description": "WRTNG-UG 1040 Writing from The Margins",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1042",
            "course_name": "",
            "description": "WRTNG-UG 1042\n\n   Pop Culture Criticism\n\nIn an era where criticism has been democratized and art is often judged exclusively by the amount of chatter it incites, the role of the professional critic is changing (and fast – these days, even reviews are subject to reviews). In this advanced writing workshop, we’ll explore the best, most effective ways for writers to engage critically with pop culture. Should critical writing be personal or objective? Is it more important to contextualize or describe? Given the overwhelming deluge of options facing media consumers, is the critic’s job merely to direct the conversation?  Students submit f...\n\n      more description for WRTNG-UG 1042 »\n\n      \n\n\n\nIn an era where criticism has been democratized and art is often judged exclusively by the amount of chatter it incites, the role of the professional critic is changing (and fast – these days, even reviews are subject to reviews). In this advanced writing workshop, we’ll explore the best, most effective ways for writers to engage critically with pop culture. Should critical writing be personal or objective? Is it more important to contextualize or describe? Given the overwhelming deluge of options facing media consumers, is the critic’s job merely to direct the conversation?  Students submit four original pieces of criticism for workshop; readings may include works by Emily Nussbaum, A.O. Scott, Ellen Willis, John Jeremiah Sullivan, and others.\n\n      less description for WRTNG-UG 1042 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1045",
            "course_name": "",
            "description": "WRTNG-UG 1045\n\n   Writing Race in Contemporary America\n\nIn contemporary America, we have a multicultural and racially diversified population; our national image is no longer dominated by people of European descent. This is easily evidenced in our mass media and in the last U.S.Census Report where the statistics demonstrate that our African-American, Hispanic, Asian, and ?Other? populations are rapidly growing and developing. We are interbreeding, intermarrying, interracial, and interlocked. In this writing course, we will increase awareness of the phenomenon of our multicultural identities by writing personal essays, biographies, and autobiographie...\n\n      more description for WRTNG-UG 1045 »\n\n      \n\n\n\nIn contemporary America, we have a multicultural and racially diversified population; our national image is no longer dominated by people of European descent. This is easily evidenced in our mass media and in the last U.S.Census Report where the statistics demonstrate that our African-American, Hispanic, Asian, and ?Other? populations are rapidly growing and developing. We are interbreeding, intermarrying, interracial, and interlocked. In this writing course, we will increase awareness of the phenomenon of our multicultural identities by writing personal essays, biographies, and autobiographies. We will focus on exploring our own racial and ethnic backgrounds, as well as exploring this theme in readings and in a variety of films.   Readings include Race and Remembrance: A Memoir by Arthur L. Johnson and Brown: The Last Discovery of America by Richard Rodriguez.\n\n      less description for WRTNG-UG 1045 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1047",
            "course_name": "",
            "description": "WRTNG-UG 1047\n\n   Writing On Wealth and Power\n\nPart of the story that Americans tell themselves about themselves has to do with the Horatio Alger tales about how talent, hard work and a little luck yields success, money, status, fame and power.  Going from ?rags to riches? in the span of one generation has thus become part of how we define the American dream?even as that dream recedes further and further away from the grasp of most citizens. Using autobiographies such as Barack Obama's Dreams from My Father; Frank Kofsky?s Black Music, White Business; and classic sociological works such as C. Wright Mill's The Power Elite; this writing sem...\n\n      more description for WRTNG-UG 1047 »\n\n      \n\n\n\nPart of the story that Americans tell themselves about themselves has to do with the Horatio Alger tales about how talent, hard work and a little luck yields success, money, status, fame and power.  Going from ?rags to riches? in the span of one generation has thus become part of how we define the American dream?even as that dream recedes further and further away from the grasp of most citizens. Using autobiographies such as Barack Obama's Dreams from My Father; Frank Kofsky?s Black Music, White Business; and classic sociological works such as C. Wright Mill's The Power Elite; this writing seminar focuses on researching and writing fiction and non-fiction about ?making it in America.? Students will write experiential, narrative, and academic essays on the economic power of the men and women who have achieved or inherited it. We will also devote time in the class to discussing editing, and revising.\n\n      less description for WRTNG-UG 1047 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1050",
            "course_name": "Discourses of Desire",
            "description": "WRTNG-UG 1050 Discourses of Desire",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1055",
            "course_name": "The Urban Journalist",
            "description": "WRTNG-UG 1055 The Urban Journalist",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1059",
            "course_name": "",
            "description": "WRTNG-UG 1059\n\n   Issues in Urban Journalism: New York City and the News\n\nThis course in “urban journalism” explores some of the ways that our city is represented in the media, primarily in print and photography.  We read about the journalistic coverage of diverse people and events around New York City, examining hot-button issues surrounding race and class, and considering ways in which crime is covered in the news. Our focus on photojournalism, meanwhile, investigates intricacies and even controversies of photographic representation as we also visit and report on some of the city’s visual offerings, be they formal installations, cultural events, or impromptu art. ...\n\n      more description for WRTNG-UG 1059 »\n\n      \n\n\n\nThis course in “urban journalism” explores some of the ways that our city is represented in the media, primarily in print and photography.  We read about the journalistic coverage of diverse people and events around New York City, examining hot-button issues surrounding race and class, and considering ways in which crime is covered in the news. Our focus on photojournalism, meanwhile, investigates intricacies and even controversies of photographic representation as we also visit and report on some of the city’s visual offerings, be they formal installations, cultural events, or impromptu art. Throughout, we direct our attention to such concerns as the mediatized representation of others, journalistic ethics, and the politics of what kinds of news stories sell papers. Guest speakers may include NYC journalists, and city-based excursions are an important part of this seminar. Our readings derive from a number of disciplines (urban studies, sociology, journalism), and  authors may include Joan Didion, Henri Lefebvre and Pierre Bourdieu, as well as news articles from NYC papers and reflections by seasoned journalists, such as David Krajicek of the Daily News. This course does not teach how to be a reporter; rather, with the emphasis on critical reading, students learn to assess others’ journalistic output and to understand how that journalistic work both informs and is informed by its social and political contexts. Students write reaction pieces and academic papers, give presentations, and create a photojournalism project on a subject of their choice.\n\n      less description for WRTNG-UG 1059 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1060",
            "course_name": "Writing Theory",
            "description": "WRTNG-UG 1060 Writing Theory",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1070",
            "course_name": "Writing About Film",
            "description": "WRTNG-UG 1070 Writing About Film \nWriting about movies is more than just issuing thumbs-up, thumbs-down judgments. In this class you will learn how to discuss a film's content, style, and meaning in ways that can interest even people who disagree with you. You will explore some of the many different ways there are to write about cinema, expanding your command of words by reading such critics as James Agee, Pauline Kael, James Baldwin, Molly Haskell, and others. Students will write (and rewrite) five papers ranging from brief movie reviews to a final eight-to-ten page essay.",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1075",
            "course_name": "",
            "description": "WRTNG-UG 1075\n\n   The Montage is The Message\n\nA man smiles, a shot is fired, he frowns. No: A man frowns, a shot is fired, he smiles. The sequence tells all. When it comes to telling stories, the order of scenes conveys more meaning even than the scenes themselves. In this class, students will draw from film theory to learn the secrets of constructing a propulsive and persuasive non-fiction narrative. We will explore how writers make choices about what to describe and how to arrange those descriptions; and also how in making these choices, they begin (whether they intend it or not) to make an argument. Students will analyze film sequences...\n\n      more description for WRTNG-UG 1075 »\n\n      \n\n\n\nA man smiles, a shot is fired, he frowns. No: A man frowns, a shot is fired, he smiles. The sequence tells all. When it comes to telling stories, the order of scenes conveys more meaning even than the scenes themselves. In this class, students will draw from film theory to learn the secrets of constructing a propulsive and persuasive non-fiction narrative. We will explore how writers make choices about what to describe and how to arrange those descriptions; and also how in making these choices, they begin (whether they intend it or not) to make an argument. Students will analyze film sequences from Eisenstein, Kubrick, and Welles, and magazine stories by Cecilia Balli, Joan Didion, Ian Frazier, Frederick Kaufman, and Lawrence Weschler. The real breakthroughs, though, will occur as students set about assembling and reassembling their own magazine articles.\n\n      less description for WRTNG-UG 1075 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1105",
            "course_name": "",
            "description": "WRTNG-UG 1105\n\n   Freelance Writing\n\nSuccessful freelancers know that their days are spent cultivating and shaping story ideas, tracking down sources, parsing one story idea into three, and pitching, pitching, pitching. But where does one begin? How can new writers break in if they don't have any clips to show an editor? In this seminar, we will interrogate the art and business of freelance writing: what it takes to create a story, as well as what it takes to sell it. Writing assignments will include a variety of story types, including reviews, profiles, service stories, and personal essays, along with the all-important pitch let...\n\n      more description for WRTNG-UG 1105 »\n\n      \n\n\n\nSuccessful freelancers know that their days are spent cultivating and shaping story ideas, tracking down sources, parsing one story idea into three, and pitching, pitching, pitching. But where does one begin? How can new writers break in if they don't have any clips to show an editor? In this seminar, we will interrogate the art and business of freelance writing: what it takes to create a story, as well as what it takes to sell it. Writing assignments will include a variety of story types, including reviews, profiles, service stories, and personal essays, along with the all-important pitch letter. We will look to the masters of the craft (Susan Orlean, Michiko Kakutani, James Surowiecki, Katharine Boo, Elizabeth Kolbert, James Wood, Alex Ross, and more), and we will also discover reading in the real world of the newspapers and magazines students plan to solicit.\n\n      less description for WRTNG-UG 1105 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1110",
            "course_name": "",
            "description": "WRTNG-UG 1110\n\n   Food Across Genres\n\nThis course will explore creative food writing across a number of genres. Throughout the semester, we will ask the question: who is writing, what is their relationship to food (growing it, cooking it, eating it), and how can food be used as a narrative lens? We will read food journalism, personal essays, humor, cookbook excerpts, blogs, philosophy and poetry. The course will be evenly divided between close, critical reading and discussion of various food writers' work, and experimenting with several forms of food writing ourselves. Students will write several short pieces and choose one longer...\n\n      more description for WRTNG-UG 1110 »\n\n      \n\n\n\nThis course will explore creative food writing across a number of genres. Throughout the semester, we will ask the question: who is writing, what is their relationship to food (growing it, cooking it, eating it), and how can food be used as a narrative lens? We will read food journalism, personal essays, humor, cookbook excerpts, blogs, philosophy and poetry. The course will be evenly divided between close, critical reading and discussion of various food writers' work, and experimenting with several forms of food writing ourselves. Students will write several short pieces and choose one longer piece to develop over the course of the semester. Students will workshop one another's work in class on a rotating weekly basis. Visiting lecturers will lead discussions of their particular lenses on food, its potency in various cultural contexts, and help us explore food's power as a narrative tool. Readings will include selections by writers such as Calvin Trillin, MFK Fisher, Joseph Mitchell, John T. Edge, Zora Neale Hurston, Wendell Berry, Robert Farrar Capon and Octavio Paz.\n\n      less description for WRTNG-UG 1110 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1120",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17141",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 601",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Franklin, Sara"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1120\n\n   The Southern Table: Place, Politics, Memory, Mythology in the Food/American South\n\nThere is perhaps no region in America as valorized and contested, romanticized and politically polarizing as the South. In contemporary American food culture, the South has come to represent a number of aesthetic ideals including authenticity, craftsmanship and the particularities of place. Many even go so far as to argue that the foods of the South make up the only “true” American cuisine. Why the South? What elements of the region’s unique history inform this contemporary mindset, and what can we learn from today’s “New Southern” table about identity, politics, history and progress? How can ...\n\n      more description for WRTNG-UG 1120 »\n\n      \n\n\n\nThere is perhaps no region in America as valorized and contested, romanticized and politically polarizing as the South. In contemporary American food culture, the South has come to represent a number of aesthetic ideals including authenticity, craftsmanship and the particularities of place. Many even go so far as to argue that the foods of the South make up the only “true” American cuisine. Why the South? What elements of the region’s unique history inform this contemporary mindset, and what can we learn from today’s “New Southern” table about identity, politics, history and progress? How can studying the food of the South help us understand the popular mythology of our country as a whole?   In this course, we will read both scholarly and popular literature as well as watch and listen to various materials that dig into Southern food culture. We will tease apart what is so unique about the region and its pockets of vernacular cuisine, both in reality and in imagination. By putting Southern food under the magnifying glass, we will tease apart how various forms of media engage with historical and contemporary issues of race, class and gender by continually asking: Who is credited with “inventing” the cuisines of the American South? From whence do signature Southern ingredients really hail, and who has prepared them? How have branding, advertising, cookbooks and television massaged the Southern narrative in order to serve and perpetuate the romantic ideals of the Old South?  And in today’s “New South,” who is invited to, and who is still excluded from, the Southern table, both in reality and in popular narratives?  In this unique moment of Southern food’s surge in popularity, we will pen our own stories about how the South is translated and represented gastronomically in our own locale, New York City.\n\n      less description for WRTNG-UG 1120 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1205",
            "course_name": "Dialogue in Theory and Practice",
            "description": "WRTNG-UG 1205 Dialogue in Theory and Practice",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1210",
            "course_name": "Writing The Human Predicament",
            "description": "WRTNG-UG 1210 Writing The Human Predicament",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1215",
            "course_name": "",
            "description": "WRTNG-UG 1215\n\n   Writing the Other\n\nWriting professors often advise students, “Write what you know.” But how about writing from what you know into what you don’t know, specifically by tackling the perspective of someone who is different from you? In this course, we’ll explore a range of identities: gender, race, sexual orientation, class, age, disability, body type, and many more. How can we learn to recognize our own blind spots that prevent us from fully seeing the people and the world around us? And how can we confront and overcome our fears of causing offense in our attempts to get inside someone whose life experience we don...\n\n      more description for WRTNG-UG 1215 »\n\n      \n\n\n\nWriting professors often advise students, “Write what you know.” But how about writing from what you know into what you don’t know, specifically by tackling the perspective of someone who is different from you? In this course, we’ll explore a range of identities: gender, race, sexual orientation, class, age, disability, body type, and many more. How can we learn to recognize our own blind spots that prevent us from fully seeing the people and the world around us? And how can we confront and overcome our fears of causing offense in our attempts to get inside someone whose life experience we don’t share? During the course, we’ll examine how categories of “Same” and “Other” can shift wildly not only from person to person, but within each person. We’ll also look at how the process of choosing or rejecting various identity labels intersects with issues of characterization. Finally, we'll consider the possible dangers of writing about the Other, such as distortion, erasure, or stereotype. Students will produce several short pieces of creative fiction and two complete short stories (10-15 pages each) to be workshopped and then revised, each focusing on capturing a character who does not share at least one identity marker with the author. For inspiration, we’ll also read examples of work by writers like Ha Jin, Manuel Munoz, Edwidge Danticat, Victor LaValle, Lorrie Moore, Jhumpa Lahiri, and Bernard Malamud.\n\n      less description for WRTNG-UG 1215 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1220",
            "course_name": "",
            "description": "WRTNG-UG 1220\n\n   Writing the LGBT Experience\n\nIt’s an exciting time in publishing, as LGBT authors and characters are no longer pushed toward the smallest houses—their books shelved in the darkest corners of the bookstore. Books like Alison Bechdel’s Fun Home are gaining mainstream appeal. But alongside this newfound recognition comes responsibility—to represent the community in particular ways, with particular agendas. And all of this is in the era, supposedly, of post-identity politics. So, while this is an exciting time, it’s also a confusing time to write LGBT characters, or to be an author of LGBT experience. For whom are we writing;...\n\n      more description for WRTNG-UG 1220 »\n\n      \n\n\n\nIt’s an exciting time in publishing, as LGBT authors and characters are no longer pushed toward the smallest houses—their books shelved in the darkest corners of the bookstore. Books like Alison Bechdel’s Fun Home are gaining mainstream appeal. But alongside this newfound recognition comes responsibility—to represent the community in particular ways, with particular agendas. And all of this is in the era, supposedly, of post-identity politics. So, while this is an exciting time, it’s also a confusing time to write LGBT characters, or to be an author of LGBT experience. For whom are we writing; how are we pigeonholed; what is silenced; and what is most true?  In this class, we will read a range of both contemporary and classic LGBT authors and stories (from James Baldwin and Audre Lorde to Thea Hillman and T Cooper), to ask these types of questions. We’ll read both fiction and nonfiction, to analyze the function of the queer main character, the “gay sidekick,” the (far fewer) transgender characters in confessional narratives and novels, and the ways authors implicitly define their audience, as they write from an insider perspective or explain “the other” to a mainstream culture. Because this is a hybrid seminar/writing class, we’ll also be looking to these authors for technique; we’ll study their voice, form, and style as a way to inform our own writing of the LGBT experience.  This course is open to both fiction and nonfiction writers, and to students of all gender identities and sexual orientations. There’s often tremendous pressure to “write what you know,” especially in this highly-politicized genre, but in this class, students will be encouraged to experiment imaginatively, developing characters or ideas outside their direct experience. Everyone will write one piece of literary criticism, and two pieces of either fiction or nonfiction to be workshopped in class.\n\n      less description for WRTNG-UG 1220 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1225",
            "course_name": "",
            "description": "WRTNG-UG 1225\n\n   Cultural Criticism & the Black Aesthetic\n\nCultural Criticism and the Black Aesthetic operates on the assumption that a piece of criticism is first and foremost an essay. Our reading and writing will focus on the strategies the writer employs to establish authority, construct an argument, find a balance between description and judgment, and entertain doubt as we explore the lineaments of cultural criticism. We will look at the ways in which the critic constructs a persona and establishes a bond with the reader, while employing the most effective prose style, as well as the formal and intellectual possibilities of criticism. Our central...\n\n      more description for WRTNG-UG 1225 »\n\n      \n\n\n\nCultural Criticism and the Black Aesthetic operates on the assumption that a piece of criticism is first and foremost an essay. Our reading and writing will focus on the strategies the writer employs to establish authority, construct an argument, find a balance between description and judgment, and entertain doubt as we explore the lineaments of cultural criticism. We will look at the ways in which the critic constructs a persona and establishes a bond with the reader, while employing the most effective prose style, as well as the formal and intellectual possibilities of criticism. Our central theme is the Black Aesthetic. What is it? How do we know it when we experience it? What is its relationship to racial identity and representations of race in America? How can we evaluate it in the realms of popular media and “high art,” including film, theater, music, dance, and literature? We will delve into black aesthetic values through the lens of the intersection of cultural critique and critique of culture with the objective of giving students the tools and context to produce a collection of effective criticism of the work of African American cultural producers. Readings may include works by Tricia Rose, DJ Spooky, Antonin Artaud, Edward Said, Henry Louis “Skip” Gates, Hazel Carby, Roland Barthes, Ralph Ellison, Margo Jefferson, Walter Benjamin, Theodor Adorno, Amiri Baraka, and Greg Tate.\n\n      less description for WRTNG-UG 1225 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1230",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17072",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 401",
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Agabian, Nancy"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1230\n\n   Writing Cross-Culturally\n\nIn this course, students will create writing that traverses identities, borders and cultures, as well as genres, as they explore and deepen their understanding of issues of form, craft and ethics. The class will read and discuss a variety of texts that center around various modes of culture crossing, such as travel, tourism, and study abroad; immigration, expatriation and repatriation; and historical clashes and conflicts. Through an ongoing examination of structural and craft issues in the exemplary texts, students will make creative decisions to help write three main assignments dealing with...\n\n      more description for WRTNG-UG 1230 »\n\n      \n\n\n\nIn this course, students will create writing that traverses identities, borders and cultures, as well as genres, as they explore and deepen their understanding of issues of form, craft and ethics. The class will read and discuss a variety of texts that center around various modes of culture crossing, such as travel, tourism, and study abroad; immigration, expatriation and repatriation; and historical clashes and conflicts. Through an ongoing examination of structural and craft issues in the exemplary texts, students will make creative decisions to help write three main assignments dealing with themes of Memory, Identity and Conflict. We'll use our discussions of Memory to help focus on expository and reflective rhetorical strategies, Identity as a way to experiment with point of view and character development, and Conflict as a method for exploring structure and dramatic tension. In order to write cross-culturally about personal experiences, students will be encouraged to create texts along the spectrum between creative nonfiction and autobigraphical fiction. Theoretical essays will help inform how we ethically position ourselves as writers observing cultures not (necessarily) our own in order to inform audiences and to challenge our own prejudices. Through it all, we'll consider how formal experiments across genres may help illuminate experiences and confront perceptions. Authors to be read include Gloria Anzaldua, Staceyann Chin, Edwidge Danticat, Junot Diaz, Randa Jarrar, V.S. Naipaul, Mary Louise Pratt, Salman Rushdie, Edward Said, Marjane Satrapi, Amy Tan, and Le Thi Diem Thuy.\n\n      less description for WRTNG-UG 1230 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1250",
            "course_name": "",
            "description": "WRTNG-UG 1250\n\n   Creating a Magazine: A Multimedia Approach\n\nThis pair of collaborative courses will enact Gallatin’s multidisciplinary, self-directed approach to learning, as students explore the potential of magazines as catalysts, cultural barometers, alternative communities, and forums for debate and new ideas. Through the discussion of critical texts about the history of publication, the analysis of various historical and contemporary magazines, and the development of new publications, students will learn to communicate ideas through design, editorial, and medium-specific approaches; analyze and question the features of the codex, the page, and the...\n\n      more description for WRTNG-UG 1250 »\n\n      \n\n\n\nThis pair of collaborative courses will enact Gallatin’s multidisciplinary, self-directed approach to learning, as students explore the potential of magazines as catalysts, cultural barometers, alternative communities, and forums for debate and new ideas. Through the discussion of critical texts about the history of publication, the analysis of various historical and contemporary magazines, and the development of new publications, students will learn to communicate ideas through design, editorial, and medium-specific approaches; analyze and question the features of the codex, the page, and the screen; and play with how these features affect how we read and perceive art. In the advanced writing course, students will concentrate on writing and editing for multiple platforms. In the arts workshop, students will focus on print media and design. In addition, students in both classes will have the opportunity to commission and edit both written text and art works from one another. Each class will meet two times a week: once with its designated professor, and once as a collaborative lab with both classes and both professors. The lab will be devoted to the conception, development, and production of publications that will each include a 32-page print prototype and new media elements. Lab days will also enable students to meet with guest speakers from the worlds of publishing and design; and go on field trips to the offices of contemporary experimental magazines and relevant institutions and archives.\n\n      less description for WRTNG-UG 1250 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1300",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12301",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 501",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "East, Elyssa"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1300\n\n   Creative Nonfiction\n\nThe best creative nonfiction borrows several elements other genres. From fiction, it utilizes strong character development, well crafted scenes, and a tangible narrative arc. From poetry, it borrows voice, nuance, image, and concision. From journalism, it employs thorough research, live reporting and a writer’s quizzical, intelligent stance. This class explores creative nonfiction’s unique synergy through reading and writing three of the genre’s signature forms: the memoir, the personal essay, and the literary profile. We will begin by reading masters and new voices working in these forms and ...\n\n      more description for WRTNG-UG 1300 »\n\n      \n\n\n\nThe best creative nonfiction borrows several elements other genres. From fiction, it utilizes strong character development, well crafted scenes, and a tangible narrative arc. From poetry, it borrows voice, nuance, image, and concision. From journalism, it employs thorough research, live reporting and a writer’s quizzical, intelligent stance. This class explores creative nonfiction’s unique synergy through reading and writing three of the genre’s signature forms: the memoir, the personal essay, and the literary profile. We will begin by reading masters and new voices working in these forms and will then try our hands at the craft. Along the way, we’ll study story form, structure, argument, and how to utilize research and reporting as a means of story-telling. Emphasis will be on reading, writing, and revision, as two out of three of student stories will require major rewriting. Students will also learn effective editing strategies by working closely with their peers and will come away from the course with a thorough introduction to the genre’s creative possibilities.\n\n      less description for WRTNG-UG 1300 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1301",
            "course_name": "",
            "description": "WRTNG-UG 1301\n\n   Advanced Creative Nonfiction\n\nThis is a course for students with some experience in reporting, researching and writing nonfiction, who want to experiment in literary, long-form journalism. Students will choose a small culture or community on which to focus throughout the semester. We’ll start by writing one profile of a member of this community, developing interviewing skills, and learning about voice and point of view. We’ll also write a reflective piece on interrogating the ways we explore this community without exploiting, exoticizing or oversimplifying our sources. Then students will move on to one major work of litera...\n\n      more description for WRTNG-UG 1301 »\n\n      \n\n\n\nThis is a course for students with some experience in reporting, researching and writing nonfiction, who want to experiment in literary, long-form journalism. Students will choose a small culture or community on which to focus throughout the semester. We’ll start by writing one profile of a member of this community, developing interviewing skills, and learning about voice and point of view. We’ll also write a reflective piece on interrogating the ways we explore this community without exploiting, exoticizing or oversimplifying our sources. Then students will move on to one major work of literary feature-writing—the bulk of the semester’s work—which will be written in sections and go through several revisions. Borrowing the best tools from fiction writing—like character development, a strong arc, and engaging scenes—these features will be rich in narra-tive and as complex as the communities they portray. Students will learn advanced re-porting techniques, story organization and editing skills, and debate the ethical issues inherent to truth-gathering. Readings will likely include Joseph Mitchell, Katherine Boo, Alex Kotlowitz, Leon Dash, Adrian Nicole LeBlanc and Peter Hessler.\n\n      less description for WRTNG-UG 1301 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1302",
            "course_name": "Form and Freedom in Narrative Nonfiction",
            "description": "WRTNG-UG 1302 Form and Freedom in Narrative Nonfiction",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1303",
            "course_name": "",
            "description": "WRTNG-UG 1303\n\n   Writing Nonfiction on Social Change\n\nIn this course, we’ll examine nonfiction from times of conflict and crisis to help us write essays and critiques in which we witness, report, advocate, question, and/or desire change in our own era. To provide inspiration, we’ll read essays on 9/11 and its aftermath, Occupy Wall Street,  the recent events in Ferguson MO, and other issues. We'll read authors such as Ta-Nahesi Coates, John D’Agata, Edwidge Danticat, Carolyn Forche, Roxane Gay, Ryszard Kapuscinski, Kiese Laymon, Arundhati Roy,  and Lawrence Weschler, to study their use of formal tools such as narration,  observation, analysis, re...\n\n      more description for WRTNG-UG 1303 »\n\n      \n\n\n\nIn this course, we’ll examine nonfiction from times of conflict and crisis to help us write essays and critiques in which we witness, report, advocate, question, and/or desire change in our own era. To provide inspiration, we’ll read essays on 9/11 and its aftermath, Occupy Wall Street,  the recent events in Ferguson MO, and other issues. We'll read authors such as Ta-Nahesi Coates, John D’Agata, Edwidge Danticat, Carolyn Forche, Roxane Gay, Ryszard Kapuscinski, Kiese Laymon, Arundhati Roy,  and Lawrence Weschler, to study their use of formal tools such as narration,  observation, analysis, reflection, and argument in exploring avenues of  change in the world around them. How do writers bring a personal voice to writing a political essay? And how do reporters balance opinion and research to show the need for change? These questions are considered as you write 1) an essay centered on an issue that you care about, and 2) a report that you write from observation about a social or political movement. Finally, writing an argument or advocacy piece on a public debate allows you to incorporate many of the lessons from the semester. Revision is part of our process, guided by peer reviews.\n\n      less description for WRTNG-UG 1303 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1304",
            "course_name": "",
            "description": "WRTNG-UG 1304\n\n   The Art of The Personal Essay\n\nThe personal essay is a flexible genre that often incorporates rumination, memoir, narrative, portrait, anecdote, diatribe, scholarship, fantasy and moral philosophy. The title of Montaigne?s Essais (?attempts\"), published in 1580, suggests the tentative and exploratory nature of this form as well as its freedom. The hallmark of the personal essay is its intimacy?the sharing of the writer?s observations and reflections with a reader, establishing a dialogue on subjects that range from the mundane to autobiographical and political meditations to reflections on abstract concepts and moral dilemm...\n\n      more description for WRTNG-UG 1304 »\n\n      \n\n\n\nThe personal essay is a flexible genre that often incorporates rumination, memoir, narrative, portrait, anecdote, diatribe, scholarship, fantasy and moral philosophy. The title of Montaigne?s Essais (?attempts\"), published in 1580, suggests the tentative and exploratory nature of this form as well as its freedom. The hallmark of the personal essay is its intimacy?the sharing of the writer?s observations and reflections with a reader, establishing a dialogue on subjects that range from the mundane to autobiographical and political meditations to reflections on abstract concepts and moral dilemmas. Style, shape, and intellectual depth lend the personal essay its drama, charm, and its ability to provoke thought. In this course, we will read and write personal essays that explore ?persona,? ?tone,? and ?voice? in dialogue with concepts such as ?the self,? ?personal identity,? and ?sincerity.? Readings may include essays by Seneca, Michel de Montaigne, Charles Lamb, George Orwell, Virginia Woolf, Wole Soyinka, Natalia Ginsburg, James The personal essay is a flexible genre that often incorporates rumination, memoir, narrative, portrait, anecdote, diatribe, scholarship, fantasy and moral philosophy. The title of Montaigne?s Essais (?attempts\"), published in 1580, suggests the tentative and exploratory nature of this form as well as its freedom. The hallmark of the personal essay is its intimacy?the sharing of the writer?s observations and reflections with a reader, establishing a dialogue on subjects that range from the mundane to autobiographical and political meditations to reflections on abstract concepts and moral dilemmas. Style, shape, and intellectual depth lend the personal essay its drama, charm, and its ability to provoke thought. In this course, we will read and write personal essays that explore ?persona,? ?tone,? and ?voice? in dialogue with concepts such as ?the self,? ?personal identity,? and ?sincerity.? Readings may include essays by Seneca, Michel de Montaigne, Charles Lamb, George Orwell, Virginia Woolf, Wole Soyinka, Natalia Ginsburg, James Baldwin, Joan Didion, Alice Walker, Maxine Hong Kingston, and Gloria Anzaldua.\n\n      less description for WRTNG-UG 1304 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1305",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12531",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL143",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Friedman, Sharon"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1305\n\n   The Art of The Personal Essay\n\nThe personal essay is a flexible genre that often incorporates rumination, memoir, narrative, portrait, anecdote, diatribe, scholarship, fantasy and moral philosophy. The title of Montaigne’s Essais (“attempts\"), published in 1580, suggests the tentative and exploratory nature of this form as well as its freedom. The hallmark of the personal essay is its intimacy—the sharing of the writer’s observations and reflections with a reader, establishing a dialogue on subjects that range from the mundane to autobiographical and political meditations to reflections on abstract concepts and moral dilemm...\n\n      more description for WRTNG-UG 1305 »\n\n      \n\n\n\nThe personal essay is a flexible genre that often incorporates rumination, memoir, narrative, portrait, anecdote, diatribe, scholarship, fantasy and moral philosophy. The title of Montaigne’s Essais (“attempts\"), published in 1580, suggests the tentative and exploratory nature of this form as well as its freedom. The hallmark of the personal essay is its intimacy—the sharing of the writer’s observations and reflections with a reader, establishing a dialogue on subjects that range from the mundane to autobiographical and political meditations to reflections on abstract concepts and moral dilemmas. Style, shape, and intellectual depth lend the personal essay its drama, charm, and its ability to provoke thought. In this course, we will read and write personal essays, and, in the process, explore how writers create “persona,” “tone,” and “voice.” We will also consider concepts such as “the self,” “personal identity,” and “sincerity.” Readings may include essays by Seneca, Michel de Montaigne, George Orwell, Virginia Woolf, Jorge Luis Borges, Natalia Ginsburg, James Baldwin, Joan Didion, Alice Walker, Maxine Hong Kingston, Adrienne Rich, and Hanif Kureishi.\n\n      less description for WRTNG-UG 1305 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1307",
            "course_name": "",
            "description": "WRTNG-UG 1307\n\n   Finding a Voice: The Personal Essay\n\nIn this course we will consider the personal essay as an art of narrative, a mode of storytelling that gives rise to questions about both the nature of writing and of factual reporting. How does narrative arise from observation and reportage? What sort of warrant as to strict truthfulness should the reader expect from the essayist? To what extent ought the writer?s viewpoint be grounded in the voice of personal reflection, the ?I,? and to what degree does even that commitment shade into fiction? Reading and writing essays on subjects that range from the mundane to the autobiographical to polit...\n\n      more description for WRTNG-UG 1307 »\n\n      \n\n\n\nIn this course we will consider the personal essay as an art of narrative, a mode of storytelling that gives rise to questions about both the nature of writing and of factual reporting. How does narrative arise from observation and reportage? What sort of warrant as to strict truthfulness should the reader expect from the essayist? To what extent ought the writer?s viewpoint be grounded in the voice of personal reflection, the ?I,? and to what degree does even that commitment shade into fiction? Reading and writing essays on subjects that range from the mundane to the autobiographical to political, literary critical, and philosophical meditations, we will consider how writers tell nonfictional stories about themselves and others by selecting certain events and images, how writers use their writing to come to self-awareness, and how writers may cover up or omit important facts in the construction of a literary persona. Readings may include selections from works by such authors as Samuel Johnson, Jean-Jacques Rousseau, Virginia Woolf, Junichiro Tanizaki, Walter Benjamin, C. G. Jung, Janet Malcolm, Jorge Luis Borges, Wole Soyinka, Mary McCarthy, James Baldwin, Joan Didion and Alice Walker.\n\n      less description for WRTNG-UG 1307 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1308",
            "course_name": "",
            "description": "WRTNG-UG 1308\n\n   Crafting Personal Essays and Fiction\n\nVoice, characterization, dialogue, pacing, point of view, imagery, structure?these elements of craft are indispensable to both the personal essayist and fiction writer.  We will learn how to use a writer?s tools to shape essays drawn from your life as well as short stories and novel chapters spun from your imagination.  We will use exercises to jumpstart your writing and revision to polish it. In this cross-genre course we will write, read and workshop personal essays and fiction. Texts may include essays by Joan Didion, Nora Ephron, Jonathan Lethem, Julio Cortazar, Ha Jin, Nathan Englander an...\n\n      more description for WRTNG-UG 1308 »\n\n      \n\n\n\nVoice, characterization, dialogue, pacing, point of view, imagery, structure?these elements of craft are indispensable to both the personal essayist and fiction writer.  We will learn how to use a writer?s tools to shape essays drawn from your life as well as short stories and novel chapters spun from your imagination.  We will use exercises to jumpstart your writing and revision to polish it. In this cross-genre course we will write, read and workshop personal essays and fiction. Texts may include essays by Joan Didion, Nora Ephron, Jonathan Lethem, Julio Cortazar, Ha Jin, Nathan Englander and Junot Diaz among others.\n\n      less description for WRTNG-UG 1308 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1309",
            "course_name": "The Writer in The City",
            "description": "WRTNG-UG 1309 The Writer in The City",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1310",
            "course_name": "Writing Your Life: The Memoir",
            "description": "WRTNG-UG 1310 Writing Your Life: The Memoir",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1311",
            "course_name": "",
            "description": "WRTNG-UG 1311\n\n   Taken from Life: Turning Memories Into Fiction\n\n?Write the stories that harass you,? the writer Grace Paley used to tell her students. Those stories are often the ones imprinted upon the writer?s memory. In this workshop we will focus upon the transformative processes writers engage in when they turn their life experiences into fiction, the shaping and selecting that are essential, the mysterious and crucial way voice evokes the character of the first-person narrator. Students will be assigned a series of brief memory exercises; they will choose the real-life material that feels most urgent to them as the basis for short stories or for the ...\n\n      more description for WRTNG-UG 1311 »\n\n      \n\n\n\n?Write the stories that harass you,? the writer Grace Paley used to tell her students. Those stories are often the ones imprinted upon the writer?s memory. In this workshop we will focus upon the transformative processes writers engage in when they turn their life experiences into fiction, the shaping and selecting that are essential, the mysterious and crucial way voice evokes the character of the first-person narrator. Students will be assigned a series of brief memory exercises; they will choose the real-life material that feels most urgent to them as the basis for short stories or for the opening pages of novels that will be shared with the class as they progress and are revised into final form. The class will also look at two writers with two different approaches to autobiographical fiction: They will read Virginia Woolf?s memoir essays in Moments of Being and her novel To the Lighthouse, and Jack Kerouac?s Visions of Gerard and On the Road, as well as selections from his journals and letters.\n\n      less description for WRTNG-UG 1311 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1315",
            "course_name": "",
            "description": "WRTNG-UG 1315\n\n   Exploring the Possibilities of Travel Writing\n\nIn this creative writing workshop, we unearth the wide range of creative possibilities available to practitioners of the much-misunderstood genre of travel literature.  In addition to developing practical skills of research and crafting sentences, we consider how the struggle to capture settings with words reveals larger truths about not only the places we visit, but also the people who inhabit them (including ourselves).   Other issues we examine include the ethical dilemmas of travel writing, the relationship of place of origin to destination, and the thorny question of the “authentic” trave...\n\n      more description for WRTNG-UG 1315 »\n\n      \n\n\n\nIn this creative writing workshop, we unearth the wide range of creative possibilities available to practitioners of the much-misunderstood genre of travel literature.  In addition to developing practical skills of research and crafting sentences, we consider how the struggle to capture settings with words reveals larger truths about not only the places we visit, but also the people who inhabit them (including ourselves).   Other issues we examine include the ethical dilemmas of travel writing, the relationship of place of origin to destination, and the thorny question of the “authentic” travel experience.  Students craft four original pieces during the term that represent four different genres of travel literature.  We begin with two shorter pieces and then work toward creating a longer research-based non-fiction feature. Finally, we conclude with a work of short fiction.  For inspiration, we do short exercises and analyze work by writers like D. H. Lawrence, Ernest Hemingway, Patricia Highsmith, Bruce Chatwin, W. G. Sebald, Mary Gordon, Jhumpa Lahiri, Barack Obama, as well as contemporary working travel writers.\n\n      less description for WRTNG-UG 1315 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1316",
            "course_name": "",
            "description": "WRTNG-UG 1316\n\n   Telling Truths:The Skill of Autobiography\n\nHow can one tell the \"truth\" about one's life in narrative form? In this course we will explore the pleasures and dangers of telling stories about our lives through writing autobiographical essays, as well as through reading the autobiographies of selected others. Readings may include texts by Janet Frame, Nancy Mairs, Mary Karr, and David Sedaris. We will analyze the way in which self-narrative is constructed from the tangled materials of real life, how we read and understand the life writing of others, and how the stories of others can influence our own. Topics include authenticity, memory, ...\n\n      more description for WRTNG-UG 1316 »\n\n      \n\n\n\nHow can one tell the \"truth\" about one's life in narrative form? In this course we will explore the pleasures and dangers of telling stories about our lives through writing autobiographical essays, as well as through reading the autobiographies of selected others. Readings may include texts by Janet Frame, Nancy Mairs, Mary Karr, and David Sedaris. We will analyze the way in which self-narrative is constructed from the tangled materials of real life, how we read and understand the life writing of others, and how the stories of others can influence our own. Topics include authenticity, memory, identity, voice, point of view, and relationships.\n\n      less description for WRTNG-UG 1316 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1317",
            "course_name": "",
            "description": "WRTNG-UG 1317\n\n   Only Connect: Strategies for Writing\n\nThe late W.G. Sebald perfected a sublime art of connection-teasing out associations between ancient snapshots, newspaper clippings, and the words of others. His elegantly haunting books (which blurred novel, history, and memoir) couldn't be more different from the typical posts that proliferate in the so-called blogosphere. Yet Internet writing, with its hyperlinks and screen-grabs, calls upon a magpie instinct that Sebald and other illustrious writers would instantly recognize. This course takes students on a tour of writing methods old and new, imparting a ravenous approach to composition us...\n\n      more description for WRTNG-UG 1317 »\n\n      \n\n\n\nThe late W.G. Sebald perfected a sublime art of connection-teasing out associations between ancient snapshots, newspaper clippings, and the words of others. His elegantly haunting books (which blurred novel, history, and memoir) couldn't be more different from the typical posts that proliferate in the so-called blogosphere. Yet Internet writing, with its hyperlinks and screen-grabs, calls upon a magpie instinct that Sebald and other illustrious writers would instantly recognize. This course takes students on a tour of writing methods old and new, imparting a ravenous approach to composition useful for work in any genre: fiction, nonfiction, poetry, and the borderlands of our virtual reality. Classes will focus on the use of images in text, the cento, the footnote, the double-jointed review, and more. Writing will include frequent in-class experiments and several longer assignments. Students will read works by Nicholson Baker, Alison Bechdel, Harry Stephen Keeler, Raymond Queneau, and others.\n\n      less description for WRTNG-UG 1317 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1318",
            "course_name": "Writing Biography",
            "description": "WRTNG-UG 1318 Writing Biography",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1319",
            "course_name": "Lives of New York",
            "description": "WRTNG-UG 1319 Lives of New York",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1320",
            "course_name": "True Stories",
            "description": "WRTNG-UG 1320 True Stories",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1321",
            "course_name": "",
            "description": "WRTNG-UG 1321\n\n   Travel Writing\n\nA sense of place, dialogue and dialect, the creation of a narrative through a sequence of anecdotes: these are some of the particular demands in travel writing. Students will be required to take a few short trips in the New York area in order to experience an ethnic neighborhood or a cultural milieu that is not familiar to them. When writing their pieces they will practice the literary skills that convey adventure and sensory impressions while incorporating a fair amount of factual information and historical background. They will look for the unique, revealing detail, and learn to exploit the ...\n\n      more description for WRTNG-UG 1321 »\n\n      \n\n\n\nA sense of place, dialogue and dialect, the creation of a narrative through a sequence of anecdotes: these are some of the particular demands in travel writing. Students will be required to take a few short trips in the New York area in order to experience an ethnic neighborhood or a cultural milieu that is not familiar to them. When writing their pieces they will practice the literary skills that convey adventure and sensory impressions while incorporating a fair amount of factual information and historical background. They will look for the unique, revealing detail, and learn to exploit the value of the unexpected encounter. They will discover that there are many ways to write about a journey, and many different reasons to read a travel story. Writings of professionals we study in this class include excerpts from Paul Theroux, The Great Railway Bazaar; Alexandra Fuller, Don?t Let?s Go to the Dogs Tonight; Dervla Murphy, Full Tilt; Rory Stewart, The Places in Between; and some magazine pieces.\n\n      less description for WRTNG-UG 1321 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1322",
            "course_name": "New York Stories",
            "description": "WRTNG-UG 1322 New York Stories",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1323",
            "course_name": "Journeys Past and Present",
            "description": "WRTNG-UG 1323 Journeys Past and Present",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1324",
            "course_name": "",
            "description": "WRTNG-UG 1324\n\n   The Journal in The City\n\nLiterary journalists have long been inspired by the urban muse.  Paris, London, Berlin, Prague and New York have nurtured such noted journalists as Rilke, Woolf, Kafka, Walter Benjamin and Allen Ginsberg.  As we look into the journals of these intriguing writers we will immerse ourselves in the New York City milieu, asking what is the impact of the city on the text, as well as examining the effect of the city on our own journals. As writers, how do we interact with the city?  Whom do we become in our journals in the city?  We will keep and develop literary journals for the duration of the cour...\n\n      more description for WRTNG-UG 1324 »\n\n      \n\n\n\nLiterary journalists have long been inspired by the urban muse.  Paris, London, Berlin, Prague and New York have nurtured such noted journalists as Rilke, Woolf, Kafka, Walter Benjamin and Allen Ginsberg.  As we look into the journals of these intriguing writers we will immerse ourselves in the New York City milieu, asking what is the impact of the city on the text, as well as examining the effect of the city on our own journals. As writers, how do we interact with the city?  Whom do we become in our journals in the city?  We will keep and develop literary journals for the duration of the course: our “New York City Journals.”\n\n      less description for WRTNG-UG 1324 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1325",
            "course_name": "The Journal as Genre",
            "description": "WRTNG-UG 1325 The Journal as Genre",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1326",
            "course_name": "",
            "description": "WRTNG-UG 1326\n\n   The Letter as Literature\n\nThe letter as a genre of literature is situated in a middle space between private and public discourse. This writing seminar will inhabit the “space of the letter” to experiment with the letter-format as a unique modality of self-inscription. We will examine the “space of the letter” as an especially productive location for writing, and the literary letter as a vehicle with the potential to transport our writing from personal communication to literary work. We will theorize the letter by reading other people’s mail, such as Sylvia Plath’s “Letters Home,” Kafka’s “Letter to My Father,” and Rilk...\n\n      more description for WRTNG-UG 1326 »\n\n      \n\n\n\nThe letter as a genre of literature is situated in a middle space between private and public discourse. This writing seminar will inhabit the “space of the letter” to experiment with the letter-format as a unique modality of self-inscription. We will examine the “space of the letter” as an especially productive location for writing, and the literary letter as a vehicle with the potential to transport our writing from personal communication to literary work. We will theorize the letter by reading other people’s mail, such as Sylvia Plath’s “Letters Home,” Kafka’s “Letter to My Father,” and Rilke’s “Letters on Cezanne,” letters written as literary works, and letters never intended to be read. We will investigate the rhetoric, psychology and economy of the letter, a trajectory that will take us through the dead letter office (Derrida’s “Post Card”) and into the realm of blackmail (Poe’s “Purloined Letter”). As a community of writers we will “send and receive” letters in various literary formats, and take our place on the cutting edge with the electronic letter as it shifts the paradigm of this familiar, but strange, literary genre.\n\n      less description for WRTNG-UG 1326 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1327",
            "course_name": "New York City Stories",
            "description": "WRTNG-UG 1327 New York City Stories",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1328",
            "course_name": "",
            "description": "WRTNG-UG 1328\n\n   Writing The Double\n\nMaurice Blanchot observed, ?When I am alone, someone is there.? In this writing course, we will get acquainted with the \"someone\" who haunts (and sometimes sabotages) the scene of writing, the ?Writing-I? who always participates in our ?solo act? of writing. Writing from the place of the double, in subjective genres (the memoir, the letter, the confessional poem, the interior monologue), we will experience and analyze the writer's ?double bind.? We will also observe the ?split-subject? in some well-known ?double-writers? such as Rilke (Malte: Journal of My Other Self), Borges (Borges & I), Kaf...\n\n      more description for WRTNG-UG 1328 »\n\n      \n\n\n\nMaurice Blanchot observed, ?When I am alone, someone is there.? In this writing course, we will get acquainted with the \"someone\" who haunts (and sometimes sabotages) the scene of writing, the ?Writing-I? who always participates in our ?solo act? of writing. Writing from the place of the double, in subjective genres (the memoir, the letter, the confessional poem, the interior monologue), we will experience and analyze the writer's ?double bind.? We will also observe the ?split-subject? in some well-known ?double-writers? such as Rilke (Malte: Journal of My Other Self), Borges (Borges & I), Kafka (The Metamorphosis), Conrad (The Secret Sharer), and Wilde (The Picture of Dorian Gray). In a workshop format, students will work with a ?double,? writing and discussing a number of ?doppelgnger? pieces, and will have the opportunity to develop a substantial work of fictional duplicity over the course of the semester. As our guides to the topography of the double, we will consult theorists such as Blanchot himself, Kristeva (the split subject), Freud (the Narcissus complex), Lacan (the mirror stage) and Jung (the Shadow), and we will not avoid Dr.  Jekyll and Mr. Hyde.\n\n      less description for WRTNG-UG 1328 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1329",
            "course_name": "",
            "description": "WRTNG-UG 1329\n\n   Writing The Fragment\n\nThis writing seminar will explore the fragment as a literary genre and as a modality for literary production. Our engagement with the fragment will focus on interruption as a force for generating writing, a dynamic that leaves in its wake literary debris to be collected and recouped. Revisiting our own literary scenes of destruction we will develop a writing technique based on bricolage. Using the writing workshop as a literary archeological dig we will learn to recognize our usable fragments, to reconfigure and recontextualize them into revitalized works. (Students will bring fragments from t...\n\n      more description for WRTNG-UG 1329 »\n\n      \n\n\n\nThis writing seminar will explore the fragment as a literary genre and as a modality for literary production. Our engagement with the fragment will focus on interruption as a force for generating writing, a dynamic that leaves in its wake literary debris to be collected and recouped. Revisiting our own literary scenes of destruction we will develop a writing technique based on bricolage. Using the writing workshop as a literary archeological dig we will learn to recognize our usable fragments, to reconfigure and recontextualize them into revitalized works. (Students will bring fragments from their own work to the project.) We will look at some famous literary fragments such as the classic “Anaximander Fragment” and the remains of Sappho’s odes on love. Shelley’s “Ozymandias,” Eliot’s “Wasteland,” Rilke’s “Archaic Torso of Apollo,” and selections from Benjamin’s monumental bricolage-work will figure in our itinerary among the ruins. Theoretical writings may include Said's “Beginnings” and Blanchot's “Writing the Disaster.” Students will revisit and redeploy their own literary fragments and will also work within the genre of the “intentional fragment.”\n\n      less description for WRTNG-UG 1329 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1330",
            "course_name": "",
            "description": "WRTNG-UG 1330\n\n   Writing On Borderlines\n\nThis course will examine \"borderline cases,\" those types of writing that balance precariously between one genre and another, for example, between fiction and non-fiction.  We will look into such literary hybrids as the prose poem (Baudelaire et al.); journalistic-fiction (J. Barnes, Didion, D.F. Wallace); fictional journals (Rilke, Nin); such literary imposters as the faux-autobiography (Stein/Toklas), the discovered manuscript (Borges) and the imaginary portrait (Pater).  We will attempt to distinguish and work with what Virginia Woolf calls (in her essay on biography) the truth of fact and t...\n\n      more description for WRTNG-UG 1330 »\n\n      \n\n\n\nThis course will examine \"borderline cases,\" those types of writing that balance precariously between one genre and another, for example, between fiction and non-fiction.  We will look into such literary hybrids as the prose poem (Baudelaire et al.); journalistic-fiction (J. Barnes, Didion, D.F. Wallace); fictional journals (Rilke, Nin); such literary imposters as the faux-autobiography (Stein/Toklas), the discovered manuscript (Borges) and the imaginary portrait (Pater).  We will attempt to distinguish and work with what Virginia Woolf calls (in her essay on biography) the truth of fact and the truth of fiction.  Students will have the opportunity to engage in various borderline writing exercises and to bring one original borderline case to conclusion by the end of the course.\n\n      less description for WRTNG-UG 1330 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1331",
            "course_name": "",
            "description": "WRTNG-UG 1331\n\n   The Voyage: Writing About Travel\n\nBeginning with readings of contemporary travel writers, we will move backwards in history to explore the theme of the voyage in literature, and at the same time write about our own journeys past and present.  This course will explore travel accounts, novels, poems, stories, and plays by authors from Latin America, Europe, Asia, and North America.  We will ask how modern works permit us to reinterpret acknowledged classics, and better understand the encounter between self and other.  Our discussions of the rhythms of departure, progression, arrival, and return in texts from different times and ...\n\n      more description for WRTNG-UG 1331 »\n\n      \n\n\n\nBeginning with readings of contemporary travel writers, we will move backwards in history to explore the theme of the voyage in literature, and at the same time write about our own journeys past and present.  This course will explore travel accounts, novels, poems, stories, and plays by authors from Latin America, Europe, Asia, and North America.  We will ask how modern works permit us to reinterpret acknowledged classics, and better understand the encounter between self and other.  Our discussions of the rhythms of departure, progression, arrival, and return in texts from different times and cultures will form the basis of our writing about the voyage.  Readings may include works by Peter Matthiesen, Toni Morrison, Pablo Neruda, Basho, Shakespeare, and Homer, as well as brief selections by Pico Iyer, Elizabeth Bishop, Jorge Luis Borges, Edith Wharton, Arthur Rimbaud, and Friedrich Hlderlin.  Students may write in various genres, both critical and creative.\n\n      less description for WRTNG-UG 1331 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1332",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "16961",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 601",
                    "time": "Mon,Wed 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "Blythe, Victoria"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1332\n\n   Writing The Strange\n\nIn this advanced writing class students will approach writing from off-center, by taking an oblique perspective. We will examine the attempts of such writers as Pound, Stein , Mallarme, Duras, Ponge and Robbes-Grillet to achieve originality by “making it new”, by “making it strange”, by defamiliarizing their subject matter. Our writing projects will be situated at the intersection of the absurd and the surreal, and may incorporate techniques of other media such as the cubist/surrealist painters, the French graffiti artists, bricolage and the found-object. We will risk nausea with Sartre and ve...\n\n      more description for WRTNG-UG 1332 »\n\n      \n\n\n\nIn this advanced writing class students will approach writing from off-center, by taking an oblique perspective. We will examine the attempts of such writers as Pound, Stein , Mallarme, Duras, Ponge and Robbes-Grillet to achieve originality by “making it new”, by “making it strange”, by defamiliarizing their subject matter. Our writing projects will be situated at the intersection of the absurd and the surreal, and may incorporate techniques of other media such as the cubist/surrealist painters, the French graffiti artists, bricolage and the found-object. We will risk nausea with Sartre and vertigo with the Vorticists. Students will apply their exercises in the strange to “estranging” a work-in-progress as the culmination of the course. Theorists may include Deleuze, Guattari, Derrida and Baudrillard.\n\n      less description for WRTNG-UG 1332 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1333",
            "course_name": "",
            "description": "WRTNG-UG 1333\n\n   Writing The Family\n\nMany of us want to write memoirs, but families—good or bad—are loaded territory. How do we navigate wisely? In this class we’ll look at writers who have done it, such as James Baldwin, Annie Dillard, Vivian Gornick, Richard Rodriguez, and Sister Souljah,  to trace their fault lines and unearth their strategies for remaining faithful to their readers while truthful to their lived experience. We’ll look at issues of voice and point of view, and how to gain enough emotional distance from characters to make them both believable and three-dimensional. We’ll write and workshop several family scenes,...\n\n      more description for WRTNG-UG 1333 »\n\n      \n\n\n\nMany of us want to write memoirs, but families—good or bad—are loaded territory. How do we navigate wisely? In this class we’ll look at writers who have done it, such as James Baldwin, Annie Dillard, Vivian Gornick, Richard Rodriguez, and Sister Souljah,  to trace their fault lines and unearth their strategies for remaining faithful to their readers while truthful to their lived experience. We’ll look at issues of voice and point of view, and how to gain enough emotional distance from characters to make them both believable and three-dimensional. We’ll write and workshop several family scenes, building them into a few full-length stories or, if the student wishes, chapters for a larger work.  Readings may include Modern American Memoirs, edited by Annie Dillard and Cort Conley; Heaven’s Coast, Mark Doty; Name All the Animals, Alison Smith; The Women, Hilton Als; and An American Childhood, Annie Dillard.\n\n      less description for WRTNG-UG 1333 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1334",
            "course_name": "",
            "description": "WRTNG-UG 1334\n\n   The Writer's Discourse\n\n“What must the writer remember?” Maurice Blanchot asks. “Himself when he is not writing.” In this class, we will discover the infinite conversation that writers often have with themselves and their own writing. As we write our own texts, we will engage with theorists/writers and discover how they have interrogated themselves and their works. The modality of our project will be writerly self-reflection: discoursing with ourselves while writing, reading ourselves in our own texts, and engaging with a work-in-progress by means of a conversation with it. Readings may include works by Barthes, Blan...\n\n      more description for WRTNG-UG 1334 »\n\n      \n\n\n\n“What must the writer remember?” Maurice Blanchot asks. “Himself when he is not writing.” In this class, we will discover the infinite conversation that writers often have with themselves and their own writing. As we write our own texts, we will engage with theorists/writers and discover how they have interrogated themselves and their works. The modality of our project will be writerly self-reflection: discoursing with ourselves while writing, reading ourselves in our own texts, and engaging with a work-in-progress by means of a conversation with it. Readings may include works by Barthes, Blanchot, Derrida, Heidegger, and Deleuze and Guattari.\n\n      less description for WRTNG-UG 1334 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1335",
            "course_name": "Writing Family History",
            "description": "WRTNG-UG 1335 Writing Family History",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1336",
            "course_name": "",
            "description": "WRTNG-UG 1336\n\n   Writing Your Ancestry\n\nThis workshop will give students the opportunity to practice elements of creative nonfiction through a multi-faceted approach to writing on ancestry and cultural heritage. The main goal will be a written exploration of the self to consider wider issues of history, community, identity, place, and family. The major assignments will be structured around various tasks: a personal essay will help to define themes and set scenes in the present; memoir writing will involve mining your memories of family to identify possible leads into the past; a reported piece will entail interviews of family member...\n\n      more description for WRTNG-UG 1336 »\n\n      \n\n\n\nThis workshop will give students the opportunity to practice elements of creative nonfiction through a multi-faceted approach to writing on ancestry and cultural heritage. The main goal will be a written exploration of the self to consider wider issues of history, community, identity, place, and family. The major assignments will be structured around various tasks: a personal essay will help to define themes and set scenes in the present; memoir writing will involve mining your memories of family to identify possible leads into the past; a reported piece will entail interviews of family members, historical research, and/or a visit to an ancestral site. These essays will be developed gradually with the help of shorter at-home assignments and in-class exercises on style, structure, and strategy. Revision will be built into the process, and we will read each other's work and give supportive feedback throughout the semester. Likely authors to be read and discussed for inspiration will include Ian Frazier, Honor Moore, Lawrence Weschler, Sarah Vowell, Bliss Broyard, Brenda Lin, Tara Bray Smith, and D.J. Waldie.\n\n      less description for WRTNG-UG 1336 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1338",
            "course_name": "Writing Women'S Lives",
            "description": "WRTNG-UG 1338 Writing Women'S Lives",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1339",
            "course_name": "",
            "description": "WRTNG-UG 1339\n\n   Ripped from the Headlines: Current Events in Fiction\n\nIn 1961 Philip Roth wrote: \"the American writer…has his hands full in trying to understand, and then describe, and then make credible much of the American reality.\" Is he right? Can a literary imagination encompass its social and political moment? Does it thereby lose its hold on universal truths? Or is there a perspective on and insight into current events only fiction can offer? We'll consider these and other questions through readings of novels and short stories that depict their contemporary political and cultural events. We'll pay particular attention to the ways these writers borrow, sub...\n\n      more description for WRTNG-UG 1339 »\n\n      \n\n\n\nIn 1961 Philip Roth wrote: \"the American writer…has his hands full in trying to understand, and then describe, and then make credible much of the American reality.\" Is he right? Can a literary imagination encompass its social and political moment? Does it thereby lose its hold on universal truths? Or is there a perspective on and insight into current events only fiction can offer? We'll consider these and other questions through readings of novels and short stories that depict their contemporary political and cultural events. We'll pay particular attention to the ways these writers borrow, subvert, or reinvent journalistic (or \"new\" journalistic) techniques. Students will be expected to produce several written exercises, as well as two longer fictional pieces (short stories or novel chapters) that take current events as a starting point for narrative. These will be discussed through in-class workshops. Readings may include John Updike's Rabbit Redux, Joan Didion's Democracy, Don Delillo's Mao II, and Brett Easton Ellis's Less Than Zero, as well as short stories by Grace Paley, Alicia Erian and Martin Amis.\n\n      less description for WRTNG-UG 1339 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1340",
            "course_name": "Writing New York City",
            "description": "WRTNG-UG 1340 Writing New York City",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1341",
            "course_name": "",
            "description": "WRTNG-UG 1341\n\n   Oral Narratives\nOral Narratives\n\nIn this workshop, we’ll explore how oral tradition – through performance, interviewing, and oral history – can inform the craft of written stories.  From ancient epic poetry to the authors of This American Life, students will consider how storytelling has given way to printed narrative, and vice versa, as they first develop their own autobiographical monologues and then write the narratives of others.  Through the reading of monologues, interviews, and oral histories in various formats (poetry, performance text, literary journalism, memoir, archive, theatre, video and film), students will cons...\n\n      more description for WRTNG-UG 1341 »\n\n      \n\n\n\nIn this workshop, we’ll explore how oral tradition – through performance, interviewing, and oral history – can inform the craft of written stories.  From ancient epic poetry to the authors of This American Life, students will consider how storytelling has given way to printed narrative, and vice versa, as they first develop their own autobiographical monologues and then write the narratives of others.  Through the reading of monologues, interviews, and oral histories in various formats (poetry, performance text, literary journalism, memoir, archive, theatre, video and film), students will consider the motives for placing spoken or spontaneous language down on the page to read as a permanent text.  Journalistic interviews with a family or community member will inform an assignment to write a profile, as students determine how to best represent their own voice alongside the speech of their subject. We'll also use oral history methodology to collect the accounts of a group of people, examining conflicts and discrepancies among individual stories as an opportunity to explore form. Students will then use transcriptions of their interviews to inform a historical piece in a genre (or mixed genre) of their choice: poetry, nonfiction, or performance text.  Authors to be read include Anna Deavere Smith, Studs Terkel, Spalding Gray, Sherman Alexie and Ntozake Shange. We'll also visit an oral history archive as well as mine the crafted \"archives\" of Def Poetry Jam, the Moth live storytelling series, and Meem (a Beirut-based queer women's group) for inspiration.\n\n      less description for WRTNG-UG 1341 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1342",
            "course_name": "Writing Urban",
            "description": "WRTNG-UG 1342 Writing Urban",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1345",
            "course_name": "Writing for Children",
            "description": "WRTNG-UG 1345 Writing for Children",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1350",
            "course_name": "",
            "description": "WRTNG-UG 1350\n\n   Writing for Young Readers\n\nThis course guides students in writing fiction for readers age ten through adolescence. While writing, workshopping, and revising, students consider both theoretical and practical issues of writing for young people. We explore the history of children?s literature and examine the academic journal Children?s Literature, the newsletter of the Society of Children?s Book Writers and Illustrators, the American Library Association?s Newbery Awards and various bestseller lists. Each student presents an analysis of a favorite book. Texts we read and analyze as models will likely include such ?contempor...\n\n      more description for WRTNG-UG 1350 »\n\n      \n\n\n\nThis course guides students in writing fiction for readers age ten through adolescence. While writing, workshopping, and revising, students consider both theoretical and practical issues of writing for young people. We explore the history of children?s literature and examine the academic journal Children?s Literature, the newsletter of the Society of Children?s Book Writers and Illustrators, the American Library Association?s Newbery Awards and various bestseller lists. Each student presents an analysis of a favorite book. Texts we read and analyze as models will likely include such ?contemporary classics? for younger readers as Lois Lowry?s Anastasia Krupnik, Karen Cushman?s The Midwife?s Apprentice, Walter Dean Myers?s Monster, and Francesa Lia Block?s Weetzie Bat; and recent works that are both popular and critically  acclaimed, such as Mark Haddon?s The Curious Incident of the Dog in the Nighttime, Sherman Alexie?s The Absolutely True Diary of a Part-Time Indian, and E. Lockhart?s The Disreputable History of Frankie Landau-Banks. We may attend a reading by a writer or editor of fiction for young readers; a writer and/or a publishing professional will be our guest speaker.\n\n      less description for WRTNG-UG 1350 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1360",
            "course_name": "",
            "description": "WRTNG-UG 1360\n\n   The Path of the Storyteller: Writing Children's Fiction\n\nFrom Charlotte’s Web to the Harry Potter series, the enduring works of children’s fiction epitomize the twin virtues that all classic novels share: a great story, beautifully told. Through reading and discussion of assigned texts, and in-class workshopping of the students’ own novels in progress, this class offers writers of fiction for the middle-grade reader (ages 8 through early adolescence) a solid foundation in the principles of storytelling and the tools of the writer’s craft. Through writing exercises and close reading of assigned books, we’ll examine character development, point of vie...\n\n      more description for WRTNG-UG 1360 »\n\n      \n\n\n\nFrom Charlotte’s Web to the Harry Potter series, the enduring works of children’s fiction epitomize the twin virtues that all classic novels share: a great story, beautifully told. Through reading and discussion of assigned texts, and in-class workshopping of the students’ own novels in progress, this class offers writers of fiction for the middle-grade reader (ages 8 through early adolescence) a solid foundation in the principles of storytelling and the tools of the writer’s craft. Through writing exercises and close reading of assigned books, we’ll examine character development, point of view, and other elements of fiction. We’ll improve the quality of our prose by learning to recognize common errors and revise our drafts into polished, finished works. Assigned readings are drawn from the best of children’s literature and trace the development of the form, from early 20th century classics (Tolkien’s The Hobbit) to later novels by E. B. White, Madeleine L’Engle, and others. We’ll end by looking at work by contemporary writers such as Neil Gaiman, Louis Sachar and Thanha Lai.\n\n      less description for WRTNG-UG 1360 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1365",
            "course_name": "Science Fiction and Social Analysis",
            "description": "WRTNG-UG 1365 Science Fiction and Social Analysis",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1370",
            "course_name": "",
            "description": "WRTNG-UG 1370\n\n   Writing About Love\n\nRather than focus on one genre in their reading and writing, student writing in this course will be inspired by a theme: the nature and meanings of romantic love as both private feeling and social ideology. Love has assumed an enormously important place in Western culture in the last two centuries, shaping expectations of what the good life should be, as well as evoking anxiety about how to achieve the fulfillment of that dream. Students may try varied forms of writing about romance in our modern world, including writing about their own emotions and experiences, literary analysis, cultural obs...\n\n      more description for WRTNG-UG 1370 »\n\n      \n\n\n\nRather than focus on one genre in their reading and writing, student writing in this course will be inspired by a theme: the nature and meanings of romantic love as both private feeling and social ideology. Love has assumed an enormously important place in Western culture in the last two centuries, shaping expectations of what the good life should be, as well as evoking anxiety about how to achieve the fulfillment of that dream. Students may try varied forms of writing about romance in our modern world, including writing about their own emotions and experiences, literary analysis, cultural observation, and opinion. Accordingly, our texts will likewise be diverse, and may include memoir, letters and diaries; philosophy; pop culture; sociological studies of gender and romance; and cultural theory about dating. You will have a great deal of choice as to the type of writing you would like to do, but out of five pieces, at least one non-fiction essay and one creative piece will be required. Classes will be devoted to responding to the texts to inspire ideas for writing, intensive workshopping of drafts in student groups, and personal conferences with the instructor.\n\n      less description for WRTNG-UG 1370 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1405",
            "course_name": "TBA",
            "description": "WRTNG-UG 1405 TBA",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1425",
            "course_name": "",
            "description": "WRTNG-UG 1425\n\n   Translation Practicum\n\nThis introductory practicum will involve a weekly submission: a piece selected in an original global language and a draft of that same piece brought into English. Fluency is not required, but student should have working knowledge of a language other than This introductory practicum will involve a weekly submission: a piece selected in an original global language and a draft of that same piece brought into English. Fluency is not required, but student should have working knowledge of a language other than English. Some genres explored may include recipes, directions, obituaries, short prose pie...\n\n      more description for WRTNG-UG 1425 »\n\n      \n\n\n\nThis introductory practicum will involve a weekly submission: a piece selected in an original global language and a draft of that same piece brought into English. Fluency is not required, but student should have working knowledge of a language other than This introductory practicum will involve a weekly submission: a piece selected in an original global language and a draft of that same piece brought into English. Fluency is not required, but student should have working knowledge of a language other than English. Some genres explored may include recipes, directions, obituaries, short prose pieces, and poems.  What are the challenges and limits of translation? What may be gained? What may be lost?  Students writing samples will be submitted, read, and discussed weekly. Handouts of  samples will feature a piece in its original language and then versions of it in translation.\n\n      less description for WRTNG-UG 1425 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1430",
            "course_name": "",
            "description": "WRTNG-UG 1430\n\n   Literary Translation\n\nThis course will introduce students to the craft of literary translation and the many ways it can help them become more innovative writers. Students will work individually and together to choose authors not yet known in English whose work strikes the students as distinctive and exciting. We will discuss how the process of choosing a writer they admire and bringing that author’s work into English is a way to explore what makes a piece of writing stand out from other works of the same period. We will talk about translating tone, humor, voice and innuendo and explore how students might experiment...\n\n      more description for WRTNG-UG 1430 »\n\n      \n\n\n\nThis course will introduce students to the craft of literary translation and the many ways it can help them become more innovative writers. Students will work individually and together to choose authors not yet known in English whose work strikes the students as distinctive and exciting. We will discuss how the process of choosing a writer they admire and bringing that author’s work into English is a way to explore what makes a piece of writing stand out from other works of the same period. We will talk about translating tone, humor, voice and innuendo and explore how students might experiment with these aspects in their own work. Over the course of the semester, we’ll workshop translations together with original writing the students generated while working on their translations. We'll also look at the work of leading writer-translators like Christian Hawkey, Sawako Nakayasu, Lydia Davis, and Charles Simic and discuss the aesthetic connections between the authors they've translated and their own prose and poetry.\n\n      less description for WRTNG-UG 1430 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1460",
            "course_name": "Literacy",
            "description": "WRTNG-UG 1460 Literacy",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1490",
            "course_name": "Writing/Research Seminar",
            "description": "WRTNG-UG 1490 Writing/Research Seminar",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1495",
            "course_name": "Writing The Documentary Film",
            "description": "WRTNG-UG 1495 Writing The Documentary Film",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1496",
            "course_name": "Writing With Integrity",
            "description": "WRTNG-UG 1496 Writing With Integrity",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1505",
            "course_name": "",
            "description": "WRTNG-UG 1505\n\n   Writing Short Comedy\n\nThis course introduces students to writing short humor, including political satire (The Daily Show, Last Week Tonight With John Oliver, Real Time With Bill Maher), sketch humor (Saturday Night Live and in the tradition of Kids In The Hall, Mad TV, Upright Citizens Brigade), monologues (Jimmy Fallon, Conan O’Brien, Jimmy Kimmel), observational humor (stand-up comedy), parody (essays, think pieces, video, YouTube). Students learn the difference between a sketch and a bit, how to create memorable original characters, where to find humor. Students experiment with writing a different specific piece...\n\n      more description for WRTNG-UG 1505 »\n\n      \n\n\n\nThis course introduces students to writing short humor, including political satire (The Daily Show, Last Week Tonight With John Oliver, Real Time With Bill Maher), sketch humor (Saturday Night Live and in the tradition of Kids In The Hall, Mad TV, Upright Citizens Brigade), monologues (Jimmy Fallon, Conan O’Brien, Jimmy Kimmel), observational humor (stand-up comedy), parody (essays, think pieces, video, YouTube). Students learn the difference between a sketch and a bit, how to create memorable original characters, where to find humor. Students experiment with writing a different specific piece each week, possibly including a parody of a TV commercial, fake news stories à la The Onion, Jimmy Fallon Thank You Notes, monologue jokes for talk-show hosts, humorous short films for Funny Or Die, and a humorous Op-Ed piece for The New York Times.\n\n      less description for WRTNG-UG 1505 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1508",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12529",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-1",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Gilles, D. B.; Gilles, Donald"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1508\n\n   Writing for Late Night Television: Monologue, Jokes, Bits, and Sketches\n\nThis course introduces students to writing for the world of Late Night Television. Every talk show host has a unique voice and style. Work will include learning how to write opening monologues for The Daily Show,  Conan O'Brien, Larry Wilmore and Jimmy Kimmel among others.  Other subjects we will cover include understanding the difference between a sketch and a bit, how to structure a joke, and how to find material. Work will also involve writing sketches such as those on Saturday Night Live, Between Two Ferns with Zach Galifianakus, Key and Peele and we’ll examine the techniques of Upright Ci...\n\n      more description for WRTNG-UG 1508 »\n\n      \n\n\n\nThis course introduces students to writing for the world of Late Night Television. Every talk show host has a unique voice and style. Work will include learning how to write opening monologues for The Daily Show,  Conan O'Brien, Larry Wilmore and Jimmy Kimmel among others.  Other subjects we will cover include understanding the difference between a sketch and a bit, how to structure a joke, and how to find material. Work will also involve writing sketches such as those on Saturday Night Live, Between Two Ferns with Zach Galifianakus, Key and Peele and we’ll examine the techniques of Upright Citizens Brigade.  Students will learn how to go from idea, to building the sketch, to completing it. Writing assignments may include creating  original on-going sketch characters, Jimmy Fallon Thank You Notes, fake news items ala Weekend Update and writing short film parodies ala Funny Or Die.\n\n      less description for WRTNG-UG 1508 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1510",
            "course_name": "Writing Comedy",
            "description": "WRTNG-UG 1510 Writing Comedy",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1511",
            "course_name": "Advanced Comedy Writing",
            "description": "WRTNG-UG 1511 Advanced Comedy Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1515",
            "course_name": "",
            "description": "WRTNG-UG 1515\n\n   The Art of Satire: Laughter as a Political Instrument\n\nLaughter is fundamental and universal. Satire is often able to illuminate cultural and social issues more effectively than straight polemical discourse because it strikes directly at the reader's sensory response. Throughout history, satire has acted as an instrument of social change by provoking debate and planting seeds of social conscience while entertaining – Jon Stewart is a great example of this. Most politically engaged fiction writers are natural satirists, because unfunny polemical fiction quickly curdles into propaganda, or stagnates into social realism. This class will read and writ...\n\n      more description for WRTNG-UG 1515 »\n\n      \n\n\n\nLaughter is fundamental and universal. Satire is often able to illuminate cultural and social issues more effectively than straight polemical discourse because it strikes directly at the reader's sensory response. Throughout history, satire has acted as an instrument of social change by provoking debate and planting seeds of social conscience while entertaining – Jon Stewart is a great example of this. Most politically engaged fiction writers are natural satirists, because unfunny polemical fiction quickly curdles into propaganda, or stagnates into social realism. This class will read and write satirical pieces, both fiction and non-fiction. We will investigate what makes a piece of writing funny: primarily the choice of the point of view, voice, and detail, as well as such devices as contrast, repetition, and the deadpan delivery. The students will be able to follow their interests and passions in choosing topics for their writing. Readings may include: Mark Twain, Mikhail Bulgakov, Sherman Alexie, Jon Stewart, George Saunders, Gary Shteyngart, Emma McLaughlin and Nicola Kraus, Lorrie Moore, Tina Fey, and the writers of The Onion.\n\n      less description for WRTNG-UG 1515 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1520",
            "course_name": "",
            "description": "WRTNG-UG 1520\n\n   Creating Narrative Effects\n\nGood writing is seamless and smooth, skillfully persuading us of the authenticity of the time and place and the emotional landscape of the characters.  We are shown only what needs to be illuminated, carried forward at the right speed, kept at arm?s length sometimes and clasped close at other times. Great stories or novels work at every level because the writer has mastered the craft of fiction. This class will examine those elements of craft that lead to better storytelling?ingenious use of point of view, narrative voice, pacing, meaningful description and telling detail, effective dialogue a...\n\n      more description for WRTNG-UG 1520 »\n\n      \n\n\n\nGood writing is seamless and smooth, skillfully persuading us of the authenticity of the time and place and the emotional landscape of the characters.  We are shown only what needs to be illuminated, carried forward at the right speed, kept at arm?s length sometimes and clasped close at other times. Great stories or novels work at every level because the writer has mastered the craft of fiction. This class will examine those elements of craft that lead to better storytelling?ingenious use of point of view, narrative voice, pacing, meaningful description and telling detail, effective dialogue and many more. We will read great stories illustrating these aspects of craft, and write stories which we will workshop. Possible text: The Story and Its Writer : An Introduction to Short Fiction edited by Ann Charters.\n\n      less description for WRTNG-UG 1520 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1522",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17004",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 401",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Tognazzini, Anthony"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1522\n\n   Thin Stories:  Alternative Narrative Strategies\n\nThis course will explore a strain of storytelling that might seem, at first glance, a little spindly. The texts under examination will feature extreme compression, elliptical structures, and conspicuous narrative absences, storytelling modes that stand in direct opposition to the larger scope, causal sequencing, and exposition-heavy style often found in conventional novels and short stories. In the class readings and their own original work, students will investigate fiction that proposes new formal approaches, incorporates strategies from poetry and other genres, and \"minimizes\" the tradition...\n\n      more description for WRTNG-UG 1522 »\n\n      \n\n\n\nThis course will explore a strain of storytelling that might seem, at first glance, a little spindly. The texts under examination will feature extreme compression, elliptical structures, and conspicuous narrative absences, storytelling modes that stand in direct opposition to the larger scope, causal sequencing, and exposition-heavy style often found in conventional novels and short stories. In the class readings and their own original work, students will investigate fiction that proposes new formal approaches, incorporates strategies from poetry and other genres, and \"minimizes\" the traditional narrative arc by slicing it up in new ways. Texts will include Yasunari Kawabata’s Palm of the Hand Stories, Anne Carson’s Autobiography of Red, Lydia Davis’s Almost No Memory, Joe Wenderoth’s Letters To Wendy’s and Italo Calvino’s Invisible Cities, among others. Ultimately, the class will be a kind of creative laboratory where students can craft experimental narrative forms, discovering their own “thin stories” and the rich, tricky possibilities therein.\n\n      less description for WRTNG-UG 1522 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1524",
            "course_name": "",
            "description": "WRTNG-UG 1524\n\n   Five x Five: Contemporary Masters of Short Fiction\n\nStudents in this writing-intensive class will engage in a close study of short fiction by reading five contemporary masters of the form: Donald Barthelme, Amy Hempel, Barry Hannah, Lydia Davis, and George Saunders. In Barthelme and Davis, students will be exposed to a shifting kaleidoscope of forms, in Hempel they’ll see conventional dramatic material reworked via elliptical design and redaction, in Saunders a unique approach to satire, cultural critique, and social engagement, and in Hannah a fresh take on Southern storytelling traditions. In examining the range of voices, techniques, and for...\n\n      more description for WRTNG-UG 1524 »\n\n      \n\n\n\nStudents in this writing-intensive class will engage in a close study of short fiction by reading five contemporary masters of the form: Donald Barthelme, Amy Hempel, Barry Hannah, Lydia Davis, and George Saunders. In Barthelme and Davis, students will be exposed to a shifting kaleidoscope of forms, in Hempel they’ll see conventional dramatic material reworked via elliptical design and redaction, in Saunders a unique approach to satire, cultural critique, and social engagement, and in Hannah a fresh take on Southern storytelling traditions. In examining the range of voices, techniques, and formal strategies these authors employ, and by experimenting with some of these same approaches in their own fiction, students will expand their understanding of the diversity, vitality, and possibility available to today’s short story writer. The class will feature close readings, discussion, group work, in-class exercises, formal assignments, and workshop.\n\n      less description for WRTNG-UG 1524 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1525",
            "course_name": "Five Senses in Creative Writing",
            "description": "WRTNG-UG 1525 Five Senses in Creative Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1526",
            "course_name": "",
            "description": "WRTNG-UG 1526\n\n   The Monster Under Your Story: Exploring Genre\n\nFrom the Gothic mansions of Poe to the gleaming hovercrafts of Gibson, genre fiction is often a craft of extremes: extreme imagination, extreme emotion. Do the trappings of \"literary fiction\" sometimes feel constraining to you as a writer? Do the settings feel too familiar, the conventions too tame for the story you want to tell? Could your story use a cowboy? A flesh-eating zombie? In this course, students will examine and write in different genres, from mystery to science fiction, western to horror. While the course will include close, textual readings of works by authors such as Stephen Kin...\n\n      more description for WRTNG-UG 1526 »\n\n      \n\n\n\nFrom the Gothic mansions of Poe to the gleaming hovercrafts of Gibson, genre fiction is often a craft of extremes: extreme imagination, extreme emotion. Do the trappings of \"literary fiction\" sometimes feel constraining to you as a writer? Do the settings feel too familiar, the conventions too tame for the story you want to tell? Could your story use a cowboy? A flesh-eating zombie? In this course, students will examine and write in different genres, from mystery to science fiction, western to horror. While the course will include close, textual readings of works by authors such as Stephen King, Kelly Link, Ursula K. Le Guin, Koji Suzuki, Walter Mosley, Karen Russell, Elmore Leonard, and Max Brooks, the majority of each class will be spent workshopping student fiction.\n\n      less description for WRTNG-UG 1526 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1527",
            "course_name": "",
            "description": "WRTNG-UG 1527\n\n   Writing Dystopian Fiction\n\nThis reading and writing-intensive workshop will examine visions of dystopian societies presented in several fictional works. We will consider the political and cultural crisis depicted in each text, and the impact of this crisis on individual identity and freedom. Students will respond to the themes in these texts in their own creative work, crafting personal dystopic visions influenced by contemporary concerns and the impulses of their imaginations. Texts will include Orwell’s 1984, Atwood’s The Handmaid’s Tale, Cormac McCarthy’s The Road, Terry Gilliam’s film Brazil, and a course reader fea...\n\n      more description for WRTNG-UG 1527 »\n\n      \n\n\n\nThis reading and writing-intensive workshop will examine visions of dystopian societies presented in several fictional works. We will consider the political and cultural crisis depicted in each text, and the impact of this crisis on individual identity and freedom. Students will respond to the themes in these texts in their own creative work, crafting personal dystopic visions influenced by contemporary concerns and the impulses of their imaginations. Texts will include Orwell’s 1984, Atwood’s The Handmaid’s Tale, Cormac McCarthy’s The Road, Terry Gilliam’s film Brazil, and a course reader featuring short works by Kafka, Jennifer Egan, Colson Whitehead, George Saunders, Blake Butler, and others.\n\n      less description for WRTNG-UG 1527 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1530",
            "course_name": "Creative Writing for Twenty-First Century",
            "description": "WRTNG-UG 1530 Creative Writing for Twenty-First Century",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1534",
            "course_name": "",
            "description": "WRTNG-UG 1534\n\n   Sidelines: The World of the Cross-Genre Writer\n\nBoundaries between literary genres can be quite foggy, and for this we should be grateful, since beautiful things take shape in fog. In this course, which will emphasize craft and creative practice, we’ll explore literary hybrid forms that blur or erase lines between fiction, poetry, and non-fiction. We’ll look at prose poems, lyrical essays, fictional autobiographies, hoaxes that pass as truth (and vice versa), graphic novels, and other genre crossbreeds. We’ll discuss and explore, through writing exercises and assignments, the possibilities these forms create for our notions of storytelling,...\n\n      more description for WRTNG-UG 1534 »\n\n      \n\n\n\nBoundaries between literary genres can be quite foggy, and for this we should be grateful, since beautiful things take shape in fog. In this course, which will emphasize craft and creative practice, we’ll explore literary hybrid forms that blur or erase lines between fiction, poetry, and non-fiction. We’ll look at prose poems, lyrical essays, fictional autobiographies, hoaxes that pass as truth (and vice versa), graphic novels, and other genre crossbreeds. We’ll discuss and explore, through writing exercises and assignments, the possibilities these forms create for our notions of storytelling, authenticity, literary craft, and imaginative expression. Students will read works by Kafka, Jamaica Kincaid, Anne Carson, Michael Ondaatje, Lydia Davis, Italo Calvino, Colson Whitehead, Joan Didion, and Vladimir Nabokov, among others, and use these models as springboards for their own hybrid inventions.\n\n      less description for WRTNG-UG 1534 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1535",
            "course_name": "The Habit of Art",
            "description": "WRTNG-UG 1535 The Habit of Art",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1536",
            "course_name": "",
            "description": "WRTNG-UG 1536\n\n   The Short Story: a Workshop in Revising\n\nThis workshop is dedicated to the oft-repeated observation that all writing is re-writing.  Each writer will focus their efforts on only one or two short stories, rather than starting many new stories and abandoning them in favor of yet another new beginning.  Students will take each of their stories through a number of drafts and revise them in response to (though not necessarily in accord with) questions and comments raised by other members of the workshop.  The objective is to learn ways of staying with such challenges as maintaining the story's voice, determining the order of experience, a...\n\n      more description for WRTNG-UG 1536 »\n\n      \n\n\n\nThis workshop is dedicated to the oft-repeated observation that all writing is re-writing.  Each writer will focus their efforts on only one or two short stories, rather than starting many new stories and abandoning them in favor of yet another new beginning.  Students will take each of their stories through a number of drafts and revise them in response to (though not necessarily in accord with) questions and comments raised by other members of the workshop.  The objective is to learn ways of staying with such challenges as maintaining the story's voice, determining the order of experience, and arriving at an ending that satisfies the design of the story as well as the intentions of the writer.  Workshop members share their stories in class throughout the semester and comment in detail on one another's work.  Participants should have some experience writing short stories.\n\n      less description for WRTNG-UG 1536 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1537",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12532",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-3",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Rinehart, Steven"
                }
            ],
            "course_name": "Crafting Short Fiction from the Sentence Up",
            "description": "WRTNG-UG 1537 Crafting Short Fiction from the Sentence Up \nThis class explores the craft of writing, starting with the sentence and ending with the scene. Half of each class is devoted to craft exercises and the remaining half to a traditional workshop approach to discussing student submissions. By the end of the semester we'll be able to talk intelligently about some of the \"micro\" parts of a short story or novel, giving the students some practical tools for editing those parts.",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1540",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12302",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 402",
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Zoref, Carol"
                }
            ],
            "course_name": "Reading and Writing The Short Story",
            "description": "WRTNG-UG 1540 Reading and Writing The Short Story \nThis short story workshop is designed for the writer who believes that there is as much to be learned from reading the works of others as from writing their own stories. Master story readings will be assigned each week so that we can develop a common canon.  Exercises will be assigned in the early weeks of the term as a way of developing and reinforcing each writer’s relationship to literary craft. Each writer will also present her or his own stories in class. Workshop members are required to participate actively in classroom critiques.",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1545",
            "course_name": "Writing Short Fiction",
            "description": "WRTNG-UG 1545 Writing Short Fiction",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1546",
            "course_name": "Content is Key: Editing Short Fiction",
            "description": "WRTNG-UG 1546 Content is Key: Editing Short Fiction \nThis class explores the hard decision-making involved in fiction, and attempts to give the students tools for deciding which content belongs in a story and which needs to be put aside for later use, or discarded altogether. We look at ways to discover what the first and second drafts are about, and which parts of the story add to that idea and which detract. We will also hold a traditional workshop, discussing student stories in a roundtable session.",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1547",
            "course_name": "",
            "description": "WRTNG-UG 1547\n\n   Writing the Novel\n\nThe main objectives of this course are to provide students interested in writing a novel an awareness of the various techniques available to them and to help them develop their own approach to novel writing. We will examine every aspect of the craft of novel writing: plot, structure, point of view, narrative voice, dialogue, building of  individual scenes, etc. Students will learn to study texts from the unique perspective of a writer. The class will become a community of writers working in a safe, honest and considerate environment, presenting their own fiction, responding to the writing of o...\n\n      more description for WRTNG-UG 1547 »\n\n      \n\n\n\nThe main objectives of this course are to provide students interested in writing a novel an awareness of the various techniques available to them and to help them develop their own approach to novel writing. We will examine every aspect of the craft of novel writing: plot, structure, point of view, narrative voice, dialogue, building of  individual scenes, etc. Students will learn to study texts from the unique perspective of a writer. The class will become a community of writers working in a safe, honest and considerate environment, presenting their own fiction, responding to the writing of others, and discussing questions about literature, editing, and publishing. Each student will write a novel outline and two chapters. Reading assignments will include works by a variety of classic and contemporary authors, such as Jane Austen, Fyodor Dostoyevsky, F.Scott Fitzgerald, Junot Diaz, and Jennifer Egan.\n\n      less description for WRTNG-UG 1547 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1548",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "16962",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 601",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Nair, Meera"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1548\n\n   Pitch Perfect:  A Multi-genre Writing Workshop\n\nVoice is the first thing we encounter in compelling writing. Voice is the palpable presence of the writer, the hand that reaches out to pull us in. It is writer’s persona, the sound of his or her presence. Voice is what persists, whispering in our head, long after the essayist's convictions are aired, long after we have closed the book, or closed the browser. This multigenre writing workshop will help hone an essential and potent element of your writing: an ability to adapt your voice to the medium. Whether it is the rigor of short fiction, the convictions of the personal essay or the quick mu...\n\n      more description for WRTNG-UG 1548 »\n\n      \n\n\n\nVoice is the first thing we encounter in compelling writing. Voice is the palpable presence of the writer, the hand that reaches out to pull us in. It is writer’s persona, the sound of his or her presence. Voice is what persists, whispering in our head, long after the essayist's convictions are aired, long after we have closed the book, or closed the browser. This multigenre writing workshop will help hone an essential and potent element of your writing: an ability to adapt your voice to the medium. Whether it is the rigor of short fiction, the convictions of the personal essay or the quick musings of a blog, we will explore different ways to develop your voice. We will close-read published stories, essays, blogs as a starting point for your own writing. We will explore aspects of craft: point of view, character, theme, rhythm, structure and so on. We will burnish each other’s work with frank and constructive comment and grapple with the rigors of editing. The course will require close-readings of fiction by Kafka, Cortazar, Ha Jin, Lahiri, Oates, personal essays by Hemon, Dillard, Jo Ann Beard, Shteyngart and other writers. We will also study blogs like ze frank, Learningtoloveyoumore by Miranda July. In addition to writing fiction and essay and studying aspects of craft, students will also design and create website content and make presentations.\n\n      less description for WRTNG-UG 1548 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1549",
            "course_name": "",
            "description": "WRTNG-UG 1549\n\n   Writers as Shapers\n\nA piece of fiction can be constructed in an unlimited number of ways and this course seeks to explore the formal possibilities available to us. We will study the choices we can make as writers—of narrative point of view, characterization, beginnings, dialogue, scene, summary, pacing, plot and resolutions. We will isolate and inspect strategies that published authors have used, even as students produce and workshop their own fiction from exercises. In this conversation between student writing and the studied literature we will hopefully get a greater sense of writers as sculptors of the raw mat...\n\n      more description for WRTNG-UG 1549 »\n\n      \n\n\n\nA piece of fiction can be constructed in an unlimited number of ways and this course seeks to explore the formal possibilities available to us. We will study the choices we can make as writers—of narrative point of view, characterization, beginnings, dialogue, scene, summary, pacing, plot and resolutions. We will isolate and inspect strategies that published authors have used, even as students produce and workshop their own fiction from exercises. In this conversation between student writing and the studied literature we will hopefully get a greater sense of writers as sculptors of the raw material of story. Possible texts: Mishima, Ha Jin, Russell Banks, Charles Baxter, C.J. Hribal, Daniyal Mueenuddin, Alice Munroe, Jhumpa Lahiri.\n\n      less description for WRTNG-UG 1549 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1550",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12584",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 501",
                    "time": "Wed 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "King, David"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1550\n\n   Fiction Writing\n\nThis course provides students interested in writing fiction an opportunity to explore and practice various forms in a workshop environment. The main objective of the course is to help students develop individual styles and voices and to raise their awareness of the techniques available to them. To this end, we'll examine the craft elements of traditional fiction writing--plot, structure, point of view, narrative voice, dialogue, style, action, etc--as well as methods for generating narrative ideas, moving beyond the first draft and working more experimentally. We'll begin with exercises rangin...\n\n      more description for WRTNG-UG 1550 »\n\n      \n\n\n\nThis course provides students interested in writing fiction an opportunity to explore and practice various forms in a workshop environment. The main objective of the course is to help students develop individual styles and voices and to raise their awareness of the techniques available to them. To this end, we'll examine the craft elements of traditional fiction writing--plot, structure, point of view, narrative voice, dialogue, style, action, etc--as well as methods for generating narrative ideas, moving beyond the first draft and working more experimentally. We'll begin with exercises ranging from simple to demanding, then enter a workshop phase in which students present their own work, moving toward a serious and considered revision as a final project. Students are responsible for presenting their own fiction and responding to the work of classmates, as well as to questions about literature, editing, and publishing.  Reading assignments will include work by contemporary writers including Alice Munroe, T C Boyle, Lorrie Moore, Jim Shepard and others, as well as Chekhov, Wharton and Nabokov.\n\n      less description for WRTNG-UG 1550 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1555",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12303",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-7",
                    "time": "Thu 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Spain, Christopher"
                }
            ],
            "course_name": "",
            "description": "WRTNG-UG 1555\n\n   Advanced Fiction Writing\n\nThe aim of this class is to present the (mostly) verifiable, repeatable, teachable, learnable and nearly non-negotiable elements—scene, summary, evoking of the senses, want, choice, et cetera—of the theory of story that repeatedly wake a want in the reader to reach for the next page.  The Scientific Method is our model, and we use published narratives—from The New Yorker, Zoetrope, others—for field observation, vivisection, analysis.  The idea is to help you begin to acquire the tools of narrative—through systematic measurement, experiment, modification of hypotheses—necessary to resist reader...\n\n      more description for WRTNG-UG 1555 »\n\n      \n\n\n\nThe aim of this class is to present the (mostly) verifiable, repeatable, teachable, learnable and nearly non-negotiable elements—scene, summary, evoking of the senses, want, choice, et cetera—of the theory of story that repeatedly wake a want in the reader to reach for the next page.  The Scientific Method is our model, and we use published narratives—from The New Yorker, Zoetrope, others—for field observation, vivisection, analysis.  The idea is to help you begin to acquire the tools of narrative—through systematic measurement, experiment, modification of hypotheses—necessary to resist reader indifference. Students turn in three drafts of fiction, each 10-14 pages long, to be critiqued in a workshop setting.  Critiques are rigorous but constructive: no nastiness allowed.\n\n      less description for WRTNG-UG 1555 «",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1558",
            "course_name": "Narrative Strategies",
            "description": "WRTNG-UG 1558 Narrative Strategies",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 1560",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12304",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "12WV L114",
                    "time": "Mon 6.20 PM - 9.00 PM",
                    "open": true,
                    "professor": "Fragos, Emily"
                },
                {
                    "format": "Seminar",
                    "class_id": "12556",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WEIN SB20",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Pies, Stacy"
                }
            ],
            "course_name": "The Art and Craft of Poetry",
            "description": "WRTNG-UG 1560 The Art and Craft of Poetry \nIn this workshop poets will focus on the foundations and intricate dynamics of poetry as a writer’s process. A weekly reading of a poem by each poet in the circle will serve as point of departure for discussion of the relationships of craft and expression. Each student will also briefly present a favorite poet/poem for the enjoyment and learning of the class. A final portfolio of poems is required at the end of the course.",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1564",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12566",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "12WV L113",
                    "time": "Fri 11.00 AM - 1.45 PM",
                    "open": true,
                    "professor": "Hightower, Scott"
                }
            ],
            "course_name": "Advanced Poetry Writing",
            "description": "WRTNG-UG 1564 Advanced Poetry Writing \nA workshop designed for serious poets, this class teaches students how to take their writing to another level both intellectually and artistically; depth of theme, imagination, and craft are discussed. Emphasis is placed on developing and strengthening one’s personal style and voice. Through workshopping, students further refine their critical abilities as poets and readers. The class includes exercises and readings. Submission of work will be discussed and encouraged.",
            "offering": true
        },
        {
            "course_id": "WRTNG-UG 1565",
            "course_name": "Advance Poetry Writing",
            "description": "WRTNG-UG 1565 Advance Poetry Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 9150",
            "course_name": "",
            "description": "WRTNG-UG 9150\n\n   Creative Writing: Argentina, travel Writing at the End of the World\n\nA practical course in the writing of creative literary texts: prose (short stories as well as literary non-fiction) and poetry. Selected published works will be analyzed in class both to provide inspiration for student writing as well as to represent literary structures and strategies. Writing assignments ranging from spontaneous to long-term projects will promote creative exploration and self-expression. Critical skills are emphasized and enhanced as students respond to each others’ work. Awareness of correct conventional use of the English language will be upheld. Students build up a body of...\n\n      more description for WRTNG-UG 9150 »\n\n      \n\n\n\nA practical course in the writing of creative literary texts: prose (short stories as well as literary non-fiction) and poetry. Selected published works will be analyzed in class both to provide inspiration for student writing as well as to represent literary structures and strategies. Writing assignments ranging from spontaneous to long-term projects will promote creative exploration and self-expression. Critical skills are emphasized and enhanced as students respond to each others’ work. Awareness of correct conventional use of the English language will be upheld. Students build up a body of work over the semester. For full credit and in demonstration of a writing “process,” the final portfolios should include both first drafts and subsequent revisions. At least one longer text (or set of poems) will be selected for submission as would be appropriate to publishers or literary contests.\n\n      less description for WRTNG-UG 9150 «",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 9450",
            "course_name": "Creative Writing",
            "description": "WRTNG-UG 9450 Creative Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 9500",
            "course_name": "Creative Writing",
            "description": "WRTNG-UG 9500 Creative Writing",
            "offering": false
        },
        {
            "course_id": "WRTNG-UG 9501",
            "course_name": "",
            "description": "WRTNG-UG 9501\n\n   Creative Writing\n\nIn this class students are encouraged to consider the intersectional environments (natural, urban, cultural, historical etc.) that they interact with and within, and how their sensibilities differ living away from home to contemplate how a sense of place can be conveyed through writing. We will engage with a diverse range of readings – featuring many Australian authors – and discuss technical elements and affective poetics to learn how to ‘read as a writer’. Weeks are devoted to crafting the short story, contemporary indigenous storytelling, creative nonfiction, and poetry. The class emphasize...\n\n      more description for WRTNG-UG 9501 »\n\n      \n\n\n\nIn this class students are encouraged to consider the intersectional environments (natural, urban, cultural, historical etc.) that they interact with and within, and how their sensibilities differ living away from home to contemplate how a sense of place can be conveyed through writing. We will engage with a diverse range of readings – featuring many Australian authors – and discuss technical elements and affective poetics to learn how to ‘read as a writer’. Weeks are devoted to crafting the short story, contemporary indigenous storytelling, creative nonfiction, and poetry. The class emphasizes the importance of embodied interaction with the city through a field trip using ‘The Disappearing’ – a downloadable app featuring over 100 site-specific poems spanning a ‘poetic map’ of Sydney, created by The Red Room Company. Students will think about the possibilities of marrying new technologies with writing as they navigate using poems as landmarks. Students shall workshop their drafts during the course, learning how to effectively communicate critical feedback and how to be receptive to constructive critique.\n\n      less description for WRTNG-UG 9501 «",
            "offering": false
        }
    ]
}