{
    "major_id": "AFRS-GA",
    "file": "./2015-2016/Africana_Studies_(AFRS-GA).html",
    "courses": [
        {
            "course_id": "AFRS-GA 1015",
            "course_name": "Minorities & The Media",
            "description": "AFRS-GA 1015 Minorities & The Media",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1316",
            "course_name": "African Societies & Cult",
            "description": "AFRS-GA 1316 African Societies & Cult",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1317",
            "course_name": "Ethnographic Traditions: Sub-Saharan Africa",
            "description": "AFRS-GA 1317 Ethnographic Traditions: Sub-Saharan Africa",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1320",
            "course_name": "Race & Punishment in Advanced Society",
            "description": "AFRS-GA 1320 Race & Punishment in Advanced Society",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1562",
            "course_name": "Lit of The Field: Africa",
            "description": "AFRS-GA 1562 Lit of The Field: Africa",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1563",
            "course_name": "Black Internationalism",
            "description": "AFRS-GA 1563 Black Internationalism",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1782",
            "course_name": "African-American History",
            "description": "AFRS-GA 1782 African-American History",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1784",
            "course_name": "West Central Africa: Dimensions & Duplication",
            "description": "AFRS-GA 1784 West Central Africa: Dimensions & Duplication",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1801",
            "course_name": "Literature of The Field:",
            "description": "AFRS-GA 1801 Literature of The Field:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 1803",
            "course_name": "African Amer & Native Amer in North America",
            "description": "AFRS-GA 1803 African Amer & Native Amer in North America",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2000",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1047",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 303",
                    "time": "Tue 4.55 PM - 7.35 PM",
                    "open": true,
                    "professor": "Amkpa, Awam"
                }
            ],
            "course_name": "",
            "description": "AFRS-GA 2000\n\n   Proseminar in Africana Studies\n\nOffering a topical exploration of key research themes and topics, the course is an introduction to contemporary historical, ethnographic, cultural and political discourses in Africana studies. The course frames Africana studies within an Atlantic prism as well as exploring other ‘hemispheric’ approaches to examining Africa and its diasporas by examining the various intersecting modernities within which Africana is constructed and contested. Each class will be in three sections. The first part will be lecture based by leading or guest professor, the second will be an open student discussion, wh...\n\n      more description for AFRS-GA 2000 »\n\n      \n\n\n\nOffering a topical exploration of key research themes and topics, the course is an introduction to contemporary historical, ethnographic, cultural and political discourses in Africana studies. The course frames Africana studies within an Atlantic prism as well as exploring other ‘hemispheric’ approaches to examining Africa and its diasporas by examining the various intersecting modernities within which Africana is constructed and contested. Each class will be in three sections. The first part will be lecture based by leading or guest professor, the second will be an open student discussion, while the third returns to the lecturer contextualizing debates within the larger academic remit of the course.\n\n      less description for AFRS-GA 2000 «",
            "offering": true
        },
        {
            "course_id": "AFRS-GA 2007",
            "course_name": "Islam in West Africa",
            "description": "AFRS-GA 2007 Islam in West Africa",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2015",
            "course_name": "Race, Slavery, & Freedom in The Atlantic World",
            "description": "AFRS-GA 2015 Race, Slavery, & Freedom in The Atlantic World",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2028",
            "course_name": "History of West Africa",
            "description": "AFRS-GA 2028 History of West Africa",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2029",
            "course_name": "African Culture & Experience in No Amer",
            "description": "AFRS-GA 2029 African Culture & Experience in No Amer",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2102",
            "course_name": "Ethnography & The Global City",
            "description": "AFRS-GA 2102 Ethnography & The Global City",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2200",
            "course_name": "British Black Cultural Studies",
            "description": "AFRS-GA 2200 British Black Cultural Studies",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2301",
            "course_name": "Making of The African Diaspora",
            "description": "AFRS-GA 2301 Making of The African Diaspora",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2302",
            "course_name": "Theorizing The Diaspora",
            "description": "AFRS-GA 2302 Theorizing The Diaspora",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2303",
            "course_name": "",
            "description": "AFRS-GA 2303\n\n   Seminar:\n\nThis seminar explores how the trope of ?blackness? is medThis seminar explores how the trope of ?blackness? is mediated over a range of ideas, images, and expressions of social difference in cinema. Screenings and readings examine how popular cinema, ranging from black independence to the commercial ?mainstream,? deals not only with issues of race and color, but how these issues intersect, and interact, with other social categories of difference(s) mainly related to class, sexual orientation, and gender but including many others. The course explores such issues as seeing beyond the ?black-whit...\n\n      more description for AFRS-GA 2303 »\n\n      \n\n\n\nThis seminar explores how the trope of ?blackness? is medThis seminar explores how the trope of ?blackness? is mediated over a range of ideas, images, and expressions of social difference in cinema. Screenings and readings examine how popular cinema, ranging from black independence to the commercial ?mainstream,? deals not only with issues of race and color, but how these issues intersect, and interact, with other social categories of difference(s) mainly related to class, sexual orientation, and gender but including many others. The course explores such issues as seeing beyond the ?black-white binary? model of race relations; gendered perspectives on ?blackness? and black women?s filmmaking; the cultural and political dynamic between blackness and gayness on the screen; and issues of class, caste, and ?colorism? in cinema. The course also examines a number of ideas and theories related to the material, including passing, double consciousness, unmarked difference, and creolization.\n\n      less description for AFRS-GA 2303 «",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2304",
            "course_name": "Sem: Urban Polit Econ & Af-Am Health in 20Thc",
            "description": "AFRS-GA 2304 Sem: Urban Polit Econ & Af-Am Health in 20Thc",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2553",
            "course_name": "Transition from Slavery to Freedom in The U.S.",
            "description": "AFRS-GA 2553 Transition from Slavery to Freedom in The U.S.",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2555",
            "course_name": "African Slavery and The Atlantic Slave Trade",
            "description": "AFRS-GA 2555 African Slavery and The Atlantic Slave Trade",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2556",
            "course_name": "Engagement Exile Errancy: Narrative After US Occupancy",
            "description": "AFRS-GA 2556 Engagement Exile Errancy: Narrative After US Occupancy",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2561",
            "course_name": "Theorizing Race and Slavery",
            "description": "AFRS-GA 2561 Theorizing Race and Slavery",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2600",
            "course_name": "",
            "description": "AFRS-GA 2600\n\n   Colloq in Women'S Hist: Race & Reproduction\n\nFrom the policies, priorities, and perversions of slave owners to the pronatalist campaigns of colonial Africa, to the family planning programs that are a hallmark of liberalism and development in the postcolonial world, and, most recently, to the promotion of assisted reproduction technologies among western elites, race and reproduction have always been among the primary axes on which large-scale political, economic, cultural, social, and intellectual processes are configured. Because reproduction connects the intimate experiences of individuals to larger historical structures and forces and ...\n\n      more description for AFRS-GA 2600 »\n\n      \n\n\n\nFrom the policies, priorities, and perversions of slave owners to the pronatalist campaigns of colonial Africa, to the family planning programs that are a hallmark of liberalism and development in the postcolonial world, and, most recently, to the promotion of assisted reproduction technologies among western elites, race and reproduction have always been among the primary axes on which large-scale political, economic, cultural, social, and intellectual processes are configured. Because reproduction connects the intimate experiences of individuals to larger historical structures and forces and because reproduction is such a fundamental (if varied) biological and social experience, this topic in particular lends itself to comparative work. This course explores issues in the history of race and reproduction, focusing primarily (though not exclusively) on American and African contexts. This cross-cultural breadth helps students to consider the relationship between biological experiences (which are often portrayed as universal) and sociocultural context. Through readings, students consider how different disciplinaryorientations (social history, medical anthropology, feminist theory, art history, etc.) approach women?s history both methodologically, theoretically, and in terms of narrative and analytic strategies.\n\n      less description for AFRS-GA 2600 «",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2605",
            "course_name": "The Burden of Representation",
            "description": "AFRS-GA 2605 The Burden of Representation",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2607",
            "course_name": "Race, Civil War & Reconstruction",
            "description": "AFRS-GA 2607 Race, Civil War & Reconstruction",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2610",
            "course_name": "Exodus: The Politics of Black Liberation",
            "description": "AFRS-GA 2610 Exodus: The Politics of Black Liberation \nSeminar on the struggle for cultural and political autonomy in the United States among African Americans, primarily in the urban North, who rejected the church-based nonviolent Civil Rights Movement. Focuses on the ?Negro? or African side of what W. E. B. DuBois called Afro-American ?double-consciousness.?",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2611",
            "course_name": "The Sweat of Thy Face: African Amer Labor Hist",
            "description": "AFRS-GA 2611 The Sweat of Thy Face: African Amer Labor Hist",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2612",
            "course_name": "To The Mountaintop: The Movemnt for Civil Rights",
            "description": "AFRS-GA 2612 To The Mountaintop: The Movemnt for Civil Rights \nSeminar on the struggle to end racial segregation and discrimination in the former slave societies of the United States. Focuses on the ?American? side of what W. E. B. DuBois called the Afro-American ?double-consciousness.?",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2614",
            "course_name": "Steal Away: African Atlantic Relig Culture",
            "description": "AFRS-GA 2614 Steal Away: African Atlantic Relig Culture \nThis seminar is a comparative study of African Atlantic religious celebration, primarily in the context of Afro-Christianity, but touching on Islam, ?Voodoo,? Santer?a, and Candombl?. Although designed for graduate students, this seminar is also open to seniors with a GPA of 3.65 or better, who may choose to take the seminar on a pass-fail basis.",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2645",
            "course_name": "Topics Postcoloniality:",
            "description": "AFRS-GA 2645 Topics Postcoloniality: \nExplores and interrogates the notion of the ?postcolonial? in relation to certain key aspects of contemporary African and/or Caribbean societies, cultures, and histories. Individual areas of investigation include theories of Africa and Africans, Caribbean literary theory, modern postcolonial theory and its applicability and relevance to recent developments in the African continent and its diaspora, new identity formations, African and Caribbean cultural studies, nationalism and the nation-state, creolization, and theories of resistance.",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2650",
            "course_name": "Tpcs in Caribbean Lit:",
            "description": "AFRS-GA 2650 Tpcs in Caribbean Lit:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2651",
            "course_name": "Topics in Caribbean Lit:",
            "description": "AFRS-GA 2651 Topics in Caribbean Lit:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2652",
            "course_name": "",
            "description": "AFRS-GA 2652\n\n   Haiti in The Caribbean Context\n\nFrancophone communities in the Caribbean are as different from each other as they are different from their Anglophone and Hispanophone neighbors. This course concentrates on the representation of Haiti, arguably the most distinctive Caribbean country in the region and the second independent republic in the hemisphere, in the imagination of Caribbean writers. It is as much an introduction to key issues in Haitian politics, history, and culture as an investigation of the impact of Haiti on the rest of the hemisphere. The latter aspect of the course is examined through a number of texts that reac...\n\n      more description for AFRS-GA 2652 »\n\n      \n\n\n\nFrancophone communities in the Caribbean are as different from each other as they are different from their Anglophone and Hispanophone neighbors. This course concentrates on the representation of Haiti, arguably the most distinctive Caribbean country in the region and the second independent republic in the hemisphere, in the imagination of Caribbean writers. It is as much an introduction to key issues in Haitian politics, history, and culture as an investigation of the impact of Haiti on the rest of the hemisphere. The latter aspect of the course is examined through a number of texts that react to Haiti and are drawn from literature for the most part but also from history and anthropology in the 20th century.\n\n      less description for AFRS-GA 2652 «",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2654",
            "course_name": "",
            "description": "AFRS-GA 2654\n\n   Resiting Resistance: Writ Nat/Diasp in Carib\n\nIn the islands of the Caribbean archipelago, plantation slavery and later schemes of indentureship left in their wake diverse groups of people who were cut off from their communities of origin.  Ethnic and cultural heterogeneity was further intensified by prolonged periods of colonization making Caribbean societies some of the oldest colonies in the West which because of their unusual hybrid genesis, could neither be seen as ?western? or could they be considered ?native?, that is distinctly ?other?. This course looks at the Caribbean archipelago in terms of its fragmented island spaces, the do...\n\n      more description for AFRS-GA 2654 »\n\n      \n\n\n\nIn the islands of the Caribbean archipelago, plantation slavery and later schemes of indentureship left in their wake diverse groups of people who were cut off from their communities of origin.  Ethnic and cultural heterogeneity was further intensified by prolonged periods of colonization making Caribbean societies some of the oldest colonies in the West which because of their unusual hybrid genesis, could neither be seen as ?western? or could they be considered ?native?, that is distinctly ?other?. This course looks at the Caribbean archipelago in terms of its fragmented island spaces, the dominance of the sea and the influence of the Atlantic world. Theorizing Caribbean identity will be treated not in terms of an inherent wholeness or cultural unity in the region but of open-ended cultural interaction.  Caribbean literary theories manifest a connectedness and cross-cultural relocation that mark all the major literary movements. Some of the central paradigms to be addressed will be nationalism, cosmopolitanism, creolization and relationality\n\n      less description for AFRS-GA 2654 «",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2800",
            "course_name": "Tpcs Latin Amer: Haitian Revolution & Its Impact",
            "description": "AFRS-GA 2800 Tpcs Latin Amer: Haitian Revolution & Its Impact",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2802",
            "course_name": "",
            "description": "AFRS-GA 2802\n\n   Afro-Latino Culture and History\n\nLatinos are now called ?the nation?s largest minority,? outpacing African Americans and thereby signaling a benchmark in the changing meaning of what it means to be American. In public accounts of this dramatic shift, Latinos are commonly counterposed against African Americans in mutually exclusionary terms: either you are Hispanic or you are black. Little if any attention goes to the huge though uncounted black Latino population, the group that fLatinos are now called ?the nation?s largest minority,? outpacing African Americans and thereby signaling a benchmark in the changing meaning of what...\n\n      more description for AFRS-GA 2802 »\n\n      \n\n\n\nLatinos are now called ?the nation?s largest minority,? outpacing African Americans and thereby signaling a benchmark in the changing meaning of what it means to be American. In public accounts of this dramatic shift, Latinos are commonly counterposed against African Americans in mutually exclusionary terms: either you are Hispanic or you are black. Little if any attention goes to the huge though uncounted black Latino population, the group that fLatinos are now called ?the nation?s largest minority,? outpacing African Americans and thereby signaling a benchmark in the changing meaning of what it means to be American. In public accounts of this dramatic shift, Latinos are commonly counterposed against African Americans in mutually exclusionary terms: either you are Hispanic or you are black. Little if any attention goes to the huge though uncounted black Latino population, the group that fits neatly in neither the Hispanic nor the black category and yet may play a decisive role in the emerging cultural configurations and political alignments of our times. This course examines the profound sociological and cultural implications of the growing Afro-Latino presence in light of recent theorizing on race and diasporas. After an overview of the historical background of African-descendant peoples in the Spanish-speaking Americas, the course then traces the longstanding social experience of black Latinos in the United States. Along with a discussion of migration patterns and community formations, there is a focus on narrative accounts of Afro-Latino life and on the traditions of cultural expression; special attention goes to Afro-Latino poetry and to the rich history of Afro-Latino music through the generations, from rumba, mambo, and Cubop to salsa, Latin soul, and hip-hop. Finally, the course turns to the possible theoretical and political consequences of this increasingly self-conscious transnational identity formation.\n\n      less description for AFRS-GA 2802 «",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2803",
            "course_name": "African Lit & Culture",
            "description": "AFRS-GA 2803 African Lit & Culture",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2901",
            "course_name": "Topics:",
            "description": "AFRS-GA 2901 Topics:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2914",
            "course_name": "Locations of Africa in Contemp Caribbean",
            "description": "AFRS-GA 2914 Locations of Africa in Contemp Caribbean",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2924",
            "course_name": "Loc of Africa in Contemp Caribbean",
            "description": "AFRS-GA 2924 Loc of Africa in Contemp Caribbean",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 2964",
            "course_name": "Locations of Africa:",
            "description": "AFRS-GA 2964 Locations of Africa:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 3210",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2283",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Readings in Africana Studies",
            "description": "AFRS-GA 3210 Readings in Africana Studies",
            "offering": true
        },
        {
            "course_id": "AFRS-GA 3211",
            "course_name": "Readings in Africana Studies",
            "description": "AFRS-GA 3211 Readings in Africana Studies",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 3212",
            "course_name": "Topics in Black Urban Studies:",
            "description": "AFRS-GA 3212 Topics in Black Urban Studies:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 3213",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20459",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 4.55 PM - 6.10 PM",
                    "open": true,
                    "professor": "20CS 4CONF"
                }
            ],
            "course_name": "Topics:America in Age of Obama",
            "description": "AFRS-GA 3213 Topics:America in Age of Obama",
            "offering": true
        },
        {
            "course_id": "AFRS-GA 3310",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2284",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship",
            "description": "AFRS-GA 3310 Internship",
            "offering": true
        },
        {
            "course_id": "AFRS-GA 3311",
            "course_name": "Internship",
            "description": "AFRS-GA 3311 Internship",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 3630",
            "course_name": "Tpcs African Lit:",
            "description": "AFRS-GA 3630 Tpcs African Lit:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 3640",
            "course_name": "Topics in African Lit:",
            "description": "AFRS-GA 3640 Topics in African Lit:",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 9102",
            "course_name": "Ethnography & The Global City",
            "description": "AFRS-GA 9102 Ethnography & The Global City",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 9316",
            "course_name": "African Societies & Culture",
            "description": "AFRS-GA 9316 African Societies & Culture",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 9803",
            "course_name": "African Literature & Culture",
            "description": "AFRS-GA 9803 African Literature & Culture",
            "offering": false
        },
        {
            "course_id": "AFRS-GA 9914",
            "course_name": "Locations of Africa",
            "description": "AFRS-GA 9914 Locations of Africa",
            "offering": false
        }
    ]
}