{
    "major_id": "ANST-UA",
    "file": "./2015-2016/Animal_Studies_(ANST-UA).html",
    "courses": [
        {
            "course_id": "ANST-UA 200",
            "course_name": "",
            "description": "ANST-UA  200\n\n   Animals & Society\n\nThis course analyzes the ways that animal and human lives intersect.  Specifically, it examines how relationships with animals both reflect and shape social life, culture, and how people think about themselves.  We will explore the myriad and contradictory positions that animals occupy in society (e.g., as pets, pests) and deconstruct the social origins of these seemingly natural categories.  We will also take a grounded look at what actually happens when humans and animals interact, which sheds new light on the nature of human and animal consciousness.  Fundamentally, students will learn how ...\n\n      more description for ANST-UA  200 »\n\n      \n\n\n\nThis course analyzes the ways that animal and human lives intersect.  Specifically, it examines how relationships with animals both reflect and shape social life, culture, and how people think about themselves.  We will explore the myriad and contradictory positions that animals occupy in society (e.g., as pets, pests) and deconstruct the social origins of these seemingly natural categories.  We will also take a grounded look at what actually happens when humans and animals interact, which sheds new light on the nature of human and animal consciousness.  Fundamentally, students will learn how the roles that animals take on in our lives, and the ways that we think about and relate to them, are patterned by geography, culture, class, gender, and so on.\n\n      less description for ANST-UA  200 «",
            "offering": false
        },
        {
            "course_id": "ANST-UA 257",
            "course_name": "Primate  Communication",
            "description": "ANST-UA  257 Primate  Communication",
            "offering": false
        },
        {
            "course_id": "ANST-UA 300",
            "course_name": "",
            "description": "ANST-UA  300\n\n   Animals in Art and Literature\n\nThe anthropologist Claude Levi-Strauss said that animals featured so prominently in myth and ritual “not because they are ‘good to eat’ but because they are ‘good to think.’” The history of art and literature suggests that they are also good to paint, to sculpt, to photograph, to film, and to write about.  In this course we will use methodologies and perspectives offered by the emerging field of Animal Studies to explore the way artists use the figure of the animal and the subject of animality in their work.  We will study a range of contemporary representations of animals—in fiction, poetry, ...\n\n      more description for ANST-UA  300 »\n\n      \n\n\n\nThe anthropologist Claude Levi-Strauss said that animals featured so prominently in myth and ritual “not because they are ‘good to eat’ but because they are ‘good to think.’” The history of art and literature suggests that they are also good to paint, to sculpt, to photograph, to film, and to write about.  In this course we will use methodologies and perspectives offered by the emerging field of Animal Studies to explore the way artists use the figure of the animal and the subject of animality in their work.  We will study a range of contemporary representations of animals—in fiction, poetry, film, and the visual arts—with a view to understanding how the contemporary cultural imagination configures the ethics, politics, and aesthetics of the relationship between humans and other animals.\n\n      less description for ANST-UA  300 «",
            "offering": false
        },
        {
            "course_id": "ANST-UA 393",
            "course_name": "",
            "description": "ANST-UA  393\n\n   Making Art in the Anthropocene: Project on Ecology, Species and Vibrant Matter\n\n“Either stop writing, or write like a rat!” In one of the most provocative texts in contemporary animal philosophy, the French philosophers Gilles Deleuze and Felix Guattari famously propose “becoming animal” as a liberating artistic practice. This workshop-cum-seminar will engage with key themes in recent “post-humanist” discourse by applying and testing them in our own creative practice. We will read recent theories of species, ecology, and matter (by writers like Jacques Derrida, Donna Haraway, Elizabeth Grosz, Jane Bennett, and Timothy Morton) and we will study a variety of literary, cinem...\n\n      more description for ANST-UA  393 »\n\n      \n\n\n\n“Either stop writing, or write like a rat!” In one of the most provocative texts in contemporary animal philosophy, the French philosophers Gilles Deleuze and Felix Guattari famously propose “becoming animal” as a liberating artistic practice. This workshop-cum-seminar will engage with key themes in recent “post-humanist” discourse by applying and testing them in our own creative practice. We will read recent theories of species, ecology, and matter (by writers like Jacques Derrida, Donna Haraway, Elizabeth Grosz, Jane Bennett, and Timothy Morton) and we will study a variety of literary, cinematic and visual art works that seem to resonate with key themes of that discourse (works like Wallace Shawn’s Grasses of a Thousand Colors, Cesar Aira’s An Episode in the Life of a Landscape Painter, Marina Zurkow’s “Slurb,” Marian Engel’s Bear, Robinson Devor’s Zoo). Our seminar-style investigations of these texts and artworks will regularly be applied in workshop sessions where we will use space, objects, movement, sound, imagery, and writing to explore the aesthetic implications of these theoretical ideas. A main interest of this course is to experiment with “creative research,” a way of doing intellectual work in which art-making is regarded as—and systematically used as—a mode of knowledge and inquiry, and in which ideas are developed by doing and making as well as by thinking/writing/speaking. Prior artistic training/practice is welcomed but not required; however, all students must be willing to and interested in exploring their \"inner artist.\"\n\n      less description for ANST-UA  393 «",
            "offering": false
        },
        {
            "course_id": "ANST-UA 400",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7957",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 269",
                    "time": "Tue 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": "Kanet, Sharisse; Delon, Nicolas"
                }
            ],
            "course_name": "",
            "description": "ANST-UA  400\n\n   Ethics and Animal\n\nThis course examines the morality of our treatment of nonhuman animals. We start by asking about the nature of moral rights and duties. What are rights, and where do they come from? How do we resolve conflicts among rights? Do animals have rights? Next, what are obligations, and where do they come from? What makes right actions right? Do we have special obligations to members of our own family, nation, or species? Is there a moral difference between killing and letting die? Do we have group obligations as well as individual obligations? We then ask how these issues apply to our treatment of no...\n\n      more description for ANST-UA  400 »\n\n      \n\n\n\nThis course examines the morality of our treatment of nonhuman animals. We start by asking about the nature of moral rights and duties. What are rights, and where do they come from? How do we resolve conflicts among rights? Do animals have rights? Next, what are obligations, and where do they come from? What makes right actions right? Do we have special obligations to members of our own family, nation, or species? Is there a moral difference between killing and letting die? Do we have group obligations as well as individual obligations? We then ask how these issues apply to our treatment of nonhuman animals. Are we justified in treating animals as property under the law? Are we justified in using animals for food, clothing, entertainment, research, or companionship? Finally, what are the ethics of animal advocacy? Here we consider abolition vs. regulation, incrementalism vs. absolutism, and legal reform vs. direct action.\n\n      less description for ANST-UA  400 «",
            "offering": true
        },
        {
            "course_id": "ANST-UA 410",
            "course_name": "",
            "description": "ANST-UA  410\n\n   Animal Minds\n\nThis course examines the philosophy of cognitive ethology and comparative psychology. We begin by discussing the nature of animal minds. Are animals conscious? Do they experience pain? Do they have beliefs? Do they use language? Are they self-conscious? How can we know? This involves applying concepts from metaphysics and epistemology to research in cognitive ethology and comparative psychology. We then discuss more general questions like: Are animals agents? Do they have free will? Do they live meaningful lives? Do they have moral rights? This involves applying concepts from ethics, existenti...\n\n      more description for ANST-UA  410 »\n\n      \n\n\n\nThis course examines the philosophy of cognitive ethology and comparative psychology. We begin by discussing the nature of animal minds. Are animals conscious? Do they experience pain? Do they have beliefs? Do they use language? Are they self-conscious? How can we know? This involves applying concepts from metaphysics and epistemology to research in cognitive ethology and comparative psychology. We then discuss more general questions like: Are animals agents? Do they have free will? Do they live meaningful lives? Do they have moral rights? This involves applying concepts from ethics, existentialism, and other areas of philosophy to our conclusions about animal minds. Finally, we also ask, along the way, how research on animal minds can affect our philosophical theories. For example, should we revise our theories of consciousness, language, agency, morality, and so on if they seem to have implausible implications about animals?\n\n      less description for ANST-UA  410 «",
            "offering": false
        },
        {
            "course_id": "ANST-UA 440",
            "course_name": "Food, Animals, & The Environment",
            "description": "ANST-UA  440 Food, Animals, & The Environment",
            "offering": false
        },
        {
            "course_id": "ANST-UA 500",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7839",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC15",
                    "time": "Thu 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": "Wolfson, David"
                }
            ],
            "course_name": "Animals and Public Policy",
            "description": "ANST-UA  500 Animals and Public Policy",
            "offering": true
        },
        {
            "course_id": "ANST-UA 600",
            "course_name": "Topics in AS:",
            "description": "ANST-UA  600 Topics in AS:",
            "offering": false
        }
    ]
}