{
    "major_id": "BMSC-GA",
    "file": "./2015-2016/Basic_Medical_Science_(BMSC-GA).html",
    "courses": [
        {
            "course_id": "BMSC-GA 1997",
            "course_name": "",
            "description": "BMSC-GA 1997\n\n   Grant Writing for Scientists\n\nCourse Enrollment limited to PhD students enrolled at the Sackler Institute. This course will introduce every aspect of grant writing, including selecting funding mechanisms, writing individual grant sections and understanding administrative policies. The course format will alternate between large didactic lectures on specific portions of the grant application or application process and small group meetings. The small groups will be one senior faculty per six students and each student will be responsible for writing the current grant section assignment and critiquing the work of the other stud...\n\n      more description for BMSC-GA 1997 »\n\n      \n\n\n\nCourse Enrollment limited to PhD students enrolled at the Sackler Institute. This course will introduce every aspect of grant writing, including selecting funding mechanisms, writing individual grant sections and understanding administrative policies. The course format will alternate between large didactic lectures on specific portions of the grant application or application process and small group meetings. The small groups will be one senior faculty per six students and each student will be responsible for writing the current grant section assignment and critiquing the work of the other students.\n\n      less description for BMSC-GA 1997 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 1998",
            "course_name": "Introduction to Pre-Doctoral Research",
            "description": "BMSC-GA 1998 Introduction to Pre-Doctoral Research",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 1999",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1105",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Sun, Tung-tien",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 1999\n\n   Scientific Methods: Survival Techniques\n\nAlthough tremendous scientific progress Although tremendous scientific progress has been made during the past two centuries, the way we train our young investigators to do research has basically remained unchanged: we practice apprenticeship. While our students are provided courses on select subjects, formal instruction on how to do research is not offered. As this can be frustrating and inefficient for the students, Dr. Tung-Tien Sun has organized a course to assist students in learning how to get laboratory techniques to work reproducibly and predictably; read a paper actively rather than pa...\n\n      more description for BMSC-GA 1999 »\n\n      \n\n\n\nAlthough tremendous scientific progress Although tremendous scientific progress has been made during the past two centuries, the way we train our young investigators to do research has basically remained unchanged: we practice apprenticeship. While our students are provided courses on select subjects, formal instruction on how to do research is not offered. As this can be frustrating and inefficient for the students, Dr. Tung-Tien Sun has organized a course to assist students in learning how to get laboratory techniques to work reproducibly and predictably; read a paper actively rather than passively; select a good project; keep current with the scientific literature and the relevance of such a task; write a scientific paper; become an effective seminar speaker. This course consists of five sessions, each two hours long (one hour lecture plus one hour discussion), covering several topics that a graduate student must master in order to survive and to excel in doing research. The course covers the following topics: experimental design, literature analysis, scientific writing, oral presentation, and computer skills.\n\n      less description for BMSC-GA 1999 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2000",
            "course_name": "Scientific Integrity & Responsible Conduct Rsch",
            "description": "BMSC-GA 2000 Scientific Integrity & Responsible Conduct Rsch \nThis is a 10-week course, which meets each spring semester for approximately 1.5 hours per week. Students are required to complete readings and attend small group discussions (consisting of 10 students each). Each discussion group is led by a senior graduate student or postdoctoral fellow who presents different case studies on the lecture topic presented that week. Written materials and other resources may be given out each week. To demonstrate the trainees? comprehension and retention of information presented during the course, a written examination must be passed.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2001",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1106",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Tranguch, Susanne; Wilson, Angus",
                    "time": "Tue,Thu,Fri 9.00 AM - 10.30 AM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 2001\n\n   Foundations of Cell & Molecular Biology I\n\nThis course provides a broad overview of gene expression, nuclear organization and nucleic acid metabolism. Part I consists of five weekly group discussions covering fundamental methodologies applicable to many areas of cell and molecular biology and introduces students to the art of reading of the primary scientific literature. Part II features nine weeks of intensive lectures and weekly discussion groups organized into timely themes such as control of gene transcription, chromatin structure and epigenetics, telomere biology, DNA replication and recombination, synthesis and folding of functio...\n\n      more description for BMSC-GA 2001 »\n\n      \n\n\n\nThis course provides a broad overview of gene expression, nuclear organization and nucleic acid metabolism. Part I consists of five weekly group discussions covering fundamental methodologies applicable to many areas of cell and molecular biology and introduces students to the art of reading of the primary scientific literature. Part II features nine weeks of intensive lectures and weekly discussion groups organized into timely themes such as control of gene transcription, chromatin structure and epigenetics, telomere biology, DNA replication and recombination, synthesis and folding of functional proteins, and RNA processing. The course emphasizes fundamental molecular processes that underlie almost all aspects of current research in molecular, cellular and developmental biology.\n\n      less description for BMSC-GA 2001 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2002",
            "course_name": "",
            "description": "BMSC-GA 2002\n\n   Foundations of Cell and Molecular Biology II\n\nIntensive, two-semester course. Provides a broad overview of nucleic acid and protein metabolism and function. The spring semester covers various aspects of cell biology, signal transduction, and genetics. Topics include biogenesis of cellular membranes; vesicular transport; the cytoskeleton; cell differentiation and development; concepts in receptor signaling; and genetics of model organisms. Each semester is comprised of two or three modules that differ somewhat in organization, including the number of required lectures. Each module places significant emphasis on student-led discussions. The...\n\n      more description for BMSC-GA 2002 »\n\n      \n\n\n\nIntensive, two-semester course. Provides a broad overview of nucleic acid and protein metabolism and function. The spring semester covers various aspects of cell biology, signal transduction, and genetics. Topics include biogenesis of cellular membranes; vesicular transport; the cytoskeleton; cell differentiation and development; concepts in receptor signaling; and genetics of model organisms. Each semester is comprised of two or three modules that differ somewhat in organization, including the number of required lectures. Each module places significant emphasis on student-led discussions. The reading of primary research articles is heavily stressed. Grades are assigned on the basis of examination, essay, and discussion scores.\n\n      less description for BMSC-GA 2002 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2003",
            "course_name": "Genetics",
            "description": "BMSC-GA 2003 Genetics",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2004",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1107",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hubbard, Stevan",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 2004\n\n   Molecular Mechanisms in Biology\n\nThe goal of this course is to provide students with an in-depth understanding of the structures of proteins and nucleic acids, the modes of interaction that underlie protein-protein and protein-nucleic acid recognition, and how knowledge of macromolecular structure leads to an understanding of biological processes. Topics include enzyme structure and mechanism, membrane proteins, ligand-receptor recognition, protein-protein interactions in signal transduction, molecular machines, and protein-nucleic acid recognition. The class meets three times per week?two lectures and one discussion session....\n\n      more description for BMSC-GA 2004 »\n\n      \n\n\n\nThe goal of this course is to provide students with an in-depth understanding of the structures of proteins and nucleic acids, the modes of interaction that underlie protein-protein and protein-nucleic acid recognition, and how knowledge of macromolecular structure leads to an understanding of biological processes. Topics include enzyme structure and mechanism, membrane proteins, ligand-receptor recognition, protein-protein interactions in signal transduction, molecular machines, and protein-nucleic acid recognition. The class meets three times per week?two lectures and one discussion session.\n\n      less description for BMSC-GA 2004 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1108",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Chesler, Mitchell",
                    "time": "Mon,Wed 9.00 AM - 11.00 AM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 2005\n\n   Intro to Cell Neurosci\n\nIntroduction to the anatomy, cell biology, molecular structure, and physiology of neurons and glial cells. Equips students with the skills necessary to read the contemporary neuroscience literature as well as provides a grounding in the fundamental concepts of cellular neurobiology. Emphasis is on basic cellular and molecular mechanisms used by neurons to receive, integrate, and transmit information. Subjects covered include the fine structural anatomy and electrophysiological properties of neurons and glia, the role of ion channels in intracellular and intercellular communication, mechanisms ...\n\n      more description for BMSC-GA 2005 »\n\n      \n\n\n\nIntroduction to the anatomy, cell biology, molecular structure, and physiology of neurons and glial cells. Equips students with the skills necessary to read the contemporary neuroscience literature as well as provides a grounding in the fundamental concepts of cellular neurobiology. Emphasis is on basic cellular and molecular mechanisms used by neurons to receive, integrate, and transmit information. Subjects covered include the fine structural anatomy and electrophysiological properties of neurons and glia, the role of ion channels in intracellular and intercellular communication, mechanisms of synaptic transmission and integration, biochemistry and physiology of neurotransmitters, and regulation of neuronal function by gene expression.\n\n      less description for BMSC-GA 2005 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2006",
            "course_name": "Intro to Integrative, Develop & Cog Neurosci",
            "description": "BMSC-GA 2006 Intro to Integrative, Develop & Cog Neurosci",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2009",
            "course_name": "Neuroscience",
            "description": "BMSC-GA 2009 Neuroscience",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2010",
            "course_name": "",
            "description": "BMSC-GA 2010\n\n   Medical & Molecular Parasitology\n\nThe course will provide an in-depth analysis of the cellular, immunological, molecular and genetic mechanisms in parasite biology and parasite-host interactions. Topics will include mechanisms of host cell invasion, host innate and adaptative immune response, parasite genome structure and expression, antigenic variability, immune evasion, vaccine design, epidemiology, genetics, genomics and vector-parasite interactions. The course will cover a variety of parasites and their insect vectors. Protozoan (Plasmodium, Leishmania, Trypanosoma, Toxoplasma, Entamoeba, Trichomonas) and metazoan (Schisto...\n\n      more description for BMSC-GA 2010 »\n\n      \n\n\n\nThe course will provide an in-depth analysis of the cellular, immunological, molecular and genetic mechanisms in parasite biology and parasite-host interactions. Topics will include mechanisms of host cell invasion, host innate and adaptative immune response, parasite genome structure and expression, antigenic variability, immune evasion, vaccine design, epidemiology, genetics, genomics and vector-parasite interactions. The course will cover a variety of parasites and their insect vectors. Protozoan (Plasmodium, Leishmania, Trypanosoma, Toxoplasma, Entamoeba, Trichomonas) and metazoan (Schistosoma, Trichinella) parasites which cause disease in humans will be studied.\n\n      less description for BMSC-GA 2010 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2013",
            "course_name": "Bio Cells/Tissues/Organs",
            "description": "BMSC-GA 2013 Bio Cells/Tissues/Organs",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2014",
            "course_name": "Gross Anatomy",
            "description": "BMSC-GA 2014 Gross Anatomy",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2016",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1955",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "1960",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Special Topics in Cell and Molecular Biology",
            "description": "BMSC-GA 2016 Special Topics in Cell and Molecular Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2017",
            "course_name": "Advanced Tissues & Organs: Special Topics",
            "description": "BMSC-GA 2017 Advanced Tissues & Organs: Special Topics \nThe focus of this course is autoimmunity and the GU & Endocrine systems; open to both first and second year students, including non-Pathobiology students.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2051",
            "course_name": "Gross Anatomy I",
            "description": "BMSC-GA 2051 Gross Anatomy I",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2103",
            "course_name": "Molec Genetics, Biochem and Cell Biology",
            "description": "BMSC-GA 2103 Molec Genetics, Biochem and Cell Biology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2104",
            "course_name": "Special Tpcs in Cell Bio",
            "description": "BMSC-GA 2104 Special Tpcs in Cell Bio",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2110",
            "course_name": "Rdg Biochem/Mol+Cel Bio",
            "description": "BMSC-GA 2110 Rdg Biochem/Mol+Cel Bio",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2202",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2443",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Torres, Victor J",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 2202\n\n   Microbiology\n\nThis course is roughly divided into two sections: virology and bacteriology/ mycology. The virology section covers viral structure, classification, and replication; viral pathogenesis; antiviral drugs; viral oncogenesis; host-parasite interactions; and methods of prevention. The bacteriology/mycology section covers bacterial structure, function, and classification; microbial adaptation (genetics, genetics of pathogenesis, and antibiotic resistance); mechanisms of microbial pathogenesis; antibiotic design and targets; host-parasite interactions; epidemiology of infectious disease; and methods o...\n\n      more description for BMSC-GA 2202 »\n\n      \n\n\n\nThis course is roughly divided into two sections: virology and bacteriology/ mycology. The virology section covers viral structure, classification, and replication; viral pathogenesis; antiviral drugs; viral oncogenesis; host-parasite interactions; and methods of prevention. The bacteriology/mycology section covers bacterial structure, function, and classification; microbial adaptation (genetics, genetics of pathogenesis, and antibiotic resistance); mechanisms of microbial pathogenesis; antibiotic design and targets; host-parasite interactions; epidemiology of infectious disease; and methods of prevention.\n\n      less description for BMSC-GA 2202 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2204",
            "course_name": "Human Genetics",
            "description": "BMSC-GA 2204 Human Genetics",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2210",
            "course_name": "Molecular Virology",
            "description": "BMSC-GA 2210 Molecular Virology \nThis course is an introduction to the molecular biology and pathogenesis of animal viruses. Twenty lectures cover fundamental aspects of the viral life cycle (viral entry into cells, replication, transformation, control of translation) host response (innate and acquired immune response) and explore the biology of a number of medically important RNA and DNA viruses, including some emerging pathogens. Selected readings assigned by the lecturers are discussed in separate sections",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2213",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1109",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Klein, Hannah",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Genetics",
            "description": "BMSC-GA 2213 Genetics \nTransmission genetics in diploid organisms. Principles and methods of genetic analysis in diploid organisms?including Drosophila, worms, zebrafish, plants, mice, and humans?are emphasized. Classes include lectures, problem solving, and discussion of primary literature. Topics include linkage, gene interactions, mapping, mutagenesis, clonal analysis, sex determination, transgenic studies, use of mosaics, imprinting, and methods of study in human genetics.",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2214",
            "course_name": "Genetics I",
            "description": "BMSC-GA 2214 Genetics I",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2215",
            "course_name": "Int Cmp&Cmp Prg Biomd Sc",
            "description": "BMSC-GA 2215 Int Cmp&Cmp Prg Biomd Sc",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2306",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1110",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 2306\n\n   Intro to Immunology\n\nThis comprehensive core course, designed for research-oriented students, provides a broad but intensive examination of the immune response, with a special emphasis on the experimental approaches that led to our current understanding of immunological principles. Students are assigned weekly reading in the form of textbook chapters and a primary research paper. Students and faculty discuss the textbook information during one session each week, and regular quizzes on this information provide feedback to all students on their preparation and progress. Critical analysis of the original research art...\n\n      more description for BMSC-GA 2306 »\n\n      \n\n\n\nThis comprehensive core course, designed for research-oriented students, provides a broad but intensive examination of the immune response, with a special emphasis on the experimental approaches that led to our current understanding of immunological principles. Students are assigned weekly reading in the form of textbook chapters and a primary research paper. Students and faculty discuss the textbook information during one session each week, and regular quizzes on this information provide feedback to all students on their preparation and progress. Critical analysis of the original research articles in a discussion format is held on Fridays. The research papers form the starting point for a dialogue between students and faculty that probes intellectual and practical questions in immunology research, venturing beyond the material presented in the papers into related issues and current research.\n\n      less description for BMSC-GA 2306 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2308",
            "course_name": "Advanced Immunology",
            "description": "BMSC-GA 2308 Advanced Immunology \nStudents are assigned two to three ?papers of the week,? which are sent by e-mail a week in advance of the seminar. Students are selected to present the papers to fellow classmates and faculty. The papers are discussed for their significance (questions addressed and their relevance), techniques utilized, analysis of data, and perspectives.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2309",
            "course_name": "General Pathology",
            "description": "BMSC-GA 2309 General Pathology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2318",
            "course_name": "Molecular Oncology",
            "description": "BMSC-GA 2318 Molecular Oncology \nStudies the molecular basis of cancer. Topics include somatic mutations and DNA repair mechanisms; viral systems relevant to cellular transformation and human cancer; the pathogenesis of cancer as a consequence of alterations in oncogenes; growth factor genes and tumor suppressor genes, with emphasis on the function of their normal counterparts; tumor progression; mechanisms of metastasis; and tumor immunology.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2321",
            "course_name": "Genetic Toxicology",
            "description": "BMSC-GA 2321 Genetic Toxicology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2322",
            "course_name": "Subcell/Molecular Pathlg",
            "description": "BMSC-GA 2322 Subcell/Molecular Pathlg",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2324",
            "course_name": "Dna Replication & Repair",
            "description": "BMSC-GA 2324 Dna Replication & Repair",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2401",
            "course_name": "Principles in Pharmacol",
            "description": "BMSC-GA 2401 Principles in Pharmacol \nThis course is a combination of lectures, workshops, and seminars. The lectures and workshops are part of the Medical Pharmacology course for medical students. Topics include pharmacokinetics, pharmacodynamics, drug metabolism, drug receptors, and drugs affecting the nervous system. The seminars, for graduate students only, are designed to introduce the students to the use of molecular pharmacology in drug development.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2402",
            "course_name": "Pharmacology",
            "description": "BMSC-GA 2402 Pharmacology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2404",
            "course_name": "",
            "description": "BMSC-GA 2404\n\n   Molecular Signalling\n\nThis course, divided into two parts, focuses on modern drug design and discovery. In the first part, lectures relating to modern drug design discuss structure/function analysis, rational drug design, combinatorial chemistry, automation, target discovery, and gene-based therapies. In the second part, lectures relating to drug discovery as it applies to biology and medicine discuss peptides as inhibitors of amyloidosis, receptors and AIDS, angiogenic inhibitors, anti-obesity peptides, vaccine development for malaria, inflammation, anticancer drugs, and factors that control neuronal survival/deat...\n\n      more description for BMSC-GA 2404 »\n\n      \n\n\n\nThis course, divided into two parts, focuses on modern drug design and discovery. In the first part, lectures relating to modern drug design discuss structure/function analysis, rational drug design, combinatorial chemistry, automation, target discovery, and gene-based therapies. In the second part, lectures relating to drug discovery as it applies to biology and medicine discuss peptides as inhibitors of amyloidosis, receptors and AIDS, angiogenic inhibitors, anti-obesity peptides, vaccine development for malaria, inflammation, anticancer drugs, and factors that control neuronal survival/death. Each student is expected to write a research paper related to one of these topics. One session is devoted to business considerations in drug development, including interactions between academia and industry. At the end of the course, each student writes a plan for developing a new drug that is related to topics in the course or that utilizes methodology discussed in the course. This plan includes a short introduction, a description of the experimental design, and a discussion of the expected outcomes.\n\n      less description for BMSC-GA 2404 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2406",
            "course_name": "",
            "description": "BMSC-GA 2406\n\n   Molecular Pharmacology of Receptors\n\nThis course gives an overview of the principles in pharmacology, modern approaches to studying pharmacology, and molecular aspects of receptors and signal transduction. The course is divided into three parts. The first part, introduction to molecular pharmacology, focuses on some of the basic concepts in signaling, drug-receptor interactions, and pharmacokinetics. The second part, modern approaches to pharmacological research, emphasizes methods such as crystallography, mass spectrometry, and genetic studies with Drosophila and C. elegans as pharmacological tools. The third part, applications ...\n\n      more description for BMSC-GA 2406 »\n\n      \n\n\n\nThis course gives an overview of the principles in pharmacology, modern approaches to studying pharmacology, and molecular aspects of receptors and signal transduction. The course is divided into three parts. The first part, introduction to molecular pharmacology, focuses on some of the basic concepts in signaling, drug-receptor interactions, and pharmacokinetics. The second part, modern approaches to pharmacological research, emphasizes methods such as crystallography, mass spectrometry, and genetic studies with Drosophila and C. elegans as pharmacological tools. The third part, applications of pharmacology research, focuses on the structure and function of tyrosine kinase receptors, receptor phosphatases, G protein receptors, insulin receptors, steroid/thyroid hormone nuclear receptor gene family, glycoproteins and proteoglycans of the nervous system, recycling and internalization of receptors, exocytosis and receptors for neurotransmitters, and proteolytic processing of receptors and ligands. Classes include lectures as well as weekly discussions on selected papers.\n\n      less description for BMSC-GA 2406 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2409",
            "course_name": "Physical Biochemistry",
            "description": "BMSC-GA 2409 Physical Biochemistry",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2410",
            "course_name": "Global Burden of Infectious Disease",
            "description": "BMSC-GA 2410 Global Burden of Infectious Disease",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2411",
            "course_name": "Free Radical Mechanism in Biology",
            "description": "BMSC-GA 2411 Free Radical Mechanism in Biology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2413",
            "course_name": "Free Radical Mechanisms in Biology",
            "description": "BMSC-GA 2413 Free Radical Mechanisms in Biology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2420",
            "course_name": "Genetic Epidemiology",
            "description": "BMSC-GA 2420 Genetic Epidemiology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2440",
            "course_name": "Emerging Diseases & Bioterrorism",
            "description": "BMSC-GA 2440 Emerging Diseases & Bioterrorism",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2450",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1111",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "1112",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced Epidemiology",
            "description": "BMSC-GA 2450 Advanced Epidemiology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2503",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1113",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Mammalian Physiology",
            "description": "BMSC-GA 2503 Mammalian Physiology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2504",
            "course_name": "Synaptic Transmission",
            "description": "BMSC-GA 2504 Synaptic Transmission",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2506",
            "course_name": "Neuronal Integration",
            "description": "BMSC-GA 2506 Neuronal Integration",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2507",
            "course_name": "Electrobiology of The Mammalian Cns",
            "description": "BMSC-GA 2507 Electrobiology of The Mammalian Cns",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2511",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1114",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Krogsgaard, Michelle",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorial in Structural Biology",
            "description": "BMSC-GA 2511 Tutorial in Structural Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2513",
            "course_name": "Sem Sensory Physiology",
            "description": "BMSC-GA 2513 Sem Sensory Physiology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2603",
            "course_name": "Adv Tpcs in Structural Biology",
            "description": "BMSC-GA 2603 Adv Tpcs in Structural Biology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2604",
            "course_name": "",
            "description": "BMSC-GA 2604\n\n   Bioinformatics\n\nThis practical course in bioinformatics emphasizes the use of computers as a tool in molecular biology research. The course devotes approximately equal time to applications available on the Web and to those available at the School of Medicine?s Research Computing Resource. Rather than teach specific commands, discussions emphasize underlying principles that enable scientists to make better use of computer programs. Includes an introduction to the VMS operating system, the basics of computer communications (telnet, e-mail, Usenet, and the WWW), using sequence databases, similarity searching, mu...\n\n      more description for BMSC-GA 2604 »\n\n      \n\n\n\nThis practical course in bioinformatics emphasizes the use of computers as a tool in molecular biology research. The course devotes approximately equal time to applications available on the Web and to those available at the School of Medicine?s Research Computing Resource. Rather than teach specific commands, discussions emphasize underlying principles that enable scientists to make better use of computer programs. Includes an introduction to the VMS operating system, the basics of computer communications (telnet, e-mail, Usenet, and the WWW), using sequence databases, similarity searching, multiple alignment, DNA sequencing, and phylogenetics.\n\n      less description for BMSC-GA 2604 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2605",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1115",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Ziff, Edward",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorial",
            "description": "BMSC-GA 2605 Tutorial",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2606",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1116",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hubbard, E",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tut:",
            "description": "BMSC-GA 2606 Tut:",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2607",
            "course_name": "Advanced Topics in Microbial Pathogenesis",
            "description": "BMSC-GA 2607 Advanced Topics in Microbial Pathogenesis \nThe objective of this course is to familarize students with an integrative approach to host-parasite interactions. Microbial diseases are the result of a very complex interaction between the parasite and the host. Recent developments in the genetics and physiology of pathogens as well as in the immune response of the host make microbial pathogenesis a very exciting field of research. This course provides an integrative view of different pathogens.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2608",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1117",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Chao, Moses",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "1969",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorial:",
            "description": "BMSC-GA 2608 Tutorial:",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2609",
            "course_name": "Developmental Systems II",
            "description": "BMSC-GA 2609 Developmental Systems II \nFundamental questions, concepts, and methodologies of modern inquiry into the genetic and epigenetic mechanisms of development are explored through lectures, readings in the primary literature, and laboratory work.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2610",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1118",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Developmental Systems I",
            "description": "BMSC-GA 2610 Developmental Systems I \nExplores fundamental questions, concepts, and methodologies of modern inquiry into the genetic and epigenetic mechanisms of development through lectures, readings in the primary literature, and laboratory work. Topics include embryonic axis determination, region-specific gene expression, cell specification through cell-cell interaction, gastrulation, and organogenesis.",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2611",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1119",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "1120",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "1121",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "1842",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "1968",
                    "section": "007",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorial:Tutorial in Cell Biology",
            "description": "BMSC-GA 2611 Tutorial:Tutorial in Cell Biology \nNeuroscience graduate students are required to take a sequence of tutorials during the spring semester of their first year in the program.",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2616",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1122",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 2616\n\n   Tutorial:\n\nThis course is an introduction to the range of eukaryotic organisms that causes disease in humans. The course covers the helminths and the protozoan parasites and studies insects as both agents and vectors of human disease. For each pathogen, students learn its life history, epidemiology, clinical features of the disease it causes, and pathogenesis. The course also covers the basic principles of laboratory diagnosis and treatment. In the laboratory sessions, students look at prepared slides, make wet mounts of live parasites, and learn to prepare thick and thin blood films for diagnosis of mal...\n\n      more description for BMSC-GA 2616 »\n\n      \n\n\n\nThis course is an introduction to the range of eukaryotic organisms that causes disease in humans. The course covers the helminths and the protozoan parasites and studies insects as both agents and vectors of human disease. For each pathogen, students learn its life history, epidemiology, clinical features of the disease it causes, and pathogenesis. The course also covers the basic principles of laboratory diagnosis and treatment. In the laboratory sessions, students look at prepared slides, make wet mounts of live parasites, and learn to prepare thick and thin blood films for diagnosis of malaria. At the end of the course, the students work on group projects that address questions such as: (1) Do helminth infections protect against the development of autoimmune diseases? (2) Will there ever be a malaria vThis course is an introduction to the range of eukaryotic organisms that causes disease in humans. The course covers the helminths and the protozoan parasites and studies insects as both agents and vectors of human disease. For each pathogen, students learn its life history, epidemiology, clinical features of the disease it causes, and pathogenesis. The course also covers the basic principles of laboratory diagnosis and treatment. In the laboratory sessions, students look at prepared slides, make wet mounts of live parasites, and learn to prepare thick and thin blood films for diagnosis of malaria. At the end of the course, the students work on group projects that address questions such as: (1) Do helminth infections protect against the development of autoimmune diseases? (2) Will there ever be a malaria vaccine? 3. Do parasites always evolve towards less virulence?\n\n      less description for BMSC-GA 2616 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2617",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1123",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorial: Biomedical Imaging",
            "description": "BMSC-GA 2617 Tutorial: Biomedical Imaging",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2701",
            "course_name": "Parasitology II",
            "description": "BMSC-GA 2701 Parasitology II",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2702",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1823",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Rodriguez, Ana; Rodriguez, Ana09/02/2015 - 12/15/2015 Fri 2.00 PM - 4.00 PM",
                    "time": "Tue 3.00 PM - 5.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Parasitology I",
            "description": "BMSC-GA 2702 Parasitology I",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 2703",
            "course_name": "Immunity to Parasites",
            "description": "BMSC-GA 2703 Immunity to Parasites",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2704",
            "course_name": "Methods in Parasitology",
            "description": "BMSC-GA 2704 Methods in Parasitology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2705",
            "course_name": "Molecular Evolution",
            "description": "BMSC-GA 2705 Molecular Evolution",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2706",
            "course_name": "Advanced Topics in Microbial Pathogenesis",
            "description": "BMSC-GA 2706 Advanced Topics in Microbial Pathogenesis",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2707",
            "course_name": "Medical Statistics I",
            "description": "BMSC-GA 2707 Medical Statistics I",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 2708",
            "course_name": "Medical Statistics II",
            "description": "BMSC-GA 2708 Medical Statistics II",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3001",
            "course_name": "Research in Anatomy",
            "description": "BMSC-GA 3001 Research in Anatomy",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3002",
            "course_name": "Research in Anatomy",
            "description": "BMSC-GA 3002 Research in Anatomy",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3007",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1124",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Wilson-Abdul-Malik, Laura",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research Cell Biology",
            "description": "BMSC-GA 3007 Research Cell Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3008",
            "course_name": "Research in Cell Biology",
            "description": "BMSC-GA 3008 Research in Cell Biology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3011",
            "course_name": "Rsch Environmntl Oncolog",
            "description": "BMSC-GA 3011 Rsch Environmntl Oncolog",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3012",
            "course_name": "Rsch Environmntl Oncolog",
            "description": "BMSC-GA 3012 Rsch Environmntl Oncolog",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3013",
            "course_name": "Sem Environmntl Oncology",
            "description": "BMSC-GA 3013 Sem Environmntl Oncology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3014",
            "course_name": "Sem Environmentl Oncolog",
            "description": "BMSC-GA 3014 Sem Environmentl Oncolog",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3025",
            "course_name": "NYU-STEP Individual Development Plan",
            "description": "BMSC-GA 3025 NYU-STEP Individual Development Plan",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3101",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1125",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Ziff, Edward",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Biochemistry",
            "description": "BMSC-GA 3101 Research in Biochemistry",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3102",
            "course_name": "Research in Biochemistry",
            "description": "BMSC-GA 3102 Research in Biochemistry",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3111",
            "course_name": "Seminar in Biochemistry",
            "description": "BMSC-GA 3111 Seminar in Biochemistry",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3112",
            "course_name": "Seminar in Biochemistry",
            "description": "BMSC-GA 3112 Seminar in Biochemistry",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3115",
            "course_name": "Seminar in Cell Biology",
            "description": "BMSC-GA 3115 Seminar in Cell Biology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3116",
            "course_name": "Seminar in Cell Biology",
            "description": "BMSC-GA 3116 Seminar in Cell Biology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3201",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1126",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Belasco, Joel",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Rsch in Microbiology",
            "description": "BMSC-GA 3201 Rsch in Microbiology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3202",
            "course_name": "Research in Microbiology",
            "description": "BMSC-GA 3202 Research in Microbiology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3211",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1127",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Pearson, Melanie",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Seminar in Microbiology",
            "description": "BMSC-GA 3211 Seminar in Microbiology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3212",
            "course_name": "Seminar in Microbiology",
            "description": "BMSC-GA 3212 Seminar in Microbiology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3301",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1128",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Levy, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Pathology",
            "description": "BMSC-GA 3301 Research in Pathology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3302",
            "course_name": "Research in Pathology",
            "description": "BMSC-GA 3302 Research in Pathology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3311",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1129",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Levy, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Seminar in Pathology",
            "description": "BMSC-GA 3311 Seminar in Pathology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3312",
            "course_name": "Seminar in Pathology",
            "description": "BMSC-GA 3312 Seminar in Pathology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3401",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1130",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "David, Gregory",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Pharmacology",
            "description": "BMSC-GA 3401 Research in Pharmacology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3402",
            "course_name": "Research in Pharmacology",
            "description": "BMSC-GA 3402 Research in Pharmacology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3403",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1131",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Nance, Jeremy",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Rsch in Develop Genetics",
            "description": "BMSC-GA 3403 Rsch in Develop Genetics",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3404",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1132",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hubbard, E",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Developmental Genetics",
            "description": "BMSC-GA 3404 Developmental Genetics",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3411",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1133",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Bach, Erika",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Seminar in Pharmacology",
            "description": "BMSC-GA 3411 Seminar in Pharmacology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3412",
            "course_name": "Seminar in Pharmacology",
            "description": "BMSC-GA 3412 Seminar in Pharmacology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3501",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1134",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Physiology & Neuroscience",
            "description": "BMSC-GA 3501 Research in Physiology & Neuroscience",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3502",
            "course_name": "Rsch Physiology/Neurosci",
            "description": "BMSC-GA 3502 Rsch Physiology/Neurosci",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3507",
            "course_name": "Sem Physiology/Biophysic",
            "description": "BMSC-GA 3507 Sem Physiology/Biophysic",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3508",
            "course_name": "Sem Physiology/Neurosci",
            "description": "BMSC-GA 3508 Sem Physiology/Neurosci",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3701",
            "course_name": "Research in Parasitology",
            "description": "BMSC-GA 3701 Research in Parasitology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3702",
            "course_name": "Research in Parasitology",
            "description": "BMSC-GA 3702 Research in Parasitology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3711",
            "course_name": "Seminar in Parasitology",
            "description": "BMSC-GA 3711 Seminar in Parasitology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3712",
            "course_name": "Seminar in Parasitology",
            "description": "BMSC-GA 3712 Seminar in Parasitology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 3713",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1135",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Structural Biology",
            "description": "BMSC-GA 3713 Research in Structural Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 3715",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1136",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Krogsgaard, Michelle",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Seminar in Molecular Biophysics",
            "description": "BMSC-GA 3715 Seminar in Molecular Biophysics",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4012",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1137",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Reading Course in Biochemistry",
            "description": "BMSC-GA 4012 Reading Course in Biochemistry",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4013",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1138",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Readings in Microbiology",
            "description": "BMSC-GA 4013 Readings in Microbiology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4111",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1139",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Reading Course in Pharmacology",
            "description": "BMSC-GA 4111 Reading Course in Pharmacology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4112",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1140",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Reading Course in Molecular Oncology",
            "description": "BMSC-GA 4112 Reading Course in Molecular Oncology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4115",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1141",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Levy, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Reading Course in Immunology",
            "description": "BMSC-GA 4115 Reading Course in Immunology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4116",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1142",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Reading Course in Cell Biology",
            "description": "BMSC-GA 4116 Reading Course in Cell Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4401",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1143",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Reading Course in Developmental Genetics",
            "description": "BMSC-GA 4401 Reading Course in Developmental Genetics",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4402",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1144",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Reading Course in Structural Biology",
            "description": "BMSC-GA 4402 Reading Course in Structural Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4403",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1145",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced Techniques in Structural Biology",
            "description": "BMSC-GA 4403 Advanced Techniques in Structural Biology \nThis course teaches students the underlying theory and techniques used in X-ray crystallography, electron microscopy, NMR spectroscopy, mass spectrometry, and computer modeling. The information in this course enables students to pursue their dissertation research in structural biology. Topics include X-ray diffraction, phasing, and refinement; cryoelectron microscopy, image processing, and tomography; multidimensional NMR spectroscopy; MALDI-TOF and Q-TOF mass spectrometry; and ab initio and homology modeling of proteins.",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4404",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1146",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Collins, Christopher",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Fund Concepts Magnetic Resonance Imaging (Mri)",
            "description": "BMSC-GA 4404 Fund Concepts Magnetic Resonance Imaging (Mri) \nMagnetic resonance imaging is a fast-growing interdisciplinary field. In this course, students learn how the knowledge they gain from their education in physics, chemistry, mathematics, and computer science can be utilized to further understand the biomedical sciences.",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4405",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1147",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study in Structural Biology",
            "description": "BMSC-GA 4405 Independent Study in Structural Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4406",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1148",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Loomis, Cynthia",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Intro to Tissues and Organ Systems",
            "description": "BMSC-GA 4406 Intro to Tissues and Organ Systems \nThis survey course and its accompanying laboratory are the cornerstone for the newly developed graduate training program in pathobiology. The specific goal of this course is to provide an overview of the basic development and physiology of mammalian tissues and organs and introduce the tools, techniques, and strategies important in the study of in vivo model systems for human disease.",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4407",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "1149",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Loomis, Cynthia",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Intro to Histopathology Laboratory",
            "description": "BMSC-GA 4407 Intro to Histopathology Laboratory \nThis introductory laboratory course must be taken in conjunction with the lecture course Tissues and Organ Systems. The specific goal of this laboThis introductory laboratory course must be taken in conjunction with the lecture course Tissues and Organ Systems. The specific goal of this laboratory course is to introduce students to the tools, techniques, and strategies necessary for the study of in vivo model systems for human disease.",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4408",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1150",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Stokes, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 4408\n\n   Cryoelectron Microscopy of Macromolecular Assembles\n\nThis comprehensive course covers the theory and practice of solving molecular structures by electron microscopy. The course starts with optics, sample preparation, and a basic mathematical description of diffraction before moving into a detailed exploration of the three main methods of structure determination: electron crystallography, single particle analysis, and electron tomography. The course ends with a discussion of map interpretation and molecular fitting. This is predominantly a lecture course involving one 2-hour lecture per week accompanied by a discussion session and an occasional p...\n\n      more description for BMSC-GA 4408 »\n\n      \n\n\n\nThis comprehensive course covers the theory and practice of solving molecular structures by electron microscopy. The course starts with optics, sample preparation, and a basic mathematical description of diffraction before moving into a detailed exploration of the three main methods of structure determination: electron crystallography, single particle analysis, and electron tomography. The course ends with a discussion of map interpretation and molecular fitting. This is predominantly a lecture course involving one 2-hour lecture per week accompanied by a discussion session and an occasional practical session using the facilities at the New York Structural Biology Center. Lectures are given by expert electron microscopists from around New York City, and students from various campuses are encouraged to attend.\n\n      less description for BMSC-GA 4408 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4409",
            "course_name": "",
            "description": "BMSC-GA 4409\n\n   Adv Magnetic Resonance Imaging\n\nThis course continues from Fundamentals of MRI, taught in the fall, and successful completion of the fall course is a prerequisite. The course introduces and utilizes mathematical concepts such as the Fourier transform, k-space, and the Bloch equations to describe the physical and mathematical principles governing data acquisition and image reconstruction. Topics covered include diffusion, perfusion, functional brain imaging, cardiac MRI, spectroscopic imaging, clinical MRI, rf engineering, contrast agents, and molecular imaging. This course includes weekly lectures, discussion sessions revolv...\n\n      more description for BMSC-GA 4409 »\n\n      \n\n\n\nThis course continues from Fundamentals of MRI, taught in the fall, and successful completion of the fall course is a prerequisite. The course introduces and utilizes mathematical concepts such as the Fourier transform, k-space, and the Bloch equations to describe the physical and mathematical principles governing data acquisition and image reconstruction. Topics covered include diffusion, perfusion, functional brain imaging, cardiac MRI, spectroscopic imaging, clinical MRI, rf engineering, contrast agents, and molecular imaging. This course includes weekly lectures, discussion sessions revolving around assigned research articles, and practical labs pertinent to material covered in the lectures.\n\n      less description for BMSC-GA 4409 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4410",
            "course_name": "",
            "description": "BMSC-GA 4410\n\n   Advanced Tissues & Organs: Cardiovascular and Pulmonary Systems\n\nThis course combines a practical lab component with lectures and discussions. The first half of the course focuses on three complex organ systems: the cardiovascular, endocrine, and nervous systems. The goals are to understand the individual systems as well as their interactions with other systems and resulting impact on the function or dysfunction of the organism as a whole. The goal of the second half of the course is to provide a strong foundation in basic immunology and the host response to infectious, inflammatory, and autoimmune stimuli. The laboratory sessions provide a more robust, thr...\n\n      more description for BMSC-GA 4410 »\n\n      \n\n\n\nThis course combines a practical lab component with lectures and discussions. The first half of the course focuses on three complex organ systems: the cardiovascular, endocrine, and nervous systems. The goals are to understand the individual systems as well as their interactions with other systems and resulting impact on the function or dysfunction of the organism as a whole. The goal of the second half of the course is to provide a strong foundation in basic immunology and the host response to infectious, inflammatory, and autoimmune stimuli. The laboratory sessions provide a more robust, three-dimensional understanding of normal organ function as well as better conceptualization of the underlying cellular processes leading to disease.\n\n      less description for BMSC-GA 4410 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4411",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1841",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Erlebacher, Adrian",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 4411\n\n   Pathobiology of Disease\n\nThis course focuses on the molecular, cellular, and organismal basis of disease pathogenesis and how modern experimental approaches have led to new therapies. Students take the course in the spring semester of both their first and second years. Each year, the course discusses two complex disease entities. The course is based on student presentations and the critical evaluation of selected papers from the contemporary literature. There is also a writing component to the course: Students write their own abstracts to existing papers that approach disease pathophysiology in whole animal models. Th...\n\n      more description for BMSC-GA 4411 »\n\n      \n\n\n\nThis course focuses on the molecular, cellular, and organismal basis of disease pathogenesis and how modern experimental approaches have led to new therapies. Students take the course in the spring semester of both their first and second years. Each year, the course discusses two complex disease entities. The course is based on student presentations and the critical evaluation of selected papers from the contemporary literature. There is also a writing component to the course: Students write their own abstracts to existing papers that approach disease pathophysiology in whole animal models. This exercise helps students learn how to distill core data from in vivo experiments, and to appreciate the inherent advantages and limitations of in vivo approaches.\n\n      less description for BMSC-GA 4411 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4413",
            "course_name": "",
            "description": "BMSC-GA 4413\n\n   Stem Cell Biology\n\nThis course will cover a broad range of topics relevant to stem cell biology. This fast-moving field brings together many aspects of basic and applied biology and medicine including development, regeneration/repair, and cancer. The course will cover these topics in four parts: concepts and themes (including adult, embryonic, germline stem cells, general molecular themes), stem cell biology relevant to specific organ systems, stem cells and cancer, and therapeutics and ethics. The lecture/discussion format will give students both a broad background and the opportunity to apply critical thinking...\n\n      more description for BMSC-GA 4413 »\n\n      \n\n\n\nThis course will cover a broad range of topics relevant to stem cell biology. This fast-moving field brings together many aspects of basic and applied biology and medicine including development, regeneration/repair, and cancer. The course will cover these topics in four parts: concepts and themes (including adult, embryonic, germline stem cells, general molecular themes), stem cell biology relevant to specific organ systems, stem cells and cancer, and therapeutics and ethics. The lecture/discussion format will give students both a broad background and the opportunity to apply critical thinking skills to recent data in the field\n\n      less description for BMSC-GA 4413 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4414",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1906",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Rice, Margaret",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 4414\n\n   Disorders of The Nervous System\n\nThis course will address disorders of the nervous system, using examples selected from several of the the major classes of CNS disorders. The first lectures will address developmental disorders, followed by disorders of sensory systems. Subsequently there will be a series of topics that address neurological and psychiatric diseases with complex or heterogeneous etiology, such as schizophrenia and epilepsy. Neurodegenerative disorders and brain injury will(also be addressed. Finally, examples of cancer and infectious diseases that target the CNS will be presented. For each topic, a clinical ove...\n\n      more description for BMSC-GA 4414 »\n\n      \n\n\n\nThis course will address disorders of the nervous system, using examples selected from several of the the major classes of CNS disorders. The first lectures will address developmental disorders, followed by disorders of sensory systems. Subsequently there will be a series of topics that address neurological and psychiatric diseases with complex or heterogeneous etiology, such as schizophrenia and epilepsy. Neurodegenerative disorders and brain injury will(also be addressed. Finally, examples of cancer and infectious diseases that target the CNS will be presented. For each topic, a clinical overview will be provided, followed by research about underlying mechanisms, based on clinical research or animal models. The course will follow the textbook \"Diseases of the Nervous System\" (S. Gilman, Ed.). The course instructors are research scientists who have expertise in neuroscience and translational research. The major(goals of the course will be to introduce clinical topics to graduate students in a context that complements basic neuroscience courses, and provides opportunities to expand their perspectives from basic science to clinically-related endpoints.\n\n      less description for BMSC-GA 4414 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4415",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1151",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 4415\n\n   Rdgs in Translational Neuroscience\n\nThis course will be a weekly discussion series that addresses current translational neuroscience research. Each session will last 1-1.5 hours. Every month there will be one didactic lecture by the course instructor that will address how to read scientific articles, how to write articles, construct abstracts, optimize poster and oral presentations of research articles. The topics for the presentThis course will be a weekly discussion series that addresses current translational neuroscience research. Each session will last 1-1.5 hours. Every month there will be one didactic lecture by the course...\n\n      more description for BMSC-GA 4415 »\n\n      \n\n\n\nThis course will be a weekly discussion series that addresses current translational neuroscience research. Each session will last 1-1.5 hours. Every month there will be one didactic lecture by the course instructor that will address how to read scientific articles, how to write articles, construct abstracts, optimize poster and oral presentations of research articles. The topics for the presentThis course will be a weekly discussion series that addresses current translational neuroscience research. Each session will last 1-1.5 hours. Every month there will be one didactic lecture by the course instructor that will address how to read scientific articles, how to write articles, construct abstracts, optimize poster and oral presentations of research articles. The topics for the presentation will be decided with the help of the course instructor. The presentation will begin with an overview of the topic, and then continue with a critical presentation of the article. Students will be graded on their presentation, and participation in discussions of other presentations.\n\n      less description for BMSC-GA 4415 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4416",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1152",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Turnbull, Daniel",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Seminar in Biomedical Imaging",
            "description": "BMSC-GA 4416 Seminar in Biomedical Imaging",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4417",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "1153",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Turnbull, Daniel",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Biomedical Imaging",
            "description": "BMSC-GA 4417 Research in Biomedical Imaging",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4418",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1154",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Turnbull, Daniel",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorial in Biomedical Imaging",
            "description": "BMSC-GA 4418 Tutorial in Biomedical Imaging",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4419",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1155",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Gold, Gabrielle",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Drug Development in a New Era",
            "description": "BMSC-GA 4419 Drug Development in a New Era",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4420",
            "course_name": "Neuroanatomy",
            "description": "BMSC-GA 4420 Neuroanatomy",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4421",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1156",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Neuroscience Colloquium",
            "description": "BMSC-GA 4421 Neuroscience Colloquium",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4422",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1844",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Carroll, William",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Translating Cancer Discovery into Clinical Practice",
            "description": "BMSC-GA 4422 Translating Cancer Discovery into Clinical Practice",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4423",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1843",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Concentrations in Clinical Biology",
            "description": "BMSC-GA 4423 Concentrations in Clinical Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4425",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1956",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Wilson, Elaine",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Stem Cell Biology Seminar",
            "description": "BMSC-GA 4425 Stem Cell Biology Seminar",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4426",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2446",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Lattanzi, Riccardo",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Medical Imaging",
            "description": "BMSC-GA 4426 Medical Imaging",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4427",
            "course_name": "Practical Magnetic Resonance Imaging I",
            "description": "BMSC-GA 4427 Practical Magnetic Resonance Imaging I",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4428",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1957",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Pract Magnetic Resonance Imaging II",
            "description": "BMSC-GA 4428 Pract Magnetic Resonance Imaging II",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4429",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2106",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hubbard, E",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Tutorial in Stem Cell Biology",
            "description": "BMSC-GA 4429 Tutorial in Stem Cell Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4430",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2105",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Stem Cell Biology",
            "description": "BMSC-GA 4430 Research in Stem Cell Biology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4431",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1958",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hubbard, Vanessa",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Fundamentals of Teaching",
            "description": "BMSC-GA 4431 Fundamentals of Teaching",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4433",
            "course_name": "Assembly & Function of Circuits in the CNS",
            "description": "BMSC-GA 4433 Assembly & Function of Circuits in the CNS",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4435",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2110",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Fenyo, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Biomedical Informatics Seminar",
            "description": "BMSC-GA 4435 Biomedical Informatics Seminar",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4436",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2109",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Fenyo, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Biomedical Informatics",
            "description": "BMSC-GA 4436 Research in Biomedical Informatics",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4437",
            "course_name": "Proteomics Informatics",
            "description": "BMSC-GA 4437 Proteomics Informatics",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4438",
            "course_name": "Computational Causal Discovery",
            "description": "BMSC-GA 4438 Computational Causal Discovery",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4439",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2442",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Statnikov, Alexander",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Machine Learning",
            "description": "BMSC-GA 4439 Machine Learning",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4440",
            "course_name": "Microbiomics Infomatics",
            "description": "BMSC-GA 4440 Microbiomics Infomatics",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4441",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2444",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Feske, Stefan",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Seminar in Immunology",
            "description": "BMSC-GA 4441 Seminar in Immunology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4442",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2445",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Krogsgaard, Michelle",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Immunology",
            "description": "BMSC-GA 4442 Research in Immunology",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4446",
            "course_name": "Optical Microscopy",
            "description": "BMSC-GA 4446 Optical Microscopy \nThe course will cover the basics of light and fluorescence microscopy, along with up to date developments and advanced methods. This course will give an introduction to the physical nature of light, experimental design of microscope, image analysis, with a focus on modern microscopy techniques and single-molecule microscopy methods.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4447",
            "course_name": "Special Topics in Immunology: Cancer Immunology",
            "description": "BMSC-GA 4447 Special Topics in Immunology: Cancer Immunology",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4448",
            "course_name": "High Performance Computing in Biomedical Informatics",
            "description": "BMSC-GA 4448 High Performance Computing in Biomedical Informatics",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4449",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2448",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Fu, Lawrence",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Methodological Foundations of Biomedical Informatics",
            "description": "BMSC-GA 4449 Methodological Foundations of Biomedical Informatics",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4450",
            "course_name": "Consulting in Biomedical  Informatics",
            "description": "BMSC-GA 4450 Consulting in Biomedical  Informatics",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4451",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2449",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Fenyo, David",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 4451\n\n   Introduction to Biostatistics and Bioinformatics\n\nThe goal for the Introduction to Biostatistics and Bioinformatics course is to provide an introduction to statistics and informatics methods for the analysis of data generated in biomedical research. Practical examples covering both small-scale lab experiments and high-throughput assays will be explored. The course covers a wide range of topics in a short time so the focus will be on the basic concepts, and in the practical programming exercises the students explore these basic concept and common pitfalls. An introduction of basic Python programming will be given throughout the course and many...\n\n      more description for BMSC-GA 4451 »\n\n      \n\n\n\nThe goal for the Introduction to Biostatistics and Bioinformatics course is to provide an introduction to statistics and informatics methods for the analysis of data generated in biomedical research. Practical examples covering both small-scale lab experiments and high-throughput assays will be explored. The course covers a wide range of topics in a short time so the focus will be on the basic concepts, and in the practical programming exercises the students explore these basic concept and common pitfalls. An introduction of basic Python programming will be given throughout the course and many exercises will involve programming.\n\n      less description for BMSC-GA 4451 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4452",
            "course_name": "",
            "description": "BMSC-GA 4452\n\n   Next Generation Sequencing Informatics\n\nThis course provides practical training in informatics methods for analysis of next-generation DNA sequencing (NGS) data. Students will review the development of DNA sequencing laboratory technologies and informatics tools, current methods, and promising new developments. Current best-practice bioinformatics methods will be discussed, with an emphasis on data structures and algorithms, for the most commonly used NGS technologies and applications including variant detection, ChIP-seq, RNA-seq, de novo assembly, and targeted sequencing. A number of different computational frameworks and toolkits...\n\n      more description for BMSC-GA 4452 »\n\n      \n\n\n\nThis course provides practical training in informatics methods for analysis of next-generation DNA sequencing (NGS) data. Students will review the development of DNA sequencing laboratory technologies and informatics tools, current methods, and promising new developments. Current best-practice bioinformatics methods will be discussed, with an emphasis on data structures and algorithms, for the most commonly used NGS technologies and applications including variant detection, ChIP-seq, RNA-seq, de novo assembly, and targeted sequencing. A number of different computational frameworks and toolkits will be used including SAMTools, BedTools, BWA, TopHat/Cufflinks, GATK, QIIME, and Galaxy.\n\n      less description for BMSC-GA 4452 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4453",
            "course_name": "",
            "description": "BMSC-GA 4453\n\n   Integrative Genomic Data Analysis\n\nThis course provides practical training in informatics methods for analysis of next-generation DNA sequencing (NGS) data. Students will review the development of DNA sequencing laboratory technologies and informatics tools, current methods, and promising new developments. Current best-practice bioinformatics methods will be discussed, with an emphasis on data structures and algorithms, for the most commonly used NGS technologies and applications including variant detection, ChIP-seq, RNA-seq, de novo assembly, and targeted sequencing. A number of different computational frameworks and toolkits...\n\n      more description for BMSC-GA 4453 »\n\n      \n\n\n\nThis course provides practical training in informatics methods for analysis of next-generation DNA sequencing (NGS) data. Students will review the development of DNA sequencing laboratory technologies and informatics tools, current methods, and promising new developments. Current best-practice bioinformatics methods will be discussed, with an emphasis on data structures and algorithms, for the most commonly used NGS technologies and applications including variant detection, ChIP-seq, RNA-seq, de novo assembly, and targeted sequencing. A number of different computational frameworks and toolkits will be used including SAMTools, BedTools, BWA, TopHat/Cufflinks, GATK, QIIME, and Galaxy.\n\n      less description for BMSC-GA 4453 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4454",
            "course_name": "Molecular Pathology in the Omics Era",
            "description": "BMSC-GA 4454 Molecular Pathology in the Omics Era",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4455",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2451",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Aphinyanaphongs, Yindalon",
                    "time": "Mon,Tue,Thu 2.00 PM - 3.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Biomedical Informatics Foundations II: Medical Informatics",
            "description": "BMSC-GA 4455 Biomedical Informatics Foundations II: Medical Informatics",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4456",
            "course_name": "BMI Foundations I: Bioinformatics",
            "description": "BMSC-GA 4456 BMI Foundations I: Bioinformatics \nThis course serves as an introduction to Biomedical Informatics, an interdisciplinary science of biological information management. The course focuses on the relevant mathematical, statistical, and computer science methodology that build the foundation of the field. Overview of application areas of Bioinformatics in current biomedical research will also be presented.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4457",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16391",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Genome Integrity",
            "description": "BMSC-GA 4457 Genome Integrity",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4458",
            "course_name": "",
            "description": "BMSC-GA 4458\n\n   Current Topics in Genome Integrity\n\nTraining in current topics relevant to Genome Integrity will be provided by a weekly journal club in conjunction with the New York Academy of Sciences Genome Integrity Discussion Group (NYAS GIDG). The topics for the Journal Club papers will be coordinated with the NYAS GIDG meeting talks. The NYAS convenes various meetings, seminars, and interdisciplinary conferences annually in New York City. The Sackler Institute provides annual NYAS memberships to all Sackler Graduate Students. The GIDG at the NYAS has been in place since 2002. It meets 5 times a year with 4 talks by invited faculty from t...\n\n      more description for BMSC-GA 4458 »\n\n      \n\n\n\nTraining in current topics relevant to Genome Integrity will be provided by a weekly journal club in conjunction with the New York Academy of Sciences Genome Integrity Discussion Group (NYAS GIDG). The topics for the Journal Club papers will be coordinated with the NYAS GIDG meeting talks. The NYAS convenes various meetings, seminars, and interdisciplinary conferences annually in New York City. The Sackler Institute provides annual NYAS memberships to all Sackler Graduate Students. The GIDG at the NYAS has been in place since 2002. It meets 5 times a year with 4 talks by invited faculty from the greater New York area (Oct, Dec, Feb, and April meetings) and a keynote address by a leader in the field (June meeting). Many faculty, students, and postdocs from NYU and the greater New York area regularly attend these meetings. \nThe NYAS GIDG covers a broad range of topics including the DNA damage response, DNA replication, transcription, chromatin modification, recombination, cell cycle control, telomeres, chromosome segregation, epigenetic states, as well as the emergence of new technologies relevant to research in genome integrity. Prior to each meeting students will be assigned four papers (one for each talk) and then will meet with a participating genome integrity training grant (TG) faculty member each week for the four weeks prior to the meeting to discuss the papers in a journal club format. Eight TG faculty will participate each year hosting one Journal Club during the Fall and one during the Spring semester. Attendance at the NYAS GIDG meetings will then reinforce and enrich student understanding of the Journal Club topics.\n\n      less description for BMSC-GA 4458 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4459",
            "course_name": "",
            "description": "BMSC-GA 4459\n\n   Pharmacology and Drug Development\n\nThis course is a combination of lectures and discussions of primary literature. The lectures that constitute the first part of the course are designed to provide a firm foundation in the basic concepts in pharmacology and drug development. Topics include: pharmacokinetics, drug metabolism, drug receptors and drug development, testing and approval. The lectures in the second part of the course are designed to introduce the students to the use of molecular pharmacology in drug development. Lectures encompass cardiovascular disease, G-protein receptors; the development of drugs that block kinases...\n\n      more description for BMSC-GA 4459 »\n\n      \n\n\n\nThis course is a combination of lectures and discussions of primary literature. The lectures that constitute the first part of the course are designed to provide a firm foundation in the basic concepts in pharmacology and drug development. Topics include: pharmacokinetics, drug metabolism, drug receptors and drug development, testing and approval. The lectures in the second part of the course are designed to introduce the students to the use of molecular pharmacology in drug development. Lectures encompass cardiovascular disease, G-protein receptors; the development of drugs that block kinases for the treatment of cancer; lipid metabolism; and pharmacological strategies for the treatment of addictive disorders. The third part of the course will cover diabetes. Topics include feeding behavior/satiety, obesity, diabetes and its complications. The final part of the course concerns metabolism and cancer. Topics include metabolism of cancer cells, chemotherapy and personalized medicine.  There will be one formal lecture and one paper discussion section per week.  The examination is at the conclusion of the course and will require students to defend specific aims (grant format) on any related topic discussed in the course in a group oral presentation. Attendance, active participation and discussion leadership throughout the course will also contribute to the final grade.\n\n      less description for BMSC-GA 4459 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4460",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "16392",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Smith, Susan",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BMSC-GA 4460\n\n   Genome Integrity Works-in-Progress\n\nGenome Integrity students will be required to present their research annually from their 2nd year on. As a forum for student presentations, we will take advantage of our already existing multi-group meeting (The NYU Genome Integrity Group). This group, which comprises over one third (10/29) of the faculty mentors in the proposed training grant, meet monthly for faculty, postdocs and students to present their research. This meeting will be expanded to twice-monthly to provide a forum for graduate students in the Genome Integrity Training Program to present their research. As the number of stude...\n\n      more description for BMSC-GA 4460 »\n\n      \n\n\n\nGenome Integrity students will be required to present their research annually from their 2nd year on. As a forum for student presentations, we will take advantage of our already existing multi-group meeting (The NYU Genome Integrity Group). This group, which comprises over one third (10/29) of the faculty mentors in the proposed training grant, meet monthly for faculty, postdocs and students to present their research. This meeting will be expanded to twice-monthly to provide a forum for graduate students in the Genome Integrity Training Program to present their research. As the number of students in the program increases we will develop a Works in Progress Course for student presentations that will meet weekly.\n\n      less description for BMSC-GA 4460 «",
            "offering": true
        },
        {
            "course_id": "BMSC-GA 4461",
            "course_name": "",
            "description": "BMSC-GA 4461\n\n   Molecular Mechanisms of Neurodegeneration\n\nThis elective course for graduate students focuses on molecular and cellular mechanisms of neurodegeneration. For the Spring 2015 semester, topics will include, genetics, endoplasmic reticulum stress, endosomal dysfunction, parenchymal and vascular amyloid as well as cerebrovascular dysfunction, axonal degeneration, mitochondria and oxidative stress, viral infections, neuromuscular synapses, microglia and therapeutic approaches. It is anticipated that these topics may change from year to year based on advances in the field and availability of experts. The objective is to provide st  udents who...\n\n      more description for BMSC-GA 4461 »\n\n      \n\n\n\nThis elective course for graduate students focuses on molecular and cellular mechanisms of neurodegeneration. For the Spring 2015 semester, topics will include, genetics, endoplasmic reticulum stress, endosomal dysfunction, parenchymal and vascular amyloid as well as cerebrovascular dysfunction, axonal degeneration, mitochondria and oxidative stress, viral infections, neuromuscular synapses, microglia and therapeutic approaches. It is anticipated that these topics may change from year to year based on advances in the field and availability of experts. The objective is to provide st  udents who are interested in neurodegeneration with a foundation relevant to their dissertation project, and that these lectures and journal clubs may introduce them to novel concepts, hypotheses and controversies that may have implications for their own research.\n\n      less description for BMSC-GA 4461 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4462",
            "course_name": "Systems and Motor Neuroscience",
            "description": "BMSC-GA 4462 Systems and Motor Neuroscience \nA core required course for the Neuroscience & Physiology Training Program.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4463",
            "course_name": "Readings in Neuroscience",
            "description": "BMSC-GA 4463 Readings in Neuroscience \nThis course will serve as an advanced elective course in the \nNeuroscience & Physiology graduate training program.",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4464",
            "course_name": "Advanced Tissues & Organs: Nervous System",
            "description": "BMSC-GA 4464 Advanced Tissues & Organs: Nervous System",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4465",
            "course_name": "",
            "description": "BMSC-GA 4465\n\n   Seminars in Pathobiology and Translational Medicine (WIP)\n\nSeminars in Pathobiology and Translational Medicine (also known as works-in-progress or WIP) are designed specifically for the Pathobiology training program but they are open to all Sackler graduate students. These seminars are overseen by the Pathobiology Program Director and Graduate Advisors. Pathobiology students begin to attend WIP in their second year after they join the program. In years 3-4-5, students are required to present their research projects, including the description of the underlying hypothesis, critical review of the background literature, and presentation of latest results....\n\n      more description for BMSC-GA 4465 »\n\n      \n\n\n\nSeminars in Pathobiology and Translational Medicine (also known as works-in-progress or WIP) are designed specifically for the Pathobiology training program but they are open to all Sackler graduate students. These seminars are overseen by the Pathobiology Program Director and Graduate Advisors. Pathobiology students begin to attend WIP in their second year after they join the program. In years 3-4-5, students are required to present their research projects, including the description of the underlying hypothesis, critical review of the background literature, and presentation of latest results. Each trainee presents at least once per year in an oral presentation format.  Once a month in place of the research presentation, students participate in the Translational Science and Medicine Journal Club where a research article is jointly presented by one Pathology resident/fellow and one graduate student. Clinical subjects are addressed in the context of basic science/mechanism-based research. Dr. Sandra DeMaria helps oversee the content of this course.\n\n      less description for BMSC-GA 4465 «",
            "offering": false
        },
        {
            "course_id": "BMSC-GA 4466",
            "course_name": "Research in Pathobiology",
            "description": "BMSC-GA 4466 Research in Pathobiology \nThis course will be for those students in the Pathobiology Training Program or an open program student doing research in a Pathobiology faculty member’s lab.",
            "offering": false
        }
    ]
}