{
    "major_id": "BUSOR-AD",
    "file": "./2015-2016/Business_&_Organizational_Studies(BUSOR-AD).html",
    "courses": [
        {
            "course_id": "BUSOR-AD 110",
            "course_name": "",
            "description": "BUSOR-AD  110\n\n   Making Groups and Teams Effective\n\nThis course studies the fundamentals of how human groups function and evolve over time and what scholars and practitioners have learned over the last 50 years about making them more effective. The course examines how size, longevity, surrounding social context, member composition, and emergent social norms dramatically shape how a group behaves and how effectively it operates. Then the course turns to study how group behavior can be shaped and changed over time. Particular attention is paid to issues of group culture, status and power structures, communication patterns, member diversity, and t...\n\n      more description for BUSOR-AD  110 »\n\n      \n\n\n\nThis course studies the fundamentals of how human groups function and evolve over time and what scholars and practitioners have learned over the last 50 years about making them more effective. The course examines how size, longevity, surrounding social context, member composition, and emergent social norms dramatically shape how a group behaves and how effectively it operates. Then the course turns to study how group behavior can be shaped and changed over time. Particular attention is paid to issues of group culture, status and power structures, communication patterns, member diversity, and the effects of new member entry and member departures.\n\n      less description for BUSOR-AD  110 «",
            "offering": false
        },
        {
            "course_id": "BUSOR-AD 111",
            "course_name": "J Principles of Marketing",
            "description": "BUSOR-AD  111J Principles of Marketing \nThis course studies the fundamentals of marketing - from determining what it is that consumers want and need, translating those wants and needs into products and services, and selling those products and services in a highly competitive global marketplace.\nDepending on the instructor, different topic\nareas are emphasized, including, for example,\nthe role of consumer research, product design\nand pricing, branding, and communications and\npromotional strategies in effective marketing.",
            "offering": false
        },
        {
            "course_id": "BUSOR-AD 112",
            "course_name": "Special Topics in Management and Strategy",
            "description": "BUSOR-AD  112 Special Topics in Management and Strategy \nThis course is taught by leading management and economic scholars from around the world who are in residence in Abu Dhabi. The content is oriented toward the scholar’s expertise and the evolving international landscape of business, management, and competitive strategy.",
            "offering": false
        },
        {
            "course_id": "BUSOR-AD 115",
            "course_name": "Management & Organizations",
            "description": "BUSOR-AD  115 Management & Organizations \nWhy do some organizations succeed while others flounder? As students of business, it is critically important for you to have an understanding of the key factors that contribute to organizational success, and the role that managers play in helping their organizations be successful.  The better that you understand these issues, the more effective you will be in your future careers.",
            "offering": false
        }
    ]
}