{
    "major_id": "BUSF-SHU",
    "file": "./2015-2016/Business_and_Finance_(BUSF-SHU).html",
    "courses": [
        {
            "course_id": "BUSF-SHU 1",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "20673",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Calculus Workshop for Business and Economics",
            "description": "BUSF-SHU    1 Calculus Workshop for Business and Economics",
            "offering": true
        },
        {
            "course_id": "BUSF-SHU 10",
            "course_name": "J",
            "description": "BUSF-SHU   10J\n\n   Creativity and Innovation\n\nTo compete today in a fast-changing world, organizations and individuals need a steady stream of innovative strategies and unexpected solutions to stay ahead of the game—solutions that revive stagnant markets or completely reinvent the competitive dynamics of an industry. This course is about fostering a culture of creative thinking that provides the framework and motivation to generate those strategies and execute those solutions. It is an essential skill for any student with the desire to transform organizational processes and behaviors, and a willingness to challenge the status quo.The cour...\n\n      more description for BUSF-SHU   10J »\n\n      \n\n\n\nTo compete today in a fast-changing world, organizations and individuals need a steady stream of innovative strategies and unexpected solutions to stay ahead of the game—solutions that revive stagnant markets or completely reinvent the competitive dynamics of an industry. This course is about fostering a culture of creative thinking that provides the framework and motivation to generate those strategies and execute those solutions. It is an essential skill for any student with the desire to transform organizational processes and behaviors, and a willingness to challenge the status quo.The course provides many opportunities to apply these new ways of thinking through class exercises and a course project, where you will develop innovative solutions for a chosen topic. Teams will submit two assignment deliverables.\nThis course is a  Non-finance elective course.\n\n      less description for BUSF-SHU   10J «",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 101",
            "course_name": "Statistics for Business and Economics",
            "description": "BUSF-SHU  101 Statistics for Business and Economics \nThis course introduces students to the use of statistical methods. Topics include: descriptive statistics; introduction to probability; sampling; statistical inference concerning means, standard deviations, and proportions; correlation; analysis of variance; linear regression, including multiple regression analysis. Applications to empirical situations are an integral part of the course. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 188",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19820",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Chen, Zhihong",
                    "time": "Mon,Wed 4.15 PM - 5.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BUSF-SHU  188\n\n   Advanced High Business Chinese - Cases from Real World\n\nThis is the second part of a two-semester sequence for those who have studied Mandarin to the advanced level, although part 1 is NOT the prerequisite for taking part 2 or vise versa. The course is aimed to enhance students’ Chinese skills in the business context and promote their understanding about the macro and micro business environment and culture in China. An approach placing more emphasis on case study is adopted along with task-based language teaching. The course is based on real-life cases from the business word. One is a multinational company which entered the Chinese market as a pion...\n\n      more description for BUSF-SHU  188 »\n\n      \n\n\n\nThis is the second part of a two-semester sequence for those who have studied Mandarin to the advanced level, although part 1 is NOT the prerequisite for taking part 2 or vise versa. The course is aimed to enhance students’ Chinese skills in the business context and promote their understanding about the macro and micro business environment and culture in China. An approach placing more emphasis on case study is adopted along with task-based language teaching. The course is based on real-life cases from the business word. One is a multinational company which entered the Chinese market as a pioneer in the late 1970s and developed even closer ties to China in the 1990s by acquiring or partnering with the Chinese companies; five are Chinese companies that have endeavored in different ways to reach larger domestic and global markets. These cases center upon the issues of Business Globalization, M & A (Mergers and Acquisition), OEM (Original Equipment Manufacturer) and Antidumping etc. Through reading and discussing these cases and performing form-focused and communicative tasks related to these cases, students will learn how to use Chinese as a “carrier of culture” in a more dynamic way, thus acquiring a better understanding about China in economic and, broadly defined, cultural terms. In addition, the case study will also inspire students to explore the Chinese consumers’ interest and mentality, so that they will occupy a more qualified position to explore a successful road toward “doing business in/with China.”In addition to the business case analysis, supplementary reading, writing and listening exercises as well as media materials from different sources will also be provided in class or on-line. Highlights of these exercises are: Listening comprehension of business news reports on current issues as well as video recordings of television interviews and talk shows that cast successful international business leaders; analysis of the international financial markets (incl. analysis of origin, functions and conflict of interest of the investment banks); translation of business terminologies and documents, and commercial language and word processing. For students who are interested in pursuing career opportunities in Mainland China and Hong Kong, the course will teach the proper ways to compose a Chinese resume while, at the same time, introducing related job interview skills. By the end of the semester, students are expected to: (1) be equipped with the language skills to function more 2comfortably and confidently in the real business settings such as job interviews that require the Chinese language proficiency; (2) enhance the cultural awareness about the Chinese business world; (3) improve listening comprehension of Chinese business related media materials; (4) improve reading and translation skills of business terminologies/documents; (5) be able to use Chinese language software for certain business purposes.\nClass will be conducted in Chinese.\n\n      less description for BUSF-SHU  188 «",
            "offering": true
        },
        {
            "course_id": "BUSF-SHU 201",
            "course_name": "Global Perspectives on Enterprise Systems",
            "description": "BUSF-SHU  201 Global Perspectives on Enterprise Systems \nThis course compares the development of rich and “emerging market” societies over time. Through both macro- and micro-economic perspectives, students examine political, cultural, and economic similarities and differences of national enterprise systems, paying special attention to impacts of government, financial institutions, entrepreneurship and management. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 202",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "13236",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Landskroner, Yoram",
                    "time": "Mon,Wed 9.45 AM - 11.00 AM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "13332",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Landskroner, Yoram",
                    "time": "Mon,Wed 11.30 AM - 12.45 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "13333",
                    "section": "003",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "13334",
                    "section": "004",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "13335",
                    "section": "005",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "13336",
                    "section": "006",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "BUSF-SHU  202\n\n   Foundations of Finance\n\nThe course is a rigorous, quantitative introduction to financial market structure and financial asset valuation. The main topics of the course are financial markets, arbitrage, portfolio selection, equilibrium asset pricing, fixed income securities and option pricing.\n \nYou are expected to understand valuation formulas and be able to apply them to new problems. The appropriate tools necessary for solving these problems will be developed at each stage and practiced in the homework assignments. The models we will cover have immediate applications and implications for real-world financial decisio...\n\n      more description for BUSF-SHU  202 »\n\n      \n\n\n\nThe course is a rigorous, quantitative introduction to financial market structure and financial asset valuation. The main topics of the course are financial markets, arbitrage, portfolio selection, equilibrium asset pricing, fixed income securities and option pricing.\n \nYou are expected to understand valuation formulas and be able to apply them to new problems. The appropriate tools necessary for solving these problems will be developed at each stage and practiced in the homework assignments. The models we will cover have immediate applications and implications for real-world financial decisions.  Prerequisites BUSFN-101 and ECON-150\n\n      less description for BUSF-SHU  202 «",
            "offering": true
        },
        {
            "course_id": "BUSF-SHU 202",
            "course_name": "CL Foundations of Finance",
            "description": "BUSF-SHU  202CL Foundations of Finance",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 203",
            "course_name": "Industrial and Organizational Psychology",
            "description": "BUSF-SHU  203 Industrial and Organizational Psychology \nPersonal, social, and environmental factors related to people’s attitudes and performance in industry and other organizations. Topics include personnel selection and evaluation, training and development, attitudes and motivation, leadership, group dynamics, organizational structure and climate, and job design and working conditions. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 204",
            "course_name": "Innovation and Design",
            "description": "BUSF-SHU  204 Innovation and Design \nCreativity and innovation are the key drivers of success for many of today’s leading companies.  This course will focus on developing breakthrough design thinking, an essential element of such companies’ creative culture. The course provides many opportunities to apply these new ways of thinking through class exercises and a course project, where students develop creative concepts for an assigned topic. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 205",
            "course_name": "Information Technology in Business and Society",
            "description": "BUSF-SHU  205 Information Technology in Business and Society \nStudents in this course learn the essential tools used by today’s knowledge workers, including spreadsheet modeling and analysis and database querying. They learn to recognize the large-scale systems that run modern organizations, and how to evaluate IT investments in products, services, and systems.  They learn about the economics of information pricing, technological lock-in, and network effects.  And they discuss a set of special topics, which may include digital music, information privacy, data mining and digital piracy.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 206",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19367",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Investing in Finance in China",
            "description": "BUSF-SHU  206 Investing in Finance in China",
            "offering": true
        },
        {
            "course_id": "BUSF-SHU 210",
            "course_name": "",
            "description": "BUSF-SHU  210\n\n   Business Analytics\n\nThis course introduces the basic principles and techniques of applied mathematical modeling for managerial decision making. You will learn to use some important analytic methods (e.g. forecasting, data mining, optimization, Monte Carlo simulation), to recognize their assumptions and limitations, and to employ them in decision making. The course is entirely hands-on. The emphasis will be on model formulation and interpretation of results, not on mathematical theory. The emphasis is on models that are widely used in diverse industries and functional areas, including finance, marketing, and opera...\n\n      more description for BUSF-SHU  210 »\n\n      \n\n\n\nThis course introduces the basic principles and techniques of applied mathematical modeling for managerial decision making. You will learn to use some important analytic methods (e.g. forecasting, data mining, optimization, Monte Carlo simulation), to recognize their assumptions and limitations, and to employ them in decision making. The course is entirely hands-on. The emphasis will be on model formulation and interpretation of results, not on mathematical theory. The emphasis is on models that are widely used in diverse industries and functional areas, including finance, marketing, and operations.  Prerequisite:  A prior Statistics Course.\n\n      less description for BUSF-SHU  210 «",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 250",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "13337",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "13338",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "13339",
                    "section": "005",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "13340",
                    "section": "006",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "19128",
                    "section": "007",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "19129",
                    "section": "008",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Principles of Financial Accounting",
            "description": "BUSF-SHU  250 Principles of Financial Accounting \nDevelops students’ abilities to understand business transactions and financial statements and to determine the most appropriate financial measures for these events. Investigates the underlying rationale for accounting practices and assesses their effectiveness in providing useful information for decision making. Emphasis is placed on accounting practices that purport to portray corporate financial position, operating results, cash flows, manager performance, and financial strength. Prerequisite: None.",
            "offering": true
        },
        {
            "course_id": "BUSF-SHU 250",
            "course_name": "CL Princ. of Financial Accounting",
            "description": "BUSF-SHU  250CL Princ. of Financial Accounting",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 303",
            "course_name": "Corporate Finance",
            "description": "BUSF-SHU  303 Corporate Finance \nThis course analyzes the major financial decisions made by corporate managers. The major topics include the objective of the firm, investment valuation and capital budgeting, risk management, capital structure and dividend policy. Insights from behavioral corporate finance that help better understand corporate decisions in practice will also be discussed. There will be emphasis on both developing the tools and mindset of the financial practitioner as well as examining specific applications in the form of examples, case discussions, and classroom simulations.  Prerequisite: BUSF-SHU 202",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 304",
            "course_name": "Futures and Options",
            "description": "BUSF-SHU  304 Futures and Options \nThis course covers the theoretical and practical aspects of futures, options, and other derivative instruments, which have become some of the most important tools of modern finance. While the primary focus is on financial derivatives, contracts based on commodities, credit risk, and other nonfinancial variables are also covered. Topics include market institutions and trading practices, valuation models, hedging, and other risk management techniques. The course requires relatively extensive use of quantitative methods and theoretical reasoning. Prerequisite: BUSF-202.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 305",
            "course_name": "",
            "description": "BUSF-SHU  305\n\n   Debt Instruments and Markets\n\nThis course describes important fixed income securities and markets and develops tools for valuing debt instruments and managing interest rate risk. The course covers traditional bond pricing, term structure, and interest rate risk concepts. It also covers the analytical and institutional aspects of fixed income derivatives, such as interest rate swaps, forwards, futures, and options, as well as bonds with embedded options and mortgage-backed securities. Topics also include credit risk, bond portfolio, management, financial engineering, and international fixed income. The study of fixed income...\n\n      more description for BUSF-SHU  305 »\n\n      \n\n\n\nThis course describes important fixed income securities and markets and develops tools for valuing debt instruments and managing interest rate risk. The course covers traditional bond pricing, term structure, and interest rate risk concepts. It also covers the analytical and institutional aspects of fixed income derivatives, such as interest rate swaps, forwards, futures, and options, as well as bonds with embedded options and mortgage-backed securities. Topics also include credit risk, bond portfolio, management, financial engineering, and international fixed income. The study of fixed income is quantitative and technical by nature. Prerequisite: BUSF-202.\n\n      less description for BUSF-SHU  305 «",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 306",
            "course_name": "The Chinese Financial System",
            "description": "BUSF-SHU  306 The Chinese Financial System",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 350",
            "course_name": "Principles of Managerial Accounting",
            "description": "BUSF-SHU  350 Principles of Managerial Accounting \nIntroduces students to the evolving role that managerial accounting has played and is expected to play in servicing the informational needs of managers in the planning, organizing, and controlling functions. Highlights the attention-directing, decision-support, and decision-influencing roles of managerial accounting, while helping students learn to structure business decisions systematically and identify the information relevant to a decision. Trains students to think analytically about improving existing systems to further a firm’s competitive advantage. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 351",
            "course_name": "",
            "description": "BUSF-SHU  351\n\n   Competitive Advantage from Operations\n\nDesigned to give students a better understanding of how firms can gain competitive advantage from their operations function. Typically this requires the firm to achieve, at a minimum, cost, quality, and ecological parity; responsiveness and adaptability to customer needs and desires; rapid time to market; process technology leadership; and sufficient and responsive capacity. A problem-solving framework is developed that enables students to undertake managerial and technical analysis that should result in the desired comparative advantage. Both service and manufacturing case examples are utiliz...\n\n      more description for BUSF-SHU  351 »\n\n      \n\n\n\nDesigned to give students a better understanding of how firms can gain competitive advantage from their operations function. Typically this requires the firm to achieve, at a minimum, cost, quality, and ecological parity; responsiveness and adaptability to customer needs and desires; rapid time to market; process technology leadership; and sufficient and responsive capacity. A problem-solving framework is developed that enables students to undertake managerial and technical analysis that should result in the desired comparative advantage. Both service and manufacturing case examples are utilized. Prerequisite: None.\n\n      less description for BUSF-SHU  351 «",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 352",
            "course_name": "",
            "description": "BUSF-SHU  352\n\n   Mergers and Acquisitions\n\nThis course presents the theories and empirical evidence on mergers, acquisitions and restructuring, and analyzes the effects of various policy options on the stock values of acquirer and target companies. Findings about the reaction of stock prices to information on control transactions are used to analyze the effects of various policy options in such transactions. Topics related to M&A include evaluating acquisition targets, methods of payment in acquisitions, acquisition strategies, the use of leverage in acquisitions and the effects of acquisitions on bond values, major legal issues, case ...\n\n      more description for BUSF-SHU  352 »\n\n      \n\n\n\nThis course presents the theories and empirical evidence on mergers, acquisitions and restructuring, and analyzes the effects of various policy options on the stock values of acquirer and target companies. Findings about the reaction of stock prices to information on control transactions are used to analyze the effects of various policy options in such transactions. Topics related to M&A include evaluating acquisition targets, methods of payment in acquisitions, acquisition strategies, the use of leverage in acquisitions and the effects of acquisitions on bond values, major legal issues, case law, and defensive measures against hostile acquisitions. The course combines lecture material, case analysis, quantitative and qualitative analysis, and discussions of relevant news of such transactions. There is an emphasis on fundamental concepts of valuation and other areas of corporate finance related to M&As. Prerequisite: BUSF-303.\n\n      less description for BUSF-SHU  352 «",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 353",
            "course_name": "International Financial Management",
            "description": "BUSF-SHU  353 International Financial Management \nThis course examines the operation of international currency exchange and capital markets and applies financial management principles to the financial decisions of multinational corporations. It addresses such topics as economic determinants of exchange rates, currency market efficiency, exchange rate forecasting, techniques for measuring and managing exposure to exchange and political risk and financing alternatives and capital budgeting decisions of multinational corporations. Readings and case studies are employed. Prerequisites: BUSF-303 and ECON-250.",
            "offering": false
        },
        {
            "course_id": "BUSF-SHU 301",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17410",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Ro, Raymond",
                    "time": "Tue 1.00 PM - 4.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "| BUSF-SHU 9001",
            "description": "BUSF-SHU  301 | BUSF-SHU 9001\n\n   Management and Organizations\n\nThis course addresses contemporary management challenges stemming from changing organizational structures, complex environmental conditions, new technological developments, and increasingly diverse workforces. It highlights critical management issues involved in planning, organizing, controlling, and leading an organization. Ultimately, it aims to strengthen students’ managerial potential by providing general frameworks for analyzing, diagnosing, and responding to both fundamental and complex organizational situations. It also provides opportunities for students to enhance their communication ...\n\n      more description for BUSF-SHU  301 | BUSF-SHU 9001 »\n\n      \n\n\n\nThis course addresses contemporary management challenges stemming from changing organizational structures, complex environmental conditions, new technological developments, and increasingly diverse workforces. It highlights critical management issues involved in planning, organizing, controlling, and leading an organization. Ultimately, it aims to strengthen students’ managerial potential by providing general frameworks for analyzing, diagnosing, and responding to both fundamental and complex organizational situations. It also provides opportunities for students to enhance their communication and interpersonal skills, which are essential to effective management. The structure of the course encourages learning at multiple levels: through in-class lectures, exercises, and discussions; in small teams carrying out projects; and in individual reading, study, and analysis. Prerequisite: None.\n\n      less description for BUSF-SHU  301 | BUSF-SHU 9001 «",
            "offering": true
        }
    ]
}