{
    "major_id": "CHDED-GE",
    "file": "./2015-2016/Childhood_Education_(CHDED-GE).html",
    "courses": [
        {
            "course_id": "CHDED-GE 2010",
            "course_name": "",
            "description": "CHDED-GE 2010\n\n   Intgr Sem Chldhd Ed II\n\nStudy of Teaching II is the second of two courses designed to support preservice teachers' efforts to integrate learning from courses with practice in the field and to explore the role of teacher-as-researcher as a vehicle for continual professional growth. The course is concurrent with methods courses in the social studies and is intended to help beginning teachers analyze the various teacher roles, actions, teaching models, and decisions they make as they interact with learners around the implementation of their methods course assignments in the process of student teaching. Students will com...\n\n      more description for CHDED-GE 2010 »\n\n      \n\n\n\nStudy of Teaching II is the second of two courses designed to support preservice teachers' efforts to integrate learning from courses with practice in the field and to explore the role of teacher-as-researcher as a vehicle for continual professional growth. The course is concurrent with methods courses in the social studies and is intended to help beginning teachers analyze the various teacher roles, actions, teaching models, and decisions they make as they interact with learners around the implementation of their methods course assignments in the process of student teaching. Students will complete their professional portfolios and a small-scale action research study focused on a classroom-related topic of their choosing.\n\n      less description for CHDED-GE 2010 «",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2011",
            "course_name": "Multicultural Perspect in Social Studies",
            "description": "CHDED-GE 2011 Multicultural Perspect in Social Studies \nCurrent theories and practices in multicultural and anti-bias education. Reflection on self and others leading to a critical examination of multiple perspectives. Development of transformative multicultural curricula based on an understanding of the historical/social context in which groups interacted and formulated world views.",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2021",
            "course_name": "Child Dev&Prog Child Edu",
            "description": "CHDED-GE 2021 Child Dev&Prog Child Edu \nAnalysis of recent developments in theory and research about child development with particular reference to their implications for education.  Emphasis placed on children's construction of knowledge.  Methods and techniques for gathering and interpreting data are included.",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2055",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4814",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 512",
                    "time": "Wed 6.45 PM - 8.35 PM",
                    "open": true,
                    "professor": "Seymour, Phillip"
                }
            ],
            "course_name": "Integrated Arts in Childhood & Early Education",
            "description": "CHDED-GE 2055 Integrated Arts in Childhood & Early Education \nMethods for integrating music, art, dance, and drama into an integrated childhood education curriculum.",
            "offering": true
        },
        {
            "course_id": "CHDED-GE 2060",
            "course_name": "",
            "description": "CHDED-GE 2060\n\n   Prc App Tch Read Write Lstng/Speak K-8\n\nThrough in-class reading and writing workshops, students will embark on writing projects across a range of literary genres. This activity-oriented course emphasizes the development of personal reading and writing expertise as a basis for language arts teaching. Focus on building a repertoire of strategies for planning curriculum, developing genre studies and using literature in the language of arts classroom. Focus on student literacy assessment as a means to inform language arts instruction and developing systems to monitor and record student progress. Course includes internet component as a ...\n\n      more description for CHDED-GE 2060 »\n\n      \n\n\n\nThrough in-class reading and writing workshops, students will embark on writing projects across a range of literary genres. This activity-oriented course emphasizes the development of personal reading and writing expertise as a basis for language arts teaching. Focus on building a repertoire of strategies for planning curriculum, developing genre studies and using literature in the language of arts classroom. Focus on student literacy assessment as a means to inform language arts instruction and developing systems to monitor and record student progress. Course includes internet component as a venue for student dialogue.\n\n      less description for CHDED-GE 2060 «",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2070",
            "course_name": "Found of Curriculum in Childhood Education",
            "description": "CHDED-GE 2070 Found of Curriculum in Childhood Education \nOverview of current theory and practice in curriculum development and assessment.  Application to Pre-K through 6th grade classrooms in urban settings emphasized.",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4362",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Romandetto, Patricia",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4363",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Kirch, Susan",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "CHDED-GE 2300 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula.  Each departmental program has established its on maximum credit allowance for independent study.  This information may be obtained from the student's department . Prior to registering for independent study , each student should obtain an Independent Study approval from the adviser.",
            "offering": true
        },
        {
            "course_id": "CHDED-GE 2313",
            "course_name": "Curriculum Experience in Social Studies & Science",
            "description": "CHDED-GE 2313 Curriculum Experience in Social Studies & Science \nExperiences for developing children's concepts and skills in social studies and science.  Program planning and use of resources: the out-of-doors, maps, globes, books, pictures and other media.  Includes techniques for integrating the two content areas, evaluating current materials, and adapting programs for special students in regular classrooms.  Hands-on experience with microcomputers and selected software.",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2351",
            "course_name": "Creating Cases for Ed II Teachers",
            "description": "CHDED-GE 2351 Creating Cases for Ed II Teachers \nCollaborative experiences in producing written incidents touching on critical issues about teachers and teaching that can be utilized by education students for reflection and professional action.  Cases are problem centered, cut across subject and program lines, &, for the most part, focus on classroom activities and interactions.",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2357",
            "course_name": "Analytical Study of Tchn",
            "description": "CHDED-GE 2357 Analytical Study of Tchn \nStudy and application of strategies  toward becoming a reflective practitioner.  Emphasis on developing professional self-awareness.  Studying classroom life through a variety of lenses with the aim of extending our concepts schemes of learning and teaching.",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2359",
            "course_name": "",
            "description": "CHDED-GE 2359\n\n   Sem in Classroom Tchng\n\nStudy of Teaching I is the first of two courses designed to support preservice teachers' efforts to integrate learning from courses with practice in the field and to explore the role of teacher-as-researcher as a vehicle for continual professional growth. The course is concurrent with methods of courses in literacy, mathematics, and science and is intended to help beginning teachers analyze the various teacher roles, actions, teaching models, and decisions they make as they interact with learners around the implementation of their methods course assignments in the process of student teaching. ...\n\n      more description for CHDED-GE 2359 »\n\n      \n\n\n\nStudy of Teaching I is the first of two courses designed to support preservice teachers' efforts to integrate learning from courses with practice in the field and to explore the role of teacher-as-researcher as a vehicle for continual professional growth. The course is concurrent with methods of courses in literacy, mathematics, and science and is intended to help beginning teachers analyze the various teacher roles, actions, teaching models, and decisions they make as they interact with learners around the implementation of their methods course assignments in the process of student teaching. Students will begin their professional portfolios and complete a small-scale action research study focused on some aspect of learning.\n\n      less description for CHDED-GE 2359 «",
            "offering": false
        },
        {
            "course_id": "CHDED-GE 2901",
            "classes": [
                {}
            ],
            "course_name": "Student Teaching in Childhood I",
            "description": "CHDED-GE 2901 Student Teaching in Childhood I \nOne semester supervised student teaching in a childhood classroom  a minimum of 180 hours within 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": true
        },
        {
            "course_id": "CHDED-GE 2902",
            "classes": [
                {}
            ],
            "course_name": "Student Teaching in Childhood II",
            "description": "CHDED-GE 2902 Student Teaching in Childhood II \nOne semester supervised student teaching in a childhood education classroom a minimum of 180 hours within 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": true
        },
        {
            "course_id": "CHDED-GE 3053",
            "course_name": "Doctoral Practicum",
            "description": "CHDED-GE 3053 Doctoral Practicum \nIndividually designed practicum to enable advanced students to develop competence in new professional roles.  Project sponsor must be a full-time faculty member of the ELED program.",
            "offering": false
        }
    ]
}