{
    "major_id": "CAMS-UA",
    "file": "./2015-2016/Child-Adoles_Mental_Hlth_Stds_(CAMS-UA).html",
    "courses": [
        {
            "course_id": "CAMS-UA 101",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "6074",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "CANT 101",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Shatkin, Jess; Evans, Lori"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  101\n\n   Child & Adolescent Psychopathology\n\nWhile psychopathology courses are commonplace among undergraduate psychology curricula, courses focusing on child and adolescent psychopathology are relatively rare. More novel still is the opportunity to receive instruction in child and adolescent psychopathology from practicing psychiatrists and psychologists at an internationally renowned clinical and research center. Through lecture presentations and discussions, this course focuses on disease etiology, epidemiology, phenomenology, nosology, and diagnosis. It engages students in a critical review of common child and adolescent psychopathol...\n\n      more description for CAMS-UA  101 »\n\n      \n\n\n\nWhile psychopathology courses are commonplace among undergraduate psychology curricula, courses focusing on child and adolescent psychopathology are relatively rare. More novel still is the opportunity to receive instruction in child and adolescent psychopathology from practicing psychiatrists and psychologists at an internationally renowned clinical and research center. Through lecture presentations and discussions, this course focuses on disease etiology, epidemiology, phenomenology, nosology, and diagnosis. It engages students in a critical review of common child and adolescent psychopathology and challenges social and cultural assumptions of what constitutes ?normal? vs. ?pathological? behavior, cognition, and emotion. Students also complete one practicum by participating with a clinician (psychologist or psychiatrist) during the evaluation of a child or adolescent patient at the NYU Child Study Center.\n\n      less description for CAMS-UA  101 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 102",
            "course_name": "",
            "description": "CAMS-UA  102\n\n   The Treatment of Child & Adolesc Mental Illness\n\nProvides students with an overview and understanding of the current methods employed in the treatment of child and adolescent mental illness. For most of the past century, treatments for children and adolescents suffering from mental illness relied primarily on open-ended psychotherapies, which have not consistently demonstrated a beneficial effect. Over the past 25 years, however, a variety of new evidence-based treatments have emerged, including behavioral psychotherapies such as cognitive behavior therapy for anxiety and depression, dialectical behavior therapy for personality disorders, an...\n\n      more description for CAMS-UA  102 »\n\n      \n\n\n\nProvides students with an overview and understanding of the current methods employed in the treatment of child and adolescent mental illness. For most of the past century, treatments for children and adolescents suffering from mental illness relied primarily on open-ended psychotherapies, which have not consistently demonstrated a beneficial effect. Over the past 25 years, however, a variety of new evidence-based treatments have emerged, including behavioral psychotherapies such as cognitive behavior therapy for anxiety and depression, dialectical behavior therapy for personality disorders, and parent management training for children with oppositional and defiant disorders. In addition, we now have strong evidence supporting the use of various pharmacological interventions for attention-deficit hyperactivity disorder (ADHD), mood and anxiety disorders, and autism. Students investigate each of these treatments by reading and analyzing much of the original research that established their efficacy. This course builds upon Child and Adolescent Psychopathology (V05.0101).\n\n      less description for CAMS-UA  102 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 103",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7952",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 408",
                    "time": "Wed 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Lewis, Beata; Chai, Marianne; Canale, Thomas"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  103\n\n   Complementary & Alternative Mental Health\n\nComplementary and alternative treatments comprise the most rapidly expanding segment of American healthcare.  This course will examine the role of non-conventional care in the mental wellness of children, adolescents and young adults.  We will survey the historical, clinical, and scientific aspects of mind-body treatments, biologically-based alternative therapies, spirituality, and the traditional medical systems of China and India.  In addition, we will investigate the social, political, and economic forces influencing the role and status of complementary and alternative practices in America....\n\n      more description for CAMS-UA  103 »\n\n      \n\n\n\nComplementary and alternative treatments comprise the most rapidly expanding segment of American healthcare.  This course will examine the role of non-conventional care in the mental wellness of children, adolescents and young adults.  We will survey the historical, clinical, and scientific aspects of mind-body treatments, biologically-based alternative therapies, spirituality, and the traditional medical systems of China and India.  In addition, we will investigate the social, political, and economic forces influencing the role and status of complementary and alternative practices in America.  Students will assess these practices by participating in class discussion, reviewing research literature, and engaging in several group experiential exercises.\n\n      less description for CAMS-UA  103 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 104",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7807",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 408",
                    "time": "Mon 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Brown, Adam; Mathewson, Karen"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  104\n\n   When Nightmare is Real: Trauma in Child &Adolesc\n\nEvery childhood is fraught with complications, but some children are exposed to traumatic experiences that have a lasting impact on their development and health. Many children in New York City are still reeling from the effects of September 11, yet these numbers pale in comparison to the more than three million reported cases of child abuse and neglect in the United States annually, in addition to the many more cases that go unreported. This course examines the neurobiological and psychological effects of trauma on children, adolescents, and their families. We investigate the impact of physica...\n\n      more description for CAMS-UA  104 »\n\n      \n\n\n\nEvery childhood is fraught with complications, but some children are exposed to traumatic experiences that have a lasting impact on their development and health. Many children in New York City are still reeling from the effects of September 11, yet these numbers pale in comparison to the more than three million reported cases of child abuse and neglect in the United States annually, in addition to the many more cases that go unreported. This course examines the neurobiological and psychological effects of trauma on children, adolescents, and their families. We investigate the impact of physical, emotional, and sexual abuse and neglect, war, terrorism, natural disasters, bereavement, and medical illness. In addition, we explore the concepts of vulnerability and resilience to discover why most affected children successfully traverse their trauma. Finally, we discuss the treatment modalities commonly employed with traumatized children, adolescents, and their families.\n\n      less description for CAMS-UA  104 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 105",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "8826",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "25W4 C-13"
                }
            ],
            "course_name": "Mindfulness and Mental Health",
            "description": "CAMS-UA  105 Mindfulness and Mental Health",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 110",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "6075",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC50",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Schlechter, Alan; Lerner, Daniel Louis"
                },
                {
                    "format": "Recitation",
                    "class_id": "7812",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 404",
                    "time": "Mon 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "Schlechter, Alan; Lerner, Daniel Louis"
                },
                {
                    "format": "Recitation",
                    "class_id": "7813",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 412",
                    "time": "Tue 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "Schlechter, Alan; Lerner, Daniel Louis"
                },
                {
                    "format": "Recitation",
                    "class_id": "7814",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 210",
                    "time": "Wed 8.00 AM - 9.00 AM",
                    "open": true,
                    "professor": "Schlechter, Alan; Lerner, Daniel Louis"
                },
                {
                    "format": "Recitation",
                    "class_id": "7815",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 409",
                    "time": "Thu 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "Lerner, Daniel Louis; Schlechter, Alan"
                },
                {
                    "format": "Recitation",
                    "class_id": "7841",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "194M 301"
                },
                {
                    "format": "Recitation",
                    "class_id": "7842",
                    "section": "007",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "WAVE 429"
                },
                {
                    "format": "Recitation",
                    "class_id": "7873",
                    "section": "008",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "25W4 C-9"
                },
                {
                    "format": "Recitation",
                    "class_id": "7876",
                    "section": "009",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "SILV 404"
                },
                {
                    "format": "Recitation",
                    "class_id": "7878",
                    "section": "010",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 8.00 AM - 9.00 AM",
                    "open": true,
                    "professor": "194M 210"
                },
                {
                    "format": "Recitation",
                    "class_id": "7911",
                    "section": "011",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.45 AM - 10.45 AM",
                    "open": true,
                    "professor": "194M 210"
                },
                {
                    "format": "Recitation",
                    "class_id": "8833",
                    "section": "012",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "194M 301"
                },
                {
                    "format": "Recitation",
                    "class_id": "8834",
                    "section": "013",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "194M 308"
                },
                {
                    "format": "Recitation",
                    "class_id": "8835",
                    "section": "014",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "194M 301"
                },
                {
                    "format": "Recitation",
                    "class_id": "8842",
                    "section": "015",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "25W4 C-10"
                },
                {
                    "format": "Recitation",
                    "class_id": "8899",
                    "section": "016",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "194M 301"
                },
                {
                    "format": "Recitation",
                    "class_id": "17006",
                    "section": "017",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "25W4 C-10"
                },
                {
                    "format": "Recitation",
                    "class_id": "17007",
                    "section": "018",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "194M 308"
                },
                {
                    "format": "Recitation",
                    "class_id": "17008",
                    "section": "019",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "25W4 C-17"
                },
                {
                    "format": "Recitation",
                    "class_id": "17009",
                    "section": "020",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "25W4 C-10"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  110\n\n   The Science of Happiness\n\nExamines the state of college-student mental health and wellness on a personal and systems level. As undergraduate university students approach the end of adolescence, they often reevaluate the beliefs, values, and assumptions with which they left home. Young adulthood is a time of great promise, but the transition from child to adult is never easy. We look at how individuals can create positive change by reinterpreting their goals and identifying steps toward a successful college experience. Key findings from the fields of neuroscience and positive psychology are referenced to inform our stud...\n\n      more description for CAMS-UA  110 »\n\n      \n\n\n\nExamines the state of college-student mental health and wellness on a personal and systems level. As undergraduate university students approach the end of adolescence, they often reevaluate the beliefs, values, and assumptions with which they left home. Young adulthood is a time of great promise, but the transition from child to adult is never easy. We look at how individuals can create positive change by reinterpreting their goals and identifying steps toward a successful college experience. Key findings from the fields of neuroscience and positive psychology are referenced to inform our study of the biopsychosocial underpinnings of success and happiness. Through lectures and discussions, students learn about a variety of wellness topics that include mindfulness, relationships, and self-esteem. The final project requires students to promote an area of mental wellness on campus.\n\n      less description for CAMS-UA  110 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 111",
            "course_name": "",
            "description": "CAMS-UA  111\n\n   Risk & Resilience in Urban Teens:\n\nThe most effective way to learn and retain information is by teaching others.  This course is focused on school-based mental health promotion, positive youth development, resilience-building and risk-reduction techniques that specifically target behavioral risk factors in adolescents.  From tackling cognitive distortions, to\nstress and anxiety reduction, to effective communication skills and managing difficult conversations, this course provides a powerful and evidence-based toolkit for how to survive the high school (and college!) years.  This unique two-semester course provides students the ...\n\n      more description for CAMS-UA  111 »\n\n      \n\n\n\nThe most effective way to learn and retain information is by teaching others.  This course is focused on school-based mental health promotion, positive youth development, resilience-building and risk-reduction techniques that specifically target behavioral risk factors in adolescents.  From tackling cognitive distortions, to\nstress and anxiety reduction, to effective communication skills and managing difficult conversations, this course provides a powerful and evidence-based toolkit for how to survive the high school (and college!) years.  This unique two-semester course provides students the unparalleled opportunity to thoroughly learn and practice these concepts and techniques in the fall and then, in the spring, to teach\na 10-week curriculum to 9th-grade students at public high schools in New York City.  This course is a must for any students wanting to work directly with adolescents and those who wish to develop and improve their teaching skills in a classroom setting.\n\n      less description for CAMS-UA  111 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 112",
            "course_name": "",
            "description": "CAMS-UA  112\n\n   Risk & Resilience in Urban Teens:\n\nThe most effective way to learn and retain information is by teaching others.  This course is focused on school-based mental health promotion, positive youth development, resilience-building and risk-reduction techniques that specifically target behavioral risk factors in adolescents.  From tackling cognitive distortions, to\nstress and anxiety reduction, to effective communication skills and managing difficult conversations, this course provides a powerful and evidence-based toolkit for how to survive the high school (and college!) years.  This unique two-semester course provides students the ...\n\n      more description for CAMS-UA  112 »\n\n      \n\n\n\nThe most effective way to learn and retain information is by teaching others.  This course is focused on school-based mental health promotion, positive youth development, resilience-building and risk-reduction techniques that specifically target behavioral risk factors in adolescents.  From tackling cognitive distortions, to\nstress and anxiety reduction, to effective communication skills and managing difficult conversations, this course provides a powerful and evidence-based toolkit for how to survive the high school (and college!) years.  This unique two-semester course provides students the unparalleled opportunity to thoroughly learn and practice these concepts and techniques in the fall and then, in the spring, to teach\na 10-week curriculum to 9th-grade students at public high schools in New York City.  This course is a must for any students wanting to work directly with adolescents and those who wish to develop and improve their teaching skills in a classroom setting.\n\n      less description for CAMS-UA  112 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "6076",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 265",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Lucas, Christopher"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  120\n\n   Skepticism & Proof: Rsch Methods in Child Mh\n\nClinical practice and public policy in child mental health is too often driven by the media, conventional wisdom, and prejudice rather than by scientific data. Evidence-based clinical care seeks to guide practitioners in the critical appraisal of data on risk factors, prevention, and treatment. This course is designed for those who wish to read the health research literature and draw their own conclusions. It provides a practical means to learn and apply research methods and focuses on the knowledge and skills needed to design, carry out, and evaluate a research study. Discussion of topical “h...\n\n      more description for CAMS-UA  120 »\n\n      \n\n\n\nClinical practice and public policy in child mental health is too often driven by the media, conventional wisdom, and prejudice rather than by scientific data. Evidence-based clinical care seeks to guide practitioners in the critical appraisal of data on risk factors, prevention, and treatment. This course is designed for those who wish to read the health research literature and draw their own conclusions. It provides a practical means to learn and apply research methods and focuses on the knowledge and skills needed to design, carry out, and evaluate a research study. Discussion of topical “hot-button” issues, such as the apparent “epidemic” of certain diagnoses, the influence of the environment or culture on child mental health, and the risks/benefits of widely prescribed medications, are combined with a systematic review of the existing evidence base on current empirically supported treatment for child mental health problems.\n\n      less description for CAMS-UA  120 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 131",
            "course_name": "",
            "description": "CAMS-UA  131\n\n   Behavioral Interventions for Children: Didactic\n\nAttention-deficit hyperactivity disorder (ADHD) is the most commonly diagnosed neurobehavioral childhood disorder, affecting between 5 and 7 percent of the population. It is a complex disorder that typically impacts a child’s functioning across multiple settings. Although medication is often the first-line treatment, a multimodal approach, including behavioral interventions, is often necessary to address deficits in social skills, classroom behavior, and parent-child relations. This two-part summer course begins with a didactic that helps students obtain a broader understanding of the impact o...\n\n      more description for CAMS-UA  131 »\n\n      \n\n\n\nAttention-deficit hyperactivity disorder (ADHD) is the most commonly diagnosed neurobehavioral childhood disorder, affecting between 5 and 7 percent of the population. It is a complex disorder that typically impacts a child’s functioning across multiple settings. Although medication is often the first-line treatment, a multimodal approach, including behavioral interventions, is often necessary to address deficits in social skills, classroom behavior, and parent-child relations. This two-part summer course begins with a didactic that helps students obtain a broader understanding of the impact of this disorder on children’s functioning and learn specifically how behavioral treatments are employed to improve children’s functioning in social, academic, and home settings. It provides a foundation in social learning theory and then, through a practicum at the NYU Child Study Center’s Summer Program for Kids, offers supervised, hands-on experience in applying behavioral principles and procedures. Ongoing discussion with supervisors regarding the clinical expression of symptoms and treatment response takes place daily. Students also gain considerable insight into the challenges clinicians face in treating children afflicted with this disorder. Finally, students learn how to employ these same behavioral treatments for children affected by commonly comorbid conditions, such as oppositional defiant and conduct disorder.\n\n      less description for CAMS-UA  131 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 132",
            "course_name": "",
            "description": "CAMS-UA  132\n\n   Behavioral Interventions for Children: Practicum\n\nAttention-deficit hyperactivity disorder (ADHD) is the most commonly diagnosed neurobehavioral childhood disorder, affecting between 5 and 7 percent of the population. It is a complex disorder that typically impacts a child’s functioning across multiple settings. Although medication is often the first-line treatment, a multimodal approach, including behavioral interventions, is often necessary to address deficits in social skills, classroom behavior, and parent-child relations. This two-part summer course begins with a didactic that helps students obtain a broader understanding of the impact o...\n\n      more description for CAMS-UA  132 »\n\n      \n\n\n\nAttention-deficit hyperactivity disorder (ADHD) is the most commonly diagnosed neurobehavioral childhood disorder, affecting between 5 and 7 percent of the population. It is a complex disorder that typically impacts a child’s functioning across multiple settings. Although medication is often the first-line treatment, a multimodal approach, including behavioral interventions, is often necessary to address deficits in social skills, classroom behavior, and parent-child relations. This two-part summer course begins with a didactic that helps students obtain a broader understanding of the impact of this disorder on children’s functioning and learn specifically how behavioral treatments are employed to improve children’s functioning in social, academic, and home settings. It provides a foundation in social learning theory and then, through a practicum at the NYU Child Study Center’s Summer Program for Kids, offers supervised, hands-on experience in applying behavioral principles and procedures. Ongoing discussion with supervisors regarding the clinical expression of symptoms and treatment response takes place daily. Students also gain considerable insight into the challenges clinicians face in treating children afflicted with this disorder. Finally, students learn how to employ these same behavioral treatments for children affected by commonly comorbid conditions, such as oppositional defiant and conduct disorder.\n\n      less description for CAMS-UA  132 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 133",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "6077",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL150",
                    "time": "Thu 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "Rosenfeld, Andrew J"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  133\n\n   From Huck Finn to Columbine:Understanding Disruptive Behaviors in Chldrn & Adolscnt\n\nWhat makes kids do bad things? Who is accountable for their acts? How can we prevent childhood violence? In this course we will explore these questions and seek to understand the spectrum of \"bad\" behavior from biological, psychological, and sociological perspectives. We will address broad topics ranging from the nature vs. nurture debate to biased media reporting to medicating disruptive behaviors. We will examine the increased exposure to media violence and its influence on children and adolescents; how the criminal justice system responds to delinquent behavior; and gender differences in di...\n\n      more description for CAMS-UA  133 »\n\n      \n\n\n\nWhat makes kids do bad things? Who is accountable for their acts? How can we prevent childhood violence? In this course we will explore these questions and seek to understand the spectrum of \"bad\" behavior from biological, psychological, and sociological perspectives. We will address broad topics ranging from the nature vs. nurture debate to biased media reporting to medicating disruptive behaviors. We will examine the increased exposure to media violence and its influence on children and adolescents; how the criminal justice system responds to delinquent behavior; and gender differences in disruptive behavior. We will study atrocities perpetrated by children and adolescents, the growing scientific literature detailing neurodevelopment as it relates to behavior, and historical descriptions of disruptive behavior and delinquency. Students will analyze case studies, debate controversial issues (e.g., the influence of violent gaming), and review online discussion boards in an effort to determine sensible efforts aimed at prevention and treatment.\n\n      less description for CAMS-UA  133 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 134",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7882",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 203",
                    "time": "Mon 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Verduin, Timothy"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  134\n\n   Behav Probs in School: Impairment to Interventn\n\nThis course reviews typical children’s behavior problems in school settings and offers a primer in evidence-based behavior management tools. The class addresses common causes of disruptive behavior, such as Attention-Deficit/Hyperactivity Disorder (ADHD) and related conditions. Students will be instructed in effective behavior management strategies appropriate for settings, such as schools, camps, and sports programs. Techniques will include selective attention, behavioral daily report cards, token economies, and limit setting. The theoretical and research bases for these strategies will be ex...\n\n      more description for CAMS-UA  134 »\n\n      \n\n\n\nThis course reviews typical children’s behavior problems in school settings and offers a primer in evidence-based behavior management tools. The class addresses common causes of disruptive behavior, such as Attention-Deficit/Hyperactivity Disorder (ADHD) and related conditions. Students will be instructed in effective behavior management strategies appropriate for settings, such as schools, camps, and sports programs. Techniques will include selective attention, behavioral daily report cards, token economies, and limit setting. The theoretical and research bases for these strategies will be explored. Students will practice skills with live coaching from the instructor. One required field trip to the NYU Child Study Center will allow students to view how these tools are used in real life clinical settings. This course is of particular interest to those considering careers in child psychology or psychiatry, pediatrics, or general or special education, especially those seeking experience as student aides, camp counselors, or Special Education Itinerant Teachers (SEITs).\n\n      less description for CAMS-UA  134 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 141",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "8871",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 202",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Montalto, Daniela09/02/2015 - 12/15/2015 Mon 9.30 AM - 10.45 AM at 25W4 C-2"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  141\n\n   Child Brain Devel: App Frm Neurosci to Practice\n\nThis course covers the fundamentals of human brain development from birth to young adulthood. The focus is on normal brain functioning, but illustrative pathological development and dysfunctional conditions are reviewed as well, such as developmental dyslexia, autistic disorders, and attention-deficit/hyperactivity disorder. Once students have developed a foundational knowledge of neurocognitive functioning, the course addresses three additional sections that reflect methods of examining brain-based activity: observation, assessment, and intervention. At the end of each section, students shoul...\n\n      more description for CAMS-UA  141 »\n\n      \n\n\n\nThis course covers the fundamentals of human brain development from birth to young adulthood. The focus is on normal brain functioning, but illustrative pathological development and dysfunctional conditions are reviewed as well, such as developmental dyslexia, autistic disorders, and attention-deficit/hyperactivity disorder. Once students have developed a foundational knowledge of neurocognitive functioning, the course addresses three additional sections that reflect methods of examining brain-based activity: observation, assessment, and intervention. At the end of each section, students should have a greater understanding of the neurocognitive developmental perspective and be able to apply their knowledge of brain-based skill sets to understanding the environmental demands that children and teens confront, including learning in school, handling complex social interactions, remembering autobiographical experiences, and managing emotional reactions. Students read a sampling of research articles, relevant clinical materials, and textbooks chapters.\n\n      less description for CAMS-UA  141 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 142",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7750",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon,Wed 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "SILV 514"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  142\n\n   The Adolescent Paradox\n\nAdolescence is a remarkable time of growth and development; in just a few years, children transition dramatically towards adulthood across multiple domains. While adolescence is physically the healthiest period of the lifespan, it is also marked by an enormous rise in morbidity and mortality. This seeming paradox can be explained, in part, by biological and psychological changes during puberty that affect emotion regulation, cognition, and consequent risk-taking behavior. At the turn of the twentieth century, adolescence was described as a developmental period inevitably filled with “storm and...\n\n      more description for CAMS-UA  142 »\n\n      \n\n\n\nAdolescence is a remarkable time of growth and development; in just a few years, children transition dramatically towards adulthood across multiple domains. While adolescence is physically the healthiest period of the lifespan, it is also marked by an enormous rise in morbidity and mortality. This seeming paradox can be explained, in part, by biological and psychological changes during puberty that affect emotion regulation, cognition, and consequent risk-taking behavior. At the turn of the twentieth century, adolescence was described as a developmental period inevitably filled with “storm and stress.” In what ways does this vision of adolescence still apply? How should current scientific findings inform our understanding of the propensity for risk-taking behavior during this period (including substance use, increasing sexual activity, and disordered eating)? In exploring the factors that shape emotions, behavior, and emerging identity during adolescence, this course will examine such questions from biological and psychosocial perspectives.\n\n      less description for CAMS-UA  142 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 143",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7710",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 279",
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Janssen, Aron; Shuster, Adriana E"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  143\n\n   Sex Matters: Identity Behavior & Developement\n\nSexual identity is central to our sense of who we are and how we relate to the world. The development of this identity is essential to becoming a well-rounded, effective, and high functioning adult, and failure to develop a cohesive sexual identity can lead to dysfunction. Sexual development involves a complex interplay of biological, psychological and sociological components. Sexual differentiation begins in utero, as the fetus is exposed to hormones and growth factors. As children age, their primary and secondary sex organs develop, and their ideas about the function, use and meaning of thes...\n\n      more description for CAMS-UA  143 »\n\n      \n\n\n\nSexual identity is central to our sense of who we are and how we relate to the world. The development of this identity is essential to becoming a well-rounded, effective, and high functioning adult, and failure to develop a cohesive sexual identity can lead to dysfunction. Sexual development involves a complex interplay of biological, psychological and sociological components. Sexual differentiation begins in utero, as the fetus is exposed to hormones and growth factors. As children age, their primary and secondary sex organs develop, and their ideas about the function, use and meaning of these organs change. At each stage the environment, social milieu, and hormones, among other factors, influence the direction of these changes. In this course we will explore the impact of sexual identity development on the mental health of children and adolescents.\n\n      less description for CAMS-UA  143 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 144",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7582",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL C95",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Liaw, Karen"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  144\n\n   Looking Back On Growing Up\n\nWhat is the impact of our upbringing? This course provides an overview of child development with the goal of understanding the complexity of human growth, adaptation, and responses to adversity. To this end, we will trace a variety of overlapping trajectories, including the development of cognitive, emotional, interpersonal, and moral capacities. The course reviews historical and modern-day developmental theories as well as more complex interpersonal constructs, such as family systems, peer relations, gender and sexual identity, and cultural variation. Special emphasis is placed upon examining...\n\n      more description for CAMS-UA  144 »\n\n      \n\n\n\nWhat is the impact of our upbringing? This course provides an overview of child development with the goal of understanding the complexity of human growth, adaptation, and responses to adversity. To this end, we will trace a variety of overlapping trajectories, including the development of cognitive, emotional, interpersonal, and moral capacities. The course reviews historical and modern-day developmental theories as well as more complex interpersonal constructs, such as family systems, peer relations, gender and sexual identity, and cultural variation. Special emphasis is placed upon examining the dynamic interplay between biology and environment. The course consists of two interactive lectures per week based upon introductory readings on child development. Students are also assigned one film to view at home each week to illustrate the myriad of ways in which human beings evolve and adapt through life’s transitions and challenges.\n\n      less description for CAMS-UA  144 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 145",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7881",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 261",
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Berry, Rebecca"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  145\n\n   Morality in Childhood\n\nHow do children learn right from wrong?  Today’s youth face an onslaught of mixed messages about morality.  Parents and teachers champion honesty, integrity and empathy, while sports stars use steroids, music and video games glorify sexual violence, and politicians pander for votes based on prejudice and fear.  At the same time, children are confronted with uniquely modern moral challenges, as they navigate bullying and privacy invasion on the Internet, easily accessible drugs of abuse, and gang and relationship violence.  This course will examine how children negotiate these challenges and le...\n\n      more description for CAMS-UA  145 »\n\n      \n\n\n\nHow do children learn right from wrong?  Today’s youth face an onslaught of mixed messages about morality.  Parents and teachers champion honesty, integrity and empathy, while sports stars use steroids, music and video games glorify sexual violence, and politicians pander for votes based on prejudice and fear.  At the same time, children are confronted with uniquely modern moral challenges, as they navigate bullying and privacy invasion on the Internet, easily accessible drugs of abuse, and gang and relationship violence.  This course will examine how children negotiate these challenges and learn moral principles, using perspectives from developmental neurobiology, evolutionary biology, philosophy, and multiple theoretical frameworks within cognitive and social psychology.  Topics will include gender, culture, socioeconomic status, education, and parenting and their influence on moral development from infancy through adolescence.\n\n      less description for CAMS-UA  145 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 146",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "8230",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 203",
                    "time": "Thu 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Diamond, Ursula; Diaz, Yamalis"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  146\n\n   Twentysomething\n\nAre 20-somethings really overeducated, afraid of commitment, self-centered, and spendthrift?  It is a fact that people in most countries are marrying, having children, and becoming financially independent at a later age than in any previous generation.  In the last 10 years a critical new developmental period between adolescence and adulthood has started to gain recognition.  “Emerging Adulthood” has been characterized as the age of identity exploration, instability, self-focus, feeling “in-between,” and infinite possibilities. This course will analyze whether this theory has validity, explore...\n\n      more description for CAMS-UA  146 »\n\n      \n\n\n\nAre 20-somethings really overeducated, afraid of commitment, self-centered, and spendthrift?  It is a fact that people in most countries are marrying, having children, and becoming financially independent at a later age than in any previous generation.  In the last 10 years a critical new developmental period between adolescence and adulthood has started to gain recognition.  “Emerging Adulthood” has been characterized as the age of identity exploration, instability, self-focus, feeling “in-between,” and infinite possibilities. This course will analyze whether this theory has validity, explore the factors that contribute to diverging developmental pathways, review the typical life of the American 20-something, and uncover the truth behind the stereotypes.\n\n      less description for CAMS-UA  146 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 147",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17019",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 4.00 PM - 6.30 PM",
                    "open": true,
                    "professor": "GCASL 388"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  147\n\n   Love Actually\n\nAh, love. L’amour. The very word stirs our imaginations and pulls at our heartstrings. This most fundamental of emotions has long been a source of creative inspiration – a muse for literature, song, and art. The importance of love and intimacy in human life is clear, but what can the latest observations and scientific discoveries about the brain tell us about this supreme emotion? Through discussions, papers, and projects, we will examine the concepts of love and intimacy through various lenses, including those of neurobiology, evolutionary psychology, culture, and art. Focusing on the develop...\n\n      more description for CAMS-UA  147 »\n\n      \n\n\n\nAh, love. L’amour. The very word stirs our imaginations and pulls at our heartstrings. This most fundamental of emotions has long been a source of creative inspiration – a muse for literature, song, and art. The importance of love and intimacy in human life is clear, but what can the latest observations and scientific discoveries about the brain tell us about this supreme emotion? Through discussions, papers, and projects, we will examine the concepts of love and intimacy through various lenses, including those of neurobiology, evolutionary psychology, culture, and art. Focusing on the development of love throughout the lifecycle, we will study how people seek intimacy, how love evolves over time, the influence of love on human behavior, and love and intimacy’s relation to psychological well-being.\n\n      less description for CAMS-UA  147 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 150",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "6078",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 520",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Foubister, Nicole; Canale, Thomas"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  150\n\n   Children & The Media\n\nConsuming media has far outstripped reading storybooks or playing make-believe as the average American child’s favorite pastime. Children between the ages of two and 18 spend an average of five-and-a-half hours a day using some form of media. This course reviews the current literature on how media use affects children’s mental health, as well as their cognitive, emotional, and social development. Designed for those who wish to learn to think critically, this course provides a comprehensive, research-oriented review of how children and adolescents are influenced by the media. Discussions includ...\n\n      more description for CAMS-UA  150 »\n\n      \n\n\n\nConsuming media has far outstripped reading storybooks or playing make-believe as the average American child’s favorite pastime. Children between the ages of two and 18 spend an average of five-and-a-half hours a day using some form of media. This course reviews the current literature on how media use affects children’s mental health, as well as their cognitive, emotional, and social development. Designed for those who wish to learn to think critically, this course provides a comprehensive, research-oriented review of how children and adolescents are influenced by the media. Discussions include an examination of controversial issues, such as media’s effects on children’s violent behavior and substance use, as well as the potential benefits of media.\n\n      less description for CAMS-UA  150 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 151",
            "course_name": "",
            "description": "CAMS-UA  151\n\n   Cultural Perspectives on Mental Health & Illness\n\nHow do different cultures view mental health and illness?  Why do some ethnic groups readily accept mental health care while others generally avoid the psychiatrist or psychologist at all costs?  How does bicultural or multicultural identity and minority status affect one’s psychological development?  This course seeks to explore what we know about how culture, ethnicity, race and minority status affect the mental health of children, adolescents, and young adults in modern America.  We will start by studying the process of acculturation and mental health issues specific to immigrant youth and ...\n\n      more description for CAMS-UA  151 »\n\n      \n\n\n\nHow do different cultures view mental health and illness?  Why do some ethnic groups readily accept mental health care while others generally avoid the psychiatrist or psychologist at all costs?  How does bicultural or multicultural identity and minority status affect one’s psychological development?  This course seeks to explore what we know about how culture, ethnicity, race and minority status affect the mental health of children, adolescents, and young adults in modern America.  We will start by studying the process of acculturation and mental health issues specific to immigrant youth and children of immigrants.  We will delve into the cultural aspects of identity development, family dynamics, parenting, stigma, and mental health disparities and then segue into stereotypes and intergroup bias.  Readings will draw from the growing body of research literature, and examples from popular arts, media and entertainment will be incorporated as supplemental material for class discussion.  Students will review current treatments and participate in class discussions.  Students of all backgrounds will be encouraged to explore mental health and illness with a broadened cultural perspective.\n\n      less description for CAMS-UA  151 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 152",
            "course_name": "",
            "description": "CAMS-UA  152\n\n   Global Perspectives in Child and Adolescent Mental Health\n\nWorldwide studies suggest that up to 20 percent of children and adolescents suffer from a significant mental illness, but how mental health and illness are perceived varies greatly around the world. Through lectures, discussions, readings, and films, this course provides an overview of the scope and magnitude of child and adolescent mental health issues globally. The most commonly identified child and adolescent mental illnesses, including mood and anxiety, post-traumatic, disruptive behavior, and substance abuse disorders, are examined from various cultural perspectives. The ways in which geo...\n\n      more description for CAMS-UA  152 »\n\n      \n\n\n\nWorldwide studies suggest that up to 20 percent of children and adolescents suffer from a significant mental illness, but how mental health and illness are perceived varies greatly around the world. Through lectures, discussions, readings, and films, this course provides an overview of the scope and magnitude of child and adolescent mental health issues globally. The most commonly identified child and adolescent mental illnesses, including mood and anxiety, post-traumatic, disruptive behavior, and substance abuse disorders, are examined from various cultural perspectives. The ways in which geo-socio-politico-economic factors, specifically war and conflict, child exploitation, structural violence and poverty, and HIV/AIDS, affect child development and mental health are also studied. Finally, the course addresses the dearth of resources allocated to children’s mental health, as well as the barriers to care, such as stigma and education. Selected case studies from the Americas, Africa, Europe, Southeast Asia, East Asia, and the Middle East are used to illustrate key concepts.\n\n      less description for CAMS-UA  152 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 161",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "6079",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 203",
                    "time": "Thu 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Gallagher, Richard"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  161\n\n   The Art & Science of Parenting\n\nAfter spending our early lives with our parents, what can we say about how they influenced our personalities and development? How have our parents affected what we learn, how we act, and how we manage our health? Just as you have wondered about these questions, so have scientists and professionals. We study parenting styles in detail to identify qualities that foster healthy child development. The course reviews research on the importance of parenting practices within a family context. Students also learn how to interact effectively with parents, how to mobilize parents, and what efforts have ...\n\n      more description for CAMS-UA  161 »\n\n      \n\n\n\nAfter spending our early lives with our parents, what can we say about how they influenced our personalities and development? How have our parents affected what we learn, how we act, and how we manage our health? Just as you have wondered about these questions, so have scientists and professionals. We study parenting styles in detail to identify qualities that foster healthy child development. The course reviews research on the importance of parenting practices within a family context. Students also learn how to interact effectively with parents, how to mobilize parents, and what efforts have been successful in changing detrimental parenting actions. This course is for the curious and those interested in careers in education, health, and mental health.\n\n      less description for CAMS-UA  161 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 162",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7581",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "CANT 102",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Charuvastra, Anthony"
                }
            ],
            "course_name": "Children of Divorce",
            "description": "CAMS-UA  162 Children of Divorce \nThis course provides an overview of current research on divorce in American families. The instructor is a child and adolescent psychiatrist who has researched trauma and resilience and has worked clinically with children and families affected by divorce. The course emphasizes how divorce impacts children and their capacity to grow into loving, well-functioning, relationship-forming adults. Theories of attachment, intimacy, and communication are examined in the context of successful and failed marital relationships.",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 170",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7883",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "CANT 200",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Shatkin, Jess; Baroni, Argelinda; Canale, Thomas"
                },
                {
                    "format": "Recitation",
                    "class_id": "8846",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 5.00 PM - 6.00 PM",
                    "open": true,
                    "professor": "25W4 C-13"
                },
                {
                    "format": "Recitation",
                    "class_id": "8847",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 7.20 PM",
                    "open": true,
                    "professor": "25W4 C-13"
                },
                {
                    "format": "Recitation",
                    "class_id": "8848",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 11.00 AM - 12.00 PM",
                    "open": true,
                    "professor": "GCASL 388"
                },
                {
                    "format": "Recitation",
                    "class_id": "8849",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 6.45 PM - 7.45 PM",
                    "open": true,
                    "professor": "25W4 C-13"
                },
                {
                    "format": "Recitation",
                    "class_id": "17012",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 5.00 PM - 6.00 PM",
                    "open": true,
                    "professor": "25W4 C-8"
                },
                {
                    "format": "Recitation",
                    "class_id": "17013",
                    "section": "007",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 5.00 PM - 6.00 PM",
                    "open": true,
                    "professor": "7E12 129"
                },
                {
                    "format": "Recitation",
                    "class_id": "17014",
                    "section": "008",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 9.00 AM - 10.00 AM",
                    "open": true,
                    "professor": "7E12 LL27"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  170\n\n   While you were Sleeping\n\nSleep is something akin to the ocean-it surrounds us, and we could not live without it, yet it remains a mystery, whose secrets we are only now beginning to unfold.  Scientific research into sleep and dreams began in earnest about fifty years ago.  Since that time, the small and burgeoning field of sleep medicine has taught us a great deal about how and why we sleep.  This course will provide students with a comprehensive introduction to sleep and physiology, the evolution of sleep, circadian and biological rhythms, dreams, and the diagnosis and treatment of sleep disorders.  Through exercises...\n\n      more description for CAMS-UA  170 »\n\n      \n\n\n\nSleep is something akin to the ocean-it surrounds us, and we could not live without it, yet it remains a mystery, whose secrets we are only now beginning to unfold.  Scientific research into sleep and dreams began in earnest about fifty years ago.  Since that time, the small and burgeoning field of sleep medicine has taught us a great deal about how and why we sleep.  This course will provide students with a comprehensive introduction to sleep and physiology, the evolution of sleep, circadian and biological rhythms, dreams, and the diagnosis and treatment of sleep disorders.  Through exercises and assignments, students will learn the importance of sleep for mental and physical well-being and how to best establish a healthy sleep routine.\n\n      less description for CAMS-UA  170 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 180",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7584",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "GCASL 261"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  180\n\n   Drugs & Kids\n\nApproximately 72 percent of youth in the United States report using alcohol at least once and 47 percent report using illicit drugs at least once by the time they reach 12th grade. While the majority of youth who use substances will not develop a substance abuse disorder, substance abuse and addiction are major public health problems affecting approximately 9 percent of the U.S. population age 12 and older. The majority of individuals with substance abuse disorders began using substances during adolescence or even childhood. This course briefly reviews the classes of psychoactive substances, i...\n\n      more description for CAMS-UA  180 »\n\n      \n\n\n\nApproximately 72 percent of youth in the United States report using alcohol at least once and 47 percent report using illicit drugs at least once by the time they reach 12th grade. While the majority of youth who use substances will not develop a substance abuse disorder, substance abuse and addiction are major public health problems affecting approximately 9 percent of the U.S. population age 12 and older. The majority of individuals with substance abuse disorders began using substances during adolescence or even childhood. This course briefly reviews the classes of psychoactive substances, including alcohol, tobacco, and illicit drugs and their basic neurophysiological effects before exploring the historical, social, and psychological factors related to substance use and abuse in adolescents and children. The second half of the course considers substance abuse prevention, treatment, and policy related to children and adolescents.\n\n      less description for CAMS-UA  180 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 191",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7583",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "SILV 411"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  191\n\n   The Literature of Children & Adolescents\n\nConsiders children’s and adolescents’ literature as a rich, untapped source of insight into child development for students of psychology, child development, and related disciplines. Over the last century, a vibrant, many-faceted literature for young people has grown in tandem with our understanding of child and adolescent psychology to pre-sent young readers with an increasingly finely calibrated perspective on such basic developmental issues as the formation of trust, the emergence of a sense of autonomy, and the complexities of family and peer relationships. Students explore these and other ...\n\n      more description for CAMS-UA  191 »\n\n      \n\n\n\nConsiders children’s and adolescents’ literature as a rich, untapped source of insight into child development for students of psychology, child development, and related disciplines. Over the last century, a vibrant, many-faceted literature for young people has grown in tandem with our understanding of child and adolescent psychology to pre-sent young readers with an increasingly finely calibrated perspective on such basic developmental issues as the formation of trust, the emergence of a sense of autonomy, and the complexities of family and peer relationships. Students explore these and other topics as they read and discuss a wide range of picture books, longer fiction, and relevant professional literature.\n\n      less description for CAMS-UA  191 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 201",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "6080",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL33",
                    "time": "Wed 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Nishawala, Melissa"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  201\n\n   Adv Sem: Autism Spectrum Disorders\n\nThis advanced seminar provides students with an in-depth exposure to autism spectrum disorders (ASDs). Beginning with etiological theories, various biological, behavioral, and cognitive paradigms are examined in an effort to help students conceptualize the developmental links between brain and behavior. Epidemiology, diagnostic and treatment strategies, and finally issues of public policy are then reviewed in detail. All students must also engage in a supervised experiential lab practicum at the NYU Child Study Center’s Asperger Institute or an affiliated school where they work directly with c...\n\n      more description for CAMS-UA  201 »\n\n      \n\n\n\nThis advanced seminar provides students with an in-depth exposure to autism spectrum disorders (ASDs). Beginning with etiological theories, various biological, behavioral, and cognitive paradigms are examined in an effort to help students conceptualize the developmental links between brain and behavior. Epidemiology, diagnostic and treatment strategies, and finally issues of public policy are then reviewed in detail. All students must also engage in a supervised experiential lab practicum at the NYU Child Study Center’s Asperger Institute or an affiliated school where they work directly with children and adolescents with ASDs for three hours each week. Primary sources for the course include scientific papers, individual accounts by people living with ASDs, and reviews of current popular media and Web sites.\n\n      less description for CAMS-UA  201 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 203",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "8859",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 388",
                    "time": "Tue 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Weekly, Sara S"
                }
            ],
            "course_name": "Adv Seminar: Eating Disorders",
            "description": "CAMS-UA  203 Adv Seminar: Eating Disorders",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 204",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "6081",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-9",
                    "time": "Tue 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Roffman, Andrew"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  204\n\n   Advanced Seminar: It's a Family Affair:The Secret and Not-so Secret Life of Families\n\nUntil the mid-20th century, the fields of psychiatry, psychology, and mental health were dominated by individually oriented theories of human experience, development, and psychopathology. Family systems theory emerged as a response to the limitations of that paradigm, offering a radically different way both of thinking about individuals and doing psychotherapy. This emerging model views human experience as irreducibly relational. From a systems perspective, an individual is always an individual embedded in networks of significant relationships, the most central of which is the family. This cou...\n\n      more description for CAMS-UA  204 »\n\n      \n\n\n\nUntil the mid-20th century, the fields of psychiatry, psychology, and mental health were dominated by individually oriented theories of human experience, development, and psychopathology. Family systems theory emerged as a response to the limitations of that paradigm, offering a radically different way both of thinking about individuals and doing psychotherapy. This emerging model views human experience as irreducibly relational. From a systems perspective, an individual is always an individual embedded in networks of significant relationships, the most central of which is the family. This course presents family systems theory as a powerful tool for understanding families and for working with children and adolescents and includes various clinical experiences. Special emphasis is made throughout on multicultural dimensions of theory and practice.\n\n      less description for CAMS-UA  204 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 205",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "7935",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL147",
                    "time": "Mon 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Angelosante, Aleta; Spindel, Carrie B; Canale, Thomas"
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  205\n\n   Fear factor: Advanced Seminar in Anxiety Disorders\n\nThis advanced seminar will provide students with an in depth exposure to Anxiety Disorders. Beginning with etiological theories, we will examine various biological, behavioral and cognitive paradigms to conceptualize the developmental links between brain, environment, and behavior. We will then move onto diagnostic and treatment strategies, and finally current cutting-edge topics, such as the role of emotion regulation and disgust in anxiety disorders and efforts to take anxiety treatments into school settings. Primary sources for the course will include scientific papers, current chapters, an...\n\n      more description for CAMS-UA  205 »\n\n      \n\n\n\nThis advanced seminar will provide students with an in depth exposure to Anxiety Disorders. Beginning with etiological theories, we will examine various biological, behavioral and cognitive paradigms to conceptualize the developmental links between brain, environment, and behavior. We will then move onto diagnostic and treatment strategies, and finally current cutting-edge topics, such as the role of emotion regulation and disgust in anxiety disorders and efforts to take anxiety treatments into school settings. Primary sources for the course will include scientific papers, current chapters, and classroom demonstrations and discussions.\n\n      less description for CAMS-UA  205 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 206",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17021",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 512",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "Becker-weidman, Emily"
                }
            ],
            "course_name": "Advanced Seminar: Attachment and Loss",
            "description": "CAMS-UA  206 Advanced Seminar: Attachment and Loss",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 207",
            "course_name": "",
            "description": "CAMS-UA  207\n\n   Advanced Seminar: Transgender Youth\n\nTransgender and gender non-conforming (TGNC) youth are quickly becoming more visible in society.  Parents of gender non-conforming children are coming to mental health providers in increasing numbers and are often met with stigma and bias and a lack of education on TGNC health.  TGNC youth are turned out of their homes at disproportionate rates and harassed and bullied in school at higher rates than their gender conforming peers.  They have higher rates of suicide, depression and substance abuse and face unique medical, legal and social barriers.  They also have produced their own cultures and...\n\n      more description for CAMS-UA  207 »\n\n      \n\n\n\nTransgender and gender non-conforming (TGNC) youth are quickly becoming more visible in society.  Parents of gender non-conforming children are coming to mental health providers in increasing numbers and are often met with stigma and bias and a lack of education on TGNC health.  TGNC youth are turned out of their homes at disproportionate rates and harassed and bullied in school at higher rates than their gender conforming peers.  They have higher rates of suicide, depression and substance abuse and face unique medical, legal and social barriers.  They also have produced their own cultures and communities to face these challenges.  This course will examine the scientific research on TGNC youth in the context of the practical challenges faced by these individuals and their families.  Students will hear from experts in the field, receive personal accounts from TGNC teens and transgender adults, and take field trips to social services agencies and events produced by TGNC teens themselves.\n\n      less description for CAMS-UA  207 «",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 208",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17777",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  208\n\n   Advanced Seminar: Speaking Our Minds – Narrating Mental Illness\n\nStories of mental illness are all too often told from the perspective of those who study or treat it. By contrast, this course examines mental illness through the lens of those who experience it first-hand and creatively transform their experience into something that can be shared with others. Narrative has the unique ability to relate the felt experience of mental illness in a way that the conventional patient history, chart, or any strictly medical documentation cannot. Through close examination of video testimony, memoir, autobiographical fiction, theater and film, students will learn to re...\n\n      more description for CAMS-UA  208 »\n\n      \n\n\n\nStories of mental illness are all too often told from the perspective of those who study or treat it. By contrast, this course examines mental illness through the lens of those who experience it first-hand and creatively transform their experience into something that can be shared with others. Narrative has the unique ability to relate the felt experience of mental illness in a way that the conventional patient history, chart, or any strictly medical documentation cannot. Through close examination of video testimony, memoir, autobiographical fiction, theater and film, students will learn to receive and interpret the illness experience, with a focus on applications for public health, advocacy and social justice.\n\n      less description for CAMS-UA  208 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 300",
            "course_name": "Internship I",
            "description": "CAMS-UA  300 Internship I",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 301",
            "course_name": "Internship II",
            "description": "CAMS-UA  301 Internship II",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 401",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "9194",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Gallagher, Richard; Diaz, Yamalis",
                    "time": "Tue 1.30 PM - 3.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "CAMS-UA  401\n\n   Advanced Study of Clinical Intervention & Clinical Research\n\nThis course will help students understand the assessment, treatment, and effectiveness evaluation procedures used in child and adolescent mental health.  A combination of a weekly seminar, a lab placement at the NYU Child Study Center for 4 hours each week, and the completion of course exercises will allow students to obtain a comprehensive knowledge of current clinical practices and how those practices are developed and evaluated.  In addition to the course instructors, two experienced clinical psychologists, students will participate with other faculty members during their 4-hour lab.  Place...\n\n      more description for CAMS-UA  401 »\n\n      \n\n\n\nThis course will help students understand the assessment, treatment, and effectiveness evaluation procedures used in child and adolescent mental health.  A combination of a weekly seminar, a lab placement at the NYU Child Study Center for 4 hours each week, and the completion of course exercises will allow students to obtain a comprehensive knowledge of current clinical practices and how those practices are developed and evaluated.  In addition to the course instructors, two experienced clinical psychologists, students will participate with other faculty members during their 4-hour lab.  Placements involve:  the Parent-Child Interaction Therapy team, the Selective Mutism team, the Organizational Skills Study Group, the Institute for Learning and Academic Achievement, the Dialectical Behavior Therapy Program, and the Autism Spectrum Disorders Program.  Students are evaluated on seminar participation, completion of assignments, reviews of their placement activity, and a scholarly paper on their chosen topic.\n\n      less description for CAMS-UA  401 «",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 997",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "6082",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "CAMS-UA  997 Independent Study \nThe independent study program offers upper-division students the opportunity to investigate an advanced topic with a faculty member in the Department of Child and Adolescent Psychiatry. Areas of study may include research methods, clinical interviewing, systems of care, and education and training.",
            "offering": true
        },
        {
            "course_id": "CAMS-UA 998",
            "course_name": "Independent Study",
            "description": "CAMS-UA  998 Independent Study \nThe independent study program offers upper-division students the opportunity to investigate an advanced topic with a faculty member in the Department of Child and Adolescent Psychiatry. Areas of study may include research methods, clinical interviewing, systems of care, and education and training.",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 9101",
            "course_name": "Child & Adolescent Psychopathology",
            "description": "CAMS-UA 9101 Child & Adolescent Psychopathology",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 9110",
            "course_name": "The Science of Happiness",
            "description": "CAMS-UA 9110 The Science of Happiness",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 9141",
            "course_name": "Child and Adolescent Brain Development:  Application from Neuroscience to Practice",
            "description": "CAMS-UA 9141 Child and Adolescent Brain Development:  Application from Neuroscience to Practice",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 9145",
            "course_name": "Morality in Childhood",
            "description": "CAMS-UA 9145 Morality in Childhood \nHow do children learn right from wrong? Today's youth face an onslaught of\nmixed messages about morality. Parents and teachers champion honesty,\nintegrity, and empathy, while sports stars use steroids, music and video\ngames glorify sexual violence, and politicians pander for votes based on\nprejudice and fear. At the same time, children are confronted with uniquely\nmodern moral challenges, as they navigate bullying and privacy invasion on\nthe Internet, easily accessible drugs, and gang and relationship violence.",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 9170",
            "course_name": "While You Were Sleeping",
            "description": "CAMS-UA 9170 While You Were Sleeping",
            "offering": false
        },
        {
            "course_id": "CAMS-UA 9202",
            "course_name": "Adv Sem: Global Persp in Child & Adolescent Mh",
            "description": "CAMS-UA 9202 Adv Sem: Global Persp in Child & Adolescent Mh",
            "offering": false
        }
    ]
}