{
    "major_id": "COREX-AD",
    "file": "./2015-2016/Core:_Ideas_and_Methods_of_ScienceEDNW_(COREX-AD).html",
    "courses": [
        {
            "course_id": "COREX-AD 1",
            "course_name": "",
            "description": "COREX-AD    1\n\n   The Desert: Life in an Arid Environment\n\nWhile seemingly inhospitable to life, the desert teems with animals and plants that have evolved to cope with an arid environment. This course addresses fundamental questions related to desert climates and the species that populate them. What geographic conditions generate a desert terrain? How rapidly does the terrain change over time? What are the special attributes of the plants and animals that thrive in desert climates, and how do these populations change as the desert changes? This course uses the local terrain as a laboratory to address these questions, and team projects requiring field...\n\n      more description for COREX-AD    1 »\n\n      \n\n\n\nWhile seemingly inhospitable to life, the desert teems with animals and plants that have evolved to cope with an arid environment. This course addresses fundamental questions related to desert climates and the species that populate them. What geographic conditions generate a desert terrain? How rapidly does the terrain change over time? What are the special attributes of the plants and animals that thrive in desert climates, and how do these populations change as the desert changes? This course uses the local terrain as a laboratory to address these questions, and team projects requiring field work form the core of the learning experience.\n\n      less description for COREX-AD    1 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 12",
            "course_name": "",
            "description": "COREX-AD   12\n\n   Language of Computers\n\nThis course introduces students to the basics of how computers “think” and some of the inherent limitations of computers. How do programs (software applications) make computers behave intelligently and allow them to solve problems effectively for a wide range of applications and fields, from art and other media to education, medicine, and the core sciences? How do we use computer programs to process, structure, and manage information, create and manipulate digital media, and search and gather information relevant to any particular topic? How do computer programs operate virtually, creating the...\n\n      more description for COREX-AD   12 »\n\n      \n\n\n\nThis course introduces students to the basics of how computers “think” and some of the inherent limitations of computers. How do programs (software applications) make computers behave intelligently and allow them to solve problems effectively for a wide range of applications and fields, from art and other media to education, medicine, and the core sciences? How do we use computer programs to process, structure, and manage information, create and manipulate digital media, and search and gather information relevant to any particular topic? How do computer programs operate virtually, creating the World Wide Web of the modern digital age, and how does all of this effect issues related to security and privacy in the wired world we live in today? Students are asked to create innovative programming solutions to a set of problems  and develop applications focused on the social good for their final project.  The programming language of choice is Python, a relatively easy programming language with powerful visual, text processing, and graphics capabilities. This course is intended for students from different disciplines (outside the sciences); no prerequisite is needed.\n\n      less description for COREX-AD   12 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 13",
            "course_name": "",
            "description": "COREX-AD   13\n\n   Mutations and Disease\n\nThe very word “mutations” tends to raise fear and apprehension since it is so often associated with physical deformities or exposure to harmful agents, including radiation. Perhaps such fear is warranted since many human diseases, including cystic fibrosis and cancer, are caused by “mutations”, which are mere changes in the genetic information in DNA. Starting with basic concepts, this course explores important cellular macromolecules, such as DNA, and proteins as well as their threedimensional structures that endow them with their specific functions. In fact, understanding how mutations induc...\n\n      more description for COREX-AD   13 »\n\n      \n\n\n\nThe very word “mutations” tends to raise fear and apprehension since it is so often associated with physical deformities or exposure to harmful agents, including radiation. Perhaps such fear is warranted since many human diseases, including cystic fibrosis and cancer, are caused by “mutations”, which are mere changes in the genetic information in DNA. Starting with basic concepts, this course explores important cellular macromolecules, such as DNA, and proteins as well as their threedimensional structures that endow them with their specific functions. In fact, understanding how mutations induce alterations to acromolecular structures often sheds light on the characteristic symptoms and prognoses of some human diseases and syndromes. Laboratory projects, which focus on introduction to computer modeling, emphasize visualizing in a three-dimensional environment the normal and altered macromolecules associated with some common but complex human maladies.\n\n      less description for COREX-AD   13 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 15",
            "course_name": "",
            "description": "COREX-AD   15\n\n   Microbes\n\nMicrobes are tiny organisms that are found on every imaginable surface and habitat. This complex myriad can consist of microbes that are essential to a healthy life, as well as microbes that cause infectious diseases in plants and animals, which may also contribute to many chronic diseases and conditions, such as cancer and environmentally-related diseases. To understand the delicate and complex relationship we have with these different forms of microbes, scientists have looked at their DNA for clues and answers to their causes, developing tools to help with diagnostic tests, and the developme...\n\n      more description for COREX-AD   15 »\n\n      \n\n\n\nMicrobes are tiny organisms that are found on every imaginable surface and habitat. This complex myriad can consist of microbes that are essential to a healthy life, as well as microbes that cause infectious diseases in plants and animals, which may also contribute to many chronic diseases and conditions, such as cancer and environmentally-related diseases. To understand the delicate and complex relationship we have with these different forms of microbes, scientists have looked at their DNA for clues and answers to their causes, developing tools to help with diagnostic tests, and the development of treatments and prevention methods. This information also comes with various social, ethical, and political implications that determine how we use our knowledge of these microbes. This course will introduce students to these issues by first learning the fundamentals of the biological molecules that comprise the cell and through a hands-on research project, students will identify the local microbes through their DNA. Students will also discuss how microbes positively and negatively affect the various policy options that are relevant to the social dilemmas that science created.\n\n      less description for COREX-AD   15 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 16",
            "course_name": "",
            "description": "COREX-AD   16\n\n   Where the City Meets the Sea: Studies in Coastal Urban Environments\n\nOver half of the human population lives within 100 km of a coast and coastlines contain more than two-thirds of the world’s largest cities. As a result, the world’s natural coastal environments have been substantially modified to suit human needs. This course uses the built and natural environments of coastal cities as laboratories to examine the environmental and ecological implications of urban\ndevelopment in coastal areas. Using data from multiple coastal cities, student teams use fieldbased studies and Geographic Information System\n(GIS) data to examine patterns and processes operating in ...\n\n      more description for COREX-AD   16 »\n\n      \n\n\n\nOver half of the human population lives within 100 km of a coast and coastlines contain more than two-thirds of the world’s largest cities. As a result, the world’s natural coastal environments have been substantially modified to suit human needs. This course uses the built and natural environments of coastal cities as laboratories to examine the environmental and ecological implications of urban\ndevelopment in coastal areas. Using data from multiple coastal cities, student teams use fieldbased studies and Geographic Information System\n(GIS) data to examine patterns and processes operating in coastal cities. This course uses the local terrestrial, marine, and built environments as a laboratory to address these issues, and team projects requiring field work form a core\ncomponent of the learning experience. As part of the NYU Global Network University initiative this course is being offered simultaneously in several\nNYU sites globally and students are collaborating extensively with students from their sister campuses through the duration of this course.\n\n      less description for COREX-AD   16 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 17",
            "course_name": "",
            "description": "COREX-AD   17\n\n   Domain of Crystals\n\nKnowing the three-dimensional structure of a molecule is important for understanding its functional properties. Is it indeed possible to visually analyze a molecule and use the observed experimental data to build a three-dimensional\nmodel? This structural information can be obtained using a variety of analytical techniques such as X-ray crystallography, and can lead to significant breakthroughs in pharmaceutics. Students grow crystals of different colors, shapes, and sizes and harvest them for physical and morphological characterization in order to understand the basic principles of atomic str...\n\n      more description for COREX-AD   17 »\n\n      \n\n\n\nKnowing the three-dimensional structure of a molecule is important for understanding its functional properties. Is it indeed possible to visually analyze a molecule and use the observed experimental data to build a three-dimensional\nmodel? This structural information can be obtained using a variety of analytical techniques such as X-ray crystallography, and can lead to significant breakthroughs in pharmaceutics. Students grow crystals of different colors, shapes, and sizes and harvest them for physical and morphological characterization in order to understand the basic principles of atomic structure and theory, chemical bonding and reactions, thermochemistry, periodicity, and solution chemistry.\n\n      less description for COREX-AD   17 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 24",
            "course_name": "J",
            "description": "COREX-AD   24J\n\n   Heuristics\n\nMany problems in science, business, and politics require heuristics—problem solving techniques that often work well even if not perfectly. Many problems in science, business, and politics require heuristics—problem solving techniques\nthat often work well even if not perfectly. This course teaches heuristics as they have applied in the design of scientific experiments, the solution of problems global power politics, and in the resolution of economic negotiations. While being exposed to heuristic techniques, students work in small teams that compete with one another to design strategies to solve...\n\n      more description for COREX-AD   24J »\n\n      \n\n\n\nMany problems in science, business, and politics require heuristics—problem solving techniques that often work well even if not perfectly. Many problems in science, business, and politics require heuristics—problem solving techniques\nthat often work well even if not perfectly. This course teaches heuristics as they have applied in the design of scientific experiments, the solution of problems global power politics, and in the resolution of economic negotiations. While being exposed to heuristic techniques, students work in small teams that compete with one another to design strategies to solve new puzzles better than\nother teams. You are given computational tools as needed, but the course has no programming prerequisite. To take this course, you should love to think both qualitatively and quantitatively. Among the specific problems we tackle include the design of currencies, leasing strategies for oil exploration, optimal matchmaking, and efficient experimental design. The intent is to make you better able to face complex problems in any field you choose.\n\n      less description for COREX-AD   24J «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 25",
            "course_name": "J",
            "description": "COREX-AD   25J\n\n   Coastal Urbanization and Environmental Change\n\nOver 80% of the Australian population lives within 100 km of a coast and virtually all major Australian cities occur on coastlines. As a result, Australia’s coastal environments have been substantially modified to suit human needs. This course uses the built and natural environments of Sydney, Australia’s largest city, as a case study to examine the environmental and ecological implications of urban development in coastal areas worldwide. Using Sydney’s terrestrial, marine, and built environments as a natural laboratory for field research, students collect environmental data throughout the cit...\n\n      more description for COREX-AD   25J »\n\n      \n\n\n\nOver 80% of the Australian population lives within 100 km of a coast and virtually all major Australian cities occur on coastlines. As a result, Australia’s coastal environments have been substantially modified to suit human needs. This course uses the built and natural environments of Sydney, Australia’s largest city, as a case study to examine the environmental and ecological implications of urban development in coastal areas worldwide. Using Sydney’s terrestrial, marine, and built environments as a natural laboratory for field research, students collect environmental data throughout the city and use geographic information systems (GIS) to examine the spatial patterns of human impacts to Sydney’s environment and to compare their results with patterns observed in other coastal cities.\n\n      less description for COREX-AD   25J «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 26",
            "course_name": "",
            "description": "COREX-AD   26\n\n   Sustainable Energy\n\nHow do solar cells work? What is “green” chemistry? What are “smart materials” and why are they important? Focusing on the intersection of the natural sciences, materials science, ecology and sociology, this interdisciplinary course tackles these and other energy-related issues that are central to the ideal of a sustainable society. The future social and technological advancements and prosperity of mankind are directly linked to renewable energy resources, which are rooted in the quest for new, advanced functional materials with superb physical properties. The course provides a holistic overvi...\n\n      more description for COREX-AD   26 »\n\n      \n\n\n\nHow do solar cells work? What is “green” chemistry? What are “smart materials” and why are they important? Focusing on the intersection of the natural sciences, materials science, ecology and sociology, this interdisciplinary course tackles these and other energy-related issues that are central to the ideal of a sustainable society. The future social and technological advancements and prosperity of mankind are directly linked to renewable energy resources, which are rooted in the quest for new, advanced functional materials with superb physical properties. The course provides a holistic overview of the current issues with inexpensive energy resources and the challenges with alternative energies. It provokes the creative input of students and includes undergraduate research projects, field work and brainstorming discussions aimed at possible alternative solutions.\n\n      less description for COREX-AD   26 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 30",
            "course_name": "",
            "description": "COREX-AD   30\n\n   The Mind\n\nThis course explores the perennial question, how does the mind work? We learn how philosophers, computer scientists, neuroscientists, psychologists, and linguists have answered this question. We consider several stimulating but\ndemanding questions about the nature of the mind and try to understand how the mind enables such things as perception, thinking, and behavior. We review the historical and scientific developments that led to the contemporary consensus that the human mind is fundamentally a computational organ and explore some of the challenges that this view poses to our common sense un...\n\n      more description for COREX-AD   30 »\n\n      \n\n\n\nThis course explores the perennial question, how does the mind work? We learn how philosophers, computer scientists, neuroscientists, psychologists, and linguists have answered this question. We consider several stimulating but\ndemanding questions about the nature of the mind and try to understand how the mind enables such things as perception, thinking, and behavior. We review the historical and scientific developments that led to the contemporary consensus that the human mind is fundamentally a computational organ and explore some of the challenges that this view poses to our common sense understanding of certain attributes, like consciousness and free will, that we ascribe to ourselves as human beings.\n\n      less description for COREX-AD   30 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 35",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12883",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 002",
                    "time": "Mon 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Magzoub, Mazin"
                },
                {
                    "format": "Laboratory",
                    "class_id": "12887",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 002",
                    "time": "Wed 9.15 AM - 11.55 AM",
                    "open": true,
                    "professor": "Magzoub, Mazin"
                }
            ],
            "course_name": "",
            "description": "COREX-AD   35\n\n   Seven Wonders of the Invisible World\n\n“In the year of 1657 I discovered very small living creatures in rain water.” This quote is attributed to Anton van Leeuwenhoek, a Dutch merchant whose\nskillful use of glass lenses allowed him to peer into a world of microorganisms that would otherwise be invisible to the naked eye. His careful observations\ngave way to advances in microscopy that have allowed scientists to observe detailed structures of plants, viruses invading cells, intricate crystal lattices, and the seemingly chaotic motion of small particles. In this course, microscopy is explored, first by examining the fundamental optic...\n\n      more description for COREX-AD   35 »\n\n      \n\n\n\n“In the year of 1657 I discovered very small living creatures in rain water.” This quote is attributed to Anton van Leeuwenhoek, a Dutch merchant whose\nskillful use of glass lenses allowed him to peer into a world of microorganisms that would otherwise be invisible to the naked eye. His careful observations\ngave way to advances in microscopy that have allowed scientists to observe detailed structures of plants, viruses invading cells, intricate crystal lattices, and the seemingly chaotic motion of small particles. In this course, microscopy is explored, first by examining the fundamental optical systems used to magnify objects, and eventually by using sophisticated microscopes to make observations. We explore seven wonders of the invisible world— natural animate and inanimate phenomena that include micro-animals, plant and animal cells, bacteria and viruses, fungi, proteins and naturallyoccurring\ncrystals.\n\n      less description for COREX-AD   35 «",
            "offering": true
        },
        {
            "course_id": "COREX-AD 43",
            "course_name": "",
            "description": "COREX-AD   43\n\n   Behavior\n\nWhy we behave in a certain way is one of the most fascinating and complex questions and one that we often cannot even explain to ourselves. So what drives behavior? How can behavior be measured? And can behavior be changed? This course will examine behavior from the viewpoints of biology, neuroscience, economics, psychology and philosophy. We will place an emphasis on interpreting and designing experiments that measure behavior in both humans and animals. We will discuss topics as diverse as memory, morality and altruism and examine how being part of small and large groups can affect decision-...\n\n      more description for COREX-AD   43 »\n\n      \n\n\n\nWhy we behave in a certain way is one of the most fascinating and complex questions and one that we often cannot even explain to ourselves. So what drives behavior? How can behavior be measured? And can behavior be changed? This course will examine behavior from the viewpoints of biology, neuroscience, economics, psychology and philosophy. We will place an emphasis on interpreting and designing experiments that measure behavior in both humans and animals. We will discuss topics as diverse as memory, morality and altruism and examine how being part of small and large groups can affect decision-making and behavior.\n\n      less description for COREX-AD   43 «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 48",
            "course_name": "J",
            "description": "COREX-AD   48J\n\n   Big Data\n\nBig Data is the science of large data sets. These sets have appeared in rising volume, variety and velocity during the last decade. The rise of big data is due chiefly to data collection via social networks, E-commerce and web navigation, but other types of data collection, related to phones, medicine or world trade are also involved. How do we get relevant information from these large data sets? For example, based on a very accurate analysis of their own collected data sets, companies as Google, Amazon, Facebook or Netflix manage to get significant hints about what should interest specific cu...\n\n      more description for COREX-AD   48J »\n\n      \n\n\n\nBig Data is the science of large data sets. These sets have appeared in rising volume, variety and velocity during the last decade. The rise of big data is due chiefly to data collection via social networks, E-commerce and web navigation, but other types of data collection, related to phones, medicine or world trade are also involved. How do we get relevant information from these large data sets? For example, based on a very accurate analysis of their own collected data sets, companies as Google, Amazon, Facebook or Netflix manage to get significant hints about what should interest specific customers. Data analysis is also becoming more important in healthcare with personalized medicine. This course takes a cross-disciplinary approach to Big Data, beginning with the sources and applications of Big Data, such as business, genomics, economics, and sociology. Then, we will look at how statistics and computer science (via machine learning) aid the analysis of data sets.\n\n      less description for COREX-AD   48J «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 51",
            "course_name": "J",
            "description": "COREX-AD   51J\n\n   Biomimetics\n\nHow does nature serve as a model for the design of synthetic materials? Biomimetics  is defined as the structure and function of biological systems as models for the design and engineering of materials.This introductory course reviews the complexities in natural materials following millions of years of evolution and how efficient they are in comparison to \nstandard engineering materials in performing specific tasks.  The course  will also present students with the basic concepts of engineering  materials (metals, ceramics, polymers, semiconductors) and their structure/property relationship and...\n\n      more description for COREX-AD   51J »\n\n      \n\n\n\nHow does nature serve as a model for the design of synthetic materials? Biomimetics  is defined as the structure and function of biological systems as models for the design and engineering of materials.This introductory course reviews the complexities in natural materials following millions of years of evolution and how efficient they are in comparison to \nstandard engineering materials in performing specific tasks.  The course  will also present students with the basic concepts of engineering  materials (metals, ceramics, polymers, semiconductors) and their structure/property relationship and how current manufacturing techniques  inspire scientists to recreate nature-like structures to improve current engineering practice.  The course is geared to the classroom and  experimental laboratory setting where students manipulate materials and  explore material properties for biomimetic design.\n\n      less description for COREX-AD   51J «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 52",
            "course_name": "J",
            "description": "COREX-AD   52J\n\n   Computational Tools for Cultural Comparison\n\nDifferent cultures have both unique and common properties.  These can be linguistic properties, properties of politeness, of government, of art, of economics, of food, of gender relationships, and even of war. Tools for cross-cultural comparison should allow those who are familiar with only a few cultures to enter properties and values about those cultures and then allow searchers to compare the cultures in various ways. For example, it should be possible to discover the commonalities and differences among pairs of cultures, to cluster many cultures based on their commonalities, and to find cu...\n\n      more description for COREX-AD   52J »\n\n      \n\n\n\nDifferent cultures have both unique and common properties.  These can be linguistic properties, properties of politeness, of government, of art, of economics, of food, of gender relationships, and even of war. Tools for cross-cultural comparison should allow those who are familiar with only a few cultures to enter properties and values about those cultures and then allow searchers to compare the cultures in various ways. For example, it should be possible to discover the commonalities and differences among pairs of cultures, to cluster many cultures based on their commonalities, and to find cultural rules of the form \"if culture has property x, then it has property y\".  This course will begin with the discussion of a key cultural notion-- language. You will learn the basics of linguistics and then will interact with a cross-cultural database and analysis platform called Terraling. We will also study data sets that may be useful for cross-cultural analysis mostly from the social sciences, anthropology, and archaeology.  After that, you will engage in projects to use Terraling to enter other properties and values about a topic of your choice (e.g. about food, legal structure etc.). Some of that data will come from the data sets others have gathered that are on the web and some will come from data that you yourselves gather. In the process you will learn elements of statistics, machine learning, programming in Python, and experimental design and evaluation.\n\n      less description for COREX-AD   52J «",
            "offering": false
        },
        {
            "course_id": "COREX-AD 54",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17234",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 002 with Boissinot, Stephane08/30/2015 - 12/17/2015 Thu 10.40 AM - 11.55 AM at SOC_SCI 002",
                    "time": "Tue 9.15 AM - 11.55 AM",
                    "open": true,
                    "professor": "Boissinot, Stephane"
                }
            ],
            "course_name": "",
            "description": "COREX-AD   54\n\n   Diversity\n\nThis course will investigate two fundamental concepts: Identity, “Who am I?”, and Diversity, “How am I different from other human beings?” These questions will be addressed from cultural, environmental and biological perspectives. We will examine the origin of human diversity, how human diversity is measured and analyzed, and how our perception of diversity has changed through history. Emphasis will be placed on recent progress in genetics and evolution and how this progress affects our daily life and identity. Students will learn how genes can inform us about human history, ancestry and evolu...\n\n      more description for COREX-AD   54 »\n\n      \n\n\n\nThis course will investigate two fundamental concepts: Identity, “Who am I?”, and Diversity, “How am I different from other human beings?” These questions will be addressed from cultural, environmental and biological perspectives. We will examine the origin of human diversity, how human diversity is measured and analyzed, and how our perception of diversity has changed through history. Emphasis will be placed on recent progress in genetics and evolution and how this progress affects our daily life and identity. Students will learn how genes can inform us about human history, ancestry and evolution. The laboratory component of the course will demonstrate how data are generated and analyzed, and will explore the difficulty encountered by scientists in inferring processes from observations and experiments. Students will have the option to collect and analyze genetic data from their own genome.\n\n      less description for COREX-AD   54 «",
            "offering": true
        },
        {
            "course_id": "COREX-AD 60",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19277",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 002 with Roberts, Mallory08/30/2015 - 12/17/2015 Thu 2.10 PM - 4.50 PM at SOC_SCI 002",
                    "time": "Tue 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Roberts, Mallory"
                }
            ],
            "course_name": "",
            "description": "COREX-AD   60\n\n   Observing the Universe\n\nObservation is always the first step in the scientific process, usually followed by hypotheses and experimental tests. In astronomy, observation is nearly the only way to get data and test theories. For most of human history, astronomical observations were done using the human eye aided by simple instruments. The early telescopes were also aids to the human eye. It wasn't until photography was invented in the late 19th century that astronomy began to become independent of an individual observer's eyes. In this class, we will explore the development of our understanding of the Universe through ...\n\n      more description for COREX-AD   60 »\n\n      \n\n\n\nObservation is always the first step in the scientific process, usually followed by hypotheses and experimental tests. In astronomy, observation is nearly the only way to get data and test theories. For most of human history, astronomical observations were done using the human eye aided by simple instruments. The early telescopes were also aids to the human eye. It wasn't until photography was invented in the late 19th century that astronomy began to become independent of an individual observer's eyes. In this class, we will explore the development of our understanding of the Universe through the historical development of observational tools and techniques. We will start with the instruments of the ancients and progress to the modern era using data from today's most advanced observatories which are no longer limited to light our eyes can see. However, we are still limited almost exclusively to what the Universe chooses to show us through electromagnetic or other types of radiation, since even our deepest space probes have only barely left the solar system. This course will entail several observations at night.\n\n      less description for COREX-AD   60 «",
            "offering": true
        }
    ]
}