{
    "major_id": "COREP-AD",
    "file": "./2015-2016/Core:_Pathways_of_World_Literature(COREP-AD).html",
    "courses": [
        {
            "course_id": "COREP-AD 1",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19562",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 018",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Parreiras-Horta, Luis Paulo-Lemo"
                },
                {
                    "format": "Workshop",
                    "class_id": "19563",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 018",
                    "time": "Sun 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Parreiras-Horta, Luis Paulo-Lemo"
                }
            ],
            "course_name": "W",
            "description": "COREP-AD    1W\n\n   1001 Nights: Culture and Difference\n\nThis course focuses on questions of religious and cultural difference through the 1001 Nights and related texts. Jewish, Christian, Zoroastrian, Muslim and ‘pagan’ realms co-exist uneasily in the original cycle of tales that often confront their protagonists with such differences as a problem. Even the possession of supernatural powers recurs in the tales in the form of an accusation made against perceived outsiders (the Maghrebi magician, the Jewish professional, the Sapphic witch). The reception of the Nights tales in Europe, Marina Warner contends in Stranger Magic, animated the new science...\n\n      more description for COREP-AD    1W »\n\n      \n\n\n\nThis course focuses on questions of religious and cultural difference through the 1001 Nights and related texts. Jewish, Christian, Zoroastrian, Muslim and ‘pagan’ realms co-exist uneasily in the original cycle of tales that often confront their protagonists with such differences as a problem. Even the possession of supernatural powers recurs in the tales in the form of an accusation made against perceived outsiders (the Maghrebi magician, the Jewish professional, the Sapphic witch). The reception of the Nights tales in Europe, Marina Warner contends in Stranger Magic, animated the new sciences of anthropology and psychology, suggesting alternative modes of modernity less strictly beholden to Enlightenment reason. Cultural difference peaked the interest of the translators who brought the Nights to Europe and pioneered travelogues and ethnographies of the Levant, Egypt and Arabia. Their writings would serve as points of departure for seminal works on the engagement with cultural difference and its representation, Appiah’s Cosmopolitanism and Said’s Orientalism. Texts studied include Galland’s history of the coffee trade, folktales, histories, travelogues, ethnographies, polemics, and literary and cinematic retellings.\n\n      less description for COREP-AD    1W «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 2",
            "course_name": "",
            "description": "COREP-AD    2\n\n   Discovery and Recognition in Narrative, Film, and Drama\n\nAcross all cultures, stories are fashioned to withhold information at first, holding our attention through suspense. They then produce disclosures at crucial moments of denouement. For Aristotle, this dynamic movement from ignorance to knowledge is essential, especially when it takes the form of the discovery—or recognition— of previously unknown identity. Tracing an arc from the ancient world to the present day, students study how the epistemology of modern storytelling across cultures disturbs the familiar patterns of clear and comforting revelation associated with classic genres. Readings i...\n\n      more description for COREP-AD    2 »\n\n      \n\n\n\nAcross all cultures, stories are fashioned to withhold information at first, holding our attention through suspense. They then produce disclosures at crucial moments of denouement. For Aristotle, this dynamic movement from ignorance to knowledge is essential, especially when it takes the form of the discovery—or recognition— of previously unknown identity. Tracing an arc from the ancient world to the present day, students study how the epistemology of modern storytelling across cultures disturbs the familiar patterns of clear and comforting revelation associated with classic genres. Readings include: Aristotle’s Poetics; Oedipus Rex; the Odyssey; the Old Testament; the Gospels of Mark and John; the Qur’an; the Arabian Nights; Shakespeare’s King Lear; Naguib Mafouz; and films from the 1940s to the present.\n\n      less description for COREP-AD    2 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 3",
            "course_name": "W Journeys",
            "description": "COREP-AD    3W Journeys \nThe search for knowledge has been linked historically to the traveler’s experience of new places and peoples. Travel necessitates the creation of translations that reveal how knowledge of otherness necessarily involves comparison to home\nand self. Drawing on texts that represent travel in realistic, figurative, and fantastic terms, we explore the idea that a journey entails the discovery, not only of a destination, but also of the self. As Rilke wrote, “There is only one journey. Going inside yourself.”",
            "offering": false
        },
        {
            "course_id": "COREP-AD 4",
            "course_name": "W",
            "description": "COREP-AD    4W\n\n   Reimagining Nature\n\nFor the first time in human history, the weather is about us.  Growing scientific evidence of catastrophic—and anthropogenic— climate change brings new urgency to an old question: how do we humans conceive of our relationship to “nature”? This course explores how imaginative writers have situated the human in relation to Earth’s many landscapes, plants, climates, and species. How have they depicted meaningful encounters between humans and the other animals? What have they suggested about humans’ responsibilities to the countless other living beings with whom we share this planet? How have they...\n\n      more description for COREP-AD    4W »\n\n      \n\n\n\nFor the first time in human history, the weather is about us.  Growing scientific evidence of catastrophic—and anthropogenic— climate change brings new urgency to an old question: how do we humans conceive of our relationship to “nature”? This course explores how imaginative writers have situated the human in relation to Earth’s many landscapes, plants, climates, and species. How have they depicted meaningful encounters between humans and the other animals? What have they suggested about humans’ responsibilities to the countless other living beings with whom we share this planet? How have they “mapped” the slippery and shifting conceptual ground that lies between the “man-made” and the “natural”? And how might a renewed engagement with this vast theme help us deal with the heavy weather ahead? Readings include Gilgamesh, Genesis, Bacchae, Narrow Road to the North, Walden, Island of Dr. Moreau, Do Androids Dream of Electric Sheep? and Life of Pi.\n\n      less description for COREP-AD    4W «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 10",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17864",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Roth, Nadine"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   10\n\n   Imagined Cities\n\nThis course examines the ways in which writers have responded to the social complexity of urban life and the difficult task of finding points of connection within the diversity of the city. How do writers narrate both the order and the disorder of urban space? What intellectual frameworks do they call upon to find meaning in unfamiliar settings? How do these assumptions shape what is seen and unseen within the city? And most importantly, what do these city texts reveal about the potential for building new forms of belonging and community within the urban environment? Readings will include phil...\n\n      more description for COREP-AD   10 »\n\n      \n\n\n\nThis course examines the ways in which writers have responded to the social complexity of urban life and the difficult task of finding points of connection within the diversity of the city. How do writers narrate both the order and the disorder of urban space? What intellectual frameworks do they call upon to find meaning in unfamiliar settings? How do these assumptions shape what is seen and unseen within the city? And most importantly, what do these city texts reveal about the potential for building new forms of belonging and community within the urban environment? Readings will include philosophical works from ancient Greece, travel accounts of the medieval and early modern world, and fiction from writers such as Zola, Woolf, Mahfouz, Conrad and Pamuk.\n\n      less description for COREP-AD   10 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 12",
            "course_name": "W",
            "description": "COREP-AD   12W\n\n   Our Monsters, Ourselves\n\nWe examine work from the past two hundred years as a way to consider the profound transformations that have occurred during this tumultuous period. Some of the issues we consider have to do with very basic questions: What does it mean to be human—and who do we include in our definitions of \"human?\" What is the relationship of people to their landscape and environment? What is the relationship of technology to cultural production? How do gender and sexuality define or liberate us? And, ultimately, does the artist have an obligation to address any of these issues in her work? As a guide to our e...\n\n      more description for COREP-AD   12W »\n\n      \n\n\n\nWe examine work from the past two hundred years as a way to consider the profound transformations that have occurred during this tumultuous period. Some of the issues we consider have to do with very basic questions: What does it mean to be human—and who do we include in our definitions of \"human?\" What is the relationship of people to their landscape and environment? What is the relationship of technology to cultural production? How do gender and sexuality define or liberate us? And, ultimately, does the artist have an obligation to address any of these issues in her work? As a guide to our explorations, we look at the ways in which monsters and the monstrous illuminate particular cultural moments and reflect on whether the monsters of two centuries ago shed light on our own cultural preoccupations.\n\n      less description for COREP-AD   12W «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 13",
            "course_name": "Law and the Imagination",
            "description": "COREP-AD   13 Law and the Imagination \nThere is no life without law. Nature has its laws. Religions have theirs, societies theirs, families theirs. Business has its rules and contracts. How do people understand the laws that are as much a part of life as the weather? Literature—the work of the imagination—guides our great journey towards understanding. Writers dramatize the relations among law, justice, and freedom. Writers also show the effect of law on the fates, fortunes, and feelings of people. The course explores the power of literature to show us what the law is, what it should not be, and what it might be.",
            "offering": false
        },
        {
            "course_id": "COREP-AD 14",
            "course_name": "Cosmopolitan Imagination",
            "description": "COREP-AD   14 Cosmopolitan Imagination \nOriginating in the idea of the world citizen and conceived in contradistinction to nationalism, cosmopolitanism can be understood as a perspective that regards human difference as an opportunity to be embraced rather than a problem to be solved. Does this perspective lie behind all “great” literature, which asks its readers to experience otherness by opening themselves up to another person’s words and thoughts? This course uses novels, poems, plays, and films to explore the cosmopolitan impulses behind the literary imagination.",
            "offering": false
        },
        {
            "course_id": "COREP-AD 15",
            "course_name": "Tragedy",
            "description": "COREP-AD   15 Tragedy \nTragic drama originated in ancient Greece and it is has been central to both the aesthetic and the philosophical traditions of the West. At the same time, many classic works of Western tragic drama have been adapted by cultures all over the world for their own ends. This course examines key works of Greek and Shakespearean tragedy, critical, historical and philosophical reflections on these works, and versions of some of these works from non-Western cultures, especially in film.",
            "offering": false
        },
        {
            "course_id": "COREP-AD 17",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17863",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Patell, Cyrus"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   17\n\n   Technophilia and Its Discontents\n\nWhy must Luke Skywalker turn off his in computer at the climactic moment of George Lucas’s iconic film Star Wars (1977)? Star Wars is celebrated in part because it started a revolution in cinematic special-effects, but underlying the film’s narrative logic is a deeply rooted anxiety about the right uses of technology. If man, as Hannah Arendt famously put it, is homo faber, the “creator,” the tool-making animal, then from at least Plato to the present, human beings have been telling stories about how to use tools correctly and about how dangerous they can be. This course investigates the ways ...\n\n      more description for COREP-AD   17 »\n\n      \n\n\n\nWhy must Luke Skywalker turn off his in computer at the climactic moment of George Lucas’s iconic film Star Wars (1977)? Star Wars is celebrated in part because it started a revolution in cinematic special-effects, but underlying the film’s narrative logic is a deeply rooted anxiety about the right uses of technology. If man, as Hannah Arendt famously put it, is homo faber, the “creator,” the tool-making animal, then from at least Plato to the present, human beings have been telling stories about how to use tools correctly and about how dangerous they can be. This course investigates the ways philosophical writing, novels, plays, and films have dramatized the vexed relationship between human beings and the technologies they create. What is at stake in the creation of tools and technologies? Why are human beings, perhaps now at the start of the twenty-first century more than ever, sp enamored with technological progress? Why is technophilia, the love of technology, so often accompanied by its opposite, technophobia, the fear of technology? What do the attitudes represented in the texts and films we are reading tell us about the dynamics of human agency and about the relationship between science and religion? Texts and films come from a variety of world cultures and include Alif the Unseen, Arabian Nights, Blade Runner, Do Androids Dream of Electric Sheep?, The Caves of Steel, Metropolis, Paradise Lost, Phaedrus, R.U.R. (Rossum’s Universal Robots), and Star Wars: The Force Awakens.\n\n      less description for COREP-AD   17 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 19",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17974",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Williams, Deborah"
                },
                {
                    "format": "Workshop",
                    "class_id": "19533",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Sun 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Williams, Deborah"
                }
            ],
            "course_name": "W",
            "description": "COREP-AD   19W\n\n   Myth, Magic, and Representations of Childhood\n\nThis course is fueled by two related questions: how have cultural ideas of “childhood” changed over time, and how have ancient tales of myth and magic found expression in cultures around the world?  Almost every culture in the world has some tradition that includes mythical or magical tales; very often these tales include the exploits of a youthful protagonist.  What can these tales, and their evolution—and transmission—over time and place, reveal to us about our own cultural preoccupations, as well as the cultures where these tales were originally produced?  Through an examination of material...\n\n      more description for COREP-AD   19W »\n\n      \n\n\n\nThis course is fueled by two related questions: how have cultural ideas of “childhood” changed over time, and how have ancient tales of myth and magic found expression in cultures around the world?  Almost every culture in the world has some tradition that includes mythical or magical tales; very often these tales include the exploits of a youthful protagonist.  What can these tales, and their evolution—and transmission—over time and place, reveal to us about our own cultural preoccupations, as well as the cultures where these tales were originally produced?  Through an examination of materials including graphic novels, fairy tales, movies, and fiction, we will consider the ways in which representations of childhood reveal ideas about power, politics, and the relationship between the self and society.  Readings may include excerpts from The Arabian Nights; Grimm’s fairy tales; various Harry Potter novels; films from Hiyao Miyazaki, Disney, and Pixar, among others\n\n      less description for COREP-AD   19W «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 21",
            "course_name": "Families",
            "description": "COREP-AD   21 Families \nThe family has often been described as the nucleus of society. The course studies the representation of families—both biological and symbolic—as a source of blessings and burdens, bonding and betrayal in literary texts from around the world, starting with the Odyssey and moving on through the Middle Ages to modern writing. The course also investigates modern theories of the family as found in the works of such thinkers as Engels, Freud, and Foucault.",
            "offering": false
        },
        {
            "course_id": "COREP-AD 22",
            "course_name": "Changing Notions of Race in Literature",
            "description": "COREP-AD   22 Changing Notions of Race in Literature \nThis course examines a wide variety of literary texts on black-white couples, interracial families, and biracial identity, from classical antiquity to the present. Works studied include romances, novellas, plays, novels, short stories, poems, and non-fiction, as well as some films and examples from the visual arts. Topics for discussion range from interracial genealogies to racial “passing,” from representations of racial difference to alternative plot resolutions, and from religious and political to legal and scientific contexts for the changing understanding of “race.”",
            "offering": false
        },
        {
            "course_id": "COREP-AD 23",
            "course_name": "",
            "description": "COREP-AD   23\n\n   Doubles and Masks\n\nAmong the more significant activities of human beings is that of giving shape to fears and desires through art. All cultures participate in this form of emotional exteriorization, including creating “doubles” and “masks” through myths, literature, and other media. Concentrating on doubles and masks in several different cultures, we will chart the meaning and impact of the archetypal\nmasked figures of the commedia dell’arte in French and British theatre; the obsessive concern with the grotesque (the monstrous mask) in French\nromanticism and in Haitian magical realism; zombification, carnival fi...\n\n      more description for COREP-AD   23 »\n\n      \n\n\n\nAmong the more significant activities of human beings is that of giving shape to fears and desires through art. All cultures participate in this form of emotional exteriorization, including creating “doubles” and “masks” through myths, literature, and other media. Concentrating on doubles and masks in several different cultures, we will chart the meaning and impact of the archetypal\nmasked figures of the commedia dell’arte in French and British theatre; the obsessive concern with the grotesque (the monstrous mask) in French\nromanticism and in Haitian magical realism; zombification, carnival figures, and ghostly doubles in Latin American, North American, and African cultural forms. We build a repertory of approaches to interpreting and uncovering the many layers of masking and doubling by reading in anthropology, psychoanalysis, aesthetics, and literary theory.\n\n      less description for COREP-AD   23 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 24",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13073",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Waterman, Bryan"
                },
                {
                    "format": "Workshop",
                    "class_id": "13074",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Sun 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Waterman, Bryan"
                }
            ],
            "course_name": "W",
            "description": "COREP-AD   24W\n\n   Contagion\n\nHow do we respond to news that some among us are ill, and that the illness is, perhaps, contagious? Are the healthy ethically obliged to tend to the sick? What are the relationships between contagious disease and verbal communication: rumors, medical information, stories about the dying and the dead? How has illness literally and metaphorically participated in the reimagination of community, kinship, and sexuality in different times and places? This course examines the intersections of contagious disorder and storytelling in a range of cultures, settings, and forms, from ancient Greece to cont...\n\n      more description for COREP-AD   24W »\n\n      \n\n\n\nHow do we respond to news that some among us are ill, and that the illness is, perhaps, contagious? Are the healthy ethically obliged to tend to the sick? What are the relationships between contagious disease and verbal communication: rumors, medical information, stories about the dying and the dead? How has illness literally and metaphorically participated in the reimagination of community, kinship, and sexuality in different times and places? This course examines the intersections of contagious disorder and storytelling in a range of cultures, settings, and forms, from ancient Greece to contemporary South Africa, from the Black Death, influenza, and AIDS to the proliferation of zombies and vampires in global popular culture today.\n\n      less description for COREP-AD   24W «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 25",
            "course_name": "W",
            "description": "COREP-AD   25W\n\n   World as Text\n\nHow do you write a history of the world?  What is the relationship between history and storytelling?  How do we fashion meaning in history and interpret other civilizations? This course looks for answers to these questions in the first great histories of the known world, Herodotus’s Histories and Sima Qian’s Records of the Historian.  Addressing world history from the vantage point of ancient Greece and Ancient China, these works gave narrative an unprecedented geographical scope and acquired a textual authority previously enjoyed only by epics and chronicles.  They also yielded model accounts...\n\n      more description for COREP-AD   25W »\n\n      \n\n\n\nHow do you write a history of the world?  What is the relationship between history and storytelling?  How do we fashion meaning in history and interpret other civilizations? This course looks for answers to these questions in the first great histories of the known world, Herodotus’s Histories and Sima Qian’s Records of the Historian.  Addressing world history from the vantage point of ancient Greece and Ancient China, these works gave narrative an unprecedented geographical scope and acquired a textual authority previously enjoyed only by epics and chronicles.  They also yielded model accounts of cultural difference that have influenced other narrative forms in fiction and non-fiction, textual and visual culture - to this day.  In addition to Herodotus and Sima Qian, readings include selections from Homer and early Chinese chronicles, as well as contemporary historical fiction (such as Gore Vidal’s Creation), the films Hero and The Emperor and the Assassin, and journalist Ryszard Kapuściński's memoir and travelogue Travels with Herodotus.\n\n      less description for COREP-AD   25W «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 26",
            "course_name": "",
            "description": "COREP-AD   26\n\n   Oceans\n\nOceans spell motion. They have transformed human destiny since the beginning of time. They are rolling spaces of experimentation and exchange,  hope and heartbreak, where peoples’ engagement with each other has unfolded, where humans have tussled with nature and interpreted the divine. Human interactions with oceans have spurred trade, set the boundaries of nations, built empires, redistributed populations, redefined tastes in food, produced new forms of art and music, transmitted diseases, and triggered new ideas and innovations in politics, law, science and technology. Above all, oceans cont...\n\n      more description for COREP-AD   26 »\n\n      \n\n\n\nOceans spell motion. They have transformed human destiny since the beginning of time. They are rolling spaces of experimentation and exchange,  hope and heartbreak, where peoples’ engagement with each other has unfolded, where humans have tussled with nature and interpreted the divine. Human interactions with oceans have spurred trade, set the boundaries of nations, built empires, redistributed populations, redefined tastes in food, produced new forms of art and music, transmitted diseases, and triggered new ideas and innovations in politics, law, science and technology. Above all, oceans continue to carry – and all too often thwart – the dreams of becoming and belonging of humans on the move. This course will explore the ways in which literary works across many genres – novels, plays, and poetry – have portrayed human relationships with oceans. It will prompt you to ask: how has the ocean functioned as a metaphor for the individual’s connection with nature and society? In what ways do depictions of oceans commemorate or comment upon a panoply of human experiences through time?  What affect and emotions do they encode? What identities do they create?\n\n      less description for COREP-AD   26 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 28",
            "course_name": "",
            "description": "COREP-AD   28\n\n   Enchantment\n\nThe advent of the novel marked a break with a magical way of thinking. “A magic curtain, woven of legends, hung before the world,” writes Milan Kundera, “Cervantes sent Don Quixote journeying and tore the curtain.” Is enchantment possible after modernity? And if so, what form might it take? A reenchantment as foreseen by religious cosmography, in which the human realm intersects\nwith that of jinn or other supernatural beings? Or might the discoveries and technologies of the modern world, including the laws of physics and breakthroughs in science, themselves be conceived as enchanting? This cou...\n\n      more description for COREP-AD   28 »\n\n      \n\n\n\nThe advent of the novel marked a break with a magical way of thinking. “A magic curtain, woven of legends, hung before the world,” writes Milan Kundera, “Cervantes sent Don Quixote journeying and tore the curtain.” Is enchantment possible after modernity? And if so, what form might it take? A reenchantment as foreseen by religious cosmography, in which the human realm intersects\nwith that of jinn or other supernatural beings? Or might the discoveries and technologies of the modern world, including the laws of physics and breakthroughs in science, themselves be conceived as enchanting? This course looks at attempts from various cultural vantage points to reconcile magic\nand realism in the aftermath of secularism and modernity. Must enchantment survive only as an escape from reason? Or might it be compatible\nwith the Enlightenment and scientific inquiry? We will look at responses to the riddle of magic in modern society in the art, theatre, film and fiction of Europe, the Americas, and the Middle East.\n\n      less description for COREP-AD   28 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 30",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12863",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Mitsis, Phillip"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   30\n\n   Mortal and Immortal Questions\n\nWe will read a wide-ranging selection of works from different cultures and chronological periods that have framed in memorable, though often contradictory, ways some basic questions about what it means to be a human being faced with death.   We will examine the attitudes and actions of characters struggling to understand the meaning of death and who must decide whether they believe that death is an evil that harms them or is something they should just ignore. We will also consider the ways in which their views about immortality affect their actions and whether a desire for immortality has bene...\n\n      more description for COREP-AD   30 »\n\n      \n\n\n\nWe will read a wide-ranging selection of works from different cultures and chronological periods that have framed in memorable, though often contradictory, ways some basic questions about what it means to be a human being faced with death.   We will examine the attitudes and actions of characters struggling to understand the meaning of death and who must decide whether they believe that death is an evil that harms them or is something they should just ignore. We will also consider the ways in which their views about immortality affect their actions and whether a desire for immortality has beneficial or detrimental affects on their lives and the lives of people around them.  More generally, we will be looking at some of the ways that different authors and cultures treat the question of how significant one’s death is to the continuing existence of others and what it means in different times and places to say that someone has died. Readings will include Euripides, Plato, Lucretius, Kyokai, Boccaccio, Flaubert, Tolstoy, Marquez, Morrison, Barnes, Salih, Hariharan, and Kanafani.\n\n      less description for COREP-AD   30 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 32",
            "course_name": "",
            "description": "COREP-AD   32\n\n   Stigma\n\nSocieties develop cultural behaviors that indicate the relative value of its members. Social acceptance has been historically dependent on its mutually constitutive term—ostracism—as members act on how they perceive and maintain their status in relationship to others. In this class, we will read novels, memoirs and plays that examine and deconstruct how systems of social worth operate, and how the nuances of those systems create and enforce devalued categories of people.  Readings focus on works that consider the specific attributes that adhere to the historically stigmatized categories of ill...\n\n      more description for COREP-AD   32 »\n\n      \n\n\n\nSocieties develop cultural behaviors that indicate the relative value of its members. Social acceptance has been historically dependent on its mutually constitutive term—ostracism—as members act on how they perceive and maintain their status in relationship to others. In this class, we will read novels, memoirs and plays that examine and deconstruct how systems of social worth operate, and how the nuances of those systems create and enforce devalued categories of people.  Readings focus on works that consider the specific attributes that adhere to the historically stigmatized categories of illness and disability.  We will discover how stigma affects feelings of self-worth and mediates engagement with others. Sociologist Erving Goffman observed that stigma creates “spoiled identities.”  Using ideas offered in Goffman’s seminal text on stigma, anthropologist Mary Douglas’s work on pollution and taboo, our readings will focus on authors who deconstruct experiences of stigma, and who write in order to destabilize, revise, and repair the personal and social damage stigmatizing categories and behaviors inflict.\n\n      less description for COREP-AD   32 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 33",
            "course_name": "",
            "description": "COREP-AD   33\n\n   Quest for Knowledge\n\nHumanity’s need to make sense of itself and its place in the universe has generated the world’s oldest creation stories and its most enduring myths. The quest for knowledge has itself also been a perennial theme of world literature. This course will examine the impulse to construct knowledge in a variety of time periods and cultural traditions, raising questions about how human communities around the world have conceived of the nature, conditions, limits, and means of acquiring knowledge. Readings include ancient Egyptian and Mesopotamian myths, The Epic of Gilgamesh (Mesopotamia), The Bhagava...\n\n      more description for COREP-AD   33 »\n\n      \n\n\n\nHumanity’s need to make sense of itself and its place in the universe has generated the world’s oldest creation stories and its most enduring myths. The quest for knowledge has itself also been a perennial theme of world literature. This course will examine the impulse to construct knowledge in a variety of time periods and cultural traditions, raising questions about how human communities around the world have conceived of the nature, conditions, limits, and means of acquiring knowledge. Readings include ancient Egyptian and Mesopotamian myths, The Epic of Gilgamesh (Mesopotamia), The Bhagavad Gita (India), Plato’s “Allegory of the Cave” (Greece), Farid ud-Din Attar’s The Conference of the Birds (Persia), Murasaki Shikibu’s The Tale of Genji (Japan), Cao Xueqin’s Dream of the Red Chamber (China), Sigmund Freud’s “Dora” (Austria), Alberto Mussa’s The Riddle of Qaf (Brazil), and short stories by Arthur Conan Doyle (Britain), Jorge Luis Borges (Argentina), and Naguib Mahfouz (Egypt).\n\n      less description for COREP-AD   33 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 34",
            "course_name": "",
            "description": "COREP-AD   34\n\n   Autobiography: Ideas of the Self in a Global World\n\nStorytelling is a way for humans to understand the world and their position in it. This is particularly true for those who write to tell their own life stories. In this course, we explore how these selfnarratives allow their authors to comprehend their position in a globally connected world. We read autobiographies by public figures and private citizens from different traditions and time periods who travel away from home and then write about their experience. Readings include Augustine’s Confessions (4th century), Al-Ghazali’s Deliverance from Error (11th century), Margery Kempe’s memoirs (15t...\n\n      more description for COREP-AD   34 »\n\n      \n\n\n\nStorytelling is a way for humans to understand the world and their position in it. This is particularly true for those who write to tell their own life stories. In this course, we explore how these selfnarratives allow their authors to comprehend their position in a globally connected world. We read autobiographies by public figures and private citizens from different traditions and time periods who travel away from home and then write about their experience. Readings include Augustine’s Confessions (4th century), Al-Ghazali’s Deliverance from Error (11th century), Margery Kempe’s memoirs (15th century), Catalina de Erauso’s Memoirs of a Basque Lieutenant Nun (17th century), Jean- Jacques Rousseau’s Confessions (18th century), Olaudah Equiano’s Interesting Narrative (18th\ncentury), N.O. Body’s Memoirs of a Man’s Maiden Years (1907), Buchi Emecheta’s Head Above Water (1986), Edward Said’s Out of Place (2000), and\nSophia Al-Maria’s The Girl Who Fell to Earth (2012).\n\n      less description for COREP-AD   34 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 35",
            "course_name": "",
            "description": "COREP-AD   35\n\n   Exile, Diaspora and Migration\n\nDiaspora has been a recurring feature of human history since the dispersal of Jews from the Middle East, Africans during the slave trade, or the Irish during the Great Hunger. In the past two centuries, millions have migrated from their homelands to work or find refuge in far-away countries with cultures very different from their own. How do human beings come to terms with such transformations in their lives? What are the cultural, emotional, and intellectual effects of being\nexiled from your place of birth? How far can loss be compensated for by the idea that something can also be gained? In ...\n\n      more description for COREP-AD   35 »\n\n      \n\n\n\nDiaspora has been a recurring feature of human history since the dispersal of Jews from the Middle East, Africans during the slave trade, or the Irish during the Great Hunger. In the past two centuries, millions have migrated from their homelands to work or find refuge in far-away countries with cultures very different from their own. How do human beings come to terms with such transformations in their lives? What are the cultural, emotional, and intellectual effects of being\nexiled from your place of birth? How far can loss be compensated for by the idea that something can also be gained? In this course we consider connections and differences between experiences of exile, diaspora, and migration by examining\nstories and writing about them in the Bible, the Odyssey, and texts by Plutarch, Ovid, Dante, Byron, Dostoevsky, Conrad, Césaire, Naipaul, Rhys, Lamming, Carpentier, Darwish, Edward Said, Julia Alvarez, and Kiran Desai.\n\n      less description for COREP-AD   35 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 36",
            "course_name": "W",
            "description": "COREP-AD   36W\n\n   Rogue Fictions: Tales of Tricksters, Outlaws, and Outsiders\n\nFrom mythological figures such as Coyote in North America, Hermes of Greek myth, and Eshu in West Africa, to modern icons of global pop culture like Charlie Chaplin, Bugs Bunny, and Bart Simpson, humans have long been fascinated with trickster characters who transgress boundaries, break rules, and unsettle fixed truths. Seemingly heedless of cultural norms, these characters in their many different guises point to the important role of play and disruption in the making of culture. In this course, students consider rogues, outlaws,\nand outsiders of various types from around the world and their p...\n\n      more description for COREP-AD   36W »\n\n      \n\n\n\nFrom mythological figures such as Coyote in North America, Hermes of Greek myth, and Eshu in West Africa, to modern icons of global pop culture like Charlie Chaplin, Bugs Bunny, and Bart Simpson, humans have long been fascinated with trickster characters who transgress boundaries, break rules, and unsettle fixed truths. Seemingly heedless of cultural norms, these characters in their many different guises point to the important role of play and disruption in the making of culture. In this course, students consider rogues, outlaws,\nand outsiders of various types from around the world and their portrayal in stories, novels, dramas, songs, and films. Building a repertoire of trickster\ncharacters, types, and tropes, students examine how these characters’ dynamic roles relate to central problems of art, creativity, and life.\n\n      less description for COREP-AD   36W «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 38",
            "course_name": "",
            "description": "COREP-AD   38\n\n   Money and the Good Life\n\nThis course examines a variety of cultural conceptions of money and wealth, and the ethical questions that money or wealth allows a writer to probe. Is the value of men measured by the value of their money, or are there other criteria for wealth? Is someone’s wealth possible without someone else’s poverty? How is human ambition rewarded or punished in the “pecuniary culture”? The course\nlooks for answers to these and other questions in key works of literature, sociology, economics, and other fields, reading classical texts ranging from Aristophanes' Plutus, Ihara Saikaku's \"A dose of what the ...\n\n      more description for COREP-AD   38 »\n\n      \n\n\n\nThis course examines a variety of cultural conceptions of money and wealth, and the ethical questions that money or wealth allows a writer to probe. Is the value of men measured by the value of their money, or are there other criteria for wealth? Is someone’s wealth possible without someone else’s poverty? How is human ambition rewarded or punished in the “pecuniary culture”? The course\nlooks for answers to these and other questions in key works of literature, sociology, economics, and other fields, reading classical texts ranging from Aristophanes' Plutus, Ihara Saikaku's \"A dose of what the doctor never orders,\" and William Shakespeare's The Merchant of Venice, to Honoré de Balzac's Père Goriot, Daniel Defoe's Robinson Crusoe, and F. Scott Fitzgerald's Great Gatsby.\nReadings are supplemented by excerpts from works by Ibn Khaldun, Adam Smith, Thorstein Veblen, Max Weber, and Alfred Hirshman.\n\n      less description for COREP-AD   38 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 39",
            "course_name": "",
            "description": "COREP-AD   39\n\n   Bodies in Pain: Literary Representations of Disease and Health\n\nAs the Arabic saying goes, “Health is a crown worn by the healthy and seen only by the ill.” Throughout history, literature has staged the human struggle with disease and the related search for a cure. This course depicts the literary representation of pathologies and their medical treatments, ranging from eighteenth-century European treatises on the “English Malady” to the depiction of tuberculosis and leprosy in twentieth-century Japan. In the attempt to restore health, the relationship between patient and doctor is of central importance and will therefore constitute a thematic focus for thi...\n\n      more description for COREP-AD   39 »\n\n      \n\n\n\nAs the Arabic saying goes, “Health is a crown worn by the healthy and seen only by the ill.” Throughout history, literature has staged the human struggle with disease and the related search for a cure. This course depicts the literary representation of pathologies and their medical treatments, ranging from eighteenth-century European treatises on the “English Malady” to the depiction of tuberculosis and leprosy in twentieth-century Japan. In the attempt to restore health, the relationship between patient and doctor is of central importance and will therefore constitute a thematic focus for this course. Readings will include: George Cheyne’s The English Malady, Franz Kafka’s “Country Doctor,” Thomas Mann’s “Death in Venice,” Yahya Hakki’s Lamp of Umm Hashim, Bernard Pomerance’s The Elephant Man, Albert Camus’ The Plague, Sigmund Freud’s Dora, Charlotte Perkins Gilman’s “Yellow Wallpaper,” Ernest Hemingway’s “Indian Camp,” Gail Tsukiyama’s The Samurai’s Garden, and Sanjay Gupta’s Monday Mornings.\n\n      less description for COREP-AD   39 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 41",
            "course_name": "",
            "description": "COREP-AD   41\n\n   The Soul\n\nThe theme of this class will be the discovery and exploration of the concept of the soul in the religious and philosophic traditions of the Mediterranean.  We will focus on the great questions about the soul--the conscious self and its identity-- persisting up to and perhaps beyond death:  What is it to be a person in a body?  Is there something that is our essential self, independent of the body? Is this something conscious? Does it include the mind? Does it survive death? How exactly?  Will it be judged, as Plato and Socrates thought and many religions suggest? We will explore these ideas fr...\n\n      more description for COREP-AD   41 »\n\n      \n\n\n\nThe theme of this class will be the discovery and exploration of the concept of the soul in the religious and philosophic traditions of the Mediterranean.  We will focus on the great questions about the soul--the conscious self and its identity-- persisting up to and perhaps beyond death:  What is it to be a person in a body?  Is there something that is our essential self, independent of the body? Is this something conscious? Does it include the mind? Does it survive death? How exactly?  Will it be judged, as Plato and Socrates thought and many religions suggest? We will explore these ideas from the Greeks through the Christians and Muslims, reading Homer, Plato, Augustine and Ibn Sina.  The class will conclude with a glimpse at the late Renaissance, when the permanence and even presence of human souls became more uncertain, more threatened by death and obliteration, than in the ancient and medieval worlds.  In this way, the Renaissance marks the beginning of the world in which all of us must now find our way, whether to faith--or away from it.\n\n      less description for COREP-AD   41 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 42",
            "course_name": "",
            "description": "COREP-AD   42\n\n   Animals\n\nMankind’s relationship to animals has always been ambivalent. Animals have been deified and demonised, petted and abused, cherished and exploited. While modern science is increasingly blurring the supposed demarcation line between animals (equalling nature) and humans (equalling reason), literature has allowed for transgressions that have worked both ways: transformations go from human to animal and vice versa. Not only this; throughout history animals have been thought to possess human qualities (and also: vice versa) such as speech and reason and have been represented to act in a way that of...\n\n      more description for COREP-AD   42 »\n\n      \n\n\n\nMankind’s relationship to animals has always been ambivalent. Animals have been deified and demonised, petted and abused, cherished and exploited. While modern science is increasingly blurring the supposed demarcation line between animals (equalling nature) and humans (equalling reason), literature has allowed for transgressions that have worked both ways: transformations go from human to animal and vice versa. Not only this; throughout history animals have been thought to possess human qualities (and also: vice versa) such as speech and reason and have been represented to act in a way that often seems more human than the way humans behave. The class starts with the earliest literary document of mankind, The Epic of Gilgamesh, looks at texts from Antiquity and the Middle Ages from various civilisations (Aesopus, The Jataka Tales, The Panchatantra, Apuleius, Lucian, The Physiologus, The Journey to the West) and up to modern times (Darwin, Carroll, Kipling, Kafka, Dick) and also one film which especially reflects upon the strained relationship to an animal and man’s self-perception in the face of nature (Moby Dick).\n\n      less description for COREP-AD   42 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 43",
            "course_name": "W",
            "description": "COREP-AD   43W\n\n   Knowledge and Doubt\n\nWe will explore the relation of knowledge and doubt in a wide variety of texts in different genres, historical periods, and cultural contexts. Some our questions will be about sources of knowledge and evidence, while others will be about the nature of our capacities for knowing things. Questions include:  what sources of knowledge can we trust, if any? Are there ways to achieve knowledge by transcending our normal sensory and rational capacities?  Might we be systematically deceived about the world and, if so, could we still find happiness in such a condition? Is our knowledge inevitably depen...\n\n      more description for COREP-AD   43W »\n\n      \n\n\n\nWe will explore the relation of knowledge and doubt in a wide variety of texts in different genres, historical periods, and cultural contexts. Some our questions will be about sources of knowledge and evidence, while others will be about the nature of our capacities for knowing things. Questions include:  what sources of knowledge can we trust, if any? Are there ways to achieve knowledge by transcending our normal sensory and rational capacities?  Might we be systematically deceived about the world and, if so, could we still find happiness in such a condition? Is our knowledge inevitably dependent on others or are our best sources of knowledge found within?  How can our knowledge be distorted by strong emotions such as hatred or love? Readings will be from Mo-Tzu, Sophocles, Nagarjuna, Ibn Tufayl, Dante, Montaigne, Cervantes, Descartes, Hume, Rousseau, and Proust.\n\n      less description for COREP-AD   43W «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 44",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17861",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 144 with Celik, Aysan08/30/2015 - 12/17/2015 Mon 2.10 PM - 3.25 PM at ARTS_CENT 144",
                    "time": "Wed 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Celik, Aysan"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   44\n\n   Laughter\n\nLaughter is an essential part of the human experience. Why do we laugh, and what does it mean? How does laughter function within us as individuals, in our local circles, and as a global community? What evokes laughter that transcends culture, and what is culturally specific? In this course students will confront laughter and its capacity to disarm, connect, heal, teach, debunk, humiliate, reform, confront, expose, progress, politicize, humanize, and empower. The course readings will include literature, visual art, theater, film, television, animation, new media, psychology, and biology. Studen...\n\n      more description for COREP-AD   44 »\n\n      \n\n\n\nLaughter is an essential part of the human experience. Why do we laugh, and what does it mean? How does laughter function within us as individuals, in our local circles, and as a global community? What evokes laughter that transcends culture, and what is culturally specific? In this course students will confront laughter and its capacity to disarm, connect, heal, teach, debunk, humiliate, reform, confront, expose, progress, politicize, humanize, and empower. The course readings will include literature, visual art, theater, film, television, animation, new media, psychology, and biology. Students will encounter such artists, writers and thinkers as Nasreddin Hoca, Aristophanes, Jean-Pierre Jeunet, Margaret Cho, Jim Henson, Frida Kahlo, Oscar Wilde, Jane Austen, Shakespeare, Anton Chekhov, Joss Whedon, Tina Fey, and Takashi Murakami.\n\n      less description for COREP-AD   44 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 45",
            "course_name": "",
            "description": "COREP-AD   45\n\n   Narrative and (Un)knowing\n\nThe fundamental question we will probe in this course is how narratives represent our coming to know.  Ever since the Enlightenment, the West typically assumes knowing to be the achievement of a rational subject moving progressively through lawful space and time—and figuring things out.  Only a lawful world allows the questing subject to arrive at knowledge and self-knowledge.  This progressive story serves as a central target of modernist and postcolonial critique.  Writers such as Kierkegaard, Dostoevsky, Nietzsche, Kafka, Freud, Faulkner, and Beckett call into question the narrative of the ...\n\n      more description for COREP-AD   45 »\n\n      \n\n\n\nThe fundamental question we will probe in this course is how narratives represent our coming to know.  Ever since the Enlightenment, the West typically assumes knowing to be the achievement of a rational subject moving progressively through lawful space and time—and figuring things out.  Only a lawful world allows the questing subject to arrive at knowledge and self-knowledge.  This progressive story serves as a central target of modernist and postcolonial critique.  Writers such as Kierkegaard, Dostoevsky, Nietzsche, Kafka, Freud, Faulkner, and Beckett call into question the narrative of the knowing Western subject.  Garcia-Marquez’s postcolonial One Hundred Years of Solitude simply dispenses with Western priorities of knowing and self-knowledge.\n\n      less description for COREP-AD   45 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 46",
            "course_name": "W",
            "description": "COREP-AD   46W\n\n   Extinction\n\nScientists believe that our planet is experiencing its sixth mass extinction (the fifth, caused by a meteor collision, occurred 65 million years ago).  Many even have called for the recognition of a new epoch, the Anthropocene, to mark the massive impact of human activities and human-induced extinctions on its biosphere.  But how do we make sense of this era’s accelerating rate of species death?  What is the relationship between the extinction of a species and the extinction of cultures, languages, and lifeways?  How have biodiversity loss, language death, the vanishing of “savage races” and a...\n\n      more description for COREP-AD   46W »\n\n      \n\n\n\nScientists believe that our planet is experiencing its sixth mass extinction (the fifth, caused by a meteor collision, occurred 65 million years ago).  Many even have called for the recognition of a new epoch, the Anthropocene, to mark the massive impact of human activities and human-induced extinctions on its biosphere.  But how do we make sense of this era’s accelerating rate of species death?  What is the relationship between the extinction of a species and the extinction of cultures, languages, and lifeways?  How have biodiversity loss, language death, the vanishing of “savage races” and aboriginal populations, genocide, and the specter of self-extinction shaped our understanding of what it means to be human?  This course examines the human encounter with biotic, cultural, and metaphorical extinctions in a variety of genres, from Darwin’s reflections aboard the Beagle to the preservation of Ishi (“the last wild Indian),” and from flood narratives to apocalyptic fantasies.\n\n      less description for COREP-AD   46W «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 47",
            "course_name": "",
            "description": "COREP-AD   47\n\n   Dreams\n\nDreaming is a trait that human beings share with a lot of other mammals. It was, however,  not until Freud’s insights into the subjective nature of dreams and especially neuroscience’s explorations of the material basis of dreams and their cognitive function, that dreams were considered to belong in the realm of metaphysics. Thus, they served supernatural powers as a vehicle for prophecy and premonition. Literature has made use of these specific qualities in order to reflect on the dreaming persons’ ethical motivations, impulses to act, finding their identity, being deluded or informed and cha...\n\n      more description for COREP-AD   47 »\n\n      \n\n\n\nDreaming is a trait that human beings share with a lot of other mammals. It was, however,  not until Freud’s insights into the subjective nature of dreams and especially neuroscience’s explorations of the material basis of dreams and their cognitive function, that dreams were considered to belong in the realm of metaphysics. Thus, they served supernatural powers as a vehicle for prophecy and premonition. Literature has made use of these specific qualities in order to reflect on the dreaming persons’ ethical motivations, impulses to act, finding their identity, being deluded or informed and changing their ways. The class spans texts and one film (Kubrick) that represent dreams, either literally or metaphorically, from Antiquity (Cicero) to the present day (Borges) and across a variety of civilisations.\n\n      less description for COREP-AD   47 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 48",
            "course_name": "",
            "description": "COREP-AD   48\n\n   Humans Deformed and Transformed\n\nAll cultures attempt to define what it is to be human. In the process, all cultures ponder individuals who do not fit definitions of the human—individuals who fall short or soar above their peers by commingling human with nonhuman ways and forms of being. Werewolves, wild men, fox women, and bird people test human nature against other natures. Sometimes these creatures find human nature lacking, and supplement the lack by reaching out into other natures; other times their transformations stage confrontations between civilization and chaos. We will survey how poets and narrative artists have im...\n\n      more description for COREP-AD   48 »\n\n      \n\n\n\nAll cultures attempt to define what it is to be human. In the process, all cultures ponder individuals who do not fit definitions of the human—individuals who fall short or soar above their peers by commingling human with nonhuman ways and forms of being. Werewolves, wild men, fox women, and bird people test human nature against other natures. Sometimes these creatures find human nature lacking, and supplement the lack by reaching out into other natures; other times their transformations stage confrontations between civilization and chaos. We will survey how poets and narrative artists have imagined the commingling of humanity and non-humanity across several centuries and cultures. What are the attractions of getting beyond, or sinking below, the limits of the human? How do cultures set those limits? What resources does literature offer for thinking about self-definition in relation to social responsibility?\n\n      less description for COREP-AD   48 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 49",
            "course_name": "",
            "description": "COREP-AD   49\n\n   Migration\n\nThere are more migrants worldwide today than Brazil has inhabitants. China, India, and the Philippines are sending most migrants; the most important host areas are Europe and the United States; and expats make up more than 60% of the total population in Qatar and the UAE. How has migration been represented in and shaped by literature and art? This course reviews exemplary texts, striking images, and important films. Focus is on the United States from around 1880 to World War II and on Europe in the second half of the twentieth century, then opening up toward students’ examination of cultural w...\n\n      more description for COREP-AD   49 »\n\n      \n\n\n\nThere are more migrants worldwide today than Brazil has inhabitants. China, India, and the Philippines are sending most migrants; the most important host areas are Europe and the United States; and expats make up more than 60% of the total population in Qatar and the UAE. How has migration been represented in and shaped by literature and art? This course reviews exemplary texts, striking images, and important films. Focus is on the United States from around 1880 to World War II and on Europe in the second half of the twentieth century, then opening up toward students’ examination of cultural work by and about contemporary migrants from around the world. Readings include autobiography, reportage, documentary photography and film as well as fiction and creative visual work. Among the topics for discussion are metaphors and theories of migration (from uprooting and bird-of-passage to expatriate and melting-pot); labor arrangements; scenes of departure, voyage, and arrival; vibrant migrant communities and migrant alienation and pain; negotiation between places of origin and of arrival.\n\n      less description for COREP-AD   49 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 50",
            "course_name": "",
            "description": "COREP-AD   50\n\n   Slavery and Freedom\n\nThis course draws upon literature, folk tales, films, and paintings to connect and compare the ways in which slavery has been imagined, experienced, narrated, and contested in different parts of the world from antiquity to the present. We will start by charting cross-cultural debates over “slave” and “citizen” through the ages, before proceeding to explore texts and images that positioned the “slave” as subject, and used literacy as a mode of resistance. How did these narratives define “freedom” and shape international abolitionist publics? How might we read them for evidence of slave culture ...\n\n      more description for COREP-AD   50 »\n\n      \n\n\n\nThis course draws upon literature, folk tales, films, and paintings to connect and compare the ways in which slavery has been imagined, experienced, narrated, and contested in different parts of the world from antiquity to the present. We will start by charting cross-cultural debates over “slave” and “citizen” through the ages, before proceeding to explore texts and images that positioned the “slave” as subject, and used literacy as a mode of resistance. How did these narratives define “freedom” and shape international abolitionist publics? How might we read them for evidence of slave culture and community, and imaginaries of race, gender, and nation?  How do novels and films serve as sites of public memory --or amnesia -- about slavery? What do they tell us about the threshold between history and literature? How does historical context serve to explain fiction? How do novelists and artists both use and challenge the archives to imagine “agency” in ways that official history writing does not accommodate? Course materials may be drawn from the works of Aristotle, Manu, Kautilya, Bartolomé de las Casas, George Fitzhugh, Olaudah Equiano, Frederick Douglass, Harriet Jacobs, Harriet Beecher Stowe, Toni Morrison, Caryl Phillips, Amitav Ghosh, Rayda Jacob, and Abdurazak Gurnah, as well as the Uncle Remus Tales, and paintings and excerpts from the films Gone with the Wind, Amistad, Beloved, Twelve Years a Slave, Ceddo, Razia Sultan, Rue Cases Nègres, and Quilombo.\n\n      less description for COREP-AD   50 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 51",
            "course_name": "",
            "description": "COREP-AD   51\n\n   Utopias and Dystopias\n\nWe all think about wanting to live in the perfect world, but what happens when definitions of “perfect” conflict with one another?  In this Pathways of World Literature course, we will explore the ways that writers and artists have wrestled with the question of “utopia” and, more particularly, the ways in which utopias always seem to fall short of their ideal.  As we examine these failed utopias, we will consider the ways in which these texts explore the increasingly fraught relationship between humanity and technology, and between the community and the individual.  Drawing on written and cine...\n\n      more description for COREP-AD   51 »\n\n      \n\n\n\nWe all think about wanting to live in the perfect world, but what happens when definitions of “perfect” conflict with one another?  In this Pathways of World Literature course, we will explore the ways that writers and artists have wrestled with the question of “utopia” and, more particularly, the ways in which utopias always seem to fall short of their ideal.  As we examine these failed utopias, we will consider the ways in which these texts explore the increasingly fraught relationship between humanity and technology, and between the community and the individual.  Drawing on written and cinematic texts from around the world, this course will consider whether any attempt at utopia is doomed, given the human proclivity for violence and xenophobia.  We will also consider why, in recent years, dystopian worlds have become the mainstay of pop culture, from novels to video games and movies. The course may include contemporary work by Hiyao Miyazaki, Chan Koonchung, and Vladimir Sorokin, as well as such classics as Thomas More’s Utopia, Charlotte Perkins Gilman’s Herland, and Fritz Lang’s “Metropolis.”\n\n      less description for COREP-AD   51 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 52",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17579",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Kalantzakos, Sophia"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   52\n\n   Reading the Earth\n\nThis course introduces students to a wide variety of perspectives on the way that nature and its relation to human agency has been conceived from the industrial revolution onwards.  As we face dramatic climate changes and the specter of wholesale annihilation, understanding our conceptions of and relation to nature becomes more pressing.  Can we repair the rifts between humans and nature caused by industrialization? How have technological innovations affected attitudes toward the environment? The course will be constructed around a series of discrete problems, including today’s most pressing e...\n\n      more description for COREP-AD   52 »\n\n      \n\n\n\nThis course introduces students to a wide variety of perspectives on the way that nature and its relation to human agency has been conceived from the industrial revolution onwards.  As we face dramatic climate changes and the specter of wholesale annihilation, understanding our conceptions of and relation to nature becomes more pressing.  Can we repair the rifts between humans and nature caused by industrialization? How have technological innovations affected attitudes toward the environment? The course will be constructed around a series of discrete problems, including today’s most pressing eco-critical dilemmas, that will be contextualized historically through a variety of primary and secondary readings. Readings will include works by Gaskell, Williams, Zola, Stifter, De Tocqueville, Marx, Tekin, Munif, Tolstoy, Sepulveda, Carson and others.\n\n      less description for COREP-AD   52 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 53",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17581",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Williams, Katherine"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   53\n\n   Disability\n\nThis course considers disability as a cultural concept that describes how human variation matters in the world. How has disability have been understood over time and across cultures? How have disabled bodies been represented and classified? How does disability intersect with other identity formations such as race, class, and gender? Ultimately, we will ask: what new forms of representation might bodily difference produce? Alongside texts that may describe disability as defective or tragic, we will trace other literary possibilities for bodies and minds that resist normative structures, from na...\n\n      more description for COREP-AD   53 »\n\n      \n\n\n\nThis course considers disability as a cultural concept that describes how human variation matters in the world. How has disability have been understood over time and across cultures? How have disabled bodies been represented and classified? How does disability intersect with other identity formations such as race, class, and gender? Ultimately, we will ask: what new forms of representation might bodily difference produce? Alongside texts that may describe disability as defective or tragic, we will trace other literary possibilities for bodies and minds that resist normative structures, from narratives that theorize ideas of access, cure, and care to fictions that reclaim disability as enlivening identity. Readings for the course range across drama, poetry, novels, essays, and films, including Sophocles, Philoctetes; J.M. Coetzee, Waiting for the Barbarians; Kazuo Ishiguro, Never Let Me Go; William Shakespeare’s King Lear; David B., Epileptic; Kaite O’Reilly’s Peeling; Doris Baizley and Victoria Ann Lewis, P.H.*reaks; Octavia Butler, “Speech Sounds” and more.\n\n      less description for COREP-AD   53 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 54",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17858",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Swislocki, Mark"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   54\n\n   Pilgrimage and Enlightenment\n\nFor much of human history, the West meant India, the source of Buddhism, and a destination for pilgrims in search of enlightenment.  This course examines the relationship between pilgrimage and enlightenment.  Is pilgrimage a metaphor of a life well lived, or must it be a literal journey in search of a higher state of being?  Is the purpose of pilgrimage to reach a destination, or is the journey itself, wherever it leads, more important?  When is pilgrimage an individual affair, and when are more communal aspects essential to the journey.  We begin our journey in India with Ashvagosha's Life o...\n\n      more description for COREP-AD   54 »\n\n      \n\n\n\nFor much of human history, the West meant India, the source of Buddhism, and a destination for pilgrims in search of enlightenment.  This course examines the relationship between pilgrimage and enlightenment.  Is pilgrimage a metaphor of a life well lived, or must it be a literal journey in search of a higher state of being?  Is the purpose of pilgrimage to reach a destination, or is the journey itself, wherever it leads, more important?  When is pilgrimage an individual affair, and when are more communal aspects essential to the journey.  We begin our journey in India with Ashvagosha's Life of the Buddha, and then follow a trail of religious cultural production – including sutras, mandalas, and records of individual pilgrims – that culminates in the Chinese literary masterpiece, Journey to the West.  The course then turns to \"Non Eastern\" adaptations of Journey, including Maxine Hong Kingston's Tripmaster Monkey and such films as The Lost Empire, before closing with comparisons of Buddhist pilgrimage with the Hajj, as well as “modern Western” journeys to Asia in search of spiritual alternatives to material civilization.\n\n      less description for COREP-AD   54 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 55",
            "course_name": "",
            "description": "COREP-AD   55\n\n   Gender and Representation\n\nThis course understands gender as a social construct rather than as self-evident and immutable, and examines the ways in which constructions of gender shift across time and place. Some of the questions we will consider include the following: what does it mean to be “male” or “female,” “masculine” or “feminine,” and how do the meanings of such categories vary across historical periods and geographic locations?  How do we understand gender in relation to other social differences such as race, class, sexuality, religion, nationality, and disability? How have ideologies of gender been central to c...\n\n      more description for COREP-AD   55 »\n\n      \n\n\n\nThis course understands gender as a social construct rather than as self-evident and immutable, and examines the ways in which constructions of gender shift across time and place. Some of the questions we will consider include the following: what does it mean to be “male” or “female,” “masculine” or “feminine,” and how do the meanings of such categories vary across historical periods and geographic locations?  How do we understand gender in relation to other social differences such as race, class, sexuality, religion, nationality, and disability? How have ideologies of gender been central to colonial and nationalist projects from the nineteenth century to the present? How does gender shift in the context of diaspora, migration, and globalization? We approach these questions through a consideration of aesthetic practices and representational forms – literature, film, visual art –  that suggest alternatives to a binary logic of gender and instead articulate different visions of gender justice. We will examine literary texts by Shakespeare, Charlotte Bronte, Jean Rhys, Assia Djebar, Shyam Selvadurai, Shani Mootoo, and Mahasweta Devi; films such as Gilo Pontecorvo’s The Battle of Algiers and Deepa Mehta’s Earth; and contemporary visual art from the Middle East, Africa, and South Asia.\n\n      less description for COREP-AD   55 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 56",
            "course_name": "",
            "description": "COREP-AD   56\n\n   Crime\n\nIs a fascination with crime universal or does it vary over time and across cultures? Why do humans feel compelled to tell, retell, edit, and contest stories about their darkest doings? What is more revealing of a society's values, the stories of its exemplary leaders, saints, and heroes, or the stories of its criminals, outcasts, and pariahs? What does the way a society judges and treats its criminals tell us about that society? For example, what does the death sentence passed on Socrates (for corrupting the youth with his philosophical ideas) tell us about classical Athens? How does Plato cre...\n\n      more description for COREP-AD   56 »\n\n      \n\n\n\nIs a fascination with crime universal or does it vary over time and across cultures? Why do humans feel compelled to tell, retell, edit, and contest stories about their darkest doings? What is more revealing of a society's values, the stories of its exemplary leaders, saints, and heroes, or the stories of its criminals, outcasts, and pariahs? What does the way a society judges and treats its criminals tell us about that society? For example, what does the death sentence passed on Socrates (for corrupting the youth with his philosophical ideas) tell us about classical Athens? How does Plato create a foundational myth of Western philosophy out of this criminal sentence? The intersections of literature, film and policing have fundamentally shaped the emergence and development of key concepts such as identity, identification, subject, writing, evidence, authorship, and authority. We will investigate these terms together with the ways crime and the criminal have been defined through time and in different cultures, using the lenses of literature, film, and visual culture. Works by Plato, Fyodor Dostoyevsky, Edgar Allan Poe, Arthur Conan Doyle, Franz Kafka, Lu Xun, Jorge Lois Borges, Vladimir Nabokov, Herta Müller, Fritz Lang, Akira Kurosawa, Jean-Luc Godard, and Abbas Kiarostami, among others.\n\n      less description for COREP-AD   56 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 57",
            "course_name": "",
            "description": "COREP-AD   57\n\n   Optimism and Knowledge\n\nIs this the best of all possible worlds?  Is this world knowable?  The concept of “optimism” arose in the West at the intersection of these two questions.  The European Enlightenment engaged the world as something that could and should be known because knowing could make it better. This optimism was a new attitude towards knowledge that does not dissolve into pessimism at the first sign of difficulty.  We will take this history of optimism on the road with two primary stops.  In China, we will engage what’s been called the “epistemological optimism” of Xunzi and Confucius.  We’ll then circle b...\n\n      more description for COREP-AD   57 »\n\n      \n\n\n\nIs this the best of all possible worlds?  Is this world knowable?  The concept of “optimism” arose in the West at the intersection of these two questions.  The European Enlightenment engaged the world as something that could and should be known because knowing could make it better. This optimism was a new attitude towards knowledge that does not dissolve into pessimism at the first sign of difficulty.  We will take this history of optimism on the road with two primary stops.  In China, we will engage what’s been called the “epistemological optimism” of Xunzi and Confucius.  We’ll then circle back to the Middle East to take advantage of Th. Emil Homerin’s new translations of A’ishah al-Ba’uniyyah, one of the most “prolific and prominent woman who wrote in Arabic prior to the modern period”, and track optimism’s role in Islamic legal theory.  Haunting all of our travels will be the issue of whether NYUAD is itself an act of “epistemological optimism,” and thus an institutional answer to the questions posed at the start of our journey.\n\n      less description for COREP-AD   57 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 58",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19240",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Dash, Jean"
                },
                {
                    "format": "Seminar",
                    "class_id": "19838",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 019",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Dash, Jean"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   58\n\n   (Dis)placements\n\nOne of the most significant developments in cultural and literary studies in recent times has been the focus on migration and displacement. The study of globalization further emphasizes detachment from the material world and privileges movement over locale. Consequently this emphasis on migration tends to position mobility and rootedness as opposite poles, often celebrating the former and neglecting or even devaluing the latter. The question is how a sense of place can persist in the face of all this movement and interaction.  This course will consist of theoretical and fictional texts which m...\n\n      more description for COREP-AD   58 »\n\n      \n\n\n\nOne of the most significant developments in cultural and literary studies in recent times has been the focus on migration and displacement. The study of globalization further emphasizes detachment from the material world and privileges movement over locale. Consequently this emphasis on migration tends to position mobility and rootedness as opposite poles, often celebrating the former and neglecting or even devaluing the latter. The question is how a sense of place can persist in the face of all this movement and interaction.  This course will consist of theoretical and fictional texts which make a case for revisiting the question of a global sense of place. How does the experience of displacement or contact with the outside change our relation to place? Is there a reaction to place that transcends nostalgia for lost origins?  If displacement is valued over placement do the experiences of men predominate? The theoretical and fictional readings will center on the shaping force of place in human experience and the primacy of setting and landscape in narratives.\n\n      less description for COREP-AD   58 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 59",
            "course_name": "",
            "description": "COREP-AD   59\n\n   The Unknown World\n\nFor most of human history, anything beyond one’s place of residence was unknown and mysterious, perhaps frightening and perilous, or perhaps hugely exciting. How did people imagine, discover, experience, and express what they found to exist beyond the limits of their first-hand experiences? We will read various pieces of literature, and some scholarship about that literature, which reflect on the unknown world – books of travel, conquest, adventure, exploration, mystery, and wonder. How do the authors represent the unknown and describe places they have never seen? What do they attempt to 'do' ...\n\n      more description for COREP-AD   59 »\n\n      \n\n\n\nFor most of human history, anything beyond one’s place of residence was unknown and mysterious, perhaps frightening and perilous, or perhaps hugely exciting. How did people imagine, discover, experience, and express what they found to exist beyond the limits of their first-hand experiences? We will read various pieces of literature, and some scholarship about that literature, which reflect on the unknown world – books of travel, conquest, adventure, exploration, mystery, and wonder. How do the authors represent the unknown and describe places they have never seen? What do they attempt to 'do' with the unknown, or to make the unknown do?  We will engage with texts such as: Arrian, Indika; Tacitus, Germania; The Journey of Theophanes; Al-Biruni, Indica; Marco Polo, Description of the World; Ibn Battuta, The Journey; The Legend of Prester John; Alvise Cadamosto, Navigazioni; The Four Voyages of Christopher Columbus; Hakluyt, Divers Voyages; The Journals of Lewis and Clark.\n\n      less description for COREP-AD   59 «",
            "offering": false
        },
        {
            "course_id": "COREP-AD 60",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19559",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 002",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Gajarawala, Toral"
                },
                {
                    "format": "Seminar",
                    "class_id": "19560",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 002",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Gajarawala, Toral"
                }
            ],
            "course_name": "",
            "description": "COREP-AD   60\n\n   On Violence\n\nThe ethics of violence, its articulation and resistance, violence as a social problem and violence as social necessity: from the epic, to the novel, to contemporary poetry, literature has been attempting to reckon with the question of violence.  This includes violence in the form of divine retribution, to violence as part of the rhetoric of patriarchy, to violence as necessary for anticolonial nationalism.  We will consider this both as a theoretical problem as well an aesthetic one.  In other words, we will consider the work of philosophers and theorists wrestling with ethical and political i...\n\n      more description for COREP-AD   60 »\n\n      \n\n\n\nThe ethics of violence, its articulation and resistance, violence as a social problem and violence as social necessity: from the epic, to the novel, to contemporary poetry, literature has been attempting to reckon with the question of violence.  This includes violence in the form of divine retribution, to violence as part of the rhetoric of patriarchy, to violence as necessary for anticolonial nationalism.  We will consider this both as a theoretical problem as well an aesthetic one.  In other words, we will consider the work of philosophers and theorists wrestling with ethical and political implications of violence, while also considering how literary texts drawn from a diverse geographic and historical corpus have attempted to 'write' violence as a problem of artistic representation.  Some of the texts we may consider include: Euripides' Medea, the epic Mahabharata, Dante's Inferno, Dostoevsky's Crime and Punishment, Sorel's Reflections on Violence, Gandhi's Hind Swaraj, Simone Weil's Essay on Force, Franz Fanon's The Wretched of the Earth, and the poetry of Faiz Ahmed Faiz and Dennis Brutus.\n\n      less description for COREP-AD   60 «",
            "offering": true
        },
        {
            "course_id": "COREP-AD 61",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19835",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 002 with Dinwiddie, Michael08/30/2015 - 12/17/2015 Mon,Wed 10.40 AM - 11.55 AM at SOC_SCI 001",
                    "time": "Tue 5.00 PM - 7.00 PM",
                    "open": true,
                    "professor": "Dinwiddie, Michael"
                },
                {}
            ],
            "course_name": "",
            "description": "COREP-AD   61\n\n   Cultural Memory and Resistance\n\nAs the Atlantic slave trade forcibly dispersed Africans throughout Europe and the Americas over four centuries, cultural memory became a key component of survival for those who journeyed through the Middle Passage.  How did languages incorporate modes of expression –creole, patois, pidgin—that connected with scarce-remembered cosmologies and ways of being to allow for resistance to systems of oppression? And how was the traditional music of African peoples reconstructed with new instruments and inflections during this process?  We will examine texts ranging from Plato, the Book of Exodus, Ibn ...\n\n      more description for COREP-AD   61 »\n\n      \n\n\n\nAs the Atlantic slave trade forcibly dispersed Africans throughout Europe and the Americas over four centuries, cultural memory became a key component of survival for those who journeyed through the Middle Passage.  How did languages incorporate modes of expression –creole, patois, pidgin—that connected with scarce-remembered cosmologies and ways of being to allow for resistance to systems of oppression? And how was the traditional music of African peoples reconstructed with new instruments and inflections during this process?  We will examine texts ranging from Plato, the Book of Exodus, Ibn Battuta, The Tale of Sundiata, early African slave narratives, the music of the Fisk Jubilee Singers, Bessie Smith, Billie Holiday, Nina Simone, works by Amiri Baraka, Aimé Césaire, Edouard Glissant, Wole Soyinka, Mos Def, Common, Nubian Sisters, Saul Williams, Talib Kweli, Tupac Shakur, and in films such as Sugar Cane Alley, La Haine, Illmatic and Belle to better understand key components of cultural memory and resistance.\n\n      less description for COREP-AD   61 «",
            "offering": true
        }
    ]
}