{
    "major_id": "CORES-AD",
    "file": "./2015-2016/Core:_Structures_of_Thought_&Society_(CORES-AD).html",
    "courses": [
        {
            "course_id": "CORES-AD 1",
            "course_name": "W Tolerance and Relativism",
            "description": "CORES-AD    1W Tolerance and Relativism \nMost of us agree that we should be tolerant. Often the call for tolerance is grounded in relativism—the thought that there isn’t a fact of the matter. After all, on what basis could we insist that others share our beliefs if those beliefs are subjective, a function of upbringing or our peculiar tastes and concerns? But should we accept relativism? Can relativism justify tolerance? If not, then how can we justify tolerance?",
            "offering": false
        },
        {
            "course_id": "CORES-AD 2",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17870",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Chacon, Mario"
                }
            ],
            "course_name": "",
            "description": "CORES-AD    2\n\n   Wealth of Nations\n\nThis course examines the determinants of economic development in the modern world. The course is divided into two parts. The first reviews theories\nthat place factors of production such as labor and technology as the main cause of cross-country differences in economic wealth. The second part\nof the course investigates the role of institutions, culture, religion, geography, and luck as deeper causes of comparative development. The main\nquestions addressed throughout the course are: Why are there such large differences in income per capita across countries? Why have\nsome countries developed ...\n\n      more description for CORES-AD    2 »\n\n      \n\n\n\nThis course examines the determinants of economic development in the modern world. The course is divided into two parts. The first reviews theories\nthat place factors of production such as labor and technology as the main cause of cross-country differences in economic wealth. The second part\nof the course investigates the role of institutions, culture, religion, geography, and luck as deeper causes of comparative development. The main\nquestions addressed throughout the course are: Why are there such large differences in income per capita across countries? Why have\nsome countries developed steadily over the past 200 years while many others have not? Why do some governments adopt policies that promote economic development while others set up barriers to economic activity? These questions are analyzed from a theoretical and empirical perspective.\n\n      less description for CORES-AD    2 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 3",
            "course_name": "Truth",
            "description": "CORES-AD    3 Truth \nThe course focuses on the concept of truth, addressing such central questions as whether there is such a thing as “absolute” truth; what truth is; why it is worth searching for; and how we can find it. Answers from a variety of intellectual\nand cultural traditions are considered. They are assessed for their adequacy in dealing with a range of domains in which truth is at issue—including science, morality, politics, religion, and aesthetics.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 4",
            "course_name": "W",
            "description": "CORES-AD    4W\n\n   Prejudice\n\nThis course covers historical and contemporary scientific approaches to understanding prejudice, specifically prejudice that exists between social groups (for example, ethnic prejudice, religious prejudice, etc.) across different cultures. Readings draw from multiple social scientific perspectives, and cover topics including the origins of prejudice, the justification of prejudice, the different forms of prejudicial expression, the identification of prejudice in individuals and institutions, the consequences of being a victim of prejudice, and the value (or not) of different prejudice reductio...\n\n      more description for CORES-AD    4W »\n\n      \n\n\n\nThis course covers historical and contemporary scientific approaches to understanding prejudice, specifically prejudice that exists between social groups (for example, ethnic prejudice, religious prejudice, etc.) across different cultures. Readings draw from multiple social scientific perspectives, and cover topics including the origins of prejudice, the justification of prejudice, the different forms of prejudicial expression, the identification of prejudice in individuals and institutions, the consequences of being a victim of prejudice, and the value (or not) of different prejudice reduction strategies.\n\n      less description for CORES-AD    4W «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 5",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19150",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "WEST_ADMIN 002",
                    "time": "Sun 10.40 AM - 12.40 PM",
                    "open": true,
                    "professor": "Sexton, John"
                },
                {},
                {},
                {}
            ],
            "course_name": "",
            "description": "CORES-AD    5\n\n   Relationship of Government and Religion\n\nThis course examines the relationship between government and religion. To this end, the course will concentrate on the interpretation, meaning, application, and wisdom of 16 words from the American Constitution: \"Government shall make no law respecting an establishment of religion or prohibiting the free exercise thereof.\" These 16 words will serve as a starting point for the course because they broadly prohibit government entanglement with religion while simultaneously bestowing government with the responsibility to protect religious freedom. The primary texts of the course are the opinions o...\n\n      more description for CORES-AD    5 »\n\n      \n\n\n\nThis course examines the relationship between government and religion. To this end, the course will concentrate on the interpretation, meaning, application, and wisdom of 16 words from the American Constitution: \"Government shall make no law respecting an establishment of religion or prohibiting the free exercise thereof.\" These 16 words will serve as a starting point for the course because they broadly prohibit government entanglement with religion while simultaneously bestowing government with the responsibility to protect religious freedom. The primary texts of the course are the opinions of the United States Supreme Court, the highest Court in the United States and final authority on interpretations of the Constitution. Prior knowledge of the subject matter or the United States is not a prerequisite for this class.\n\n      less description for CORES-AD    5 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 7",
            "course_name": "W Animals, Culture, and Society",
            "description": "CORES-AD    7W Animals, Culture, and Society \nThis course considers the intellectual, ethical, and political stakes of incorporating animal-centered perspectives into frameworks of social scientific inquiry. We examine how animals are socially or culturally constructed in “traditional” and “modern” societies, and consider proposals for studying animals as minded social actors. Readings include religious, scientific, philosophical, and political texts from Arabic/Islamic, Chinese, and Judeo-Christian literatures.\n\nStudents NYUNY: This course counts for Texts and Ideas (Morse Academic Plan) credit.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 10",
            "course_name": "",
            "description": "CORES-AD   10\n\n   What is Man?\n\nThe human sciences, born of the Enlightenment’s quest to recreate Man in its image, gave rise to a paradox. In brokering reconfigurations of the essence and boundaries of the human, new models for socio-political organization, and claims to inalienable human rights, they also demarcated and fortified the supposedly ‘natural’ fault lines between sexes, races, cultures, and peoples.\nThe course provides an interdisciplinary exploration of the nature of cultural distinction and the historical development of the Image of Man in a variety of\nglobal case studies, from the eighteenth century to the pr...\n\n      more description for CORES-AD   10 »\n\n      \n\n\n\nThe human sciences, born of the Enlightenment’s quest to recreate Man in its image, gave rise to a paradox. In brokering reconfigurations of the essence and boundaries of the human, new models for socio-political organization, and claims to inalienable human rights, they also demarcated and fortified the supposedly ‘natural’ fault lines between sexes, races, cultures, and peoples.\nThe course provides an interdisciplinary exploration of the nature of cultural distinction and the historical development of the Image of Man in a variety of\nglobal case studies, from the eighteenth century to the present.\n\n      less description for CORES-AD   10 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 11",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17875",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 017",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Stearns, Justin K"
                }
            ],
            "course_name": "X Faith in Science, Reason in Revelation",
            "description": "CORES-AD   11X Faith in Science, Reason in Revelation \nWe live simultaneously in an age of science and an era of great religious faith, when reason and revelation are often depicted as being in inherent and eternal tension. In this course we trace the history of the relationship of religion and science in Christendom and Islamdom from the Middle Ages to the present day, drawing on primary sources and secondary readings from religious studies, the history of science, and anthropology.",
            "offering": true
        },
        {
            "course_id": "CORES-AD 13",
            "course_name": "Family, Gender, and Modernity",
            "description": "CORES-AD   13 Family, Gender, and Modernity \nThis class examines a few universal, global pattern  in the history of families and the many ways that families are culturally diverse. We begin with a historical survey, from the “traditional” families that once dominated throughout the world, to the “modern” (industrial) and “post-modern” (post-industrial) family values that appear today. Then we focus on particular aspects of family life: childhood; dating and courtship; sex and reproduction; husband-wife relations; old age; female-headed and other nontraditional families.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 15",
            "course_name": "",
            "description": "CORES-AD   15\n\n   Politics and the City: Plato to Cairo\n\nCities are efficient social networks. They allow for increased communication and creation. They are spaces for deliberation and collective action. This class explores the reasons why most humans now live in cities, why cities rise and decline, and how they become sites and stakes of political protest. We start by examining the politics of urban development in Abu Dhabi and Dubai, and by analyzing three urban protests, in early 1990s Riyadh, in Cairo during the Egyptian revolution, and in New York City during the Occupy Wall Street movement. We then explore the concomitant processes of city mak...\n\n      more description for CORES-AD   15 »\n\n      \n\n\n\nCities are efficient social networks. They allow for increased communication and creation. They are spaces for deliberation and collective action. This class explores the reasons why most humans now live in cities, why cities rise and decline, and how they become sites and stakes of political protest. We start by examining the politics of urban development in Abu Dhabi and Dubai, and by analyzing three urban protests, in early 1990s Riyadh, in Cairo during the Egyptian revolution, and in New York City during the Occupy Wall Street movement. We then explore the concomitant processes of city making and politicization as analyzed by Plato, Ibn Khaldun, Hegel, Engels, Marx, Weber, Freud, and Simmel. The last part of the course is dedicated to interdisciplinary urban studies, from urban anthropology to the history of urban planning and to subaltern urbanism. In-class sessions are complemented by field visits to Abu Dhabi and Dubai.\n\n      less description for CORES-AD   15 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 15",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12870",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Menoret, Pascal"
                },
                {
                    "format": "Workshop",
                    "class_id": "19561",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Sun 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Menoret, Pascal"
                }
            ],
            "course_name": "W Politics and the City",
            "description": "CORES-AD   15W Politics and the City \nCities are probably the most efficient social networks. They allow for increased communication and innovation. They are natural spaces for deliberation and collective action. This course explores the reasons why cities rise and decline, the mechanisms of formal and informal urban planning, skyscrapers and suburbs, urban nature and urban design. In-class sessions are supplemented by workshops on Abu Dhabi, visits to the Abu Dhabi Urban Planning Council, and fieldwork in the city.",
            "offering": true
        },
        {
            "course_id": "CORES-AD 16",
            "course_name": "Family and Kinship",
            "description": "CORES-AD   16 Family and Kinship \nBeing part of a family and of being related, or kin, to other human beings is a universal human experience; it is fundamental to our sense of ourselves. Yet what we mean by family or by kinship changes dramatically across societies and through time. This course introduces social scientific approaches to and methods for understanding and analyzing this diversity; it therefore asks students to explore the relationship between the universal and what is specific to particular societies and cultures.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 18",
            "course_name": "J The Social Life of Finance",
            "description": "CORES-AD   18J The Social Life of Finance \nThis is a course about how and why finance matters. From credit derivatives to pyramid schemes, home mortgages to credit cards, finance both underwrites the aspirations and lines the underbelly of the contemporary economy. Finance also shapes the urban environment, producing new city forms and social structures. Drawing on sociology, anthropology, fiction, and film, our seminar examines finance as a mode of social relations and cultural meaning in contemporary capitalism.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 21",
            "course_name": "",
            "description": "CORES-AD   21\n\n   Gender and Globalization\n\nWhat does gender as category of analysis indicate? How does gender intersect with other axes of identity such as class, nation, and ethnicity in a globalized world? The course introduces students to select women’s issues (e.g. employment, political participation, reproductive rights and healthcare, feminism vs. multiculturalism, gender based violence, and peace building) that have emerged in the global context and the international debates that surround them. In addition, the course looks at the relevance of women’s representation to address barriers to gender equality in the ‘democratic proce...\n\n      more description for CORES-AD   21 »\n\n      \n\n\n\nWhat does gender as category of analysis indicate? How does gender intersect with other axes of identity such as class, nation, and ethnicity in a globalized world? The course introduces students to select women’s issues (e.g. employment, political participation, reproductive rights and healthcare, feminism vs. multiculturalism, gender based violence, and peace building) that have emerged in the global context and the international debates that surround them. In addition, the course looks at the relevance of women’s representation to address barriers to gender equality in the ‘democratic process’ as well as the shortcomings of democratic mechanisms to achieve women’s rights and some proposed solutions to these limitations.\n\n      less description for CORES-AD   21 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 22",
            "course_name": "W Cultures and Modernities",
            "description": "CORES-AD   22W Cultures and Modernities \n“Culture,” wrote Raymond Williams, “is one of the two or three most complicated words in the English language.” Modernity, arguably, is another.\nMoreover, “culture” and “modernity” are often held to be at odds with one another; if modernity can be defined by its claim to universal applicability, then\nculture(s) mark the disjunctures and discrepancies that repeatedly disrupt this narrative. This course examines the (cross-) cultural politics and imaginaries of “modernity” to ask: What does it mean to be modern in the global present?",
            "offering": false
        },
        {
            "course_id": "CORES-AD 24",
            "course_name": "W Landscapes of Memory",
            "description": "CORES-AD   24W Landscapes of Memory \nThis course explores the ways in which urban landscapes have traditionally served as fragile repositories for collective memory from the first monuments of Near Eastern civilization to the modern architecture of contemporary global cities. Some cities seek to preserve their pasts, while others aggressively brush aside older forms and structures to make way for the new. Students will examine the “politics” of urban memory, exploring historical and contemporary debates about the conflicting demands of preservation and modernization in\na variety of cities from around the world.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 25",
            "course_name": "",
            "description": "CORES-AD   25\n\n   Gift and Exchange\n\nGift giving occurs in all cultures. A gift can be a material object or money, but it can also be an act of kindness or love. A gift is free but it can also come with the expectation that it will be matched by a return gift. Gift giving is therefore part of a complex structure of economic and social exchange. This course considers gift giving from the perspectives of anthropology, history, and the arts; it explores gift exchange through ethnographies as well as texts on market economies and art, gender, death, altruism, risk, and the impacts of colonialism on traditional exchange societies. Rea...\n\n      more description for CORES-AD   25 »\n\n      \n\n\n\nGift giving occurs in all cultures. A gift can be a material object or money, but it can also be an act of kindness or love. A gift is free but it can also come with the expectation that it will be matched by a return gift. Gift giving is therefore part of a complex structure of economic and social exchange. This course considers gift giving from the perspectives of anthropology, history, and the arts; it explores gift exchange through ethnographies as well as texts on market economies and art, gender, death, altruism, risk, and the impacts of colonialism on traditional exchange societies. Readings will include seminal works on gift exchange by Marcel Mauss, Bronislaw Malinowski, Franz Boas, and others.\n\n      less description for CORES-AD   25 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 26",
            "course_name": "",
            "description": "CORES-AD   26\n\n   Legitimacy\n\nWhat are the foundations of political legitimacy and to what extent do governments abide by them? In this course, we will explore these questions using both classical and contemporary accounts. The first half of the course will focus on political systems in Ancient Greece, Rome, Medieval Europe, and Early Modern Europe through the lens of great thinkers, including Aristotle, Augustine, Aquinas, Machiavelli, Hobbes, Locke, Rousseau, Montesquieu, Burke, Weber, and Marx, as well as a series of primary source documents . We then proceed to the “post-1789” world and discuss legitimacy in the contex...\n\n      more description for CORES-AD   26 »\n\n      \n\n\n\nWhat are the foundations of political legitimacy and to what extent do governments abide by them? In this course, we will explore these questions using both classical and contemporary accounts. The first half of the course will focus on political systems in Ancient Greece, Rome, Medieval Europe, and Early Modern Europe through the lens of great thinkers, including Aristotle, Augustine, Aquinas, Machiavelli, Hobbes, Locke, Rousseau, Montesquieu, Burke, Weber, and Marx, as well as a series of primary source documents . We then proceed to the “post-1789” world and discuss legitimacy in the context of democratic government. Topics covered include the role of legislators, issue representation, descriptive vs. substantive governance, and the ongoing debate between advocates of majoritarianism and those of proportionalism.\n\n      less description for CORES-AD   26 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 27",
            "course_name": "W",
            "description": "CORES-AD   27W\n\n   Peace\n\nThis course traces the development of philosophical, religious and secular theories of peace from antiquity to the present. It explores questions of peace and justice, nonviolence, the idea of a “just war,” as well as notions of peace in international relations, economics, and psychology, examining how those spurred peace activism and the ideology of pacifism. To that end, students analyze literary, visual, and organizational representations of peace across national and cultural boundaries and the emergence of peace and conflict studies as an academic discipline. Readings include works by Laot...\n\n      more description for CORES-AD   27W »\n\n      \n\n\n\nThis course traces the development of philosophical, religious and secular theories of peace from antiquity to the present. It explores questions of peace and justice, nonviolence, the idea of a “just war,” as well as notions of peace in international relations, economics, and psychology, examining how those spurred peace activism and the ideology of pacifism. To that end, students analyze literary, visual, and organizational representations of peace across national and cultural boundaries and the emergence of peace and conflict studies as an academic discipline. Readings include works by Laotse, Thucydides, St. Francis of Assisi, Immanuel Kant, Henry David Thoreau, Edna St. Vincent Millay, Mohandas Gandhi, Martin Luther King Jr., A.J. Muste, Johan Galtung, Alma Myrdal, and Petra Kelly, among others.\n\n      less description for CORES-AD   27W «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 29",
            "course_name": "W",
            "description": "CORES-AD   29W\n\n   Property\n\nThe institution of property describes one of the fundamental relationships between people: The relationship between people as it pertains to things. In this seminar, we explore how understandings of property have been influenced by cultural and ethical norms in different civilizations; how property rights have evolved with technological progress and changes in the demands of the environment; how property is affected by and influences the sphere of individual freedom, the relation between the individual and the state, and the organization\nof productive activity. As examples, we will look at pro...\n\n      more description for CORES-AD   29W »\n\n      \n\n\n\nThe institution of property describes one of the fundamental relationships between people: The relationship between people as it pertains to things. In this seminar, we explore how understandings of property have been influenced by cultural and ethical norms in different civilizations; how property rights have evolved with technological progress and changes in the demands of the environment; how property is affected by and influences the sphere of individual freedom, the relation between the individual and the state, and the organization\nof productive activity. As examples, we will look at property in the ancient civilizations of Egypt, Greece and Rome; consider the views on property expressed in Christianity and Islam; as well as the role that changing views on property played in the Declaration of Independence, the French Revolution, and the Russian Revolution. We use our insights to debate contemporary issues in property rights of interest to seminar participants. These might include intellectual property rights, rights to genetic material, inheritance, airwaves, financial regulation, the rights of indigenous tribes of the Amazon rainforest, claims on the Arctic, or the trade-off between rights to privacy and freedom\nof the press.\n\n      less description for CORES-AD   29W «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 30",
            "course_name": "",
            "description": "CORES-AD   30\n\n   Consciousness\n\nTopics covered may include: the concept of a neural basis of consciousness and how we could discover what it is; whether there are different kinds of consciousness; the relation between consciousness and attention, cognitive accessibility, intentionality and agency; the function of consciousness; the unity of consciousness; whether the representational contents of perception are just colors, shapes and textures or include “rich” properties such as facial expressions and causation. The course also covers some theories of consciousness such as mind/body dualism, behaviorism, functionalism, physi...\n\n      more description for CORES-AD   30 »\n\n      \n\n\n\nTopics covered may include: the concept of a neural basis of consciousness and how we could discover what it is; whether there are different kinds of consciousness; the relation between consciousness and attention, cognitive accessibility, intentionality and agency; the function of consciousness; the unity of consciousness; whether the representational contents of perception are just colors, shapes and textures or include “rich” properties such as facial expressions and causation. The course also covers some theories of consciousness such as mind/body dualism, behaviorism, functionalism, physicalism, and theories of consciousness as representation. Readings from philosophers such as Thomas Nagel and David Chalmers and neuroscientists such as Hakwan Lau and Stanislas Dehaene.\n\n      less description for CORES-AD   30 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 33",
            "course_name": "",
            "description": "CORES-AD   33\n\n   What Do Leaders Do?\n\nAre social outcomes primarily shaped by prominent individuals or deterministic structural forces? Some claim leadership is a mere label used to justify social change stemming from structural forces of nature and culture. Others assert history can be found in the biographies of a few prominent men and women. In this course we examine this old and unsettled debate. Considering political, social, artistic and business perspectives, we dissect the concept of leadership. Students will learn to elaborate on the interplay between culture and leadership and to which extent societies create their own l...\n\n      more description for CORES-AD   33 »\n\n      \n\n\n\nAre social outcomes primarily shaped by prominent individuals or deterministic structural forces? Some claim leadership is a mere label used to justify social change stemming from structural forces of nature and culture. Others assert history can be found in the biographies of a few prominent men and women. In this course we examine this old and unsettled debate. Considering political, social, artistic and business perspectives, we dissect the concept of leadership. Students will learn to elaborate on the interplay between culture and leadership and to which extent societies create their own leaders. The course draws on the classic work of Machiavelli, Hobbes, Tolstoy, Marx and Carlyle, as well as modern thinkers such as Weber, Schumpeter, Russell and Lakoff, among others. We will also explore the life of prominent individuals, such as Gandhi, Mandela, Mother Teresa, Jobs, Soros, Churchill, Thatcher, and many others.\n\n      less description for CORES-AD   33 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 34",
            "course_name": "J",
            "description": "CORES-AD   34J\n\n   Polarization\n\nPolarization has been a feature of societies around the world since the inception of human civilization. To this day, individuals routinely sort themselves in to groups based on share political, social, religious, or cultural beliefs. In turn, these sorted groups often find themselves at polar extremes from one another, something that has often led to intense, and sometimes violent, conflict. In this course, we will explore the history, emergence, and pervasiveness of various kinds of polarization: ethnic, linguistic, religious, political, and geographic. We will begin the course by defining p...\n\n      more description for CORES-AD   34J »\n\n      \n\n\n\nPolarization has been a feature of societies around the world since the inception of human civilization. To this day, individuals routinely sort themselves in to groups based on share political, social, religious, or cultural beliefs. In turn, these sorted groups often find themselves at polar extremes from one another, something that has often led to intense, and sometimes violent, conflict. In this course, we will explore the history, emergence, and pervasiveness of various kinds of polarization: ethnic, linguistic, religious, political, and geographic. We will begin the course by defining polarization and looking at examples of it from antiquity to the present. Thereafter, we will look at the consequences of polarization for politics, social interactions, and economics. The course will be taught using classical works by kings and statesmen (e.g., Constantine of Rome, Louis XIV of France, Woodrow Wilson), as well as contemporary scholarship from a diverse group of scholars: historians, demographers, political scientists, biologists, and economists. Special attention will be given to social media and social networking, a pervasive aspect of contemporary social polarization; it will serve as the basis for a course-long project. There are no prerequisites for this course; some familiarity with social networking (e.g., Facebook, Twitter, Tumblr, LinkedIn) and Microsoft Excel would be useful, but not required.\n\n      less description for CORES-AD   34J «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 35",
            "course_name": "Hard Choices",
            "description": "CORES-AD   35 Hard Choices \nLife is rife with hard choices. Should you become a doctor or a lawyer? How much should you sacrifice in order to help others? Should you marry and have children? This course examines the phenomenon of hard choices by focusing on two questions: (1) what makes a choice hard? and (2) what should/does one do when faced with a hard choice? We explore answers to these questions from a variety of perspectives – philosophical, religious, literary, psychological, and neuroscientific.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 36",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12821",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Coughlin, John J"
                }
            ],
            "course_name": "| CORES-AD   36W",
            "description": "CORES-AD   36 | CORES-AD   36W\n\n   Ideas of the Sacred\n\nThe question of God(s) pertains to the existence, manifestations, meaning, and attributes of the sacred.  Although conceptions about the sacred are inevitably shaped by history and culture, the fundamental question of God(s) has had an enduring presence throughout human experience.  This course takes up this perennial human question from the context of some of the world’s major religious traditions including Buddhism, Christianity, Confucianism, Hinduism, Islam, Judaism, and Taoism.  What similarities do these great traditions share, and how does their understanding of the sacred differ?  Addi...\n\n      more description for CORES-AD   36 | CORES-AD   36W »\n\n      \n\n\n\nThe question of God(s) pertains to the existence, manifestations, meaning, and attributes of the sacred.  Although conceptions about the sacred are inevitably shaped by history and culture, the fundamental question of God(s) has had an enduring presence throughout human experience.  This course takes up this perennial human question from the context of some of the world’s major religious traditions including Buddhism, Christianity, Confucianism, Hinduism, Islam, Judaism, and Taoism.  What similarities do these great traditions share, and how does their understanding of the sacred differ?  Additionally, the course explores the relation between reason and faith.  How does the empirical verification characteristic of an increasingly pervasive scientific and technological worldview impact on belief in God(s)?  Readings for the course are drawn from a variety of disciplines with a focus on primary sources and seminal works.\n\n      less description for CORES-AD   36 | CORES-AD   36W «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 37",
            "course_name": "W",
            "description": "CORES-AD   37W\n\n   Slavery and Freedom in Comparative Perspective\n\nThis course examines slavery in historical and comparative perspective by focusing on Greek and Roman slavery, African and Islamic slavery, and slavery in the American South, Brazil, and the Caribbean. We examine the nature and centrality of the institution of slavery, the difference between societies in which slavery existed and those which can be thought of as “slave societies,” asking\nsuch questions as how did enslavement occur and who were the people enslaved and in what ways did they differ from non-slaves? What “rights” or standing in the law if any did slaves possess? What was the natur...\n\n      more description for CORES-AD   37W »\n\n      \n\n\n\nThis course examines slavery in historical and comparative perspective by focusing on Greek and Roman slavery, African and Islamic slavery, and slavery in the American South, Brazil, and the Caribbean. We examine the nature and centrality of the institution of slavery, the difference between societies in which slavery existed and those which can be thought of as “slave societies,” asking\nsuch questions as how did enslavement occur and who were the people enslaved and in what ways did they differ from non-slaves? What “rights” or standing in the law if any did slaves possess? What was the nature and extent of the master’s power over their slaves? What were the social, economic,\nand political functions of slavery? These are important questions for understanding slavery. But the study of slavery inevitably involves broader, more fundamental issues concerning freedom, personhood, social inclusion, and belonging. As Orlando Patterson put it in the most far-reaching study of slavery, Slavery and Social Death, “the idea of freedom and the concept of property were both intimately bound up with the rise of slavery, their very antithesis. Once we understand the dynamics of slavery, we immediately realize why there is nothing in the least anomalous about the fact that an Aristotle or a Jefferson owned slaves.”\n\n      less description for CORES-AD   37W «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 38",
            "course_name": "",
            "description": "CORES-AD   38\n\n   What is Law?\n\nThis course poses the fundamental questions:  “What is law?”; “What is a legal system?; and “What is the rule of law?”  Appreciating that law reflects different cultural and historical facts, the course employs a comparative methodology in order to explore the fundamental questions from the perspective of various legal traditions.   This comparative methodology considers jurisprudence from African, Chinese, Hindu, Marxist, Islamic, Southeast Asian, and Western legal traditions.   In relation to these diverse legal traditions, the course examines the topics of natural law, legal positivism, int...\n\n      more description for CORES-AD   38 »\n\n      \n\n\n\nThis course poses the fundamental questions:  “What is law?”; “What is a legal system?; and “What is the rule of law?”  Appreciating that law reflects different cultural and historical facts, the course employs a comparative methodology in order to explore the fundamental questions from the perspective of various legal traditions.   This comparative methodology considers jurisprudence from African, Chinese, Hindu, Marxist, Islamic, Southeast Asian, and Western legal traditions.   In relation to these diverse legal traditions, the course examines the topics of natural law, legal positivism, interpretivism, legal realism, justice, human rights, critical legal studies, feminist jurisprudence, critical race theory, and post-modernist jurisprudence.\n\n      less description for CORES-AD   38 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 39",
            "course_name": "W Revolutions and Social Change",
            "description": "CORES-AD   39W Revolutions and Social Change \nRevolutions, i.e. the rapid, massive and often violent change in the political and economic arrangements of society, mark the modern epoch starting with England in the 1640s, America in 1776, and France in 1789.  Revolutions obviously continue today. But what are revolution’s causes, typical course and consequences? Why such passion and energy? A systematic comparison of different revolutions informed by both the classical and contemporary theories of revolution might offer a few startling insights.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 40",
            "course_name": "Corruption",
            "description": "CORES-AD   40 Corruption \nPolitical corruption exists everywhere, but which countries are most corrupt? Do highly corrupt countries have common characteristics? How much corruption is there? The social costs of political corruption, from stealing public funds to paying bribes to avoid basic safety and healthy regulations, are often extremely high. Why are most attempts to fight corruption unsuccessful? The course is comparative and historical, and as far as possible requires no background knowledge.",
            "offering": false
        },
        {
            "course_id": "CORES-AD 42",
            "course_name": "",
            "description": "CORES-AD   42\n\n   Economics of Everyday Life\n\nThere is the economics of economists, highfalutin and opaque theoretical models, and then there is economic activity as we experience it in our everyday lives and settings. Between the two stands a wall of incomprehension. From work to love, from social networks to family life, consumption, money, witchcraft, slavery, digital economies, slums, and ghettos, these spheres of everyday life ask us hard questions about the nature of the economic realities we inhabit. This course will seek to explore the everyday life of economic experience in a way that can capture its richness, diversity, and comp...\n\n      more description for CORES-AD   42 »\n\n      \n\n\n\nThere is the economics of economists, highfalutin and opaque theoretical models, and then there is economic activity as we experience it in our everyday lives and settings. Between the two stands a wall of incomprehension. From work to love, from social networks to family life, consumption, money, witchcraft, slavery, digital economies, slums, and ghettos, these spheres of everyday life ask us hard questions about the nature of the economic realities we inhabit. This course will seek to explore the everyday life of economic experience in a way that can capture its richness, diversity, and complexity. To that end, we will be drawing on a range of sources, from classical philosophy, to journalism, sociology, anthropology, manga, film, history, literature and even economics in search of a few answers.\n\n      less description for CORES-AD   42 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 43",
            "course_name": "",
            "description": "CORES-AD   43\n\n   Ideology\n\nWhat is an ideology? How do a series of sometimes disparate beliefs about issues come together to form an ideology? How do ideologies change and reform over time? In this course, we explore these fundamental questions about beliefs in societies across the globe. We begin by defining ideologies and looking at examples from key intellectual movements of the last millennium (e.g., crusaderism/jihadism, liberalism, communism, fascism, religious nationalism, ethnic nationalism). In this intellectual journey, we read some of the great thinkers who have shaped the concept of ideology over time, inclu...\n\n      more description for CORES-AD   43 »\n\n      \n\n\n\nWhat is an ideology? How do a series of sometimes disparate beliefs about issues come together to form an ideology? How do ideologies change and reform over time? In this course, we explore these fundamental questions about beliefs in societies across the globe. We begin by defining ideologies and looking at examples from key intellectual movements of the last millennium (e.g., crusaderism/jihadism, liberalism, communism, fascism, religious nationalism, ethnic nationalism). In this intellectual journey, we read some of the great thinkers who have shaped the concept of ideology over time, including Robespierre, Burke, Jefferson, Marx, Lenin, Mosca, and (Benedict) Anderson.  Thereafter, we look at how to measure ideologies. Students are introduced to quantitative tools for assessing ideologies from both individual-level surveys, voting behavior, and text (e.g., speeches and Twitter). In the last part of the course, we examine how shifting ideologies beliefs have (or might have) consequences for a wide range of human phenomena, ranging from interpersonal interactions to elections and international conflict.\n\n      less description for CORES-AD   43 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 44",
            "course_name": "",
            "description": "CORES-AD   44\n\n   Consumption and Material Culture\n\nWhat are the social, political, and economic forces that bring consumer goods into being, keep them there, and then cause them to disappear from household use and enter the world’s waste stream? Searching for what anthropologist Mary Douglas called “an anthropology of consumption,” we will look across history and places, to pre-modern Japan, Renaissance England, the contemporary UAE and North America.  We ask about the politics of things and their shifting roles in everyday life. What is the nature of taste? of shopping? How do shifts occur depending on object, place, and time? We will explore...\n\n      more description for CORES-AD   44 »\n\n      \n\n\n\nWhat are the social, political, and economic forces that bring consumer goods into being, keep them there, and then cause them to disappear from household use and enter the world’s waste stream? Searching for what anthropologist Mary Douglas called “an anthropology of consumption,” we will look across history and places, to pre-modern Japan, Renaissance England, the contemporary UAE and North America.  We ask about the politics of things and their shifting roles in everyday life. What is the nature of taste? of shopping? How do shifts occur depending on object, place, and time? We will explore the logistics of fashion, the link between goods and geography, production systems, and distribution through retail markets.  We stretch theoretically across the political economy of Marx, neo-classical economics, and the more recent cultural-social schemas of Bruno Latour and Howard Becker. For a final project students will focus on a specific object that they research and present to class, based on readings, discussions and original research.\n\n      less description for CORES-AD   44 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 45",
            "course_name": "",
            "description": "CORES-AD   45\n\n   Language and Thought\n\nThe course is about the nature of language, of thought, and of the relation between them.  Among the questions to be asked are: Are there such things as meanings, and if so, what sorts of things are they?  How do the meanings of linguistic expressions depend on the speech acts the expressions are used to perform?  Is linguistic representation to be explained in terms of mental representation?  Vice versa?  Or is neither to be explained in terms of the other?  How from a finite stock of words is it possible for a language to construct an infinite number of sentences, each with its own meaning? ...\n\n      more description for CORES-AD   45 »\n\n      \n\n\n\nThe course is about the nature of language, of thought, and of the relation between them.  Among the questions to be asked are: Are there such things as meanings, and if so, what sorts of things are they?  How do the meanings of linguistic expressions depend on the speech acts the expressions are used to perform?  Is linguistic representation to be explained in terms of mental representation?  Vice versa?  Or is neither to be explained in terms of the other?  How from a finite stock of words is it possible for a language to construct an infinite number of sentences, each with its own meaning?  How is it possible for a child to acquire—in just a few years and without any instruction—the ability to understand indefinitely many sentences never previously encountered by herself or anyone else?  In grappling with these and other questions we will study work in philosophy, theoretical linguistics and cognitive psychology.\n\n      less description for CORES-AD   45 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 46",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12868",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Li, Allen; Li, Jui-Chung"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   46\n\n   Global Population\n\nPopulation is a basic parameter of the society. The size, composition, and distribution of a population may change over time. This course sets out to understand the causes and consequences of population change across the globe, and engage the students in ongoing debates\nover population policies. Population change takes shape by births, deaths, and migration. These\nfundamental population processes are influenced by institutions of marriage, education, health care, and the economy. Population change may lead to different cultural phenomena and individual behaviors and varying levels of economic ...\n\n      more description for CORES-AD   46 »\n\n      \n\n\n\nPopulation is a basic parameter of the society. The size, composition, and distribution of a population may change over time. This course sets out to understand the causes and consequences of population change across the globe, and engage the students in ongoing debates\nover population policies. Population change takes shape by births, deaths, and migration. These\nfundamental population processes are influenced by institutions of marriage, education, health care, and the economy. Population change may lead to different cultural phenomena and individual behaviors and varying levels of economic development. It may also have implications\nfor the distribution of human welfare, which may in turn elicit perception of injustice and even political action. We will engage the interdisciplinary scholarship on global population, and contemplate issues faced by different countries. We will emphasize general principles that help us understand global population change, and try to come up with policy solutions to related issues.\n\n      less description for CORES-AD   46 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 48",
            "course_name": "",
            "description": "CORES-AD   48\n\n   Subjectivity\n\nHuman beings differ from machines, and perhaps also from other animals, in the way we encounter the world—always from a first-personal perspective, an awareness of oneself in the world and not merely of the world. But what exactly is this peculiarly distinctive way of experiencing the world? What is the essence of our subjectivity? Can it be explained by neuroscience, by finding some particular function of the brain? Has it been better represented in the humanities, in explorations of what is called “the human condition”? Or perhaps the philosophers, who in every age and culture have reflected...\n\n      more description for CORES-AD   48 »\n\n      \n\n\n\nHuman beings differ from machines, and perhaps also from other animals, in the way we encounter the world—always from a first-personal perspective, an awareness of oneself in the world and not merely of the world. But what exactly is this peculiarly distinctive way of experiencing the world? What is the essence of our subjectivity? Can it be explained by neuroscience, by finding some particular function of the brain? Has it been better represented in the humanities, in explorations of what is called “the human condition”? Or perhaps the philosophers, who in every age and culture have reflected on the nature of the self more than any single other topic, have had something important to say. We will study important ancient thinkers from Buddhist, Hindu, Islamic, Greek and Jaina intellectual cultures, and look critically at their appeal to metaphors of light, of mirrors, and of interior spaces; at expressions of contemporary subjectivity in modern novelists and film-makers including Fernando Pessoa and Andrei Tarkovskiy; and at dissenters from Vasubandhu to Simone Weil, who have said that subjectivity is merely an illusion—or, worse, a deceit.\n\n      less description for CORES-AD   48 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 49",
            "course_name": "",
            "description": "CORES-AD   49\n\n   The Great Divergence\n\nIn 1500 the economic, social, and political differences between Europe and Asia were small.  By the twentieth century, the gaps were enormous.  How can we explain this Great Divergence between Europe and Asia?  The course will discuss the classical answers to this question given by Weber, Smith, Marx, and Malthus.  Has modern research confirmed or contradicted their views?  The roles of demography, politics, law, globalization, social structure, science, and technology will be discussed as well as the interconnections between them.  The course aims to expose the methods that social scientists ...\n\n      more description for CORES-AD   49 »\n\n      \n\n\n\nIn 1500 the economic, social, and political differences between Europe and Asia were small.  By the twentieth century, the gaps were enormous.  How can we explain this Great Divergence between Europe and Asia?  The course will discuss the classical answers to this question given by Weber, Smith, Marx, and Malthus.  Has modern research confirmed or contradicted their views?  The roles of demography, politics, law, globalization, social structure, science, and technology will be discussed as well as the interconnections between them.  The course aims to expose the methods that social scientists and historians use to answer grand questions of social evolution, so that the approaches can be compared, contrasted, and assessed.\n\n      less description for CORES-AD   49 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 50",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17873",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Minsky, Amir"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   50\n\n   Emotions\n\nEmotions have been understood since Antiquity to stand at the heart of human motivation and agency, as well as to influence diverse facets of the human condition, from family formation, empathy, and socialization, to choice-making, aggression, and war. Despite this acknowledged ubiquity, emotions were often treated with suspicion as untamable impulses and animalistic drives, threatening reason, morality, gender identity, or social and political equilibrium. This course explores the evolving forms of emotional experience and expression in a variety of global case studies. By investigating diver...\n\n      more description for CORES-AD   50 »\n\n      \n\n\n\nEmotions have been understood since Antiquity to stand at the heart of human motivation and agency, as well as to influence diverse facets of the human condition, from family formation, empathy, and socialization, to choice-making, aggression, and war. Despite this acknowledged ubiquity, emotions were often treated with suspicion as untamable impulses and animalistic drives, threatening reason, morality, gender identity, or social and political equilibrium. This course explores the evolving forms of emotional experience and expression in a variety of global case studies. By investigating diverse interplays of definition and practice of emotions in philosophical and religious systems, medical, pedagogical, and social-engineering projects, and the collusion of emotional and political regimes, it further interrogates the status of emotions as universal constants, beyond determinants of time, space, and cultural context. Course readings include works by Homer, Aristotle, Dharmakīrti, Ibn Sina, Abelard and Heloise, Shigesuke, Descartes, Spinoza, Campe, Darwin, and Freud, as well as relevant secondary scholarship.\n\n      less description for CORES-AD   50 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 51",
            "course_name": "",
            "description": "CORES-AD   51\n\n   Shame and Guilt\n\nWe will read and discuss works of major writers to explore the role that the moral emotions, shame and guilt, have played and still play, in our individual and collective lives.  We will ask whether these two emotive forces are parallel or antagonistic in their effects on our behavior.  We will apply the concepts of shame and guilt to the understanding of psychology and moral value systems, and of different patterns of culture and politics.  We will attempt to understand how shame and guilt can both serve adaptive (life-supporting) as well as maladaptive (life-destroying) functions.  Finally, ...\n\n      more description for CORES-AD   51 »\n\n      \n\n\n\nWe will read and discuss works of major writers to explore the role that the moral emotions, shame and guilt, have played and still play, in our individual and collective lives.  We will ask whether these two emotive forces are parallel or antagonistic in their effects on our behavior.  We will apply the concepts of shame and guilt to the understanding of psychology and moral value systems, and of different patterns of culture and politics.  We will attempt to understand how shame and guilt can both serve adaptive (life-supporting) as well as maladaptive (life-destroying) functions.  Finally, we will ask whether developing the capacity to love can enable us to transcend the destructive outcomes that both shame and guilt, and the ethical systems they motivate, can generate.  Authors studied will include Homer, Sophocles, the Bible, Shakespeare, Dostoevsky, Nietzsche, Freud, Ruth Benedict, Pierre Bourdieu, Salman Rushdie and Kanan Makiya.\n\n      less description for CORES-AD   51 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 52",
            "course_name": "",
            "description": "CORES-AD   52\n\n   Life’s Ends\n\nThe course will examine issues that arise concerning the concept(s) of life.  It will particularly consider various attempts to say what the ‘aim’ or ‘meaning’ of life might be.  Readings will be from a range of sources, philosophical, scientific, and literary.  We begin with biological life (how to distinguish living from non-living entities; the “units” and “levels” of life).  We then turn to a more “biographical” notion of life, applying especially to human lives.  (Is there a natural or typical structure to “a life”?  Is the unity of a life a matter of degree, and what does it depend on?  ...\n\n      more description for CORES-AD   52 »\n\n      \n\n\n\nThe course will examine issues that arise concerning the concept(s) of life.  It will particularly consider various attempts to say what the ‘aim’ or ‘meaning’ of life might be.  Readings will be from a range of sources, philosophical, scientific, and literary.  We begin with biological life (how to distinguish living from non-living entities; the “units” and “levels” of life).  We then turn to a more “biographical” notion of life, applying especially to human lives.  (Is there a natural or typical structure to “a life”?  Is the unity of a life a matter of degree, and what does it depend on?  Is narration the best way to describe or understand a life? )  Finally we turn to the value of life and lives.  (Does all life have value, and by virtue of what?  Does each human life have absolute value, or is it legitimate to compare and rank the values of different lives?)  Readings will include works or extracts by Aristotle, Euripides, Whitman, Darwin, Schopenhauer, Nietzsche, Sartre, as well as religious texts such as The Bhagavad-Gita, the Diamond Sutra, and the Tao Te Ching.\n\n      less description for CORES-AD   52 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 53",
            "course_name": "J",
            "description": "CORES-AD   53J\n\n   What is a Religion?\n\nCourse description: Most English-speaking people can answer the question, “What is your religion?” … even if the answer is “I am an atheist, so I don’t have one.” Yet the things we call religions are remarkably diverse. They differ, for example, in whether they address one God, no gods or many; how important they think explicit creeds are; how much attention they give to prayer, fasting and other rituals; and whether adherents are expected to dress or eat or engage in other everyday practices in a distinctive way. In this course we’ll discuss the views of a variety of anthropologists, philosop...\n\n      more description for CORES-AD   53J »\n\n      \n\n\n\nCourse description: Most English-speaking people can answer the question, “What is your religion?” … even if the answer is “I am an atheist, so I don’t have one.” Yet the things we call religions are remarkably diverse. They differ, for example, in whether they address one God, no gods or many; how important they think explicit creeds are; how much attention they give to prayer, fasting and other rituals; and whether adherents are expected to dress or eat or engage in other everyday practices in a distinctive way. In this course we’ll discuss the views of a variety of anthropologists, philosophers and sociologists as to what religions are; theories that seek to explain not just what, if anything, these many diverse religions have in common but the moral, social or cognitive purposes they serve. Among our theorists will be some of the founders of modern Western social science—E. B. Tylor, Max Weber, and Emile Durkheim. Among our questions will be, “Is religion a European concept?”\n\n      less description for CORES-AD   53J «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 54",
            "course_name": "J",
            "description": "CORES-AD   54J\n\n   Surveillance and Privacy\n\nThis multidisciplinary course examines the historical, sociological, cultural, and political significance of surveillance, with a particular focus on the relationship between surveillance and privacy. Drawing on a wide range of sources (­including academic research, historical documents, literature, film, and social media), the course explores how developments in the practice and technologies of surveillance have shaped the ways in which we think about privacy, identity, and personal information over the last 3000 years. Among the central questions that animate the course are: What is the rela...\n\n      more description for CORES-AD   54J »\n\n      \n\n\n\nThis multidisciplinary course examines the historical, sociological, cultural, and political significance of surveillance, with a particular focus on the relationship between surveillance and privacy. Drawing on a wide range of sources (­including academic research, historical documents, literature, film, and social media), the course explores how developments in the practice and technologies of surveillance have shaped the ways in which we think about privacy, identity, and personal information over the last 3000 years. Among the central questions that animate the course are: What is the relationship between surveillance and governance?  How has the emergence of various forms of electronic surveillance changed the ways in which we think about identity and individual privacy? How do we balance a concern for individual freedom with the pursuit of security in a world characterized by increasingly sophisticated and intrusive forms of state and private surveillance? The course will also focus on key historical debates about the appropriate limits of surveillance, paying particular attention to the ways in which certain major events (such as the 11 September 2001 attacks on the United States) have shaped how we think about surveillance and its relationship to privacy, security, and democracy.\n\n      less description for CORES-AD   54J «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 55",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17872",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Haefke, Christian"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   55\n\n   Labor\n\nHow has labor - and our attitude towards it - evolved from subsistence farming and slavery? What happened in the industrial revolution and which changes are brought about in the new digital age? What role have institutions and religions played in attitudes toward labor? How does education affect work/life satisfaction, wages, and mobility? Why do so many people choose not to work “in the market”, and at the same time, why in happiness surveys is job loss often ranked similar in severity to the death of a close relative or divorce? These are some of the questions we will discuss in this class w...\n\n      more description for CORES-AD   55 »\n\n      \n\n\n\nHow has labor - and our attitude towards it - evolved from subsistence farming and slavery? What happened in the industrial revolution and which changes are brought about in the new digital age? What role have institutions and religions played in attitudes toward labor? How does education affect work/life satisfaction, wages, and mobility? Why do so many people choose not to work “in the market”, and at the same time, why in happiness surveys is job loss often ranked similar in severity to the death of a close relative or divorce? These are some of the questions we will discuss in this class when we study how the role of and attitude towards labor has changed.\n\n      less description for CORES-AD   55 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 56",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17879",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Paik, Christopher"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   56\n\n   Boundaries\n\nHow are boundaries created and what are their roles in society? This class will explore human, natural and political boundaries as processes accompanying genetic, linguistic, religious and cultural divergence. It will also investigate changing boundaries over time in various regions to see how these changes explain both socioeconomic and political outcomes today. Students will be exposed to various interdisciplinary literature, and will learn to create their own digital maps using both archival and contemporary resources. They will also work with these novel data to present their own research ...\n\n      more description for CORES-AD   56 »\n\n      \n\n\n\nHow are boundaries created and what are their roles in society? This class will explore human, natural and political boundaries as processes accompanying genetic, linguistic, religious and cultural divergence. It will also investigate changing boundaries over time in various regions to see how these changes explain both socioeconomic and political outcomes today. Students will be exposed to various interdisciplinary literature, and will learn to create their own digital maps using both archival and contemporary resources. They will also work with these novel data to present their own research ideas.\n\n      less description for CORES-AD   56 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 57",
            "course_name": "",
            "description": "CORES-AD   57\n\n   Cooperation\n\nHardly a week goes by without a major news story concerning the need for cooperation between countries, political parties, organizations, individuals. This course will explore the issue of cooperation using insights from economics, evolutionary biology, mathematics, social psychology and anthropology. The main questions to be addressed are: When is cooperation desirable? When should an individual, an organization or a country expect others to cooperate? Why do some people fail to cooperate even when it would be to their benefit? What factors undermine cooperation? How can we engineer cooperati...\n\n      more description for CORES-AD   57 »\n\n      \n\n\n\nHardly a week goes by without a major news story concerning the need for cooperation between countries, political parties, organizations, individuals. This course will explore the issue of cooperation using insights from economics, evolutionary biology, mathematics, social psychology and anthropology. The main questions to be addressed are: When is cooperation desirable? When should an individual, an organization or a country expect others to cooperate? Why do some people fail to cooperate even when it would be to their benefit? What factors undermine cooperation? How can we engineer cooperation? Students will read classic books and articles on cooperation, participate in experiments, solve problems, discuss case studies spanning different cultures and time, and face a real-world cooperation problem which they will have to solve.\n\n      less description for CORES-AD   57 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 58",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17903",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Harris, Jonathan Andrew"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   58\n\n   Randomness\n\nDoes randomness actually exist, or is it a human theoretical construction? How does our understanding of randomness condition our ability to make sense of the world? This course will explore the role of randomness in human experience and agency, probing how our understanding of chance affects how we produce meaning and knowledge. We start by looking at how early cultures thought about and reacted to randomness and also consider later efforts to reify uncertainty with mathematics. Then, we will examine how scientists and artists manipulate chance in their work, and build on those efforts using ...\n\n      more description for CORES-AD   58 »\n\n      \n\n\n\nDoes randomness actually exist, or is it a human theoretical construction? How does our understanding of randomness condition our ability to make sense of the world? This course will explore the role of randomness in human experience and agency, probing how our understanding of chance affects how we produce meaning and knowledge. We start by looking at how early cultures thought about and reacted to randomness and also consider later efforts to reify uncertainty with mathematics. Then, we will examine how scientists and artists manipulate chance in their work, and build on those efforts using interactive simulations and course projects.\n\n      less description for CORES-AD   58 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 59",
            "course_name": "",
            "description": "CORES-AD   59\n\n   Inequality\n\nInequality is a fundamental issue with which every human society, past and present, has had to deal.  The goal of this course is to consider inequality in comparative and historical perspective so that students will gain a deeper perspective on today’s debates.  Our core focus will be on the relationship between inequality and government.  We want to know how governmental action influences inequality, and why.  We also want to know whether the presence of inequality influences what type of government is possible.  To answer these questions we will draw on sources from a range of academic disci...\n\n      more description for CORES-AD   59 »\n\n      \n\n\n\nInequality is a fundamental issue with which every human society, past and present, has had to deal.  The goal of this course is to consider inequality in comparative and historical perspective so that students will gain a deeper perspective on today’s debates.  Our core focus will be on the relationship between inequality and government.  We want to know how governmental action influences inequality, and why.  We also want to know whether the presence of inequality influences what type of government is possible.  To answer these questions we will draw on sources from a range of academic disciplines including political science, history, economics, philosophy, and literature.  However, no prior expertise in any of these areas will be required.  By the end of the course students will be in a better position to formulate their own normative opinions about inequality while also understanding how it functions in practice.\n\n      less description for CORES-AD   59 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 60",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17896",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Peisakhin, Leonid"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   60\n\n   Colonialism and Post-Colonialism\n\nUntil very recently much of the world has lived under colonial rule. Major colonial powers shaped social, religious, and institutional life in countries that they controlled. This course explores the legacies of colonial rule. Do some colonial-era institutions and practices tend to persist into the present, while others are likely to disappear? What are the conditions under which persistence of institutions and practices is more likely? What does such persistence mean for the social, political, and economic well-being of former colonies today? We engage with these and related questions through...\n\n      more description for CORES-AD   60 »\n\n      \n\n\n\nUntil very recently much of the world has lived under colonial rule. Major colonial powers shaped social, religious, and institutional life in countries that they controlled. This course explores the legacies of colonial rule. Do some colonial-era institutions and practices tend to persist into the present, while others are likely to disappear? What are the conditions under which persistence of institutions and practices is more likely? What does such persistence mean for the social, political, and economic well-being of former colonies today? We engage with these and related questions through the prism of related literatures in political science, economics, and history. First, we explore the motivations of colonizing powers and their methods. We then consider the colonial experience from the perspective of populations being colonized. Most of the course is dedicated to exploring the impact of colonial institutions and practices on contemporary levels of development, inequality, and conflict in the former colonies.\n\n      less description for CORES-AD   60 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 61",
            "course_name": "",
            "description": "CORES-AD   61\n\n   The Body\n\nThe body seems to be an essential part of our sense of individuality. Nevertheless, our bodies and the ways we perceive them are also the result of social and collective forces. This course will study how the body has been perceived and experienced across different cultures and societies. It will explore multiple artistic, scientific and literary representations of the body, as well as the body's social, institutional, and political dimensions. It will seek to understand the role played by the body in the definition of the boundaries between human and non-human, in power relations and politica...\n\n      more description for CORES-AD   61 »\n\n      \n\n\n\nThe body seems to be an essential part of our sense of individuality. Nevertheless, our bodies and the ways we perceive them are also the result of social and collective forces. This course will study how the body has been perceived and experienced across different cultures and societies. It will explore multiple artistic, scientific and literary representations of the body, as well as the body's social, institutional, and political dimensions. It will seek to understand the role played by the body in the definition of the boundaries between human and non-human, in power relations and political regimes, and in the human quest for knowledge.\n\n      less description for CORES-AD   61 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 62",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19548",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Dave, Chetan"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   62\n\n   Money\n\nThe need to trade goods and services within and across time is a requirement for the basic functioning of any society. When barter systems do not satisfy needs, the ability to engage in such trades requires a peculiar sort of good, namely, money. In this course we begin with the theory of money, why one uses either barter, commodity or fiat monies, and the functions money serves. We trace the history of the development of money and credit across societies to the present day. We explore the centrality of money to various cultures and its representation in the arts. We discuss governmental manip...\n\n      more description for CORES-AD   62 »\n\n      \n\n\n\nThe need to trade goods and services within and across time is a requirement for the basic functioning of any society. When barter systems do not satisfy needs, the ability to engage in such trades requires a peculiar sort of good, namely, money. In this course we begin with the theory of money, why one uses either barter, commodity or fiat monies, and the functions money serves. We trace the history of the development of money and credit across societies to the present day. We explore the centrality of money to various cultures and its representation in the arts. We discuss governmental manipulation of aggregate monetary stocks to spur or dampen trade; or historically to finance conflict by debasing the value represented by this peculiar good. We explore a central truth, that while modern money is intrinsically meaningless, its role in facilitating economic growth in the supply of real goods and services is surprisingly robust, provided policy does not deliver problems when too much money and credit is in circulation.\n\n      less description for CORES-AD   62 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 63",
            "course_name": "",
            "description": "CORES-AD   63\n\n   Internationalism\n\nInternationalism is as a way of looking at the world that seeks both to describe and prescribe the degree and nature of interconnectedness among states and peoples.  Since the 18th century, a variety of thinkers have used the language of internationalism to promote different visions about the development of trade, governance, and culture across borders. This course will analyze how these diverse intellectual traditions have contributed to internationalist thinking.  Five major questions will structure our discussion: 1. What is the relationship of internationalism to national and imperial imag...\n\n      more description for CORES-AD   63 »\n\n      \n\n\n\nInternationalism is as a way of looking at the world that seeks both to describe and prescribe the degree and nature of interconnectedness among states and peoples.  Since the 18th century, a variety of thinkers have used the language of internationalism to promote different visions about the development of trade, governance, and culture across borders. This course will analyze how these diverse intellectual traditions have contributed to internationalist thinking.  Five major questions will structure our discussion: 1. What is the relationship of internationalism to national and imperial imaginations? 2. Should internationalism be utopian, revolutionary, or reformist? 3. How should equality and justice inform the construction of a multilateral world? 4. What is the place of gender, race, and religion in the development of communities beyond nation-states? 5. Can internationalist projects accommodate differences in cultures, affects, and aesthetics?  Among other authors, our readings will include texts by Immanuel Kant, José Martí, W.E.B. DuBois, Okakura Kakuzo, Woodrow Wilson, Rabindranath Tagore, George Orwell, Kwame Nkrumah, Maya Angelou, Edward Said, Nancy Fraser, and Chimanda Adachi Ngozie.\n\n      less description for CORES-AD   63 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 64",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19520",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 020",
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Brule, Rachel"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   64\n\n   Justice in Theory and Practice\n\nThis course invites students to engage with historical and contemporary treatises about a universal concern: justice. To what extent are our social, political, and economic institutions just? How would we know? In this course, we explore the ideal of a just society as understood across cultures, communities, and time – from the earliest recorded histories of the Arabian Peninsula, the Iranian Plateau, the Indian subcontinent, and the European continent to present day works. Through careful reading of primary texts, we consider what place the values of group integrity, liberty and equality occu...\n\n      more description for CORES-AD   64 »\n\n      \n\n\n\nThis course invites students to engage with historical and contemporary treatises about a universal concern: justice. To what extent are our social, political, and economic institutions just? How would we know? In this course, we explore the ideal of a just society as understood across cultures, communities, and time – from the earliest recorded histories of the Arabian Peninsula, the Iranian Plateau, the Indian subcontinent, and the European continent to present day works. Through careful reading of primary texts, we consider what place the values of group integrity, liberty and equality occupy in conceptions of what constitutes a just society. We then apply these insights to inquiries into our own local communities and practices.\n\n      less description for CORES-AD   64 «",
            "offering": true
        },
        {
            "course_id": "CORES-AD 65",
            "course_name": "J",
            "description": "CORES-AD   65J\n\n   Democracy and its Critics\n\nThis course examines the institutional structures and intellectual justifications of democratic societies.  Although democracy and equality have been deeply linked in the history of political thought, critics of democratic practice argue that formal equality among citizens has rarely prevented substantive economic and political inequalities from arising--inequalities that belie the very democratic character of self-described democratic states.  One of the perennial questions of democratic theory, therefore, has been whether such substantial inequalities play a necessary structural role in demo...\n\n      more description for CORES-AD   65J »\n\n      \n\n\n\nThis course examines the institutional structures and intellectual justifications of democratic societies.  Although democracy and equality have been deeply linked in the history of political thought, critics of democratic practice argue that formal equality among citizens has rarely prevented substantive economic and political inequalities from arising--inequalities that belie the very democratic character of self-described democratic states.  One of the perennial questions of democratic theory, therefore, has been whether such substantial inequalities play a necessary structural role in democracy or whether democratic societies should strive to eliminate them.  We will begin getting our bearings on this debate by examining one of history’s most radical and influential democracies, ancient Athens.  After reading Thucydides’ complex historical account of democratic Athens at war, we will turn to ancient defenses of and attacks on democracy by Aristophanes, Isocrates, Plato, and Aristotle.  We then will compare these ancient arguments to subsequent ones by Madison, Mill, Marx, Rawls, Przeworski, and Sen in an attempt to appreciate the complex interplay between discourses of equality and inequality in democratic societies, both ancient and modern.  We will also discuss recent arguments for and against “global democracy”.  The course concludes by recreating the intellectual dynamics of direct democracy in Athens.  Students will assume roles in key decision making institutions and debate questions about democratic procedures, the extension of voting rights, religion and free speech, democratic foreign policy, etc.\nThis course counts as an International J Term.\n\n      less description for CORES-AD   65J «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 66",
            "course_name": "",
            "description": "CORES-AD   66\n\n   What Do Leaders Do?\n\nAre social outcomes primarily shaped by prominent individuals or deterministic structural forces? Some claim leadership is a mere label used to justify social change stemming from structural forces of nature and culture. Others assert history can be found in the biographies of a few prominent men and women. In this course we examine this old and unsettled debate. Considering political, social, artistic and business perspectives, we dissect the concept of leadership. Students will learn to elaborate on the interplay between culture and leadership and to which extent societies create their own l...\n\n      more description for CORES-AD   66 »\n\n      \n\n\n\nAre social outcomes primarily shaped by prominent individuals or deterministic structural forces? Some claim leadership is a mere label used to justify social change stemming from structural forces of nature and culture. Others assert history can be found in the biographies of a few prominent men and women. In this course we examine this old and unsettled debate. Considering political, social, artistic and business perspectives, we dissect the concept of leadership. Students will learn to elaborate on the interplay between culture and leadership and to which extent societies create their own leaders. The course draws on the classic work of Machiavelli, Hobbes, Tolstoy, Marx and Carlyle, as well as modern thinkers such as Weber, Schumpeter, Russell and Lakoff, among others. We will also explore the life of prominent individuals, such as Gandhi, Mandela, Mother Teresa, Jobs, Soros, Churchill, Thatcher, and many others.\n\n      less description for CORES-AD   66 «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 67",
            "course_name": "J",
            "description": "CORES-AD   67J\n\n   Sovereignty\n\nFrom Ancient Mesopotamia to modern times, the idea of sovereignty—beginning with kingly power and leading to modern popular democracy and law-based forms of rule—has dominated political theory as well as theater, literature, and philosophy. The central questions of this course concern political power : hegemony, dominion, rulership, but also democracy, law, and economics. How do we think about power and its history? What does it mean for kings, the people, or particular parties to be called \"sovereign\"? How is this sovereignty to be depicted? Through a series of literary, philosophical, and po...\n\n      more description for CORES-AD   67J »\n\n      \n\n\n\nFrom Ancient Mesopotamia to modern times, the idea of sovereignty—beginning with kingly power and leading to modern popular democracy and law-based forms of rule—has dominated political theory as well as theater, literature, and philosophy. The central questions of this course concern political power : hegemony, dominion, rulership, but also democracy, law, and economics. How do we think about power and its history? What does it mean for kings, the people, or particular parties to be called \"sovereign\"? How is this sovereignty to be depicted? Through a series of literary, philosophical, and political readings in the Western, Islamic, and Chinese traditions, we will examine these questions, against the extraordinary backdrop of Berlin and its history as capital of the German Empire and of the Third Reich, then as divided city, and finally now as perhaps the most important political center in Europe.\n\n      less description for CORES-AD   67J «",
            "offering": false
        },
        {
            "course_id": "CORES-AD 68",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20446",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 006",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "O'Brien, John"
                }
            ],
            "course_name": "",
            "description": "CORES-AD   68\n\n   Religion and Society\n\nIn this seminar, students explore the diverse and dynamic manifestations of religion in social life—as a personal and collective experience, an individual and group identity, and a code for moral behavior—and examine how these social uses of religion impact various spheres of society. After considering classic social theories of religion, we will look at substantive cases from the United\nStates, Egypt, Iran, China, and Venezuela to investigate how and why religious meanings and identities come to matter (or not) in arenas of gender equality, political mobilization, nationstate structures, ever...\n\n      more description for CORES-AD   68 »\n\n      \n\n\n\nIn this seminar, students explore the diverse and dynamic manifestations of religion in social life—as a personal and collective experience, an individual and group identity, and a code for moral behavior—and examine how these social uses of religion impact various spheres of society. After considering classic social theories of religion, we will look at substantive cases from the United\nStates, Egypt, Iran, China, and Venezuela to investigate how and why religious meanings and identities come to matter (or not) in arenas of gender equality, political mobilization, nationstate structures, everyday intergroup interactions,\nand the law and punishment. Overall, this course aims to provide students with the theoretical frameworks and substantive background necessary to analyze the workings of religion and religious identity in modern societies.\n\n      less description for CORES-AD   68 «",
            "offering": true
        }
    ]
}