{
    "major_id": "CCST-SHU",
    "file": "./2015-2016/Core_Science_(CCST-SHU).html",
    "courses": [
        {
            "course_id": "CCST-SHU 121",
            "course_name": "",
            "description": "CCST-SHU  121\n\n   The Atom and Energy\n\nE=mc2: One simple equation encapsulates the power to grant life and death in equal measure. Life associated with fusion in the sun, radiation therapy, and nuclear energy; death via nuclear bombs and nuclear disasters. This course uses nuclear physics as a prism for exploring science as a human endeavor, focusing on the physics of the atomic nucleus and its technological applications. Arguments for and against nuclear power plants are analyzed, while the power and threat of nuclear weapons are assessed. The international treaties designed to limit the spread of nuclear weapons are scrutinized, ...\n\n      more description for CCST-SHU  121 »\n\n      \n\n\n\nE=mc2: One simple equation encapsulates the power to grant life and death in equal measure. Life associated with fusion in the sun, radiation therapy, and nuclear energy; death via nuclear bombs and nuclear disasters. This course uses nuclear physics as a prism for exploring science as a human endeavor, focusing on the physics of the atomic nucleus and its technological applications. Arguments for and against nuclear power plants are analyzed, while the power and threat of nuclear weapons are assessed. The international treaties designed to limit the spread of nuclear weapons are scrutinized, emphasizing the challenges that lawmakers and citizens face in determining and guiding the uses of nuclear power as we grapple with the moral responsibility that all of us—scientists, politicians, and citizens—must bear for ourselves, our nations, and ultimately, for humanity. Prerequisite: None.\n\n      less description for CCST-SHU  121 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 122",
            "course_name": "Life in the Universe",
            "description": "CCST-SHU  122 Life in the Universe \nWhy is Earth the only object in the solar system with obvious signs of life? How did the building blocks of life form on Earth? What is the likelihood that there are other forms of life out there? This course addresses these questions and more, by covering the chemical evolution of the Universe, the formation of our solar system, the search for and study of extra-solar planets, and the possible cosmological implications of life’s existence. Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 123",
            "course_name": "",
            "description": "CCST-SHU  123\n\n   State and Fate of the Earth\n\nWhat is the current state of Earth in terms of human well-being and human impact on Earth’s natural systems? Issues such as energy, CO2, climate, agriculture, water, and material fluxes are intricately tied together as a global system that has expanded by about 3% per year. This growth rate will lead to a world in 2050 in which the average world citizen will have a life approximately equal to that of the average European or Japanese today. Will this be possible and what will be the implications for the issues above? In this inquiry-based seminar, substantial portions of the course will require...\n\n      more description for CCST-SHU  123 »\n\n      \n\n\n\nWhat is the current state of Earth in terms of human well-being and human impact on Earth’s natural systems? Issues such as energy, CO2, climate, agriculture, water, and material fluxes are intricately tied together as a global system that has expanded by about 3% per year. This growth rate will lead to a world in 2050 in which the average world citizen will have a life approximately equal to that of the average European or Japanese today. Will this be possible and what will be the implications for the issues above? In this inquiry-based seminar, substantial portions of the course will require students to conduct research by locating, using, and sharing technical papers and data bases, synthesizing facts and viewpoints, making presentations, and writing short technical papers that will be peer-reviewed by the other “researchers” in the class. The course includes field trips relevant to the topics above. Prerequisite: None.\n\n      less description for CCST-SHU  123 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 124",
            "course_name": "",
            "description": "CCST-SHU  124\n\n   Social Issues in the New Biosciences\n\nWhile the 20th century has often been characterized as the Century of Physics, many have already named the 21st century as the Century of Genetics. Important markers highlight the speed and drama of the molecular genetic revolution. These include the technique of somatic nuclear cell transfer\u2028(with the realization of mammalian cloning and the specter of human cloning) and germ-line gene therapy (with its specter of altering the genetic makeup of future generations). Alongside these markers is the promise of stem cell cures for many human ailments and diseases, and DNA identification technology...\n\n      more description for CCST-SHU  124 »\n\n      \n\n\n\nWhile the 20th century has often been characterized as the Century of Physics, many have already named the 21st century as the Century of Genetics. Important markers highlight the speed and drama of the molecular genetic revolution. These include the technique of somatic nuclear cell transfer\u2028(with the realization of mammalian cloning and the specter of human cloning) and germ-line gene therapy (with its specter of altering the genetic makeup of future generations). Alongside these markers is the promise of stem cell cures for many human ailments and diseases, and DNA identification technology to exonerate the innocent and convict the guilty. But this is only the beginning, since the newest developments promise to go far beyond “cure” to delve into human “enhancements” of mental acuity and physical prowess. This course examines these and other developments, lodging the heated debates that each generates in both social and cultural histories and current incarnations. Prerequisite: None.\n\n      less description for CCST-SHU  124 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 125",
            "course_name": "",
            "description": "CCST-SHU  125\n\n   Interconnected: The History and Theory of Networks\n\nSince the formation of trade routes connecting early civilizations, networks have been central to human exchange. Silk, jade, gold, and other goods, as well as the cultural elements of language, art, scientific discovery, philosophy and religion traveled the 6,500 km between southeast Asia and southern Europe on an elaborate system of trails, roads and waterways. This course will explore the development of several human made networks beginning with these early trade routes. Further consideration will be given to the construction of transcontinental railways, the development of electrical teleg...\n\n      more description for CCST-SHU  125 »\n\n      \n\n\n\nSince the formation of trade routes connecting early civilizations, networks have been central to human exchange. Silk, jade, gold, and other goods, as well as the cultural elements of language, art, scientific discovery, philosophy and religion traveled the 6,500 km between southeast Asia and southern Europe on an elaborate system of trails, roads and waterways. This course will explore the development of several human made networks beginning with these early trade routes. Further consideration will be given to the construction of transcontinental railways, the development of electrical telegraph and telephone systems, in addition to the evolution of modern digital communication platforms such as the world wide web. The cultural conditions that encouraged the emergence of these networks, as well as the social outcomes resulting from their adoption, will both be explored through readings and critical dialog. Students will become familiar with: economic principles; network theories and topologies; the development and standardization of protocols; methods for encoding information; concerns about infrastructure, logistics, and security; as well as legislation governing information ownership, privacy, and censorship. Students will also be asked to consider the future of networks as it relates to themes such as crowd-sourcing, software-defined networks, and the Internet of Things. Prerequisite: None.\n\n      less description for CCST-SHU  125 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 126",
            "course_name": "",
            "description": "CCST-SHU  126\n\n   From Ancient Cosmology to Science\n\nThis course will consider the origins of science in ancient cosmologies. What principles are preserved? Considering the classical Chinese, Indian and Western traditions, the question of how and to what extent culture determines the paradigms of science will be investigated. We begin with formative texts from the Chinese, Indian and Western traditions, including the Rig Veda, the Upanishads (India), the I Jing, Dao De Jing, and the neo-Confucian synthesis (China) and the pre-Socratic Ionian physicists (Western), then turn to the development of modern science. Representative works of Bacon, Desc...\n\n      more description for CCST-SHU  126 »\n\n      \n\n\n\nThis course will consider the origins of science in ancient cosmologies. What principles are preserved? Considering the classical Chinese, Indian and Western traditions, the question of how and to what extent culture determines the paradigms of science will be investigated. We begin with formative texts from the Chinese, Indian and Western traditions, including the Rig Veda, the Upanishads (India), the I Jing, Dao De Jing, and the neo-Confucian synthesis (China) and the pre-Socratic Ionian physicists (Western), then turn to the development of modern science. Representative works of Bacon, Descartes, Galileo and Newton will be read in parallel with seminal texts describing the rise of modern science in China and India. The course will conclude with a survey of contemporary cosmological theories to see how some ancient ideas are retained in modern science.\n\n      less description for CCST-SHU  126 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 127",
            "course_name": "",
            "description": "CCST-SHU  127\n\n   Serendipity in Science\n\nIn 1754 the antiquarian Horace Walpole coined the word serendipity based on the Persian fairy tale “The Three Princes of Serendip,” whose heroes “were always making discoveries, by accidents and sagacity, of things they were not in quest of.” In the ensuing centuries,the word has had a colored history. Many of the major scientific and technological developments that shape our modern economy and culture had serendipitous components, including X-rays, penicillin, nylon, vulcanization of rubber, Post-Its, Velcro, saccharin, Nutrasweet, Teflon, insulin, the Pap test, super glue and a host of other...\n\n      more description for CCST-SHU  127 »\n\n      \n\n\n\nIn 1754 the antiquarian Horace Walpole coined the word serendipity based on the Persian fairy tale “The Three Princes of Serendip,” whose heroes “were always making discoveries, by accidents and sagacity, of things they were not in quest of.” In the ensuing centuries,the word has had a colored history. Many of the major scientific and technological developments that shape our modern economy and culture had serendipitous components, including X-rays, penicillin, nylon, vulcanization of rubber, Post-Its, Velcro, saccharin, Nutrasweet, Teflon, insulin, the Pap test, super glue and a host of others. In this course we examine the history of serendipity, the synergism between the scientific background and experience of the individual scientist and researcher, and some of the many serendipitous breakthroughs that have changed and extended our lives and continually improved our standard of living.\n\n      less description for CCST-SHU  127 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 128",
            "course_name": "",
            "description": "CCST-SHU  128\n\n   The Rise of Modern Science\n\nThis is a survey of the history of scientific disciplines and scientific methods from the “Scientific Revolution” of the seventeenth century to the present. We will discuss the ways of knowing such as reason, observation, experiment, and modeling. Our topics include science and religion, science and war, and the development of key scientific disciplines, institutions, and forms of communication. While focusing on physical and life sciences we will also ask about connections between a science of things and a science of human beings and human society. Students read original works by Newton, Lavo...\n\n      more description for CCST-SHU  128 »\n\n      \n\n\n\nThis is a survey of the history of scientific disciplines and scientific methods from the “Scientific Revolution” of the seventeenth century to the present. We will discuss the ways of knowing such as reason, observation, experiment, and modeling. Our topics include science and religion, science and war, and the development of key scientific disciplines, institutions, and forms of communication. While focusing on physical and life sciences we will also ask about connections between a science of things and a science of human beings and human society. Students read original works by Newton, Lavoisier, Darwin, Freud, and Einstein, among others.\n\n      less description for CCST-SHU  128 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 129",
            "course_name": "",
            "description": "CCST-SHU  129\n\n   Information Societies\n\nProclamations of the “personal computer revolution” and the advent of the “Information Age” are now history, if only three decades old. Recently developed digital media have also been associated with radical changes and even the “death” of traditional forms of communication. This class will evaluate the relationship between information technology and society, “the media and the message,” from a broad historical perspective. Students will learn about the major material transformations in information support, from scroll to web, with a focus on Western civilization. A comparative attention to th...\n\n      more description for CCST-SHU  129 »\n\n      \n\n\n\nProclamations of the “personal computer revolution” and the advent of the “Information Age” are now history, if only three decades old. Recently developed digital media have also been associated with radical changes and even the “death” of traditional forms of communication. This class will evaluate the relationship between information technology and society, “the media and the message,” from a broad historical perspective. Students will learn about the major material transformations in information support, from scroll to web, with a focus on Western civilization. A comparative attention to the Middle East and East Asia for the Early Modern period and the Soviet political project for twentieth century developments will allow for a more nuanced interpretation of the notion of “modernity” associated with the “from printing press to Internet” narrative arc.\nWe will build toward an understanding of the interdependencies between technological and social systems in several steps. First, we will establish a longue duree perspective by surveying the scroll-to-codex transformation, and sketch contours of a Eurasian geographical plane by following paper's transition from China to the Middle East and Europe. Next, we will read foundational texts on the history of the printing press with a special focus on transformations in science and religion. We will then overview the famous nineteenth-century developments in information and communication technologies. We will ask about their roles in shaping individuals' gender and professional identities as well as in the governance of transatlantic empires. The emergence of big corporations in parallel with the modern bureaucratic apparatus and new recording and data processing technologies is our fourth step. Toward the end of the class, we look at how the WWII calculating machine, the computer, acquired the functions of a “media machine” and took center stage in the debates about alternative political systems. We conclude with an exploration of contemporary visions for blurring space and time, ubiquitous computing, and promises of ultimate technological transcendence: trans-humanism. To preserve a uniting element in this wide ranging material, each of these steps will systematically explore particularly important locations where technological and social changes are negotiated, such as the library, the printing workshop, the publishing house, the office, and, finally, the classroom and the body itself.\n\n      less description for CCST-SHU  129 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 130",
            "course_name": "",
            "description": "CCST-SHU  130\n\n   Animals, Nature, Environment\n\nThis course will explore urgent issues concerning the relation of human civilization to the natural environment in which it is embedded. There are three main components: The first investigates the human relationship with animals, starting from what are the differences between us and animals, and what these differences mean today. Second, we explore broader issues of \"nature\": how we humans have conceived of ourselves as distinct from, or even superior to Nature; or, alternatively, enslaved to our inner nature. Third, we study global environmental issues, including how environmentalism emerged ...\n\n      more description for CCST-SHU  130 »\n\n      \n\n\n\nThis course will explore urgent issues concerning the relation of human civilization to the natural environment in which it is embedded. There are three main components: The first investigates the human relationship with animals, starting from what are the differences between us and animals, and what these differences mean today. Second, we explore broader issues of \"nature\": how we humans have conceived of ourselves as distinct from, or even superior to Nature; or, alternatively, enslaved to our inner nature. Third, we study global environmental issues, including how environmentalism emerged in the industrial era, what is its place in today's world, and what the prospects are for finding solutions to the most urgent global problems.\n\n      less description for CCST-SHU  130 «",
            "offering": false
        },
        {
            "course_id": "CCST-SHU 131",
            "course_name": "",
            "description": "CCST-SHU  131\n\n   Introduction to the Use of Scientific Data in Historical Research\n\nScientific data potentially useful for the study of the past are today available in unprecedented quantity to historians and archaeologists. The scientific contributions most useful to the study of human activity and historical events involve genetics, palynology (the study of sediments), isotopic analysis (the study of chemical compounds in plants, soil, and human remains), and the reconstruction of ancient climates, based on the study of tree rings (dendrology), ice cores, and stalagmites.  The availability of high resolution data makes it possible to gain a better understanding of the envir...\n\n      more description for CCST-SHU  131 »\n\n      \n\n\n\nScientific data potentially useful for the study of the past are today available in unprecedented quantity to historians and archaeologists. The scientific contributions most useful to the study of human activity and historical events involve genetics, palynology (the study of sediments), isotopic analysis (the study of chemical compounds in plants, soil, and human remains), and the reconstruction of ancient climates, based on the study of tree rings (dendrology), ice cores, and stalagmites.  The availability of high resolution data makes it possible to gain a better understanding of the environmental and climatic conditions in which human events took place. Moreover, genetic data may be useful to trace migrations and demographic movements. Finally, the reconstruction of ancient diets can provide valuable information on the economic activities of ancient societies. The course will provide a broad-gauged introduction to the historical application of a variety of scientific data, with a special focus on Chinese and Central Asian history.\nCourse requirements\n Students are asked to prepare a short position paper and a class presentation during term time.  Presentation may be prepared in groups or individually. The Mid-Term and Final exams will consist of four multiple choice essays related to the material presented in the course. The final grade will consist of: Class presentation (20%); Mid-Term Exam (30%) and Final Exam (50%).\n\n      less description for CCST-SHU  131 «",
            "offering": false
        }
    ]
}