{
    "major_id": "CWRG1-UC",
    "file": "./2015-2016/Creative_Writing_(CWRG1-UC).html",
    "courses": [
        {
            "course_id": "CWRG1-UC 5240",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9924",
                    "section": "001",
                    "period": "09/02/2015 - 12/21/2015",
                    "location": "194M 308",
                    "time": "Mon,Wed 6.20 PM - 7.35 PM",
                    "open": true,
                    "professor": "Coppola, Michael"
                }
            ],
            "course_name": "Foundations of The Creative Process",
            "description": "CWRG1-UC 5240 Foundations of The Creative Process \nIn this course, which is required for students planning a creative writing concentration and open to all who are interested, students explore the nature and significance of creative processes. Guest writers present their work and discuss the ways in which that work comes into being. Guests include writers in all genres and artists who use writing in socially significant ways. Students participate in a variety of exercises designed to develop voice, illuminate process, and create familiarity with a variety of formal possibilities. The final product of the course is a portfolio.",
            "offering": true
        },
        {
            "course_id": "CWRG1-UC 5241",
            "course_name": "Prose Studio",
            "description": "CWRG1-UC 5241 Prose Studio \nStudents are introduced to the basic elements of prose fiction and nonfiction. This includes the development of narrative, the effect of point of view, the creation of convincing dialogue or effective use of quotation, and the control of tone and theme. The course is conducted as a studio, placing emphasis on writing in and out of class. Students comment on one another's work. In addition students read contemporary and classic prose, particularly short stories and essays.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5242",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "10077",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "194M 202",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Sims, Laura"
                }
            ],
            "course_name": "Poetry Studio",
            "description": "CWRG1-UC 5242 Poetry Studio \nIn this course students experiment with fundamental components of poetry and become acquainted with both \"received\" and \"organic\" forms. Students also read extensively to develop familiarity with the major strains of the American poetic idiom. This course requires students to read extensively, write in and out of class, and comment constructively on one another's work.",
            "offering": true
        },
        {
            "course_id": "CWRG1-UC 5243",
            "course_name": "Performance Studio",
            "description": "CWRG1-UC 5243 Performance Studio \nThis course introduces writing for theater and more experimental performance modes. The class is structured as a studio in which students write in and out of class and provide constructive criticism of classmates’ work. By the end of the semester, students write either a complete play or performance text. The course concludes with a public reading or performance. Students also read and analyze selected plays and scripts by noted authors.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5244",
            "course_name": "Focus on Technique:",
            "description": "CWRG1-UC 5244 Focus on Technique: \nFocus on Technique is a course that permits students to delve into a single area of literary craft in a concentrated period of time. Each time the course is offered, the focus will be different. Examples of techniques are: Point of View, Prosody. Dialogue, or Line Breaks.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5246",
            "course_name": "Creative Nonfiction Writ",
            "description": "CWRG1-UC 5246 Creative Nonfiction Writ",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5247",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "9781",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "WAVE 369",
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Danon, Ruth"
                }
            ],
            "course_name": "Seminar in Reading & Writing",
            "description": "CWRG1-UC 5247 Seminar in Reading & Writing \nThis seminar is required for Creative Writing students, and it is open to students in the Literature concentration. In this course students explore the problem of literary inspiration and influence. They begin to understand their own work in terms of the forces (literary and other) that have shaped it.",
            "offering": true
        },
        {
            "course_id": "CWRG1-UC 5270",
            "course_name": "Improvisation:  Method and Theory",
            "description": "CWRG1-UC 5270 Improvisation:  Method and Theory \nDevelop the use of improvisational methods to generate and revise texts. Students explore the history and theory of various compositional methods and learn how to create their own compositional strategies. Students read and write extensively in and out of class.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5271",
            "course_name": "Fiction Workshop",
            "description": "CWRG1-UC 5271 Fiction Workshop \nThis workshop focuses on developing the craft of fiction writing with the aim of cultivating individuality of voice, style, and theme. Students are expected to read and write intensively and extensively.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5272",
            "course_name": "Poetry Workshop",
            "description": "CWRG1-UC 5272 Poetry Workshop \nThis workshop focuses on developing the craft of poetry writing with the aim of cultivating individuality of voice, style, and theme. Students are expected to read and write extensively.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5273",
            "course_name": "Writing for The Theater",
            "description": "CWRG1-UC 5273 Writing for The Theater \nThis workshop is for students who wish to revise a previously completed play or performance text or develop a new one. It supplements technique discussion through analysis of published plays and live performances.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5275",
            "course_name": "Writing for The Screen",
            "description": "CWRG1-UC 5275 Writing for The Screen \nStudents are guided from the development of a concept to the completion of either a narrative or a non-narrative screenplay. Discussion of technique is supplemented by analysis of original screenplays and by screening of films illustrating such features of cinematic writing as structure, conflict, and resolution. The course covers both writing for film and writing for television. Some attention is given to book and play adaptations.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5276",
            "course_name": "Editorial Conference",
            "description": "CWRG1-UC 5276 Editorial Conference \nThis course provides an opportunity for students to work individually with a faculty member to polish a piece of writing for publication. Students may take one two-credit editorial conference per semester. A maximum of three editorial conferences is allowed.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5277",
            "course_name": "Creative Nonfiction Workshop",
            "description": "CWRG1-UC 5277 Creative Nonfiction Workshop \nThis workshop introduces students in both the humanities and social sciences to new forms of essay writing. Students explore travel writing, cultural and political argumentation, the memoir, satire, autobiography, historical sketches, or other forms that grow from student interest. Students write extensively, and read and analyze the works of representative essayists.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5280",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "17052",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "SILV 207",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Van Doren, Elizabeth"
                }
            ],
            "course_name": "Writing for Children & Adolescents",
            "description": "CWRG1-UC 5280 Writing for Children & Adolescents \nThis course focuses on understanding children’s books as distinct from books for adults, on the art and craft of writing for children, and how writing for children fits into the publishing business. In this workshop class, students gain an understanding of children’s literature as a literary genre as they develop and revise their own work. By the end of the semester, each student will have completed at least one picture-book manuscript or several chapters of a novel for middle-grade or young-adult readers.",
            "offering": true
        },
        {
            "course_id": "CWRG1-UC 5290",
            "course_name": "Sp Tpcs in Creatve Wrtg",
            "description": "CWRG1-UC 5290 Sp Tpcs in Creatve Wrtg \nThis course provides the opportunity for intensive study of specific topics in creative writing. It focuses on a different issue each time the course is offered. The course schedule for each semester indicates the particular topic of study.",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 5292",
            "course_name": "",
            "description": "CWRG1-UC 5292\n\n   Intensive Workshop in Creative Writing\n\nThis intensive program is designed for beginning and experienced poets, fiction, and creative nonfiction writers who wish to develop and refine their craft. This course is offered to McGhee degree students and SCPS Writing Center postgraduate students. During a two-week period, students spend time in daily improvisational workshops taught by McGhee faculty. These workshops help students find new ways of generating and revising text. Distinguished visiting writers (one in poetry, one in prose, one in creative nonfiction) lead craft workshops and provide private conferences. Additional readings,...\n\n      more description for CWRG1-UC 5292 »\n\n      \n\n\n\nThis intensive program is designed for beginning and experienced poets, fiction, and creative nonfiction writers who wish to develop and refine their craft. This course is offered to McGhee degree students and SCPS Writing Center postgraduate students. During a two-week period, students spend time in daily improvisational workshops taught by McGhee faculty. These workshops help students find new ways of generating and revising text. Distinguished visiting writers (one in poetry, one in prose, one in creative nonfiction) lead craft workshops and provide private conferences. Additional readings, lectures, and social events are also sponsored. McGhee students must complete a portfolio in order to receive a grade. (Admission by application only)\n\n      less description for CWRG1-UC 5292 «",
            "offering": false
        },
        {
            "course_id": "CWRG1-UC 6091",
            "course_name": "Small Journal Production",
            "description": "CWRG1-UC 6091 Small Journal Production",
            "offering": false
        }
    ]
}