{
    "major_id": "ASPP-GT",
    "file": "./2015-2016/Ctr_for_Art,_Society_&_Pub_Pol_(ASPP-GT).html",
    "courses": [
        {
            "course_id": "ASPP-GT 1038",
            "course_name": "Grad Sem No Holds Barred Intensifd Theory & Criq",
            "description": "ASPP-GT 1038 Grad Sem No Holds Barred Intensifd Theory & Criq",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2000",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "5932",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 384",
                    "time": "Mon 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "Hebert, Patrick"
                }
            ],
            "course_name": "",
            "description": "ASPP-GT 2000\n\n   Art & Public Policy All School Seminar:Critical Topographies\n\nAll School Seminar: Critical Topographies \nThis course explores how visual artists have worked with the city as the location and catalyst for their work. To inform our creative production and play, we will draw from theories of place, space and the urban as developed by critical geographers and city planners. We will also conduct close readings of contemporary art historians’ examinations into key artistic interventions in cityscapes over the last thirty years. How have artists understood the city itself as material, content, creative convergence? While we will look at artistic projects from v...\n\n      more description for ASPP-GT 2000 »\n\n      \n\n\n\nAll School Seminar: Critical Topographies \nThis course explores how visual artists have worked with the city as the location and catalyst for their work. To inform our creative production and play, we will draw from theories of place, space and the urban as developed by critical geographers and city planners. We will also conduct close readings of contemporary art historians’ examinations into key artistic interventions in cityscapes over the last thirty years. How have artists understood the city itself as material, content, creative convergence? While we will look at artistic projects from various global urban contexts, New York City will serve as a primary ongoing site for reference, investigation and engagement. New York will be explored through the work of essayists and fiction writers who have taken the city as subject. We will also direct and make regular excursions into the surrounding urbanscape to shape our creative practices. Students will engage in weekly readings and discussions, complete writing assignments to hone conceptual skills, and create and evaluate their own original artworks both individually and in groups.\n\n      less description for ASPP-GT 2000 «",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2001",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5816",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 403",
                    "time": "Thu 11.00 AM - 1.45 PM",
                    "open": true,
                    "professor": "Tchen, John"
                }
            ],
            "course_name": "",
            "description": "ASPP-GT 2001\n\n   Issues in Arts Politics\n\nThis seminar aims to give students both a conceptual and practical grounding in the range of issues and approaches by which arts politics can be understood. We will think about the complexities that lie between the politics that make art and the politics that art makes?which is to say the array of forces that give rise to specific artistic practices and the agency and efficacy of artistic work. The course will be framed by the following considerations: What are the institutional, discursive, and ideological contexts that shape the objects, images, sounds or texts we call ?art?? What are the li...\n\n      more description for ASPP-GT 2001 »\n\n      \n\n\n\nThis seminar aims to give students both a conceptual and practical grounding in the range of issues and approaches by which arts politics can be understood. We will think about the complexities that lie between the politics that make art and the politics that art makes?which is to say the array of forces that give rise to specific artistic practices and the agency and efficacy of artistic work. The course will be framed by the following considerations: What are the institutional, discursive, and ideological contexts that shape the objects, images, sounds or texts we call ?art?? What are the links between cultural spaces-- the museum, the movie-theater, the gallery, the music/dance hall, the bookstore, the fashion runway, the public street, television, cyber space-- and the larger realm of politics? And how do these relationships impact, implicitly or explicitly, the ways we create, curate, or study the arts? How do consumers play an active role in the reception of artistic products and practices?  What is the relation between formally promulgated cultural policy and the tacit knowledge that artists call upon to get their work into the world? What dimensions of the broader cultural terrain are made legible through artistic practice? What are the means through which art intervenes in the political arena? ?Art? will be studied as a site of contested representations and visions, embedded in power formations-- themselves shaped by specific historical moments and geographical locations. Given contemporary global technologies, cultural practices will also be studied within the transnational ?travel? of ideas and people. Such germane issues as the legal and constitutional dimensions of censorship, the social formation of taste, the consumption of stars, the bio-politics of the body, transnational copyrights law-- will all pass through an intersectional analyses of gender, race, class, sexuality, ethnicity, religion, and nation, incorporating the insights of such areas of inquiry as multiculturalism, feminism, postcolonialism, and queer studies. Each session is organized around the exploration of a key term, with readings that develop conceptual and practical issues. Art examples will be shown in class.\n\n      less description for ASPP-GT 2001 «",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2002",
            "course_name": "Grad Sem Cultural Activism",
            "description": "ASPP-GT 2002 Grad Sem Cultural Activism",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2003",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5817",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 361",
                    "time": "Mon 9.30 AM - 12.30 PM",
                    "open": true,
                    "professor": "Engel, Kathy"
                }
            ],
            "course_name": "Graduate Colloquium",
            "description": "ASPP-GT 2003 Graduate Colloquium",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2004",
            "course_name": "Graduate Internship Fieldwork",
            "description": "ASPP-GT 2004 Graduate Internship Fieldwork",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2005",
            "course_name": "Independent Study",
            "description": "ASPP-GT 2005 Independent Study",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2006",
            "course_name": "",
            "description": "ASPP-GT 2006\n\n   Special Topics:\n\nSpecial Topics\nDirected Projects: a blind date with the Other [Working Together With Glocally]\n \nThis course will provide a creative and supportive environment for students to conceptualize, elaborate and implement collaborative art projects in the open content, form and context framework of Art and Politics towards a global arts perspective. The course will examine the praxis of collaboration and its content as process and outcome in an international frame of reference. How do we grow and sustain collaborative teamwork in the art context between countries? Students will be asked to create and...\n\n      more description for ASPP-GT 2006 »\n\n      \n\n\n\nSpecial Topics\nDirected Projects: a blind date with the Other [Working Together With Glocally]\n \nThis course will provide a creative and supportive environment for students to conceptualize, elaborate and implement collaborative art projects in the open content, form and context framework of Art and Politics towards a global arts perspective. The course will examine the praxis of collaboration and its content as process and outcome in an international frame of reference. How do we grow and sustain collaborative teamwork in the art context between countries? Students will be asked to create and acknowledge their collaborative agency producing performances, creative platforms, installations, archives, maps, etc  involving their peers, communities, international networks, other artivists or scientists. There is going to be an allocated pool of artists and artivists as correspondents in various countries in Europe to correlate with.  Why is working together with  - a different language, country, cultural framework-  the way in order to share and develop a vision? How is a shared interest presented in a multi-authored project? What can synergy offer to a dynamic dialogue within a framework of trust and sharing? When does collaboration create a synthesis of different perspectives? This course will challenge the notions of hierarchy through systematic roles of participatory interdependence and integrative exchange. The partnerships will evolve through fully documented stages which include: setting the project, its direction and the means of implementation. Communication is a key notion in valuing diversity and thus the focus will be equally - apart from the project itself –on the interpersonal relationships built around it as well. The developmental process of collaboration will dissect the steps of framing the project, planning, setting goals, and coordinate openly in joint practices and collective consensus. The questions do what, for what, so what will be present so the peer’s and instructor’s feedback will illuminate actions and resources.\n\n      less description for ASPP-GT 2006 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2007",
            "course_name": "",
            "description": "ASPP-GT 2007\n\n   Art, Artists, and Social Change\n\n4 points – will count toward general education requirements (Humanities)\nSocial, political, and economic upheavals produce shattering transformations in human life, yet some of the most significant artistic works in literature, visual arts, theatre, film, and music have been created under these extreme circumstances.\nThe focus of this course is on developing an interdisciplinary approach to an understanding of the arts,\nartists, and the artists’ response as a catalyst for social and political change.\nWe will explore the history of various practical crises and examine how they have influenced a...\n\n      more description for ASPP-GT 2007 »\n\n      \n\n\n\n4 points – will count toward general education requirements (Humanities)\nSocial, political, and economic upheavals produce shattering transformations in human life, yet some of the most significant artistic works in literature, visual arts, theatre, film, and music have been created under these extreme circumstances.\nThe focus of this course is on developing an interdisciplinary approach to an understanding of the arts,\nartists, and the artists’ response as a catalyst for social and political change.\nWe will explore the history of various practical crises and examine how they have influenced art and artists. Some of the examples include the works of Czechoslovakian films during Soviet Occupation, Protest Theatre during Apartheid South Africa, Shostakovich’s Trio during Soviet Era, underground music scene in present day Iran, Cindy Sherman’s photography in the USA, Croatian artist Sanjan Ivekovic and Bangali writer Taslima Nasrin’s. We will also look at some examples of propaganda artists and their work as well, artists like Morteza Avini in Iran and Liu Wenxi of China. By investigating the artist’s understanding of political, social, and economic forces that impact upon art and\ntheir own lives we will examine this question: What are the complex dynamics that are involved in the emergence of movements in the arts?\n\n      less description for ASPP-GT 2007 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2008",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "5818",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Engel, Kathy",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "ASPP-GT 2008 Independent Study",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2009",
            "course_name": "",
            "description": "ASPP-GT 2009\n\n   Exit Strategies: Funding Your Work\n\nThis course gives emerging artists real skills needed to navigate the competitive world of arts funding. Students learn how to represent their work and themselves with the goal of writing effective project proposals and compelling artist statements to garner funding from sources as diverse as private foundations and Kickstarter. Students learn the tricks of researching and finding funding opportunities appropriate for their work and will prepare two completed grant applications as a final project. Feedback on these applications and work samples will come courtesy of a mock panel of judges at t...\n\n      more description for ASPP-GT 2009 »\n\n      \n\n\n\nThis course gives emerging artists real skills needed to navigate the competitive world of arts funding. Students learn how to represent their work and themselves with the goal of writing effective project proposals and compelling artist statements to garner funding from sources as diverse as private foundations and Kickstarter. Students learn the tricks of researching and finding funding opportunities appropriate for their work and will prepare two completed grant applications as a final project. Feedback on these applications and work samples will come courtesy of a mock panel of judges at the New York Foundation for the Arts. Students will exit the course with writing that they might revise and reuse for many different  purposes in their professional creative life, better prepared for bringing their creative work to the world post-graduation.\n\n      less description for ASPP-GT 2009 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2010",
            "course_name": "Art in/as Public Policy",
            "description": "ASPP-GT 2010 Art in/as Public Policy",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2011",
            "course_name": "Artists in Uncommon Partnerships",
            "description": "ASPP-GT 2011 Artists in Uncommon Partnerships",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2019",
            "course_name": "",
            "description": "ASPP-GT 2019\n\n   Narrating Iraq\n\nIraqi culture is in a unique state: its cultural production has gradually shifted from Iraq itself to a vast diaspora scattered across the globe, in the Middle- East, Europe, Australia and the Americas. A disproportionate number of Iraqis, about five million-- i.e. one sixth of the entire population— now live outside of Iraq’s borders, often in a stateless limbo. Out-of-place Iraqi intellectuals and artists have been attempting to represent their country’s ongoing devastation and fragmentation, amidst a precarious existence and rapidly shifting definitions of belonging. If Iraq is foundational...\n\n      more description for ASPP-GT 2019 »\n\n      \n\n\n\nIraqi culture is in a unique state: its cultural production has gradually shifted from Iraq itself to a vast diaspora scattered across the globe, in the Middle- East, Europe, Australia and the Americas. A disproportionate number of Iraqis, about five million-- i.e. one sixth of the entire population— now live outside of Iraq’s borders, often in a stateless limbo. Out-of-place Iraqi intellectuals and artists have been attempting to represent their country’s ongoing devastation and fragmentation, amidst a precarious existence and rapidly shifting definitions of belonging. If Iraq is foundationally a composite of multiple ethnicities, religions, and dialects, cross-border dispersions have introduced new hyphenated identities and cultural syncretisms. This course seeks to offer a transnational framework to examine Iraqi culture(s) as embedded in a complex multi-directional itinerary, between “nation” and its diasporic geographies.\n\n      less description for ASPP-GT 2019 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2020",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5947",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 670",
                    "time": "Thu 2.00 PM - 5.30 PM",
                    "open": true,
                    "professor": "Antonio, Sheril"
                }
            ],
            "course_name": "",
            "description": "ASPP-GT 2020\n\n   Anatomy of Difference\n\nThis course looks at how difference is constructed in film through reading assignments, in class screenings and critical analysis of full-length features including main stream Hollywood, independent, and international films. This inquiry will take note that while some of these films may be conventional in form, in content they challenge accepted notions of differences, or stereotypes. Our goal is to catalog films that resist accepted notions of the \"other.\" To accomplish our goals we will deal primarily with textual analysis that focuses on story, character, as well as cinematic space and time...\n\n      more description for ASPP-GT 2020 »\n\n      \n\n\n\nThis course looks at how difference is constructed in film through reading assignments, in class screenings and critical analysis of full-length features including main stream Hollywood, independent, and international films. This inquiry will take note that while some of these films may be conventional in form, in content they challenge accepted notions of differences, or stereotypes. Our goal is to catalog films that resist accepted notions of the \"other.\" To accomplish our goals we will deal primarily with textual analysis that focuses on story, character, as well as cinematic space and time. With the help of the required texts we will examine socially accepted notions of the \"other\" and see how they are derived and or challenged in and by films, thus looking at how an art form can interact with socially accepted forms of \"othering.\" The objective of the course is to train emerging artists and scholars to engage in critical analysis that can make profound contributions to the individual's unique creative or analytical process. Another intention of the course is to delineate and occupy the space left for debate between authorship as expressed from a directorial perspective from authorship from the spectator's point of view.\n\n      less description for ASPP-GT 2020 «",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2021",
            "course_name": "Censorshp, Regultn & Pop Media in 20th Cntry U.S.",
            "description": "ASPP-GT 2021 Censorshp, Regultn & Pop Media in 20th Cntry U.S.",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2022",
            "course_name": "The Culture Industries",
            "description": "ASPP-GT 2022 The Culture Industries",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2023",
            "course_name": "",
            "description": "ASPP-GT 2023\n\n   Art and/as Research Ways of Knowing\n\nThis class will concentrate on research methods of art making.  It has been argued that creativity has seven stages: orientation, preparation, analysis, ideation, incubation, synthesis, and evaluation. Each of these steps will be explored and researched with complimentary writing assignments and individual or group creative problem solving exercises.  These seven steps of creativity will be a platform to structure the class and hopefully come to understand the mystery of inspiration, originality and invention.  We will examine other related theories such as trauma and creativity, spontaneity, ...\n\n      more description for ASPP-GT 2023 »\n\n      \n\n\n\nThis class will concentrate on research methods of art making.  It has been argued that creativity has seven stages: orientation, preparation, analysis, ideation, incubation, synthesis, and evaluation. Each of these steps will be explored and researched with complimentary writing assignments and individual or group creative problem solving exercises.  These seven steps of creativity will be a platform to structure the class and hopefully come to understand the mystery of inspiration, originality and invention.  We will examine other related theories such as trauma and creativity, spontaneity, chance, creativity as a voice for empowerment and the function of freedom and lack of freedom to heighten artistic movement.  How are we inspired?  Is there a method to our creativity?  Can the creative process have a formula?  How does research inform the creative process?  The class will utilize the archives, galleries and libraries as a research tool and NYU as research University.  We will visit the Fayles library, the Tainamont library, NYU Grey Art Gallery as well as visit with scholars and artists to consider the furthering of ideas into a series of stages to a final project and paper.\n\n      less description for ASPP-GT 2023 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2024",
            "course_name": "Multiple Realities: Peel Away Rhetoric Int'L Art",
            "description": "ASPP-GT 2024 Multiple Realities: Peel Away Rhetoric Int'L Art",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2025",
            "course_name": "",
            "description": "ASPP-GT 2025\n\n   Cultural Governance\n\nThe New York City Council of New York City approved legislation for the formation of a Cultural Plan.  Given the cultural diversity of New York City that is reflected in a myriad of cultural art institutions addressing varied creative art forms what will be, should be the process of assuring cultural equity for historically marginalized communities and new immigrant communities? Examining the cultural policies of other cities in the United States, understanding the present cultural climate and resource distribution of New York City, processes of distribution and gathering the voice of varied c...\n\n      more description for ASPP-GT 2025 »\n\n      \n\n\n\nThe New York City Council of New York City approved legislation for the formation of a Cultural Plan.  Given the cultural diversity of New York City that is reflected in a myriad of cultural art institutions addressing varied creative art forms what will be, should be the process of assuring cultural equity for historically marginalized communities and new immigrant communities? Examining the cultural policies of other cities in the United States, understanding the present cultural climate and resource distribution of New York City, processes of distribution and gathering the voice of varied communities students will be actively engaged in the formation of implementable procedures to recommend a possible cultural plan for New York City. Students will be actively involved in interviewing, organizing open forums, gathering the voices of the diverse cultural arts community in what could be a comprehensive New York City Cultural Plan?\n\n      less description for ASPP-GT 2025 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2027",
            "course_name": "Censrd Bods:Gener Race, Sexulty & Poltcs of Cult",
            "description": "ASPP-GT 2027 Censrd Bods:Gener Race, Sexulty & Poltcs of Cult",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2028",
            "course_name": "",
            "description": "ASPP-GT 2028\n\n   Creative Response:\n\nCreative Response: Performance Matters\n\nThis course will consider what influences private and public performance, to consider what is performing, what we perform and how we perform. We will look deeper into varying aspects of staging such as everyday experience, lists, menus, rituals, timing, gathering and collecting.  Performing and communicating the body: gender, race and identification.  Awareness of work in progress, process, such as text, script, online and improvisation will be utilized. The visual aspect of performing:  such as accessories, design and costume. Listening, finding voice a...\n\n      more description for ASPP-GT 2028 »\n\n      \n\n\n\nCreative Response: Performance Matters\n\nThis course will consider what influences private and public performance, to consider what is performing, what we perform and how we perform. We will look deeper into varying aspects of staging such as everyday experience, lists, menus, rituals, timing, gathering and collecting.  Performing and communicating the body: gender, race and identification.  Awareness of work in progress, process, such as text, script, online and improvisation will be utilized. The visual aspect of performing:  such as accessories, design and costume. Listening, finding voice and giving and taking commands, and deviation from dominant norms of entertainment and product.  Hopefully with deeper understanding, we will seek to challenge and stimulate our own creative content to produce original, thought provoking performance.  Students will present their own work either individually or in groups, write about the theory and content of their production and have assigned readings to supplement their areas of concentration.\n\n      less description for ASPP-GT 2028 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2029",
            "course_name": "",
            "description": "ASPP-GT 2029\n\n   Conceptual Studio\n\nThis class is to consider artists, historical recording and the methods of art making that work outside of traditional norms; being time based, breaking expectations of the medium, the audience and or the placement and transaction in spectatorship. Other cultural mainstays such as interruptions, scrap books, outtakes, overheard conversation, the scandal, the accident will also be material for study. While examining and researching artifacts, footage, imagery, found objects that exist and resonate outside of the proposed point of focus we will look at the underlying meanings and the interruptio...\n\n      more description for ASPP-GT 2029 »\n\n      \n\n\n\nThis class is to consider artists, historical recording and the methods of art making that work outside of traditional norms; being time based, breaking expectations of the medium, the audience and or the placement and transaction in spectatorship. Other cultural mainstays such as interruptions, scrap books, outtakes, overheard conversation, the scandal, the accident will also be material for study. While examining and researching artifacts, footage, imagery, found objects that exist and resonate outside of the proposed point of focus we will look at the underlying meanings and the interruptions into our expectation of perception. After looking and studying examples students will create and design their own projects that can be performance, installation, new media or text based. Accompanying paper is also required.\n\n      less description for ASPP-GT 2029 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2031",
            "course_name": "Aesthetics Ethics and Politics",
            "description": "ASPP-GT 2031 Aesthetics Ethics and Politics",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2032",
            "course_name": "Production-Marxism and Art",
            "description": "ASPP-GT 2032 Production-Marxism and Art",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2033",
            "course_name": "Publicity & Its Careers",
            "description": "ASPP-GT 2033 Publicity & Its Careers",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2034",
            "course_name": "",
            "description": "ASPP-GT 2034\n\n   Female Cultural Rebel in Modern Times\n\nThis class will reflect on feminism, gender and sexuality themes. Some of the topics will be the male and female gaze, the documenting and editing of the female madwoman such as in the documentary “Grey Gardens”. We will look at the 1967 documentary of the drag beauty pageant “The Queen”, where we will consider gender fluidity, representation and costuming femininity. Other units will be on gossip, the soap opera, hysteria, horror films, female masculinity, abjection, objectification, anger, ambiguity and invisibility.  Students will also be able to concentrate on a particular subject for rese...\n\n      more description for ASPP-GT 2034 »\n\n      \n\n\n\nThis class will reflect on feminism, gender and sexuality themes. Some of the topics will be the male and female gaze, the documenting and editing of the female madwoman such as in the documentary “Grey Gardens”. We will look at the 1967 documentary of the drag beauty pageant “The Queen”, where we will consider gender fluidity, representation and costuming femininity. Other units will be on gossip, the soap opera, hysteria, horror films, female masculinity, abjection, objectification, anger, ambiguity and invisibility.  Students will also be able to concentrate on a particular subject for research. A midterm presentation and final project with companion papers is required.\n\n      less description for ASPP-GT 2034 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2035",
            "course_name": "Spoken Word-Off The Page",
            "description": "ASPP-GT 2035 Spoken Word-Off The Page",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2036",
            "course_name": "Coverins The World: Vis Cult  The Imprl Imgnry",
            "description": "ASPP-GT 2036 Coverins The World: Vis Cult  The Imprl Imgnry",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2037",
            "course_name": "Anarchism and The Arts",
            "description": "ASPP-GT 2037 Anarchism and The Arts",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2038",
            "course_name": "Grad Sem No Holds Barred Intensifd Theory & Critq",
            "description": "ASPP-GT 2038 Grad Sem No Holds Barred Intensifd Theory & Critq",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2039",
            "course_name": "Art & Times of Romare Beardon",
            "description": "ASPP-GT 2039 Art & Times of Romare Beardon",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2041",
            "course_name": "Is This What Democracy Looks Like",
            "description": "ASPP-GT 2041 Is This What Democracy Looks Like",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2044",
            "course_name": "Art and Law",
            "description": "ASPP-GT 2044 Art and Law",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2046",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5898",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC4",
                    "time": "Mon 6.20 PM - 9.05 PM",
                    "open": true,
                    "professor": "Hebert, Patrick"
                }
            ],
            "course_name": "",
            "description": "ASPP-GT 2046\n\n   Art & War Seminar:Art and War: Battle Lines of the Graphic Novel\n\nArt and War: Battle Lines of the Graphic Novel\nThis course explores storytelling about war through the use of the graphic novel. Students will be introduced to both recent and historically significant comics about war. Our goal is to gain a deeper understanding of the interplay between image and text in sequential art, the fundamentals of graphic novel development, and the ability to critically analyze graphic novels that deal with challenging subject matter. What are the ethical and methodological issues that arise when constructing sequential narratives of war? Are there differences between ...\n\n      more description for ASPP-GT 2046 »\n\n      \n\n\n\nArt and War: Battle Lines of the Graphic Novel\nThis course explores storytelling about war through the use of the graphic novel. Students will be introduced to both recent and historically significant comics about war. Our goal is to gain a deeper understanding of the interplay between image and text in sequential art, the fundamentals of graphic novel development, and the ability to critically analyze graphic novels that deal with challenging subject matter. What are the ethical and methodological issues that arise when constructing sequential narratives of war? Are there differences between war narratives that are autobiographical, documentary or fictional? Is there something unique about the format of graphic novels that enables artists to tell a different kind of war story than filmmakers, musicians or performers? How do comic books circulate culturally, and how might this expand or limit their ability to inform our understandings of war? We will explore these questions through close readings, robust discussions and careful written analysis of well-known works by Art Spiegelman, Marjane Satrapi and Joe Sacco, as well as graphic novels by Keiji Nakazawa, Mira Kirshner, Jason Lutes, J.P Stassen, Gipi, Emmanuel Guibert and others.\n\n      less description for ASPP-GT 2046 «",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2048",
            "course_name": "",
            "description": "ASPP-GT 2048\n\n   Imagination and Change:\n\nWe often talk about how artists interact with social movements. In this course we will examine how organizations are born, how they grow, and survive, (or don’t), and the art and imagination involved in creating them. We will discuss the relationship between time, place, constituency, and questions about how work is defined and carried out,\n\nthe roles of language, image, narrative, documentation, represenation. We will explore the difference between an organization, a coalition, a campaign, a movement, and a project, and ask ourselves what we can learn about structure, purpose, character, loca...\n\n      more description for ASPP-GT 2048 »\n\n      \n\n\n\nWe often talk about how artists interact with social movements. In this course we will examine how organizations are born, how they grow, and survive, (or don’t), and the art and imagination involved in creating them. We will discuss the relationship between time, place, constituency, and questions about how work is defined and carried out,\n\nthe roles of language, image, narrative, documentation, represenation. We will explore the difference between an organization, a coalition, a campaign, a movement, and a project, and ask ourselves what we can learn about structure, purpose, character, location, agility, culture, to name a few of the questions. We will read accounts by artists engaged with organization and movement, including choreographer Liz Lerman’s Hiking the Horizontal, a book about the musical group “Sweet Honey in the Rock,” among others.\n\nEach student will research an organization or project, to share with the group, and we will meet with organizational leaders to learn firsthand of their journeys.\n\n      less description for ASPP-GT 2048 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2049",
            "course_name": "",
            "description": "ASPP-GT 2049\n\n   Postcolonial Displacement: Memoir and Memory\n\nWith the growing numbers of immigrants/refugees in cities such as London, Paris, Berlin, Barcelona, New York, Los Angeles, Montreal, belonging  no longer corresponds to one geography, simplistically imagined as “over there.” This seminar will study questions of displacement as represented, mediated and narrated in a wide variety of texts. It will focus especially on memoirs, whether in written or audiovisual form, which confront exclusionary and essentialist discourses with a rich cultural production that foregrounds a complex understanding of such issues as “home,” “homeland,” “exile,” “hybri...\n\n      more description for ASPP-GT 2049 »\n\n      \n\n\n\nWith the growing numbers of immigrants/refugees in cities such as London, Paris, Berlin, Barcelona, New York, Los Angeles, Montreal, belonging  no longer corresponds to one geography, simplistically imagined as “over there.” This seminar will study questions of displacement as represented, mediated and narrated in a wide variety of texts. It will focus especially on memoirs, whether in written or audiovisual form, which confront exclusionary and essentialist discourses with a rich cultural production that foregrounds a complex understanding of such issues as “home,” “homeland,” “exile,” “hybridity” and “minorities.” How are identity and history performed in these colonial, post-colonial and diasporic contexts? What is the status and significance of the oral, the visual and the performed within the context of memory? We will examine different narrative forms of memory-making, analyzing how post/colonial authors and media-makers perform “home,” “homeland,” “diaspora,” and “exile.” How does memory become a filter for constructing contemporary discourses of belonging, especially in the context of post-independence and transnational dislocations? We will also address questions of genre, and the socio-political ramifications of certain modes of writing and performances of memory that create new hybrid genres such as the poetic documentary and experimental autobiography. We will analyze works where a fractured temporality is reassembled to form a usable past where the body serves as an icon of migratory meanings. We will also examine contemporary cyber diasporic practices, problematizing such issues as “nostalgia” and “return” in the context of new communication technologies.\n\n      less description for ASPP-GT 2049 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2050",
            "course_name": "",
            "description": "ASPP-GT 2050\n\n   Making Art Impacting Policy\n\nThis seminar will present critical frameworks for and in-depth case studies of artwork that creates, stages, facilitates and/or provokes public dialogue on public policy.Readingswill alternate between the historical, theoretical and practical, with a focus on texts by and interviews with artists and their collaborators. Much of the semester will be spent studying several key projects from initial context through inception, collaborations, implementation, and community and critical responses. Case studies will include Suzanne Lacy?s Oakland projects in the context of the California ?war on yout...\n\n      more description for ASPP-GT 2050 »\n\n      \n\n\n\nThis seminar will present critical frameworks for and in-depth case studies of artwork that creates, stages, facilitates and/or provokes public dialogue on public policy.Readingswill alternate between the historical, theoretical and practical, with a focus on texts by and interviews with artists and their collaborators. Much of the semester will be spent studying several key projects from initial context through inception, collaborations, implementation, and community and critical responses. Case studies will include Suzanne Lacy?s Oakland projects in the context of the California ?war on youth? of the 1990s; Jeremy Deller?sBattle of Orgreave, Thatcher labor politics, and the culture of historical re-enactment; Rick Lowe?s Project Row Houses and the experiences of the women in its Young Mothers Residential Program; and Group Material?s year-longDemocracyproject as a model for recent exhibitions like Creative Time?sDemocracy in America: The National Campaign. Each student will be expected to lead one discussion session and produce and present in class an 8-12 page final paper, which may be substituted by a creative project of equal commitment. Students in the course will also have the opportunity to observe firsthand, and/or participate in, the research for and production for a new dialogical project by an artist currently working in the field.\n\n      less description for ASPP-GT 2050 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2051",
            "course_name": "",
            "description": "ASPP-GT 2051\n\n   Interventionist Art: Strategy and Tactics\n\nChantal Mouffe?s brief, but relevant remarks about art, neo- liberalism and the political in an essay and interview entitled:  \"Artistic Activism and Agonistic Spaces? (2007), and ?Every Form of Art has a Political Dimension? (2001), will define our framework for discussing the contemporary complicity, or challenge to capitalism, of two fairly recent art movements known as Relational Aesthetics and The Interventionist.  Specifically, we will unpack Mouffe?s notion of hegemony, democracy, neo-liberalism and agonism, as a way to understand, to what extent, these two art practices engage with cap...\n\n      more description for ASPP-GT 2051 »\n\n      \n\n\n\nChantal Mouffe?s brief, but relevant remarks about art, neo- liberalism and the political in an essay and interview entitled:  \"Artistic Activism and Agonistic Spaces? (2007), and ?Every Form of Art has a Political Dimension? (2001), will define our framework for discussing the contemporary complicity, or challenge to capitalism, of two fairly recent art movements known as Relational Aesthetics and The Interventionist.  Specifically, we will unpack Mouffe?s notion of hegemony, democracy, neo-liberalism and agonism, as a way to understand, to what extent, these two art practices engage with capitalist domination. Along with introducing Chantal Mouffe?s key notions in political philosophy, and defining art readings on Relational Aesthetics and Interventionist Art, this course will also re-view, though the lens of agonism, the cultural production of Hans Haacke, Christo and Jeanne-Claude, Martha Rosler, Conrad Atkinson, Mierle Ukeles, Group Material, Interim Sites, PAD/D, RepoHistroy, Guerrilla Girls, Alfredo Jaar, Dennis Adams, Krzysztof Wodiczho, Critical Art Ensemble, X-PRZ, Santiago Sierra, N55, Yes Men, Superflex, DJ Spooky, Reclaim the Streets, Critical Mass, The Church of Life After Shopping, John Carpenter? s ?They Live? (1988) and Michael Moore?s ?Capitalism, A Love Story? (2009).Students for the first half of the term are required to critically research an interventionist collective/artist of interest, then present in class this work through, a re-imaging of progressive politics, using the philosophy of Agonism.  For the second half of the term, students will give form to their findings, an interventionist ontology (Manifesto), in conjunction with an interventionist act(ion).\n\n      less description for ASPP-GT 2051 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2052",
            "course_name": "Appropriation, Creati- Vity and Permissions",
            "description": "ASPP-GT 2052 Appropriation, Creati- Vity and Permissions",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2053",
            "course_name": "The Case for The Visual Arts Scene Towards a",
            "description": "ASPP-GT 2053 The Case for The Visual Arts Scene Towards a",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2054",
            "course_name": "Art and The Public Sphere",
            "description": "ASPP-GT 2054 Art and The Public Sphere",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2055",
            "course_name": "",
            "description": "ASPP-GT 2055\n\n   The Media of Displacemnt Postcolonial Culture\n\n?We are here because you were there? has become a common slogan for postcolonial diasporas in the metropolitan ?centers? of the West. With the growing numbers of immigrants and refugees from the Middle East/North Africa in cities such as London, Paris, Berlin, New York, Los Angeles, Montreal, and Sao Paulo, the construction of ?us? versus ?them? can no longer correspond to one geography, simplistically imagined as ?over there.? This seminar will study questions of displacement as represented, mediated and narrated in diverse cultural realms, especially cinema, media, visual culture and writing...\n\n      more description for ASPP-GT 2055 »\n\n      \n\n\n\n?We are here because you were there? has become a common slogan for postcolonial diasporas in the metropolitan ?centers? of the West. With the growing numbers of immigrants and refugees from the Middle East/North Africa in cities such as London, Paris, Berlin, New York, Los Angeles, Montreal, and Sao Paulo, the construction of ?us? versus ?them? can no longer correspond to one geography, simplistically imagined as ?over there.? This seminar will study questions of displacement as represented, mediated and narrated in diverse cultural realms, especially cinema, media, visual culture and writing. How such texts have confronted exclusionary and essentialist discourses with a rich cultural production that foregrounds a complex understanding of such issues as ?home,? ?homeland,? ?exile,? ?hybridity? and ?minorities.? We will look at the past few decades of artistic work within the larger context of post-independence and globalization politics. We will mainly examine the ways films/videos, novels, memoirs, and visual work have represented dislocations that have come in the wake of colonial partitions, and of regional, ethnic and religious conflicts; as well as into the ways they challenge traditional genres about immigration, transcending the neat divisions among the social documentary, the ethnographic media, the experimental autobiography, and the fictional narrative. We will also examine these texts in relation to contemporary cyber diasporic practices, problematizing especially such issues as ?nostalgia? and ?return? in the context of new communication technologies.\n\n      less description for ASPP-GT 2055 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2057",
            "course_name": "Green World",
            "description": "ASPP-GT 2057 Green World \nGreen World is an exploration of contemporary environmental, political, and technological issues whose goal is to empower artists to create immediate informed catalytic works of long-term positive social change utilizing contemporary and traditional technologies. When possible, students will be matched with an industry adviser (proponent or opponent) to deepen their understanding of a specific subject of interest.",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2058",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17092",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Cultural Institutions Communities and The Poli",
            "description": "ASPP-GT 2058 Cultural Institutions Communities and The Poli",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2059",
            "course_name": "Art & Politics The Art Space Movement",
            "description": "ASPP-GT 2059 Art & Politics The Art Space Movement",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2060",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "5819",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 325 (SB)",
                    "time": "Fri 11.00 AM - 1.45 PM",
                    "open": true,
                    "professor": "Vega, Marta"
                }
            ],
            "course_name": "",
            "description": "ASPP-GT 2060\n\n   Cultural Equity The Community Artsimperative\n\nThis course provides the opportunity for students to historically contextualize the growth of the community cultural arts movement grounded in the social and cultural equity activists movements that grew out of the Civil Rights Movement.  The continuing mission and work of multidisciplinary community based cultural arts organizations challenge cultural and social inequities framing their creative work and organizational practices to assure equitable inclusion of the varying aesthetic criteria and expressions that reflect the multiethnic communities that are integral to the nations cultural ide...\n\n      more description for ASPP-GT 2060 »\n\n      \n\n\n\nThis course provides the opportunity for students to historically contextualize the growth of the community cultural arts movement grounded in the social and cultural equity activists movements that grew out of the Civil Rights Movement.  The continuing mission and work of multidisciplinary community based cultural arts organizations challenge cultural and social inequities framing their creative work and organizational practices to assure equitable inclusion of the varying aesthetic criteria and expressions that reflect the multiethnic communities that are integral to the nations cultural identity. The first section of the course will take place in advocacy cultural arts community based organizations in the city. Community arts leaders in the field in collaboration with the class instructor will teach the course.  This team teaching approach will afford students direct exposure and learning experiences with practitioners in the field within the communities they serve. In the second section of the course students will develop a project in collaboration with staff of one of the participating institutions. Students will have direct immersion within the community and the community organization understanding the operational and programmatic realities of the field as well as direct engagement in advocacy creative work. Students will be exposed to teaching strategies for working within communities that include readings, open discussions, as well as working on multidisciplinary collaborations in the field.\n\n      less description for ASPP-GT 2060 «",
            "offering": true
        },
        {
            "course_id": "ASPP-GT 2061",
            "course_name": "Art and Catastrophe",
            "description": "ASPP-GT 2061 Art and Catastrophe",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2062",
            "course_name": "Advocacy Documentary Filmmaking and The Law",
            "description": "ASPP-GT 2062 Advocacy Documentary Filmmaking and The Law",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2063",
            "course_name": "Life Science New Media and Performativity",
            "description": "ASPP-GT 2063 Life Science New Media and Performativity",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2064",
            "course_name": "Tactical Media",
            "description": "ASPP-GT 2064 Tactical Media",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2065",
            "course_name": "Rhythm of Structure",
            "description": "ASPP-GT 2065 Rhythm of Structure",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2067",
            "course_name": "",
            "description": "ASPP-GT 2067\n\n   Figuring Cultural Policy, Figuring Cultural Diplomacy in Global Age\n\n4 points – will count toward general education requirements (Social Science)\nWe live in a world of nations and migrants between nations. Both are sources of cultural policy. This course will examine both the national frameworks within which people create cultural expressions and the disaporic experience through which they maintain a relation between worlds. For example, what does it\nmean for a Chinese artist to live and work in France while maintaining their Chinese roots and sensibilities? We will examine intercultural perspectives and representations as they bear upon global and internationa...\n\n      more description for ASPP-GT 2067 »\n\n      \n\n\n\n4 points – will count toward general education requirements (Social Science)\nWe live in a world of nations and migrants between nations. Both are sources of cultural policy. This course will examine both the national frameworks within which people create cultural expressions and the disaporic experience through which they maintain a relation between worlds. For example, what does it\nmean for a Chinese artist to live and work in France while maintaining their Chinese roots and sensibilities? We will examine intercultural perspectives and representations as they bear upon global and international for artistic work. We will also consider the meanings of global spectatorship in light of technological forms and mediations of particular cultural experiences. How do meanings change across these contexts and who decides or judges what is considered to be of greatest value? What role do international art markets play in how artists pursue their own creative process and professional opportunities? What kinds of art are considered suitable for international audiences, what are the political and cultural expectations for these forms? We will consider the ways in which such economic, cultural and esthetic questions figure in the shaping and articulation of cultural policy. How do the kinds of media and information that artists have access to shape the way in which they craft their own artistic responses and pursuits.\n\n      less description for ASPP-GT 2067 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2068",
            "course_name": "Art Design and Political Ecology",
            "description": "ASPP-GT 2068 Art Design and Political Ecology",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2069",
            "course_name": "The Bridge: Art of Dialogue Transformng Soc",
            "description": "ASPP-GT 2069 The Bridge: Art of Dialogue Transformng Soc",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2070",
            "course_name": "",
            "description": "ASPP-GT 2070\n\n   Language as Action\n\nLanguage as Action: Narrating Change\nHow will you go about finding that thing the nature of which is totally unknown to you? – Meno, from Rebecca Solnit’s A Field Guide To Getting Lost                                                          \n\nReading the lives of others mirrors and guides one’s own process of discovery. Writing one’s own story deepens understanding and possibility. How do we tell our stories? How do we learn from the stories, questions, struggles, conflicts, discoveries of others? What language(s) do we use? What is told and what is omitted? How are the components of grammar ...\n\n      more description for ASPP-GT 2070 »\n\n      \n\n\n\nLanguage as Action: Narrating Change\nHow will you go about finding that thing the nature of which is totally unknown to you? – Meno, from Rebecca Solnit’s A Field Guide To Getting Lost                                                          \n\nReading the lives of others mirrors and guides one’s own process of discovery. Writing one’s own story deepens understanding and possibility. How do we tell our stories? How do we learn from the stories, questions, struggles, conflicts, discoveries of others? What language(s) do we use? What is told and what is omitted? How are the components of grammar used to convey power, possibility, emotion, location, relationship, agency? How does the vulnerability of narrative teach us? What is the relationship between teller and listener/reader?\n\nWe often learn about the results of a project or work  – the newsworthy event, the data, time, product, outcome -- in a binary, linear fashion. In this course we will read memoirs and essays by, and in some cases biographical renderings of, artists/change makers. Simultaneously students will begin to record their own stories. Reading someone’s words regarding her or his process of discovery, invention, conflict, dreaming, building, in her or his own voice, illuminates the complexities, hills, stumbles, rivers, fears, joys, and unknowns involved in making and living a life of engagement, daring, discipline and imagination. \n\nAn intensive reading and writing course, we will explore narratives that invite us into the process of recording  experience and also connecting with communities.  Books will include choreographer/dancer Liz Lehrman’s Hiking The Horizontal,  writer Edwidge Danticat’s Creating Dangerously, sex trafficking survivor/activist Somaly Mam’s The Road of Lost Innocence,  Barack Obama’s  Dreams From My Father, writer/activist Rebecca Solnit’s A Field Guide To Getting Lost, among others.The process of reading these lives, and beginning to narrate your own, will invite you [students] to investigate and grapple with questions, to break binaries, and re-imagine the possible.\n\n      less description for ASPP-GT 2070 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2082",
            "course_name": "The Cultural Imperative: Intersections in Cultural Equity, Cultural Arts & Public Policy",
            "description": "ASPP-GT 2082 The Cultural Imperative: Intersections in Cultural Equity, Cultural Arts & Public Policy",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2100",
            "course_name": "Urban Ensemble",
            "description": "ASPP-GT 2100 Urban Ensemble",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2152",
            "course_name": "Multiculturalism & The Media",
            "description": "ASPP-GT 2152 Multiculturalism & The Media",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2220",
            "course_name": "",
            "description": "ASPP-GT 2220\n\n   Community Collaborations\n\nCOMMUNITY COLLABORATIONS is a Photography & Imaging and Art and Public Policy Course where NYU students teach digital photo based image making to high school students from throughout NYC in the Photography and Imaging digital labs. Working in teams of two or three, the NYU students co-facilitate small workshops two afternoons a week with the teens. Digital cameras are provided for the high school students to photograph their families, friends, and communities to create photographic essays exploring their day-to-day lives, dreams, concerns, and social-political challenges. The workshops will ru...\n\n      more description for ASPP-GT 2220 »\n\n      \n\n\n\nCOMMUNITY COLLABORATIONS is a Photography & Imaging and Art and Public Policy Course where NYU students teach digital photo based image making to high school students from throughout NYC in the Photography and Imaging digital labs. Working in teams of two or three, the NYU students co-facilitate small workshops two afternoons a week with the teens. Digital cameras are provided for the high school students to photograph their families, friends, and communities to create photographic essays exploring their day-to-day lives, dreams, concerns, and social-political challenges. The workshops will run from early February to end of April and are free for the teens and open by application. During the Monday evening course time for NYU students, focus will be on workshop development, lesson planning, discussion of challenges, collaboration and supervision from the instructor. There will also be guest speakers. Each group will create an online exhibition that will be added to the Community Collaborations website: http://photoandimaging.net/coco.\n\nNOTE: Groups with the teens meet two afternoons a week in addition to the course time. When you plan your schedule, make sure you have a minimum of two afternoons a week free from 3:30-6. Once you have a sense of your schedule, please email lorie.novak@nyu.edu. Non-majors interested in this course should have experience in photography, web design, film/video, or community-based teaching. Permission of instructor required. Teams will be created so that students will draw on each other’s strengths.\n\n      less description for ASPP-GT 2220 «",
            "offering": false
        },
        {
            "course_id": "ASPP-GT 2671",
            "course_name": "Actor Teacher I",
            "description": "ASPP-GT 2671 Actor Teacher I",
            "offering": false
        }
    ]
}