{
    "major_id": "SONH1-UC",
    "file": "./2015-2016/Diagnostic_Medical_Sonography_(SONH1-UC).html",
    "courses": [
        {
            "course_id": "SONH1-UC 3901",
            "course_name": "Abdominal Sonography",
            "description": "SONH1-UC 3901 Abdominal Sonography \nThis course stresses the correct identification, interpretation, and recording of the relevant sonographic images for a correct diagnosis. It presents normal sonographic anatomy and the alteration of this anatomy in a variety of pathologic conditions. The class describes and displays sonographic characteristics of basic structures in the abdominal cavity, retroperitoneal cavity, and superficial organs. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3902",
            "course_name": "Cross-Sectional Anatomy",
            "description": "SONH1-UC 3902 Cross-Sectional Anatomy \nThis course familiarizes the student with cross-sectional images of the human abdominal and pelvic cavity through the use of sonographic images, diagrams, and images of cadaver slices. It defines common terms used in sonography, such as sonolucent, anechoic, homogeneous, heterogeneous, cystic, and solid. The course provides an in-depth analysis of cross-sectional anatomy, including transverse, longitudinal, and oblique. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3905",
            "course_name": "",
            "description": "SONH1-UC 3905\n\n   Obstetrical/Gynecological Sonography I\n\nStudents become acquainted with the sonographic terms, reference planes, and basic anatomy of the female pelvis in both the gravid and nongravid states. The course discusses the specific identification, interpretation, and recording of the relevant sonographic images needed to provide correct diagnoses. It presents normal and pathologic anatomy; vascularity of the gravid and nongravid uterus, ovaries, adnexa, bladder, and pelvic musculature; and the developing fetus as they appear sonographically. The course also describes sonographic appearance of congenital anomalies of the pelvis. (Diagnost...\n\n      more description for SONH1-UC 3905 »\n\n      \n\n\n\nStudents become acquainted with the sonographic terms, reference planes, and basic anatomy of the female pelvis in both the gravid and nongravid states. The course discusses the specific identification, interpretation, and recording of the relevant sonographic images needed to provide correct diagnoses. It presents normal and pathologic anatomy; vascularity of the gravid and nongravid uterus, ovaries, adnexa, bladder, and pelvic musculature; and the developing fetus as they appear sonographically. The course also describes sonographic appearance of congenital anomalies of the pelvis. (Diagnostic Medical Sonography students only.)\n\n      less description for SONH1-UC 3905 «",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3906",
            "course_name": "Cardiovascular Principles I",
            "description": "SONH1-UC 3906 Cardiovascular Principles I \nThis course presents anatomy, physiology, and hemodynamics of the cardiovascular system along with the basics of electrocardiography (EKG) and phonocardiography. It correlates EKG and phonocardiographic data with the various echocardiographic studies and the significance of the findings discussed. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3907",
            "course_name": "Sonographic Physics I",
            "description": "SONH1-UC 3907 Sonographic Physics I \nThe main focus of this course is on tissue properties and the interaction with sound waves, attenuation, impedance, reflection, refraction, scattering, and gain setting. Transducer function and an introduction to transducer design and Doppler are included. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3908",
            "course_name": "Abdominal Clinical Med",
            "description": "SONH1-UC 3908 Abdominal Clinical Med \nThis course focuses on the etiology and epidemiology of diseases found in the abdominal cavity. It details symptomology laboratory findings and clinical findings that relate to the sonographic examination. It also explores other diagnostic procedures and treatments along with their relevance to a complete diagnostic sonographic examination. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3909",
            "course_name": "Obstetrics & Gynecology",
            "description": "SONH1-UC 3909 Obstetrics & Gynecology \nThis course teaches the etiology, epidemiology, and sequelae of disease processes of the female reproductive system as well as embryogenesis (normal and abnormal development). Students study and compare other diagnostic procedures that provide helpful clinical information with sonography. The course discusses clinical and laboratory findings necessary for the performance of an appropriate sonographic examination. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3911",
            "course_name": "Abdominal Sonography II",
            "description": "SONH1-UC 3911 Abdominal Sonography II \nThis course provides an intensive overview of abdominal and retroperitoneal sonography; integrating cross-sectional imaging; color flow and Doppler studies; clinical findings; and sonographic presentation of normal and abnormal states. It focuses on case reviews, incorporating sonographic images with other diagnostic modalities and the final diagnosis. (Diagnostic Medical Sonography students only)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3912",
            "course_name": "Superficial Structures & Neurosonography",
            "description": "SONH1-UC 3912 Superficial Structures & Neurosonography \nThis course familiarizes the student with the skills needed for special examinations, such as the sonographic evaluation of the breast (standards and nomenclature), scrotum, thyroid, parathyroid, prostate, neonatal heads, and musculoskeletal examinations. It describes anatomy and pathology; sonographic appearance, including color flow and Doppler; scanning technique; protocols; and provides an understanding of the images necessary for diagnosis. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3913",
            "course_name": "",
            "description": "SONH1-UC 3913\n\n   Echocardiography\n\nThis course combines a lecture series with hands-on lab sessions. It introduces sonographic terms, reference planes, and basic anatomy used in echocardiography. It describes the anatomy of the heart and related structures as seen on the M-mode and two-dimensional echocardiograms. The course surveys abnormal/pathologic motion patterns and anatomy and correlated with the electrical timing of the heart. The lab sessions use hands-on training to teach echocardiographic scanning techniques, proper care of the ultrasound equipment, patientpositioning, and transducer placement. (Diagnostic Medical So...\n\n      more description for SONH1-UC 3913 »\n\n      \n\n\n\nThis course combines a lecture series with hands-on lab sessions. It introduces sonographic terms, reference planes, and basic anatomy used in echocardiography. It describes the anatomy of the heart and related structures as seen on the M-mode and two-dimensional echocardiograms. The course surveys abnormal/pathologic motion patterns and anatomy and correlated with the electrical timing of the heart. The lab sessions use hands-on training to teach echocardiographic scanning techniques, proper care of the ultrasound equipment, patientpositioning, and transducer placement. (Diagnostic Medical Sonography students only.)\n\n      less description for SONH1-UC 3913 «",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3915",
            "course_name": "Ob/Gyn Sonog II",
            "description": "SONH1-UC 3915 Ob/Gyn Sonog II \nThis course is an intensive overview of obstetrics and gynecology that integrates cross-sectional anatomy, fetal anomalies with clinical findings, sonographic presentation, color flow, and Doppler studies. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3916",
            "course_name": "Cardiovascular Princ II",
            "description": "SONH1-UC 3916 Cardiovascular Princ II \nAbnormal EKGs, cardiac catheterization, and principles of hemodynamics are presented. Valvular diseases, prosthetic valves, pericardial disease, and disturbances of coronary blood flow and its effect on heart function are detailed. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3917",
            "course_name": "Sonographic Physics II",
            "description": "SONH1-UC 3917 Sonographic Physics II \nThis course describes the pulser, receiver, memory, and display and their integration and interaction in a functioning system. It provides an in-depth presentation of various types of instrumentation, the design and function of ultrasound imaging systems, the importance of sensitivity controls, transducer assembly, sound beams, and focusing. It also covers transducer selection, comparison of transducer types and arrays, their advantages and disadvantages, biological effects, and the AIUM testing objects. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3918",
            "course_name": "Cardiology",
            "description": "SONH1-UC 3918 Cardiology \nThis course provides a comprehensive description of the etiology and epidemiology of the diseases affecting the heart and related structures. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3920",
            "course_name": "Vascular Sonography",
            "description": "SONH1-UC 3920 Vascular Sonography \nThis course delivers an understanding of duplex ultrasound for the investigation of the extracranial circulation of the brain, venous, and arterial circulation of the lower extremities. It discusses normal and pathological situations in correlation with physical and clinical findings. The course includes demonstrations to enhance scanning techniques and instrumentation. There is limited hands-on instruction. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3921",
            "course_name": "Clinical Applications",
            "description": "SONH1-UC 3921 Clinical Applications \nThis course covers new sonographic applications, including sonographic physics and instrumentation update. It reviews physics and instrumentation following ARDMS guidelines using videotapes, slides, discussions, case reviews, and mock registry examinations. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3923",
            "course_name": "Doppler Echocardiography",
            "description": "SONH1-UC 3923 Doppler Echocardiography \nThis course presents the principles of pulsed, continuous, and color Doppler echocardiography with an emphasis on the physics and potential benefits of these techniques. It gives an intensive overview of echocardiography, stress echocardiograms, TEE, clinical findings, Doppler, and color flow Doppler, including images and case studies. (Diagnostic Medical Sonography students only.)",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3924",
            "course_name": "",
            "description": "SONH1-UC 3924\n\n   Clinical I\n\nThis course consists of hands-on clinical sessions accompanied by weekly seminars. Clinical training involves supervised hands-on work with patients, discussion of cases with sonographers and physicians, and exposure to a variety of duties necessary to function in a clinical facility. State-of-the-art equipment from various manufacturers is available for student use. Seminars are organized reading sessions, using images and unusual cases to improve the interpretive skills of the student. Students present cases and a journal article for critical review by instructors and their peers. Students’ ...\n\n      more description for SONH1-UC 3924 »\n\n      \n\n\n\nThis course consists of hands-on clinical sessions accompanied by weekly seminars. Clinical training involves supervised hands-on work with patients, discussion of cases with sonographers and physicians, and exposure to a variety of duties necessary to function in a clinical facility. State-of-the-art equipment from various manufacturers is available for student use. Seminars are organized reading sessions, using images and unusual cases to improve the interpretive skills of the student. Students present cases and a journal article for critical review by instructors and their peers. Students’ communication skills and understanding of continuing educational requirements are fostered along with their didactic and practical knowledge.\n\n      less description for SONH1-UC 3924 «",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3925",
            "course_name": "",
            "description": "SONH1-UC 3925\n\n   Clinical II\n\nThis course consists of hands-on clinical sessions accompanied by weekly seminars. Clinical training involves supervised hands-on work with patients, discussion of cases with sonographers and physicians, and exposure to a variety of duties necessary to function in a clinical facility. State-of-the-art equipment from various manufacturers is available for student use. The seminars consist of discussions for sharing clinical experiences, problems, and concerns. Students present cases and a journal article for critical review by instructors and their peers. Students’ communication skills and unde...\n\n      more description for SONH1-UC 3925 »\n\n      \n\n\n\nThis course consists of hands-on clinical sessions accompanied by weekly seminars. Clinical training involves supervised hands-on work with patients, discussion of cases with sonographers and physicians, and exposure to a variety of duties necessary to function in a clinical facility. State-of-the-art equipment from various manufacturers is available for student use. The seminars consist of discussions for sharing clinical experiences, problems, and concerns. Students present cases and a journal article for critical review by instructors and their peers. Students’ communication skills and understanding of continuing educational requirements are fostered along with their didactic and practical knowledge. Professionalism and growth of sonography are included.\n\n      less description for SONH1-UC 3925 «",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3926",
            "course_name": "",
            "description": "SONH1-UC 3926\n\n   Clinical III\n\nThis course consists of hands-on clinical sessions accompanied by weekly seminars. Clinical training involves supervised hands-on work with patients, discussion of cases with sonographers and physicians, and exposure to a variety of duties necessary to function in a clinical facility. State-of-the-art equipment from various manufacturers is available for student use. The seminars consist of discussions for sharing clinical experiences, problems, and concerns. Students present cases and a journal article for critical review by instructors and their peers. Students’ communication skills and unde...\n\n      more description for SONH1-UC 3926 »\n\n      \n\n\n\nThis course consists of hands-on clinical sessions accompanied by weekly seminars. Clinical training involves supervised hands-on work with patients, discussion of cases with sonographers and physicians, and exposure to a variety of duties necessary to function in a clinical facility. State-of-the-art equipment from various manufacturers is available for student use. The seminars consist of discussions for sharing clinical experiences, problems, and concerns. Students present cases and a journal article for critical review by instructors and their peers. Students’ communication skills and understanding of continuing educational requirements are fostered along with their didactic and practical knowledge. Professionalism and growth of sonography are included.\n\n      less description for SONH1-UC 3926 «",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3927",
            "course_name": "Clinical IV",
            "description": "SONH1-UC 3927 Clinical IV \nSee course description for Clinical I (DMS).",
            "offering": false
        },
        {
            "course_id": "SONH1-UC 3930",
            "course_name": "Diagnostic Sonography Recitation",
            "description": "SONH1-UC 3930 Diagnostic Sonography Recitation",
            "offering": false
        }
    ]
}