{
    "major_id": "MSDI1-GC",
    "file": "./2015-2016/Digital_Imaging_&_Dsgn_MA_(MSDI1-GC).html",
    "courses": [
        {
            "course_id": "MSDI1-GC 1000",
            "course_name": "",
            "description": "MSDI1-GC 1000\n\n   Art, Technology & Design\n\nStarting with Marshall McLuhan's prophecies about the global village and about the information age replacing the machine age, we analyze the historical interaction between art, technology, and design. Drawing on the spirit of Leonardo Da Vinci and the Bauhaus, we trace the impact of computers on design and art over the past 40 years. The course ends with the application of digital technology to the most popular projects of our time (i.e. product ads on TV, big budget films, photography, animation, product design, the web, and fine art.). Some highlights of the course include: Experiments in Ar...\n\n      more description for MSDI1-GC 1000 »\n\n      \n\n\n\nStarting with Marshall McLuhan's prophecies about the global village and about the information age replacing the machine age, we analyze the historical interaction between art, technology, and design. Drawing on the spirit of Leonardo Da Vinci and the Bauhaus, we trace the impact of computers on design and art over the past 40 years. The course ends with the application of digital technology to the most popular projects of our time (i.e. product ads on TV, big budget films, photography, animation, product design, the web, and fine art.). Some highlights of the course include: Experiments in Art and Technology, Inc. (E.A.T.), the Art and Technology Program (A&T), MIT media lab, relevant conceptual art, development of software for design, Terminator 2 (film), hardware development for digital image making, and the relationship between high level digital image making and the pop culture.\n\n      less description for MSDI1-GC 1000 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 1040",
            "course_name": "",
            "description": "MSDI1-GC 1040\n\n   Digital Production Process\n\nThe objective of this course is to understand the Digital Production process, and to learn its visual strategies and technical support. The digital production process course will focus on the production pipeline for all areas of production whether it is creating film, digital video, animation, game development, location-based entertainment, interactive projects, and any other type of production where creative content is essentially digital.  Understanding this process from a creative and technical perspective is essential to keeping up with the dynamics of evolving production environments.  Th...\n\n      more description for MSDI1-GC 1040 »\n\n      \n\n\n\nThe objective of this course is to understand the Digital Production process, and to learn its visual strategies and technical support. The digital production process course will focus on the production pipeline for all areas of production whether it is creating film, digital video, animation, game development, location-based entertainment, interactive projects, and any other type of production where creative content is essentially digital.  Understanding this process from a creative and technical perspective is essential to keeping up with the dynamics of evolving production environments.  The main topics covered in this course will include: gathering source material from the physical (analog) and digital world, converting to a common digital format, incorporating 2-D and 3-D digital elements, processing, adding digital effects, final editing and output. This course is not about producing a work of art but understanding how to move the elements through the digital process in order to produce a work of art.\n\n      less description for MSDI1-GC 1040 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2000",
            "course_name": "",
            "description": "MSDI1-GC 2000\n\n   Special Effcts in Cinema from Melies-Matri\n\nSpecial effects, creating fantasy and plausible reality, are essential to cinema. This survey spans from pioneering magician Georges Melies to today's digital artists. Although covering many films, we emphasize techniques in adventure, horror, and fantasy. Effects studied range from staged disasters to monsters to seemingly mundane realities. We learn all the major techniques, and interpret effects vis-a-vis storytelling, style and meaning. We adopt practical approaches to film history, giving students a database of influential images while examining contexts of how effects work in films. This...\n\n      more description for MSDI1-GC 2000 »\n\n      \n\n\n\nSpecial effects, creating fantasy and plausible reality, are essential to cinema. This survey spans from pioneering magician Georges Melies to today's digital artists. Although covering many films, we emphasize techniques in adventure, horror, and fantasy. Effects studied range from staged disasters to monsters to seemingly mundane realities. We learn all the major techniques, and interpret effects vis-a-vis storytelling, style and meaning. We adopt practical approaches to film history, giving students a database of influential images while examining contexts of how effects work in films. This course will be of interest to general students of film but since it covers all the major effects techniques the course also serves to complement lab-oriented courses specializing in digital design.\n\n      less description for MSDI1-GC 2000 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2010",
            "course_name": "",
            "description": "MSDI1-GC 2010\n\n   Digital Post-Production\n\nIn this course, students learn to seamlessly integrate multiple visual components for dazzling effects to be used in feature films, commercials, and television along with some basic fundamentals of Broadcast Design.  Students will use Adobe After Effects in a real post-production environment in which they will use feature-rich modules to solve design challenges and create special effects and motion graphics.   All the key elements that make up the concept of compositing and motion design are covered, including keying, creation of mattes, color correction, stabilizing, and tracking.  Also explo...\n\n      more description for MSDI1-GC 2010 »\n\n      \n\n\n\nIn this course, students learn to seamlessly integrate multiple visual components for dazzling effects to be used in feature films, commercials, and television along with some basic fundamentals of Broadcast Design.  Students will use Adobe After Effects in a real post-production environment in which they will use feature-rich modules to solve design challenges and create special effects and motion graphics.   All the key elements that make up the concept of compositing and motion design are covered, including keying, creation of mattes, color correction, stabilizing, and tracking.  Also explored: animation of text, animation, logo replacement, and wire removal.\n\n      less description for MSDI1-GC 2010 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2015",
            "course_name": "After-Effects Compositing",
            "description": "MSDI1-GC 2015 After-Effects Compositing",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2100",
            "course_name": "",
            "description": "MSDI1-GC 2100\n\n   2D Production II - Techniques & Workflow\n\nIn this course, students use Alias/Wavefront Studio Tools to create visually stunning designs that utilize Studio's CAD export capabilities for precision and accuracy.  While implementing Studio's advanced surface modeling tools, students experience immediate feedback with real time diagnostics.  Topics covered include photorealistic rendering, NURBS modeling, and advanced freeform surfacing.  Design principles, aesthetics, fabrication and the relationship of high-end modeling software to the design process are discussed.  Students are required to complete several projects, one of which will r...\n\n      more description for MSDI1-GC 2100 »\n\n      \n\n\n\nIn this course, students use Alias/Wavefront Studio Tools to create visually stunning designs that utilize Studio's CAD export capabilities for precision and accuracy.  While implementing Studio's advanced surface modeling tools, students experience immediate feedback with real time diagnostics.  Topics covered include photorealistic rendering, NURBS modeling, and advanced freeform surfacing.  Design principles, aesthetics, fabrication and the relationship of high-end modeling software to the design process are discussed.  Students are required to complete several projects, one of which will relate to the student's field of interest.  This course is suited to a wide range of design applications, including jewelry, furniture, point of purchase, product, and automotive design.\n\n      less description for MSDI1-GC 2100 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2105",
            "course_name": "2D Production III - Professionl Applications",
            "description": "MSDI1-GC 2105 2D Production III - Professionl Applications \nThe course focuses on the professional area of application dedicated to the compositing of film and video elements. As the course adds specific toolsets and techniques related to the work with film elements, students learn how to accomplish effects in 2D and combine live action elements with computer‐generated elements.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2220",
            "course_name": "Computer Animations & Visual Effcts W/Soft Img",
            "description": "MSDI1-GC 2220 Computer Animations & Visual Effcts W/Soft Img \nThis course introduces Softimage 3-D, used for 3-D character animation and effects in film, commercials, and games.  Softimage has been used in The Matrix, Fight Club, Antz, and Men in Black and games such as Resident Evil and Riven.  Softimage's modular interface and logical approach to tool sets make the learning process for computer animation easy and allows artists to focus on their creations.  In this introductory course, students learn the fundamentals of modeling, animation, shading, and rendering.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2230",
            "course_name": "",
            "description": "MSDI1-GC 2230\n\n   Editing for Visual Effects\n\nThe effects editor uses primarily rhythm to create the climax of a special effects shot within the context of the overall production.  The focus of the course will be to make the student aware of the sequence and timing in order to make the visual effects shot dynamic.  Students will learn to enhance the narrative through the use of timing, context and rhythm.  Students will also focus on supporting techniques involved in editing sequences for visual effects, as well as commercials and trailers.  The student will learn to analyze the challenge presented by such diverse factors as the story, th...\n\n      more description for MSDI1-GC 2230 »\n\n      \n\n\n\nThe effects editor uses primarily rhythm to create the climax of a special effects shot within the context of the overall production.  The focus of the course will be to make the student aware of the sequence and timing in order to make the visual effects shot dynamic.  Students will learn to enhance the narrative through the use of timing, context and rhythm.  Students will also focus on supporting techniques involved in editing sequences for visual effects, as well as commercials and trailers.  The student will learn to analyze the challenge presented by such diverse factors as the story, the camera angle, the drama, and characters.  Ultimately, the final result of the shot within the sequence should be visually captivating.  Timing, shots, color, light, shadow placement, and audio syncing are covered in depth.\n\n      less description for MSDI1-GC 2230 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 2310",
            "course_name": "Fundamentals of Computing",
            "description": "MSDI1-GC 2310 Fundamentals of Computing",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3005",
            "course_name": "",
            "description": "MSDI1-GC 3005\n\n   Compositing I\n\nThe course covers high level compositing for visual effects as used in film and video. Students focuses on the various tasks of a compositor and deepen their skills and knowledge of the technical aspects of image compositing. The course also focuses on the technical preparation of plates through advanced keying techniques, such as luma keys, chroma keys and blue/green screens, rotoscoping, stabilization and tracking. The objective is to develop a solid technical understanding and problem‐solving skills allowing students to breakdown shots into tasks and trouble shoot complex problems with the ...\n\n      more description for MSDI1-GC 3005 »\n\n      \n\n\n\nThe course covers high level compositing for visual effects as used in film and video. Students focuses on the various tasks of a compositor and deepen their skills and knowledge of the technical aspects of image compositing. The course also focuses on the technical preparation of plates through advanced keying techniques, such as luma keys, chroma keys and blue/green screens, rotoscoping, stabilization and tracking. The objective is to develop a solid technical understanding and problem‐solving skills allowing students to breakdown shots into tasks and trouble shoot complex problems with the goal of creating photo‐realistic composites.\n\n      less description for MSDI1-GC 3005 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3015",
            "course_name": "",
            "description": "MSDI1-GC 3015\n\n   Adv Techniques in Digital Post-Production\n\nThis very advanced, project-oriented course will focus on the creation of believable illusions.  Combustion, the desktop version of Flint, will be the main tool.  All the skills learned in the previous compositing courses, will be used to composite real and created elements to produce fantastic imagery that is both exciting and visually sound.   Projects will incorporate constructing scenes using scripted digital input, and then will proceed to develop the structural relationships of several types of illusions.  Students will be encouraged to replicate traditional Hollywood visual effects usin...\n\n      more description for MSDI1-GC 3015 »\n\n      \n\n\n\nThis very advanced, project-oriented course will focus on the creation of believable illusions.  Combustion, the desktop version of Flint, will be the main tool.  All the skills learned in the previous compositing courses, will be used to composite real and created elements to produce fantastic imagery that is both exciting and visually sound.   Projects will incorporate constructing scenes using scripted digital input, and then will proceed to develop the structural relationships of several types of illusions.  Students will be encouraged to replicate traditional Hollywood visual effects using totally digital techniques.\n\n      less description for MSDI1-GC 3015 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3020",
            "course_name": "",
            "description": "MSDI1-GC 3020\n\n   Compositing & Painting for Visual Effects\n\nOutstanding painting and compositing techniques were an integral part of the successes of such classic films as Raiders of The Lost Ark, The Wrath of Khan, Batman Returns, and Titanic.  Having a knowledge of digital paint, used in conjunction with good compositing techniques will prove invaluable to the digital artist. It is essential within compositing to be able to touch up, create rough masks, put finishing touches, remove wires and other unwanted elements, solve color problems, and create new imagery. Also included in this process is motion tracking and digital matte painting.  To make bel...\n\n      more description for MSDI1-GC 3020 »\n\n      \n\n\n\nOutstanding painting and compositing techniques were an integral part of the successes of such classic films as Raiders of The Lost Ark, The Wrath of Khan, Batman Returns, and Titanic.  Having a knowledge of digital paint, used in conjunction with good compositing techniques will prove invaluable to the digital artist. It is essential within compositing to be able to touch up, create rough masks, put finishing touches, remove wires and other unwanted elements, solve color problems, and create new imagery. Also included in this process is motion tracking and digital matte painting.  To make believable the integration of a painted background and an additional object is the primary focus of this course. Students also learn faster solutions to processing while maintaining the highest degree of image quality.\n\n      less description for MSDI1-GC 3020 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3030",
            "course_name": "",
            "description": "MSDI1-GC 3030\n\n   Lighting & Rendering\n\nBeautiful rendered images can be achieved using advanced software making real, all natural visual phenomena.  Illumination, color, shadows, darkness and light come alive in the truest sense during this course.  The difference between a dull sphere and a flaming comet traveling through space, lies in its surface textures, glow, lighting, color, motion blur, and dynamics (sparks).  In this course, advanced 3-D students are introduced to the complexities of surfacing.  Students observe surfaces and learn to recreate them using a variety of methods including bump maps, displacement, spot light, am...\n\n      more description for MSDI1-GC 3030 »\n\n      \n\n\n\nBeautiful rendered images can be achieved using advanced software making real, all natural visual phenomena.  Illumination, color, shadows, darkness and light come alive in the truest sense during this course.  The difference between a dull sphere and a flaming comet traveling through space, lies in its surface textures, glow, lighting, color, motion blur, and dynamics (sparks).  In this course, advanced 3-D students are introduced to the complexities of surfacing.  Students observe surfaces and learn to recreate them using a variety of methods including bump maps, displacement, spot light, ambient glow, reflectivity, texturing from Photoshop, photorealistic refractions (glass), camera exposure.  The look and feeling of an image are also addressed.  Layering of texture and setting up multipass renders.  Dynamics and particle animation are also covered. Producing professional, high-resolution images is the goal of this course.\n\n      less description for MSDI1-GC 3030 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3050",
            "course_name": "",
            "description": "MSDI1-GC 3050\n\n   Digital Audio Production W/ Pro Tools\n\nSound design is a critical element to all productions and is just as important as the impact of moving images.  Using Pro Tools/24, the industry's leading digital audio system featuring 24-bit integrated digital recording, students learn the complete editing and creative process for sound design. This course covers the fundamental techniques needed for producing soundtracks, sound effects and music.  Topics include: non-destructive recording and editing, processing, digital mixing, fade-ins and -outs, playlists and customization.  In this course, students advance through every phase of product...\n\n      more description for MSDI1-GC 3050 »\n\n      \n\n\n\nSound design is a critical element to all productions and is just as important as the impact of moving images.  Using Pro Tools/24, the industry's leading digital audio system featuring 24-bit integrated digital recording, students learn the complete editing and creative process for sound design. This course covers the fundamental techniques needed for producing soundtracks, sound effects and music.  Topics include: non-destructive recording and editing, processing, digital mixing, fade-ins and -outs, playlists and customization.  In this course, students advance through every phase of production - from input to final master.\n\n      less description for MSDI1-GC 3050 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3060",
            "course_name": "Sound Design for Visual Effects",
            "description": "MSDI1-GC 3060 Sound Design for Visual Effects \nSound designers are the creative minds that are essential to the audio production machine.  The study of convincing sound effects and soundtracks employing hard and soft techniques will be explored.   Through the study of effects and foley, the student will learn how to create sounds to match moving images.  A powerful soundtrack supports and enhances the look, tone, and feel of a picture.  The direction of the course is to help the student develop a strong understanding of sound's influence on the visualization and film process.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3080",
            "course_name": "Shake Vfx Compositing",
            "description": "MSDI1-GC 3080 Shake Vfx Compositing \nThis course is an advanced studio lab using Apple?s Shake, a high-level film compositor. Students focus on effects compositing, network rendering, multi-resolution inputs, and working with non-linear workspace.   Sophisticated problem solving techniques are taught by organizing the building blocks of complex visual effects in a tree structure.  Students will also explore Shake?s powerful warping and shape based morphing with spline tools.  This course covers high level compositing and visual effects for production of film and video.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3100",
            "course_name": "",
            "description": "MSDI1-GC 3100\n\n   3D Modeling & Product Design II\n\nThis course focuses on the successful creation of high-level models and accurate machinable surfaces for both fabrication and presentation. Within this high level modeling, students learn to edit and evaluate surfaces, so that the model not only considers aesthetics but functionality as well. Topics include: construction with free-form curves and surfaces, animating a model for presentation, and rendering for presentation.   The importance of using textures and lighting to create effects is explored for rendering realistic models.  Students use color mapping, bump mapping, environmental mappin...\n\n      more description for MSDI1-GC 3100 »\n\n      \n\n\n\nThis course focuses on the successful creation of high-level models and accurate machinable surfaces for both fabrication and presentation. Within this high level modeling, students learn to edit and evaluate surfaces, so that the model not only considers aesthetics but functionality as well. Topics include: construction with free-form curves and surfaces, animating a model for presentation, and rendering for presentation.   The importance of using textures and lighting to create effects is explored for rendering realistic models.  Students use color mapping, bump mapping, environmental mapping and raytracing to create exciting and realistic images.  Rapid prototyping/development as well as bottlenecks and workflow in the digital design process are explored.  Students are expected to complete projects, all of which will be presentation/portfolio quality.\n\n      less description for MSDI1-GC 3100 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3210",
            "course_name": "",
            "description": "MSDI1-GC 3210\n\n   Maya Visual Effects II\n\nIn this course students who have completed the introductory course will learn the advanced features of MAYA or Softimage/XSI and pursue an in-depth study of its additional tools.  Interactivity between the major modules is stressed.  In addition to learning high level accurate modeling, students will learn to model for animation (rigging).  In animation, all possible animation types are explored, including key frame animation, motion path animation, complex hierarchical structures (walking person) and editing the graphical interface.  Within rendering, students will cover the creation of mater...\n\n      more description for MSDI1-GC 3210 »\n\n      \n\n\n\nIn this course students who have completed the introductory course will learn the advanced features of MAYA or Softimage/XSI and pursue an in-depth study of its additional tools.  Interactivity between the major modules is stressed.  In addition to learning high level accurate modeling, students will learn to model for animation (rigging).  In animation, all possible animation types are explored, including key frame animation, motion path animation, complex hierarchical structures (walking person) and editing the graphical interface.  Within rendering, students will cover the creation of materials, their reflectivity, and refraction.  The discovery of dynamic techniques will also be continued in this course.  Students enhance their mastery of MEL and the ARTISAN tool set in order to customize their work.  An instructor-approved final project is required in this course.\n\n      less description for MSDI1-GC 3210 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3230",
            "course_name": "",
            "description": "MSDI1-GC 3230\n\n   Character Animation I\n\nIn response to the growing interest in the art of character animation, this course focuses on the elusive task of creating a believable animated performance using Maya's advanced character tools.  Students study the basic elements of complex motion, performance structure, and their relationship to digital inverse kinematics.  Digital characters with natural movement, emotion, and density are created and placed in interactive environments designed by the student.  Although technical ability is a requirement, the primary focus of this course is building digital characters that act.  Software wil...\n\n      more description for MSDI1-GC 3230 »\n\n      \n\n\n\nIn response to the growing interest in the art of character animation, this course focuses on the elusive task of creating a believable animated performance using Maya's advanced character tools.  Students study the basic elements of complex motion, performance structure, and their relationship to digital inverse kinematics.  Digital characters with natural movement, emotion, and density are created and placed in interactive environments designed by the student.  Although technical ability is a requirement, the primary focus of this course is building digital characters that act.  Software will be used as a creative tool to convey a realistic performance to a modeled character or creature.\n\n      less description for MSDI1-GC 3230 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3240",
            "course_name": "Comp Anim & Visual Fx2 Softimage II",
            "description": "MSDI1-GC 3240 Comp Anim & Visual Fx2 Softimage II \nThis advanced level course uses XSI, a leader in visual effects animation for the film, broadcast and game industries.  The primary subjects are to explore XSI?s non-linear animation system, deformation controls, the operator stack, render tree shaders and mental ray.  Other topics include advanced Polygon modeling and multi patch Nurbs creation and it?s resolution independent multi-layer integrated paint system.  The course will focus on industry wide production projects and solutions.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3245",
            "course_name": "",
            "description": "MSDI1-GC 3245\n\n   Character Rigging\n\nCharacter setup is one of the most important steps in the character building process.  A good character rig will allow you to get the most out of your characters, and save you from a number of possible problems you could encounter later on in your projects.  This course will cover basic and advanced rigging solutions.  Students will learn how to solve their own issues based on the tools they learn in class.  Topics include modeling for animation/ skinning, character setup, forward / inverse kinematics, and UV texture layout.  This course is designed to run in conjunction with the Character Ani...\n\n      more description for MSDI1-GC 3245 »\n\n      \n\n\n\nCharacter setup is one of the most important steps in the character building process.  A good character rig will allow you to get the most out of your characters, and save you from a number of possible problems you could encounter later on in your projects.  This course will cover basic and advanced rigging solutions.  Students will learn how to solve their own issues based on the tools they learn in class.  Topics include modeling for animation/ skinning, character setup, forward / inverse kinematics, and UV texture layout.  This course is designed to run in conjunction with the Character Animation course.\n\n      less description for MSDI1-GC 3245 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3260",
            "course_name": "",
            "description": "MSDI1-GC 3260\n\n   Title Design\n\nThe history of graphic design constitutes a mere blip in the entire history of mankind. With the recent increased acceptance of desktop computers in the film and design industries, the potential to create spectacular visual effects and design is given more to the individual.  This class will explore the history and recent innovations of motion graphics.  Students will focus on the conceptual aspects of film title design and develop the ability to think of innovative means of production on the computer and in the studio.  Students will screen music videos, films and works by Saul Bass, Norman M...\n\n      more description for MSDI1-GC 3260 »\n\n      \n\n\n\nThe history of graphic design constitutes a mere blip in the entire history of mankind. With the recent increased acceptance of desktop computers in the film and design industries, the potential to create spectacular visual effects and design is given more to the individual.  This class will explore the history and recent innovations of motion graphics.  Students will focus on the conceptual aspects of film title design and develop the ability to think of innovative means of production on the computer and in the studio.  Students will screen music videos, films and works by Saul Bass, Norman Mclaren, and Jakob Trollback to learn about type in motion, transitioning and the theme of addition subtraction and multiplication.\n\n      less description for MSDI1-GC 3260 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3350",
            "course_name": "Creative Cities: The Ground Zero Lab",
            "description": "MSDI1-GC 3350 Creative Cities: The Ground Zero Lab",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3400",
            "course_name": "Digital Medical Imaging",
            "description": "MSDI1-GC 3400 Digital Medical Imaging \nThis course is essential for students interested in high-level organic modeling.  Using Maya, Alias/Wavefront's most advanced animation application, students will explore and solve problems specific to biomedical visualization, and learn techniques for creating complex organic surfaces for human anatomy.  Eyes, bones, skin, and muscle will be created and animated in dynamic surgical situations.  Lighting attributes, shading, rendering, particles, and modeling techniques are covered.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3405",
            "course_name": "",
            "description": "MSDI1-GC 3405\n\n   Adv Digital Medical Imaging\n\nIn the first part of the course, students continue to learn the modeling, lighting, dynamics and animation techniques for medical illustration.  The new modeling techniques will include soft bodies, textures, and the dynamic interaction between surgical instruments and bones with soft tissue.  We will also address, by modeling, the concept of the varying densities between different types of anatomical parts.  In the second part of the course, students work on an approved project.  This may include the construction of a specific area of the human anatomy as it pertains virtual surgery and surgi...\n\n      more description for MSDI1-GC 3405 »\n\n      \n\n\n\nIn the first part of the course, students continue to learn the modeling, lighting, dynamics and animation techniques for medical illustration.  The new modeling techniques will include soft bodies, textures, and the dynamic interaction between surgical instruments and bones with soft tissue.  We will also address, by modeling, the concept of the varying densities between different types of anatomical parts.  In the second part of the course, students work on an approved project.  This may include the construction of a specific area of the human anatomy as it pertains virtual surgery and surgical education, i.e. the brain, heart or skull.  Students also work on a dynamic simulation of human tissue according to a specified plan.  Importing CT and MRI data to create anatomically correct images is covered.\n\n      less description for MSDI1-GC 3405 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3420",
            "course_name": "Digital Bauhaus",
            "description": "MSDI1-GC 3420 Digital Bauhaus \nThe Bauhaus philosophy dictates that common forms, shapes and function be combined together to create new, exited and usable pieces of art. This philosophy informs this production bases course. In this course students from various backgrounds will be brought together in a production - based environment to build a project. This project will include various elements in 3-D, 2-D and digital applications.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3465",
            "course_name": "Broadcast Design II",
            "description": "MSDI1-GC 3465 Broadcast Design II \nThis course will cover advanced techniques in the art and science of professional motion design.  Students will explore aspects of creating graphics for network and cable packages and their relationship to pop culture and traditional design approach.  The class will take a look at the basic strategy for motion graphics for local broadcast as well as international design and implementation.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3500",
            "course_name": "",
            "description": "MSDI1-GC 3500\n\n   Technical Directing\n\nTechnical directing is one of the most important roles in the digital production process for big budget Hollywood films, animation, and commercials.  In the entertainment world, technical directors supervise the overall look and feel of a shot, focusing on lighting, perspective and match-movement.  Students in this course will learn all aspects of a technical director's role in digital pipeline including: design of motion, lighting, textures, rendering and scene design.  Creating models, mattes, paintings and visual effects for this course will be taught using MAYA, Renderman, Flint/Flame, and...\n\n      more description for MSDI1-GC 3500 »\n\n      \n\n\n\nTechnical directing is one of the most important roles in the digital production process for big budget Hollywood films, animation, and commercials.  In the entertainment world, technical directors supervise the overall look and feel of a shot, focusing on lighting, perspective and match-movement.  Students in this course will learn all aspects of a technical director's role in digital pipeline including: design of motion, lighting, textures, rendering and scene design.  Creating models, mattes, paintings and visual effects for this course will be taught using MAYA, Renderman, Flint/Flame, and Photoshop.  Through hands-on projects students will learn to direct and produce dramatic scenes utilizing live action, lighting effects, motion blur, compositing, and rendering.  Aspects of these projects will include digital camerawork, matching 2-D and 3-D perspective, producing several forms of mood lighting and integrating dynamic elements such as fire and smoke.\n\n      less description for MSDI1-GC 3500 «",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 3900",
            "course_name": "Special Projects",
            "description": "MSDI1-GC 3900 Special Projects \nIn this course, students take one semester of extended lab hours and faculty advisement for completion of incomplete thesis projects.  Students are required to meet with an advisor weekly to discuss development strategies and progress.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 4010",
            "course_name": "Discussions in Digital Imagin",
            "description": "MSDI1-GC 4010 Discussions in Digital Imagin \nThis seminar is a sequence of invited guests focusing on critical and intellectual topics, current to culture and the digital arts.  The topics will be wide-ranging but the speaker will be required to engage the students on a high intellectual level and to stimulate them to contemplate topics related to the master's curriculum.  Students will be required to write on various topics based on the speaker's theme.  There will be a final project in the form of a written and oral presentation.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 4015",
            "course_name": "Spc Prj: Digital Fine Arts",
            "description": "MSDI1-GC 4015 Spc Prj: Digital Fine Arts \nThis course allows students to gain hands-on production knowledge by applying skills used by professionals of the Digital Fine Art industry.  The class as a production team produces one project that relates to the field.",
            "offering": false
        },
        {
            "course_id": "MSDI1-GC 4030",
            "course_name": "Spc Prj: Gaming",
            "description": "MSDI1-GC 4030 Spc Prj: Gaming \nThis course allows students to gain hands-on production knowledge by applying skills used by professionals of the Gaming industry.  The class as a production team produces one project that relates to the field.",
            "offering": false
        }
    ]
}