{
    "major_id": "DSWSW-GS",
    "file": "./2015-2016/Doctor_of_Social_Welfare_(DSWSW-GS).html",
    "courses": [
        {
            "course_id": "DSWSW-GS 4001",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "18959",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WSN 112",
                    "time": "Fri 8.30 AM - 11.30 AM",
                    "open": true,
                    "professor": "Anastas, Jeane"
                }
            ],
            "course_name": "Philosophies of Knowledge and Mind",
            "description": "DSWSW-GS 4001 Philosophies of Knowledge and Mind \nPhilosophy of Science. Differences over epistemology – the nature of\nknowledge and how we come to possess it – are part and parcel of debates\nover clinical theory and research methodology, whether it is the claimed\nsuperiority of behaviorism based on positivist views or the claimed\nsuperiority of relational psychodynamic approaches based on constructivist\naccounts of knowledge. This course will consider selected topics and\ncontroversies in philosophy of science and their application to debates\nover the nature of clinical theory and research.",
            "offering": true
        },
        {
            "course_id": "DSWSW-GS 4002",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "18960",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WSN 112",
                    "time": "Fri 12.30 PM - 3.30 PM",
                    "open": true,
                    "professor": "Aiello, Theresa"
                }
            ],
            "course_name": "",
            "description": "DSWSW-GS 4002\n\n   Social Theories and their Relationship to Clinical Practice\n\nEvery clinical theory presupposes an account of the nature of the mind.\nMoreover, clinical theory continues to grapple with the philosophical\nconundrum of the mind-body relationship. The course will review selected\ntopics in the philosophy of mind and the explanation of human action, and\ntheir application to theoretical debates within the clinical literature.\nSocial Theories and their Relationship to Clinical Practice- Course number\n4002.001\n\nThis course will examine how professional social work knowledge evolves in\nthe context of broader intellectual currents in philosophy and the social\nscie...\n\n      more description for DSWSW-GS 4002 »\n\n      \n\n\n\nEvery clinical theory presupposes an account of the nature of the mind.\nMoreover, clinical theory continues to grapple with the philosophical\nconundrum of the mind-body relationship. The course will review selected\ntopics in the philosophy of mind and the explanation of human action, and\ntheir application to theoretical debates within the clinical literature.\nSocial Theories and their Relationship to Clinical Practice- Course number\n4002.001\n\nThis course will examine how professional social work knowledge evolves in\nthe context of broader intellectual currents in philosophy and the social\nsciences, including debates in epistemology, ontology, as well as political\nand moral philosophy. Postmodern perspectives such as relational theories,\nnarrative, culture and race, second wave feminist theories, queer theories,\nand social constructivism will be examined in relation to clinical practice\nwith vulnerable populations traditionally served by social workers.\nEmphasis will be placed on the critical review of each of these theories,\nparticularly in relation to each other and their clinical utility and\nlimitations when applied to at-risk populations.\nBest,\n\n      less description for DSWSW-GS 4002 «",
            "offering": true
        }
    ]
}