{
    "major_id": "PHD-GP",
    "file": "./2015-2016/Doctoral_course_(PHD-GP).html",
    "courses": [
        {
            "course_id": "PHD-GP 5901",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "5142",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Beck, Diana",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Progress",
            "description": "PHD-GP 5901 Research in Progress \nNot counted toward course requirements for a degree.\n\nA weekly seminar for doctoral candidates working on dissertation proposals, conducting research, writing dissertations, and preparing for their oral defenses. Students present their work in progress for seminar discussion and critique.\n\nRe-registration once each term meets the doctoral program maintenance of matriculation requirement.",
            "offering": true
        },
        {
            "course_id": "PHD-GP 5902",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5110",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GODD B02",
                    "time": "Wed 1.00 PM - 2.40 PM",
                    "open": true,
                    "professor": "Dehejia, Rajeev"
                }
            ],
            "course_name": "",
            "description": "PHD-GP 5902\n\n   Research Methods\n\nRequired for doctoral students.\n\nThis course prepares the student to do and to evaluate social science research using a variety of research methods. Basic issues regarding the formulation of research questions, research design, and data collection and analysis are addressed. The course material encompasses both quantitative and qualitative methods in the discussion of the basic components of the research process: conceptualization and measurement, sample selection, and causal modeling. In addition to teaching techniques and conventions of doing research, the course also acquaints the student...\n\n      more description for PHD-GP 5902 »\n\n      \n\n\n\nRequired for doctoral students.\n\nThis course prepares the student to do and to evaluate social science research using a variety of research methods. Basic issues regarding the formulation of research questions, research design, and data collection and analysis are addressed. The course material encompasses both quantitative and qualitative methods in the discussion of the basic components of the research process: conceptualization and measurement, sample selection, and causal modeling. In addition to teaching techniques and conventions of doing research, the course also acquaints the student with critical issues in the philosophy of science, ethical questions, and how to write a research proposal.\n\n      less description for PHD-GP 5902 «",
            "offering": true
        },
        {
            "course_id": "PHD-GP 5903",
            "course_name": "Doctoral Research Seminar",
            "description": "PHD-GP 5903 Doctoral Research Seminar",
            "offering": false
        },
        {
            "course_id": "PHD-GP 5905",
            "course_name": "",
            "description": "PHD-GP 5905\n\n   Qualitative Research Methods\n\nThis course offers a hands-on opportunity for doctoral and advanced masters students to experience the practice of qualitative research. We will address the nature of qualitative research in the administrative and policy sciences, with ample opportunities to discuss the implications of the choices made in designing, implementing and reporting on the findings of a “mock” project which we will determine in class, with your input. The course will require a considerable investment of time, with intensive reading and writing, recurrent team discussions based on assignments, and individual fieldwork...\n\n      more description for PHD-GP 5905 »\n\n      \n\n\n\nThis course offers a hands-on opportunity for doctoral and advanced masters students to experience the practice of qualitative research. We will address the nature of qualitative research in the administrative and policy sciences, with ample opportunities to discuss the implications of the choices made in designing, implementing and reporting on the findings of a “mock” project which we will determine in class, with your input. The course will require a considerable investment of time, with intensive reading and writing, recurrent team discussions based on assignments, and individual fieldwork (with journal writing before, during and after site visits).\n\n      less description for PHD-GP 5905 «",
            "offering": false
        },
        {
            "course_id": "PHD-GP 5906",
            "course_name": "",
            "description": "PHD-GP 5906\n\n   Doctoral Seminar in Management\n\nManagement can mean many things. In this course, understanding management means understanding organizations.  This seminar will provide an introduction to micro organizational theory and research (also called organizational behavior) and macro organizational theory and research (also called organizational theory).  This seminar will address how individuals, groups, organizations and inter-organizational fields all affect organizational behavior and are, in turn, influenced by it.  Much of the material, though not all, will concern public, non-profit and health care organizations.The course has...\n\n      more description for PHD-GP 5906 »\n\n      \n\n\n\nManagement can mean many things. In this course, understanding management means understanding organizations.  This seminar will provide an introduction to micro organizational theory and research (also called organizational behavior) and macro organizational theory and research (also called organizational theory).  This seminar will address how individuals, groups, organizations and inter-organizational fields all affect organizational behavior and are, in turn, influenced by it.  Much of the material, though not all, will concern public, non-profit and health care organizations.The course has four goals: one, to familiarize students with these literatures; second, to help students prepare for the management comprehensive exam (though students not taking the exam are very welcome); third, to give students practice in the essential art of Scompare, contrast, conclude;? and, fourth, to offer an opportunity for students to write a theoretical paper which could provide the basis for a publishable manuscript.\n\n      less description for PHD-GP 5906 «",
            "offering": false
        },
        {
            "course_id": "PHD-GP 5907",
            "course_name": "",
            "description": "PHD-GP 5907\n\n   Doctoral Seminar in Public Finance and Financial Management\n\nThis doctoral seminar provides covThis doctoral seminar provides coverage of selected topics in the fields of public finance and financial management.  The over arching purpose of the course is to expose you to the literature in the fields of public finance and financial management and provide opportunities to critically analyze this literature, identify interesting research questions, and formulate research projects to address these questions.  \n\nThe specific objectives of the course are to:\nUnderstand the fundamental theories in the fields of public finance and financial management\nGain ...\n\n      more description for PHD-GP 5907 »\n\n      \n\n\n\nThis doctoral seminar provides covThis doctoral seminar provides coverage of selected topics in the fields of public finance and financial management.  The over arching purpose of the course is to expose you to the literature in the fields of public finance and financial management and provide opportunities to critically analyze this literature, identify interesting research questions, and formulate research projects to address these questions.  \n\nThe specific objectives of the course are to:\nUnderstand the fundamental theories in the fields of public finance and financial management\nGain broad exposure to seminal literature in the fields and directions in contemporary research\nGain experience in critically reviewing and discussing research\nWrite a research proposal\n\n      less description for PHD-GP 5907 «",
            "offering": false
        },
        {
            "course_id": "PHD-GP 5908",
            "course_name": "Doctoral Seminar in Policy",
            "description": "PHD-GP 5908 Doctoral Seminar in Policy",
            "offering": false
        },
        {
            "course_id": "PHD-GP 5910",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5113",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Coslovsky, Salo",
                    "time": "Thu 12.30 PM - 2.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Doctoral Research Colloquium I",
            "description": "PHD-GP 5910 Doctoral Research Colloquium I \nThe NYU Wagner Doctoral Research Colloquium is a seminar series at which prominent researchers present current work on pressing social issues.  The presenters represent a range of disciplines and methodological approaches, and are affiliated with institutions from around the country. This series is open to doctoral students and faculty, and doctoral students must register for one year of the colloqiuium as part of their program requirements.",
            "offering": true
        },
        {
            "course_id": "PHD-GP 5911",
            "course_name": "Doctoral Research Colloquium II",
            "description": "PHD-GP 5911 Doctoral Research Colloquium II \nThe NYU Wagner Doctoral Research Colloquium is a seminar series at which prominent researchers present current work on pressing social issues.  The presenters represent a range of disciplines and methodological approaches, and are affiliated with institutions from around the country. This series is open to doctoral students and faculty, and doctoral students must register for one year of the colloqiuium as part of their program requirements.",
            "offering": false
        }
    ]
}