{
    "major_id": "EAST-GA",
    "file": "./2015-2016/East_Asian_Studies_(EAST-GA).html",
    "courses": [
        {
            "course_id": "EAST-GA 1001",
            "course_name": "First Year Sem: Intro to Critical Asian Studies",
            "description": "EAST-GA 1001 First Year Sem: Intro to Critical Asian Studies \nThis course is an introductory seminar offered to first-year graduate students in East Asian studies. The seminar provides a critical overview of the social, political, intellectual, and institutional history of the field of East Asian studies.",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1046",
            "course_name": "Law and Society in East Asia",
            "description": "EAST-GA 1046 Law and Society in East Asia",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1135",
            "course_name": "History of Chinese Cinema I",
            "description": "EAST-GA 1135 History of Chinese Cinema I",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1223",
            "course_name": "Classical Philosophical Chinese",
            "description": "EAST-GA 1223 Classical Philosophical Chinese",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1224",
            "course_name": "Narrative Texts in Classical Chinese",
            "description": "EAST-GA 1224 Narrative Texts in Classical Chinese",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1225",
            "course_name": "Democracy in East & South Asia",
            "description": "EAST-GA 1225 Democracy in East & South Asia",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1226",
            "course_name": "Institutional Fndntns of China'S Economic Growth",
            "description": "EAST-GA 1226 Institutional Fndntns of China'S Economic Growth",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1270",
            "course_name": "Studies in Korean Modernity",
            "description": "EAST-GA 1270 Studies in Korean Modernity",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1280",
            "course_name": "",
            "description": "EAST-GA 1280\n\n   Readings in Japanese Humanities & Soc Science\n\nScholarly reading and research in modern Japanese. With varied content, approaches, and organization, this course exposes students to modern literary and expository works, and particularly to academic prose. Texts are selected to reflect circuits of knowledge and the development of disciplinarScholarly reading and research in modern Japanese. With varied content, approaches, and organization, this course exposes students to modern literary and expository works, and particularly to academic prose. Texts are selected to reflect circuits of knowledge and the development of disciplinary characteri...\n\n      more description for EAST-GA 1280 »\n\n      \n\n\n\nScholarly reading and research in modern Japanese. With varied content, approaches, and organization, this course exposes students to modern literary and expository works, and particularly to academic prose. Texts are selected to reflect circuits of knowledge and the development of disciplinarScholarly reading and research in modern Japanese. With varied content, approaches, and organization, this course exposes students to modern literary and expository works, and particularly to academic prose. Texts are selected to reflect circuits of knowledge and the development of disciplinary characteristics in style. Some emphasis is paid to the choice of text in order to facilitate familiarization of critical terminology. Particular attention is given to the role of translation as a means of considering the circulation of academic and intellectual terminology (and concepts) and the development of language by which academic discourse is conducted. The course also introduces students to some of the key reference work and methodology for solving problems of reading and interpretation at an advanced level.\n\n      less description for EAST-GA 1280 «",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1315",
            "course_name": "Ethnographic Traditions: East Asia",
            "description": "EAST-GA 1315 Ethnographic Traditions: East Asia",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1500",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1309",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "1310",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "1971",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Studies in Topics in East Asian Studies",
            "description": "EAST-GA 1500 Ind Studies in Topics in East Asian Studies",
            "offering": true
        },
        {
            "course_id": "EAST-GA 1708",
            "course_name": "Japanese Anime & New Media",
            "description": "EAST-GA 1708 Japanese Anime & New Media",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1709",
            "course_name": "Anime",
            "description": "EAST-GA 1709 Anime",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1726",
            "course_name": "",
            "description": "EAST-GA 1726\n\n   Historical Epics of China and Japan\n\nAn in-depth study of the major epics of China, Japan, and Vietnam, from the historical-military and the social-romantic. The Chinese historical epic Three Kingdoms is read against the Japanese epic Tale of the Heike. Emphasis is placed on the political nature of the dynastic state form, the types of legitimacy and the forms of rebellion, the process of breakdown and reintegration of an imperial house, the empire as dynasty and as territory, and the range of characterology. In the second half of the course, the Chinese classic Dream of the Red Chamber is read against the Japanese The Tale of Ge...\n\n      more description for EAST-GA 1726 »\n\n      \n\n\n\nAn in-depth study of the major epics of China, Japan, and Vietnam, from the historical-military and the social-romantic. The Chinese historical epic Three Kingdoms is read against the Japanese epic Tale of the Heike. Emphasis is placed on the political nature of the dynastic state form, the types of legitimacy and the forms of rebellion, the process of breakdown and reintegration of an imperial house, the empire as dynasty and as territory, and the range of characterology. In the second half of the course, the Chinese classic Dream of the Red Chamber is read against the Japanese The Tale of Genji. In addition to the above-mentioned topics, attention is given to the role of women and marriage in a governing elite, the modalities of social criticism in a novel of manners. The Vietnamese national classic Tale of Kieu is used as an introduction to the course because it combines all of the key topics. Particular attention is given to the ways in which Buddhist, Daoist, and Confucian doctrines function in each work.\n\n      less description for EAST-GA 1726 «",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1731",
            "course_name": "Topics in Asian History: Modernity & Crit Theory",
            "description": "EAST-GA 1731 Topics in Asian History: Modernity & Crit Theory",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1747",
            "course_name": "Capitalism and History",
            "description": "EAST-GA 1747 Capitalism and History",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1761",
            "course_name": "Translation, Modernity, & History",
            "description": "EAST-GA 1761 Translation, Modernity, & History",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1917",
            "course_name": "Material Culture in Chinese History",
            "description": "EAST-GA 1917 Material Culture in Chinese History",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1919",
            "course_name": "Problems in The History of Early Modern China",
            "description": "EAST-GA 1919 Problems in The History of Early Modern China",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1996",
            "course_name": "The Japanese Empire",
            "description": "EAST-GA 1996 The Japanese Empire",
            "offering": false
        },
        {
            "course_id": "EAST-GA 1997",
            "course_name": "Post War Japan",
            "description": "EAST-GA 1997 Post War Japan",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2500",
            "course_name": "21St Century Asian City: Archit/Image/Community",
            "description": "EAST-GA 2500 21St Century Asian City: Archit/Image/Community",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2510",
            "course_name": "Law, Film, & Society in East Asia",
            "description": "EAST-GA 2510 Law, Film, & Society in East Asia",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2530",
            "course_name": "Asiatic Mode Production: Theory and History",
            "description": "EAST-GA 2530 Asiatic Mode Production: Theory and History \nInvestigates aspects of the historical interpretation of China in the 19th and 20th centuries, focusing on the genesis and development of one of the most debated and enduring tropes of the historiography of China: the Asiatic mode of production.",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2550",
            "course_name": "Sem in Modern Japanese Literature & Culture",
            "description": "EAST-GA 2550 Sem in Modern Japanese Literature & Culture",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2570",
            "course_name": "",
            "description": "EAST-GA 2570\n\n   Colonialism & Modernism in East Asia\n\nAn exploration into the cultural and intellectual history of modernism in East Asia. Particular attention is given to the relationship between modernism and various East Asian social formations of colonialism. Concepts such as colonial modernity, semicolonialism, and postcolonialism are interrogated through intensive reading both of theoretical work on modernism and colonialism and modernist cultural texts. Although a major emphasis is placed on literary modernism, it is understood as part of a broader historical phenomenon that encompassed artists, philosophers, and other intellectuals. Conte...\n\n      more description for EAST-GA 2570 »\n\n      \n\n\n\nAn exploration into the cultural and intellectual history of modernism in East Asia. Particular attention is given to the relationship between modernism and various East Asian social formations of colonialism. Concepts such as colonial modernity, semicolonialism, and postcolonialism are interrogated through intensive reading both of theoretical work on modernism and colonialism and modernist cultural texts. Although a major emphasis is placed on literary modernism, it is understood as part of a broader historical phenomenon that encompassed artists, philosophers, and other intellectuals. Contemporary essays are juxtaposed with novels and short stories, and, where possible, other media. TheAn exploration into the cultural and intellectual history of modernism in East Asia. Particular attention is given to the relationship between modernism and various East Asian social formations of colonialism. Concepts such as colonial modernity, semicolonialism, and postcolonialism are interrogated through intensive reading both of theoretical work on modernism and colonialism and modernist cultural texts. Although a major emphasis is placed on literary modernism, it is understood as part of a broader historical phenomenon that encompassed artists, philosophers, and other intellectuals. Contemporary essays are juxtaposed with novels and short stories, and, where possible, other media. The course also builds on the recent proliferation of research on modernism in East Asia. Where possible, emphasis is placed on the interconnected nature of modernism in East Asia.\n\n      less description for EAST-GA 2570 «",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2571",
            "course_name": "Anti-Colonialism and Internationalism",
            "description": "EAST-GA 2571 Anti-Colonialism and Internationalism",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2572",
            "course_name": "Contemp Disc in Modern Chinese Intellectual Hst",
            "description": "EAST-GA 2572 Contemp Disc in Modern Chinese Intellectual Hst",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2573",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2290",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 4.55 PM - 7.35 PM",
                    "open": true,
                    "professor": "SILV 413"
                }
            ],
            "course_name": "Print Media & Journalism in China, 1895-1945",
            "description": "EAST-GA 2573 Print Media & Journalism in China, 1895-1945",
            "offering": true
        },
        {
            "course_id": "EAST-GA 2574",
            "course_name": "Modern Korean Historiography",
            "description": "EAST-GA 2574 Modern Korean Historiography",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2600",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19814",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KJCC 717",
                    "time": "Mon 2.00 PM - 4.45 PM",
                    "open": true,
                    "professor": "Karl, Rebecca"
                }
            ],
            "course_name": "The Agrarian Question in Modern History",
            "description": "EAST-GA 2600 The Agrarian Question in Modern History",
            "offering": true
        },
        {
            "course_id": "EAST-GA 2610",
            "course_name": "Global Modernity",
            "description": "EAST-GA 2610 Global Modernity",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2620",
            "course_name": "Post-War East Asian Cinema & Television",
            "description": "EAST-GA 2620 Post-War East Asian Cinema & Television",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2650",
            "course_name": "Spec Topics in Theory",
            "description": "EAST-GA 2650 Spec Topics in Theory",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2700",
            "course_name": "",
            "description": "EAST-GA 2700\n\n   Structures of Modernity\n\nThis course starts with?and aims to rethink?the basic theoretical terms and practical conditions of mass culture and everyday life as definitive of modernity. In part, the course is framed by claims made in new media theory (especially with regard to the advent of digital electronic technologies) and the ways in which new media supposedly are placing us within new world horizons. Modernity, however, is made up of multiple moments of ?new media?; this course provides historical perspective on these moments. Nor does the course assume a technological determinism; in addition to changing relation...\n\n      more description for EAST-GA 2700 »\n\n      \n\n\n\nThis course starts with?and aims to rethink?the basic theoretical terms and practical conditions of mass culture and everyday life as definitive of modernity. In part, the course is framed by claims made in new media theory (especially with regard to the advent of digital electronic technologies) and the ways in which new media supposedly are placing us within new world horizons. Modernity, however, is made up of multiple moments of ?new media?; this course provides historical perspective on these moments. Nor does the course assume a technological determinism; in addition to changing relations between ?new? media (including theatre, film, and animation), it examines the changing structuring of experience in terms of narrative form; architecture; art; and urbanism. One of the unifying concerns, however, is history itself and the ways in which differing material conditions create new visions of, and positions within, history. History, therefore, is one of the means through which new media conditions claim to allow the rethinking of, and critique of, the grounds of modern experience. Emphasis is placed on Japan, but comparative material is drawn from elsewhere in Asia and the West; the context is for the most part global.\n\n      less description for EAST-GA 2700 «",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2707",
            "course_name": "Topics:",
            "description": "EAST-GA 2707 Topics:",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2800",
            "course_name": "Debates in Marxism On Development",
            "description": "EAST-GA 2800 Debates in Marxism On Development",
            "offering": false
        },
        {
            "course_id": "EAST-GA 2917",
            "course_name": "Topics in Lit and Mod Culture",
            "description": "EAST-GA 2917 Topics in Lit and Mod Culture",
            "offering": false
        },
        {
            "course_id": "EAST-GA 3101",
            "course_name": "Narratives of The Novel in Modern East Asia",
            "description": "EAST-GA 3101 Narratives of The Novel in Modern East Asia",
            "offering": false
        },
        {
            "course_id": "EAST-GA 3244",
            "course_name": "Post-War East Asian Screen Culture",
            "description": "EAST-GA 3244 Post-War East Asian Screen Culture",
            "offering": false
        },
        {
            "course_id": "EAST-GA 3501",
            "course_name": "Comp Pol Sem: Democracy in East & South Asia",
            "description": "EAST-GA 3501 Comp Pol Sem: Democracy in East & South Asia",
            "offering": false
        },
        {
            "course_id": "EAST-GA 3610",
            "course_name": "Lit Theory:",
            "description": "EAST-GA 3610 Lit Theory:",
            "offering": false
        },
        {
            "course_id": "EAST-GA 3615",
            "course_name": "Cinema & Modernity: Melodramatic Imagination",
            "description": "EAST-GA 3615 Cinema & Modernity: Melodramatic Imagination",
            "offering": false
        },
        {
            "course_id": "EAST-GA 3616",
            "course_name": "Sem in East Asian Film, Media, & Visual Culture",
            "description": "EAST-GA 3616 Sem in East Asian Film, Media, & Visual Culture",
            "offering": false
        }
    ]
}