{
    "major_id": "ECON-AD",
    "file": "./2015-2016/Economics_(ECON-AD).html",
    "courses": [
        {
            "course_id": "ECON-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12764",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 004",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Nikiforakis, Nikos"
                },
                {},
                {
                    "format": "Seminar",
                    "class_id": "12826",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 004",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Nikiforakis, Nikos"
                },
                {},
                {
                    "format": "Seminar",
                    "class_id": "12833",
                    "section": "003",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 002",
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Paik, Christopher"
                },
                {},
                {},
                {}
            ],
            "course_name": "",
            "description": "ECON-AD  101\n\n   Principles of Microeconomics\n\nThis course offers students an introduction to how economists look at the world and approach problems. It focuses on individual economic decision-makers (households, business firms, and government agencies) and explores how they are linked together and how their decisions shape our economic life. Applications of supply and demand analysis and the role of prices in a market system are explored. Students are also exposed to game theory, the theory of the competitive firm, the idea of market failure, and policy responses. The course relies on cases and examples and incorporates readings from clas...\n\n      more description for ECON-AD  101 »\n\n      \n\n\n\nThis course offers students an introduction to how economists look at the world and approach problems. It focuses on individual economic decision-makers (households, business firms, and government agencies) and explores how they are linked together and how their decisions shape our economic life. Applications of supply and demand analysis and the role of prices in a market system are explored. Students are also exposed to game theory, the theory of the competitive firm, the idea of market failure, and policy responses. The course relies on cases and examples and incorporates readings from classical and contemporary sources to shed light on modern economic principles and their application to solving the problems that face the global economy.\n\n      less description for ECON-AD  101 «",
            "offering": true
        },
        {
            "course_id": "ECON-AD 102",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17855",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 003",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Dave, Chetan"
                }
            ],
            "course_name": "",
            "description": "ECON-AD  102\n\n   Principles of Macroeconomics\n\nThis course offers an introduction to the study aggregate economies in the long and short runs of time. The course begins with a discussion of some basic data used to analyze the relationships between macroeconomic aggregates such as production, inflation, and unemployment. Next, determinants of long run growth in national per capita incomes are discussed followed by a discussion of economic booms and recessions. The course concludes with descriptions of the tensions inherent in the formulation of monetary and fiscal macroeconomic policies and the pitfalls and opportunities afforded to nations...\n\n      more description for ECON-AD  102 »\n\n      \n\n\n\nThis course offers an introduction to the study aggregate economies in the long and short runs of time. The course begins with a discussion of some basic data used to analyze the relationships between macroeconomic aggregates such as production, inflation, and unemployment. Next, determinants of long run growth in national per capita incomes are discussed followed by a discussion of economic booms and recessions. The course concludes with descriptions of the tensions inherent in the formulation of monetary and fiscal macroeconomic policies and the pitfalls and opportunities afforded to nations within the context of an emergent global economy.\n\n      less description for ECON-AD  102 «",
            "offering": true
        },
        {
            "course_id": "ECON-AD 103",
            "course_name": "",
            "description": "ECON-AD  103\n\n   International Economics\n\nExamining both macro and micro aspects of the globalization of world economies, this course begins with the fundamentals of trade: comparative advantage, gains from trade, the price of factors of production, and the implications of labor and capital mobility. The second part of the coursecovers the role of money and finance in global economic activity. Topics include: the roles of the exchange rate; current and capital accounts as key variables in international economic relations;  purchasing power parity and interest rate parity; the international effects of macro policy and government exchan...\n\n      more description for ECON-AD  103 »\n\n      \n\n\n\nExamining both macro and micro aspects of the globalization of world economies, this course begins with the fundamentals of trade: comparative advantage, gains from trade, the price of factors of production, and the implications of labor and capital mobility. The second part of the coursecovers the role of money and finance in global economic activity. Topics include: the roles of the exchange rate; current and capital accounts as key variables in international economic relations;  purchasing power parity and interest rate parity; the international effects of macro policy and government exchange rate policies; the role of oil exports in the world economy; and the role of international economic organizations such as the International Monetary Fund and the World Trade Organization.\n\n      less description for ECON-AD  103 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 104",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12909",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 019",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Blakeslee, David"
                }
            ],
            "course_name": "",
            "description": "ECON-AD  104\n\n   Intermediate Macroeconomics\n\nBuilding on the material in Principles of Macroeconomics, Intermediate Macroeconomics addresses in depth four foundational aspects of macroeconomic theory and policy: (1) theories of exogenous and endogenous growth in per capita incomes; (2) theories of fluctuations in output, employment and other macroeconomic aggregates with a focus on policy and other economic stimuli that can lead to booms and recessions; (3) determinants of inflation including capacity constraints, money, credit and expectations; (4) the aims, objectives and tools of monetary and fiscal policies and their relationship wit...\n\n      more description for ECON-AD  104 »\n\n      \n\n\n\nBuilding on the material in Principles of Macroeconomics, Intermediate Macroeconomics addresses in depth four foundational aspects of macroeconomic theory and policy: (1) theories of exogenous and endogenous growth in per capita incomes; (2) theories of fluctuations in output, employment and other macroeconomic aggregates with a focus on policy and other economic stimuli that can lead to booms and recessions; (3) determinants of inflation including capacity constraints, money, credit and expectations; (4) the aims, objectives and tools of monetary and fiscal policies and their relationship with financial intermediation and its regulation. Students pursuing a specialization in theory must take Advanced Macroeconomics (ECON-AD 306), instead of Intermediate Macroeconomics.\n\n      less description for ECON-AD  104 «",
            "offering": true
        },
        {
            "course_id": "ECON-AD 105",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12853",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "EAST_ADMIN 006",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Cres, Herve"
                },
                {
                    "format": "Seminar",
                    "class_id": "17856",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 003",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Cres, Herve"
                }
            ],
            "course_name": "",
            "description": "ECON-AD  105\n\n   Intermediate Microeconomics\n\nThis course introduces the major concepts and tools of modern microeconomic analysis. We study the manner in which consumers, producers and resource owners, acting through markets, determine the prices and output of goods and the allocation of productive resources. Consumers and producers are viewed as agents with well-defined objectives, choosing optimally under constraints on their resources. The price mechanism is viewed as an institution that disseminates information to decision makers—firms and consumers—and coordinates their behavior. We will study circumstances under which markets\npromo...\n\n      more description for ECON-AD  105 »\n\n      \n\n\n\nThis course introduces the major concepts and tools of modern microeconomic analysis. We study the manner in which consumers, producers and resource owners, acting through markets, determine the prices and output of goods and the allocation of productive resources. Consumers and producers are viewed as agents with well-defined objectives, choosing optimally under constraints on their resources. The price mechanism is viewed as an institution that disseminates information to decision makers—firms and consumers—and coordinates their behavior. We will study circumstances under which markets\npromote an efficient allocation of resources, as well as sources of market failure where the price mechanism can lead to inefficient outcomes. Students pursuing a specialization in theory must take Advanced Microeconomics (ECON-AD 305), instead of Intermediate Microeconomics. Students pursuing a specialization in theory must take Advanced Microeconomics (ECON-AD 305), instead of Intermediate Microeconomics.\n\n      less description for ECON-AD  105 «",
            "offering": true
        },
        {
            "course_id": "ECON-AD 106",
            "course_name": "J Understanding the Financial Crisis",
            "description": "ECON-AD  106J Understanding the Financial Crisis \nThis course examines the root causes of the financial crisis and the ensuing economic recession. We place the crisis in historical context of the Great Depression and of the emerging market financial crises such as those that occurred in Latin American and East Asia. We contrast the European and American experiences. The course allows students to develop an analytical framework to understand the interactions of the housing market, the credit system, and the labor market. The policy responses are analyzed within the context of the political-economic environment.",
            "offering": false
        },
        {
            "course_id": "ECON-AD 198",
            "course_name": "Directed Study",
            "description": "ECON-AD  198 Directed Study",
            "offering": false
        },
        {
            "course_id": "ECON-AD 210",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12802",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 004",
                    "time": "Tue,Thu,Sun 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Noury, Abdul"
                }
            ],
            "course_name": "Introduction to Econometrics",
            "description": "ECON-AD  210 Introduction to Econometrics \nApplication of statistics and economic theory to problems of formulating and estimating models of economic behavior. Matrix algebra is developed as the main tool of analysis in regression. Acquaints students with basic estimation theory and techniques in the regression framework and covers extensions such as specification error tests, heteroskedasticity, errors in variables, and simple time series models. An introduction to simultaneous equation modes and the concept of identification is provided.",
            "offering": true
        },
        {
            "course_id": "ECON-AD 211",
            "course_name": "",
            "description": "ECON-AD  211\n\n   Macroeconomic Policies and Growth\n\nWhy is the average U.S. American or European of today more than ten times richer than the average American or European one hundred years ago? And why is income of the average U.S. American or European of today thirty times higher than the income of the average Sub-Saharan African? What explains “growth miracles” like modern day China? This course reviews data about growth and\ndevelopment, as well as the theories that have been developed in order to explain empirical regularities observed in the data. An exploration of the link\nbetween growth, institutions, and infrastructure, and evaluation of...\n\n      more description for ECON-AD  211 »\n\n      \n\n\n\nWhy is the average U.S. American or European of today more than ten times richer than the average American or European one hundred years ago? And why is income of the average U.S. American or European of today thirty times higher than the income of the average Sub-Saharan African? What explains “growth miracles” like modern day China? This course reviews data about growth and\ndevelopment, as well as the theories that have been developed in order to explain empirical regularities observed in the data. An exploration of the link\nbetween growth, institutions, and infrastructure, and evaluation of what types of policies are more growth-conducive, conclude the course.\n\n      less description for ECON-AD  211 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 213",
            "course_name": "J",
            "description": "ECON-AD  213J\n\n   Economic Development and Urbanization in Africa\n\nThe course focuses on the interactions between the urbanization and economic development processes in sub-Sahara Africa. Similarities and differences between the patterns that have occurred in many of the sub-Saharan economies\nand those of other countries and in other times are discussed. Emphasis is given to the range of factors involved: history, politics, demographics, urban planning, climate change, and economics. Accra is a particularly interesting location for this course as Ghana was the first sub-Saharan country to\nbecome independent following World War II, and its leadership was advis...\n\n      more description for ECON-AD  213J »\n\n      \n\n\n\nThe course focuses on the interactions between the urbanization and economic development processes in sub-Sahara Africa. Similarities and differences between the patterns that have occurred in many of the sub-Saharan economies\nand those of other countries and in other times are discussed. Emphasis is given to the range of factors involved: history, politics, demographics, urban planning, climate change, and economics. Accra is a particularly interesting location for this course as Ghana was the first sub-Saharan country to\nbecome independent following World War II, and its leadership was advised by one of the leading development economists, Nobel Prize winner Arthur Lewis, who gave considerable attention to the role of cities in the development process.\nThe course also considers the important roles played by slavery, the structural adjustment programs, and the colonial urban planning policies drawing out their implications for Ghana's economic development and its urbanization. A number\nof site visits to other cities are included.\n\n      less description for ECON-AD  213J «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 214",
            "course_name": "X Economic History of the Middle East",
            "description": "ECON-AD  214X Economic History of the Middle East \nThe Middle East was the cradle of civilization and one of the most vibrant regions of the world for thousands of years.  Since the middle ages, however, it has been surpassed by Europe in economic performance.  This course explores this reversal in fortune.  Was it due to culture, religion, law, geography, agrarian structure, globalization, or state policy?  What attempts have been made to catch up with the West?  Which have been successful?  How has the history of the Near East compared to that of other parts of the world and what light do those comparisons shed on the region’s experience?",
            "offering": false
        },
        {
            "course_id": "ECON-AD 215",
            "course_name": "Economics of Health",
            "description": "ECON-AD  215 Economics of Health \nDescription to be updated",
            "offering": false
        },
        {
            "course_id": "ECON-AD 216",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12988",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "SOC_SCI 004"
                }
            ],
            "course_name": "",
            "description": "ECON-AD  216\n\n   Labor Economics\n\nThis is a one-semester course on labor economics for undergraduate students. This class will study the various ways that workers and firms interact in labor markets. What factors determine  how much labor individuals supply to the market? What determines labor demand by firms?  How do firms design contracts to provide the right incentives to their workers? What determines wage inequality in the economy? What can insights from labor economics contribute to debates surrounding policies such as immigration reform, welfare reform, and income taxation? The class will expose students to the basic th...\n\n      more description for ECON-AD  216 »\n\n      \n\n\n\nThis is a one-semester course on labor economics for undergraduate students. This class will study the various ways that workers and firms interact in labor markets. What factors determine  how much labor individuals supply to the market? What determines labor demand by firms?  How do firms design contracts to provide the right incentives to their workers? What determines wage inequality in the economy? What can insights from labor economics contribute to debates surrounding policies such as immigration reform, welfare reform, and income taxation? The class will expose students to the basic theoretical models used by economists to tackle these issues. We will also survey evidence from empirical studies on these topics.\n\n      less description for ECON-AD  216 «",
            "offering": true
        },
        {
            "course_id": "ECON-AD 217",
            "course_name": "Technology and Economic Development: Markets and Networks",
            "description": "ECON-AD  217 Technology and Economic Development: Markets and Networks \nThis course will cover topics on the interface between economics and computer science, with special emphasis on issues of importance to economically developing regions.  Students will work in teams to tackle real-world and interdisciplinary problems. Students will address questions of markets and economic development using Information and Communications Technologies for Development (ICTD) techniques in the context of development through visits to NYU field sites in the UAE, Ghana and Ethiopia.",
            "offering": false
        },
        {
            "course_id": "ECON-AD 218",
            "course_name": "J",
            "description": "ECON-AD  218J\n\n   Growth and Development: An Economic Perspective on Argentina’s History\n\nCompared to most other countries the economic development of Argentina has been disastrous in the last 100 years. In 1908 GDP per capita in Argentina was around 80% of GDP per capita in US, where GDP per capita is the value of production divided by the size of the population. One hundred years later, in 2008, GDP per capita in Argentina was around 35% of GDP per capita in US. In the course we aim to understand why the development of Argentina has been so disastrous focussing on economic factors. We will compare Argentina with other countries in order to gain insight into the crucial factors fo...\n\n      more description for ECON-AD  218J »\n\n      \n\n\n\nCompared to most other countries the economic development of Argentina has been disastrous in the last 100 years. In 1908 GDP per capita in Argentina was around 80% of GDP per capita in US, where GDP per capita is the value of production divided by the size of the population. One hundred years later, in 2008, GDP per capita in Argentina was around 35% of GDP per capita in US. In the course we aim to understand why the development of Argentina has been so disastrous focussing on economic factors. We will compare Argentina with other countries in order to gain insight into the crucial factors for economic growth and development. We will first study the history of Argentina with emphasis on its economic development. Next we will go into the mechanisms of growth by studying basic economic theory about supply and demand, production, consumer choice and growth. Using our knowledge about the history of Argentina and economics, we will try to understand some of the main causes of the actual economic development of Argentina. The insights we gain from studying the Argentinian experience will help us understand that economic growth and development are sensitive and delicate phenomena, not just for Argentina but for any country. The course includes excursions to see traces of earlier times and their current impact on Buenos Aires and its culture.\n\n      less description for ECON-AD  218J «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 219",
            "course_name": "",
            "description": "ECON-AD  219\n\n   De Gustibus Non est Disputandum\n\nSo called « non economic » aspects like social interactions, trust, solidarity, fairness, emotions or cultural and social norms become increasingly acknowledged in various important economic and social policy areas like crime, ethnic conflicts, gender, the welfare state and economic development, The purpose of this course is to introduce the basic tools of microeconomic analysis and other fields (sociobiology, evolutionary anthropology, network theory, population dynamics) to such issues, emphasizing the role of endogenous preferences, culture, social norms and social interactions and their im...\n\n      more description for ECON-AD  219 »\n\n      \n\n\n\nSo called « non economic » aspects like social interactions, trust, solidarity, fairness, emotions or cultural and social norms become increasingly acknowledged in various important economic and social policy areas like crime, ethnic conflicts, gender, the welfare state and economic development, The purpose of this course is to introduce the basic tools of microeconomic analysis and other fields (sociobiology, evolutionary anthropology, network theory, population dynamics) to such issues, emphasizing the role of endogenous preferences, culture, social norms and social interactions and their implications for markets, communities and institutions.\n\n      less description for ECON-AD  219 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 220",
            "course_name": "",
            "description": "ECON-AD  220\n\n   Individual Rationality & Collective Action\n\nHow do individuals make decisions? What does it mean to be rational? How do rational individuals behave collectively? Can collective action be efficient? How stable are preferences? \nThis course explores the extent, and limitations, of rationality in individual and collective decision making - both from a positive and normative perspective. It describes and characterizes the interaction between individual and collective choices on the market place and in firms, especially when markets fail. It investigates the interplay between the market mechanism and the democratic principle in the economy. ...\n\n      more description for ECON-AD  220 »\n\n      \n\n\n\nHow do individuals make decisions? What does it mean to be rational? How do rational individuals behave collectively? Can collective action be efficient? How stable are preferences? \nThis course explores the extent, and limitations, of rationality in individual and collective decision making - both from a positive and normative perspective. It describes and characterizes the interaction between individual and collective choices on the market place and in firms, especially when markets fail. It investigates the interplay between the market mechanism and the democratic principle in the economy. \n\nThe course introduces fundamental concepts, methods and paradigms of decision theory, general equilibrium theory and social choice theory. These are illustrated through short cases borrowed from the current economic, political and business scene. It examines how these tools might lead us to make better decisions; both as individuals or members of groups, and enables a better understanding of the dynamics of collective action.\n\n      less description for ECON-AD  220 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 221",
            "course_name": "",
            "description": "ECON-AD  221\n\n   Understanding Financial Crises\n\nThe purpose of this course is to understand the key facts and basic mechanisms concerning financial crises and some related topics. The course will first lay down some foundations by studying empirical evidence about crises as well as the basic crisis mechanisms (bank runs, sovereign default decision, currency collapse). The empirical facts will provide a long run perspective on the recurrence of different types of financial crises (banking crises, currency crises, and sovereign debt crises), and will study their causes, their resolutions, and their long run consequences. The crisis mechanisms...\n\n      more description for ECON-AD  221 »\n\n      \n\n\n\nThe purpose of this course is to understand the key facts and basic mechanisms concerning financial crises and some related topics. The course will first lay down some foundations by studying empirical evidence about crises as well as the basic crisis mechanisms (bank runs, sovereign default decision, currency collapse). The empirical facts will provide a long run perspective on the recurrence of different types of financial crises (banking crises, currency crises, and sovereign debt crises), and will study their causes, their resolutions, and their long run consequences. The crisis mechanisms will be introduced through very simple canonical models, putting the emphasis on intuition and insight over model technicalities. Once the foundations are in place, the course will open up to a series of topics mixing themes – such as crises and long run growth; inequality and crises; crises, stabilization and reforms – and in-depth study of major crises episodes – such as the Great Depression, the US Financial Crises of 2007-2008 and the Euro Crisis.\n\n      less description for ECON-AD  221 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 222",
            "course_name": "",
            "description": "ECON-AD  222\n\n   Experimental Economics\n\nAs a methodological field within the discipline, experimental economics develops laboratory techniques (similar in spirit to those found in the ‘hard sciences’) in the pursuit of two broad ends: to empirically evaluate existing assumptions and theories of economic behavior and to ‘wind tunnel’ test new assumptions, theories and policies. In this course, we will learn how to marry theory with the economists’ laboratory, how to interpret the results of experiments, how to advance economic thinking using those results and how this tool applies equally to individual, group, and aggregate economic ...\n\n      more description for ECON-AD  222 »\n\n      \n\n\n\nAs a methodological field within the discipline, experimental economics develops laboratory techniques (similar in spirit to those found in the ‘hard sciences’) in the pursuit of two broad ends: to empirically evaluate existing assumptions and theories of economic behavior and to ‘wind tunnel’ test new assumptions, theories and policies. In this course, we will learn how to marry theory with the economists’ laboratory, how to interpret the results of experiments, how to advance economic thinking using those results and how this tool applies equally to individual, group, and aggregate economic behavior.\n\n      less description for ECON-AD  222 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 298",
            "course_name": "Internship",
            "description": "ECON-AD  298 Internship",
            "offering": false
        },
        {
            "course_id": "ECON-AD 300",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17865",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 018",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Blakeslee, David"
                }
            ],
            "course_name": "",
            "description": "ECON-AD  300\n\n   Development Economics\n\nThis course covers the roles of factor accumulation, technology, human capital and ideas in the growth process; the political economy of growth; the role of openness to international trade versus international trade barriers; and growth and income inequality. The course provides an overview of foreign aid in the economic development process and the policies of international institutions like the IMF and World Bank. The course also includes: the study of randomized experiments in evaluating aid projects and development interventions; rural land markets; credit markets in imperfect and fragmente...\n\n      more description for ECON-AD  300 »\n\n      \n\n\n\nThis course covers the roles of factor accumulation, technology, human capital and ideas in the growth process; the political economy of growth; the role of openness to international trade versus international trade barriers; and growth and income inequality. The course provides an overview of foreign aid in the economic development process and the policies of international institutions like the IMF and World Bank. The course also includes: the study of randomized experiments in evaluating aid projects and development interventions; rural land markets; credit markets in imperfect and fragmented capital markets; the household migration decision; and nutrition and fertility decisions.\n\n      less description for ECON-AD  300 «",
            "offering": true
        },
        {
            "course_id": "ECON-AD 301",
            "course_name": "Development and Public Policy",
            "description": "ECON-AD  301 Development and Public Policy \nThis course will cover the international aspects of contemporary economic development and poverty reduction in developing countries, including the various dimensions of globalization (trade, migration, capital movements, knowledge transfer, global public goods ...), the potential conflicts of interest between developing and developed countries, the need for global governance and the role of international organizations.",
            "offering": false
        },
        {
            "course_id": "ECON-AD 302",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12767",
                    "section": "001",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": null,
                    "time": "Tue,Thu 12.45 PM - 3.25 PM",
                    "open": true,
                    "professor": "CAMP W008"
                }
            ],
            "course_name": "Foundations of Financial Markets",
            "description": "ECON-AD  302 Foundations of Financial Markets \nThis course offers a rigorous examination of the basic concepts and tools of modern finance. Students are introduced to cash flow analysis and present value, as well as basic concepts of return and risk, in order to understand how financial markets work and how financial instruments are valued. These instruments, including equities, fixed income securities, options, and other derivative securities, become vehicles for exploring various financial markets and their utilization by managers in different kinds of financial institutions to enhance return and manage risk.",
            "offering": true
        },
        {
            "course_id": "ECON-AD 303",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12912",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "SOC_SCI 004",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Hernandez-Lagos, Pablo"
                }
            ],
            "course_name": "Corporate Finance",
            "description": "ECON-AD  303 Corporate Finance \nThis course introduces the student to selected problems and issues in financial management and corporate financial policy. Topics include: capital budgeting (strategy and techniques associated with the analysis and selection of capital projects, financial forecasting, and financial planning) and corporate finance (the cost of capital and issues associated with raising capital, mergers and acquisitions decisions, corporate bankruptcy, managerial control, and compensation strategies). Problem sets and case studies are integral parts\nof this course.",
            "offering": true
        },
        {
            "course_id": "ECON-AD 304",
            "course_name": "",
            "description": "ECON-AD  304\n\n   Behavioral Economics\n\nThis course introduces students to the field of behavioral economics or economic psychology.This is a field which seeks to insert non-standard assumptions about human preferences or beliefs into economic models. These assumptions are often motivated by psychological evidence. Throughout\nthe course, we emphasize the interaction between theoretical predictions and empirical data. We explore various ways in which the predictions of the theory can be tested. The course is organized around four topics: social preferences, intertemporal discounting, prospect theory, and heuristics and biases. The co...\n\n      more description for ECON-AD  304 »\n\n      \n\n\n\nThis course introduces students to the field of behavioral economics or economic psychology.This is a field which seeks to insert non-standard assumptions about human preferences or beliefs into economic models. These assumptions are often motivated by psychological evidence. Throughout\nthe course, we emphasize the interaction between theoretical predictions and empirical data. We explore various ways in which the predictions of the theory can be tested. The course is organized around four topics: social preferences, intertemporal discounting, prospect theory, and heuristics and biases. The course requires a command of basic microeconomic theory and calculus.\nSome familiarity with econometric analysis of microeconomic data is also welcome.\n\n      less description for ECON-AD  304 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 305",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17857",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 004",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Bochet, Olivier"
                }
            ],
            "course_name": "Advanced Microeconomics",
            "description": "ECON-AD  305 Advanced Microeconomics \nBuilding on the foundations laid down in Intermediate Microeconomics, this course provides a thorough treatment of some more advanced questions. The course starts with a careful study of the functioning of markets, culminating with the first and second theorem of welfare economics. The next topics cover an introduction to strategic behavior and game theory, and subsequently a study of market failures situations in the case of adverse selection and moral hazard. This course involves more formal analysis than the one used in Intermediate Microeconomics.",
            "offering": true
        },
        {
            "course_id": "ECON-AD 306",
            "course_name": "Advanced Macroeconomics",
            "description": "ECON-AD  306 Advanced Macroeconomics \nStudy of aggregate economic analysis, with attention paid to the determination of the level of income, employment, and inflation. Critically examines both the theories and the policies associated with them. This course involves more formal analysis than that used in ECON-AD 104.",
            "offering": false
        },
        {
            "course_id": "ECON-AD 310",
            "course_name": "Special Topics in Finance",
            "description": "ECON-AD  310 Special Topics in Finance \nThis course is designed for advanced students in the Finance specialization and will be taught by leading scholars from around the world who are in residence in Abu Dhabi. The content is oriented toward the particular scholar’s expertise. Possible topics include: the analysis of market risk and credit risk management, the valuation of derivative and fixed income securities, the analysis of investment strategies, the structure of financial intermediaries, and the regulation of institutions and markets.",
            "offering": false
        },
        {
            "course_id": "ECON-AD 313",
            "course_name": "",
            "description": "ECON-AD  313\n\n   Cooperative Games and Applications\n\nInternational alliances for the purpose of military defense, partnerships of doctors or lawyers, the Organization of Petroleum Exporting Countries, and the members of clubs or social networks, are all examples of coalitions of agents with only partially converging interests, coordinating actions for their mutual benefit. Modeling the subtle mixture of strategic interactions across those “coalitions”, and equitable compromises within coalitions, is the difficult task of cooperative game theory. The course introduces the formal models of cooperative behavior, both from the normative viewpoint of...\n\n      more description for ECON-AD  313 »\n\n      \n\n\n\nInternational alliances for the purpose of military defense, partnerships of doctors or lawyers, the Organization of Petroleum Exporting Countries, and the members of clubs or social networks, are all examples of coalitions of agents with only partially converging interests, coordinating actions for their mutual benefit. Modeling the subtle mixture of strategic interactions across those “coalitions”, and equitable compromises within coalitions, is the difficult task of cooperative game theory. The course introduces the formal models of cooperative behavior, both from the normative viewpoint of sharing the benefits of cooperation, and the positive analysis of coalition formation. Applications include competitive markets, the provision of local public goods and the emergence of federations, cost sharing of joint ventures, routing games on networks, and more. Prerequisites: Calculus with Applications (MAT-AD 111); Intermediate Microeconomics (ECON-AD 105).  Recommended Policy: Introduction to Game Theory (POLSC-AD 112)\n\n      less description for ECON-AD  313 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 320",
            "course_name": "",
            "description": "ECON-AD  320\n\n   Environmental Economics and Energy Policy\n\nCrosslisted with The Arab Crossroads, Urbanization. This course focuses on the economic analysis of major policy issues in energy and the environment. Emphasis is on market solutions to various problems and market limitations in the allocation of environmental resources. Energy issues focus on: OPEC and world oil markets; taxation and regulation of production and consumption; conservation of natural resources; and the transition to alternative energy sources. Environmental issues include policies to reduce pollution. Substantial attention is paid to global warming as it relates to the consumpt...\n\n      more description for ECON-AD  320 »\n\n      \n\n\n\nCrosslisted with The Arab Crossroads, Urbanization. This course focuses on the economic analysis of major policy issues in energy and the environment. Emphasis is on market solutions to various problems and market limitations in the allocation of environmental resources. Energy issues focus on: OPEC and world oil markets; taxation and regulation of production and consumption; conservation of natural resources; and the transition to alternative energy sources. Environmental issues include policies to reduce pollution. Substantial attention is paid to global warming as it relates to the consumption of fossil fuels.\n\n      less description for ECON-AD  320 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 321",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12910",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": "CAMP W008",
                    "time": "Tue,Thu 12.45 PM - 3.25 PM",
                    "open": true,
                    "professor": "Shyti, Anisa"
                }
            ],
            "course_name": "Introduction to Accounting",
            "description": "ECON-AD  321 Introduction to Accounting \nThis course develops students’ abilities to understand business transactions and financial statements and to determine the most appropriate financial measures for those events. The underlying rationale for accounting practices is discussed and students assess their effectiveness in providing useful information for decision-making. Emphasis is placed on accounting practices that purport to portray corporate financial position, operating results, cash flows, manager performance, and financial strength.",
            "offering": true
        },
        {
            "course_id": "ECON-AD 322",
            "course_name": "",
            "description": "ECON-AD  322\n\n   Public Economics\n\nThis course is about the economic activities of government, largely revenue raising and spending, in a global context. The course considers market failures; the evaluation of public expenditures; and the incidence, efficiency, and effects of various taxes. The primary purpose is to use economic tools (mainly microeconomic) to study the impact of government policy on the distribution of resources. Topics include: welfare economics; public goods and externalities; public choice; important issues of government expenditure, taxation, and activity (e.g., international public goods and institutions,...\n\n      more description for ECON-AD  322 »\n\n      \n\n\n\nThis course is about the economic activities of government, largely revenue raising and spending, in a global context. The course considers market failures; the evaluation of public expenditures; and the incidence, efficiency, and effects of various taxes. The primary purpose is to use economic tools (mainly microeconomic) to study the impact of government policy on the distribution of resources. Topics include: welfare economics; public goods and externalities; public choice; important issues of government expenditure, taxation, and activity (e.g., international public goods and institutions, tax competition and coordination, education, social security and health care); fiscal federalism (including European integration); and mechanisms of political influence (e.g. like elections and lobbying).\n\n      less description for ECON-AD  322 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 323",
            "course_name": "Urban Economics",
            "description": "ECON-AD  323 Urban Economics \nThis course introduces students to the spatial aspects of economics, particularly the economic forces that shape the development of cities and regions. It examines the micro and macroeconomics underlying the structure of cities, why cities exist and why some grow more quickly than others. It also explores the economics of the location decision of individuals, and firms and resulting land-use patterns. Specific problems of urban/regional economies such as poverty, crime, and congestion are covered along with related policies.",
            "offering": false
        },
        {
            "course_id": "ECON-AD 324",
            "course_name": "",
            "description": "ECON-AD  324\n\n   Collective Welfare and Distributive Justice\n\nThis course explores the contribution of macroeconomic analysis to the normative issues surrounding the design of collective decision processes (voting rules, bargaining protocols), and the fair distribution and exploitation of scarce resources through prices or other market mechanisms. Attention is on the rigorous modeling of individual and collective welfare, and the logical difficulties of combining economic efficiency with the requirements of end-state and procedural justice. Applications include the Gini and other inequality indices, the Borda and Condorcet voting rules, the design of tax...\n\n      more description for ECON-AD  324 »\n\n      \n\n\n\nThis course explores the contribution of macroeconomic analysis to the normative issues surrounding the design of collective decision processes (voting rules, bargaining protocols), and the fair distribution and exploitation of scarce resources through prices or other market mechanisms. Attention is on the rigorous modeling of individual and collective welfare, and the logical difficulties of combining economic efficiency with the requirements of end-state and procedural justice. Applications include the Gini and other inequality indices, the Borda and Condorcet voting rules, the design of tax schedules,fair division of an inheritance, overcoming the tragedy of the commons, and more.\n\n      less description for ECON-AD  324 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 325",
            "course_name": "J",
            "description": "ECON-AD  325J\n\n   Euro-American Financial System in Crisis\n\nModern European and American finance has evolved into a highly liberalized, interconnected, and globalized system that depends on markets and banks as intermediaries between users and suppliers of capital. The system has recently suffered two extraordinary shocks -- the collapse of the mortgage finance market and the \"vicious downward cycle\" caused by linkages between bank and sovereign creditworthiness. These shocks, which have thrown the Euro-American economies into a protracted Great Recession, threaten the euro and the European Union, and represent great challenges to US and European gover...\n\n      more description for ECON-AD  325J »\n\n      \n\n\n\nModern European and American finance has evolved into a highly liberalized, interconnected, and globalized system that depends on markets and banks as intermediaries between users and suppliers of capital. The system has recently suffered two extraordinary shocks -- the collapse of the mortgage finance market and the \"vicious downward cycle\" caused by linkages between bank and sovereign creditworthiness. These shocks, which have thrown the Euro-American economies into a protracted Great Recession, threaten the euro and the European Union, and represent great challenges to US and European governments, financial institutions and their regulators. The German government, based in Berlin is a key decision maker in the efforts to stabilize the euro, the weaker Eurozone member countries and the European banking system, and the European Central Bank, another key player, is not far away in Frankfurt. This course provides a broad ranging exploration of these issues for students with only general knowledge of finance and economics.\n\n      less description for ECON-AD  325J «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 352",
            "course_name": "",
            "description": "ECON-AD  352\n\n   Global Banking and Financial Markets\n\nThe dynamics of the global banking and financial sector are central to economic performance and growth, and from time to time, financial markets and institutions are the scene of great turbulence. This course explores the process of national and global financial intermediation and its key elements involving commercial banking, investment banking, asset management and insurance. Individual classes deal with such topics as project finance, debt and equity new issues, mergers and acquisitions, financial derivatives and institutional funds management. Based on an understanding of the industry, add...\n\n      more description for ECON-AD  352 »\n\n      \n\n\n\nThe dynamics of the global banking and financial sector are central to economic performance and growth, and from time to time, financial markets and institutions are the scene of great turbulence. This course explores the process of national and global financial intermediation and its key elements involving commercial banking, investment banking, asset management and insurance. Individual classes deal with such topics as project finance, debt and equity new issues, mergers and acquisitions, financial derivatives and institutional funds management. Based on an understanding of the industry, additional classes will focus on financial regulation and strategies of financial firms. The course is relatively non-technical and is intended to provide a broad-gauge overview of the global financial sector.\n\n      less description for ECON-AD  352 «",
            "offering": false
        },
        {
            "course_id": "ECON-AD 400",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12840",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 004",
                    "time": "Sun 5.00 PM - 8.00 PM",
                    "open": true,
                    "professor": "Malik, Samreen"
                },
                {
                    "format": "Seminar",
                    "class_id": "12852",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 004",
                    "time": "Mon 5.00 PM - 8.00 PM",
                    "open": true,
                    "professor": "Siga, Lucas"
                }
            ],
            "course_name": "Senior Capstone Research Project",
            "description": "ECON-AD  400 Senior Capstone Research Project \nThe two-semester seminar is designed to provide a capstone experience. Students work closely with faculty and fellow students to learn how to apply economic reasoning to human problems. Students will write several short policy papers and present them to classmates for review; they will also produce longer senior theses.",
            "offering": true
        },
        {
            "course_id": "ECON-AD 401",
            "course_name": "Senior Capstone Research Project",
            "description": "ECON-AD  401 Senior Capstone Research Project \nThe two-semester seminar is designed to provide a capstone experience. Students work closely with faculty and fellow students to learn how to apply economic reasoning to human problems. Students will write several short policy papers and present them to classmates for review; they will also produce longer senior theses.",
            "offering": false
        }
    ]
}