{
    "major_id": "ECON-SHU",
    "file": "./2015-2016/Economics_(ECON-SHU).html",
    "courses": [
        {
            "course_id": "ECON-SHU 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19769",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "19770",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Principles of Macroeconomics",
            "description": "ECON-SHU    1 Principles of Macroeconomics \nFocuses on the economy as a whole (the \"macroeconomy\"). Begins with the meaning and measurement of important macroeconomic data (on unemployment, inflation, and production), then turns to the behavior of the overall economy. Topics include long-run economic growth and the standard of living; the causes and consequences of economic booms and recessions; the banking system and the Federal Reserve; the stock and bond markets; and the role of government policy.",
            "offering": true
        },
        {
            "course_id": "ECON-SHU 2",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19822",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "19823",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Principles of Microeconomics",
            "description": "ECON-SHU    2 Principles of Microeconomics \nFocuses on individual economic decision-makers—households, business firms, and government agencies—and how they are linked together. The emphasis is on decision making by households and firms and how these decisions shape our economic life. Explores the different environments in which businesses sell their products, hire workers, and raise funds to expand their operations; the economic effects of trade between nations; and the effects of various government policies, such as minimum-wage legislation, rent controls, antitrust laws, and more.",
            "offering": true
        },
        {
            "course_id": "ECON-SHU 10",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19771",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "19772",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Intermediate Microeconomics",
            "description": "ECON-SHU   10 Intermediate Microeconomics \nRigorous examination of consumer choice, profit-maximizing behavior on the part of firms, and equilibrium in product markets. Topics include choice under uncertainty, strategic interactions between firms in noncompetitive environments, intertemporal decision making, and investment in public goods.  Prerequisites: Principles of Microeconomics or Microeconomics for Business or for students who entered NYU-SH pre Fall 2015 Microeconomics and either Calculus or Mathematics for Economics.",
            "offering": true
        },
        {
            "course_id": "ECON-SHU 150",
            "course_name": "Microeconomics",
            "description": "ECON-SHU  150 Microeconomics \nBasic microeconomic principles: applications of supply and demand analysis; consumer choice; theory of the firm under perfect and imperfect competition; game theory and strategy; and theory and policy issues in market imperfections, such as monopoly and antitrust, externalities and regulation, imperfect information and regulation, income distribution, etc. Prerequisite: MATH-SHU 121 or 201",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 201",
            "course_name": "Mathematics for Economists",
            "description": "ECON-SHU  201 Mathematics for Economists \nThis course explores applications of calculus to basic differential equations and functions of several variables, which arise in virtually all fields of applied mathematics​ including Economics​. Topics addressed include first and second-­‐order differential equations, surface and line integrals, divergence, gradient, curl, and the theorems of Gauss, Green, and Stokes.  Prerequisite: Placement via NYUSH mathematics placement exam or grade of C or better in MATH-SHU 121.",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 202",
            "course_name": "Intermediate Macroeconomics",
            "description": "ECON-SHU  202 Intermediate Macroeconomics \nStudy of aggregate economic analysis with special attention paid to the determination of the level of income, employment, and inflation. Critically examines both the theories and the policies associated with them. Prerequisites: ECON-150 & 201",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 203",
            "course_name": "",
            "description": "ECON-SHU  203\n\n   History of Economic Thought\n\nBegins with a short introduction to mercantilism, then moves to the classical school, examining the contributions of its main figures (Smith, Malthus, Ricardo, Mill, and others). Ends with Marx’s reaction to classical doctrines and the Marginalist Revolution of the late 19th century, which set the foundation of modern neoclassical economics. Conceptually, covers a variety of topics but focuses on two main entities: first, the normative aspects of the debate on the factors determining the value of commodities and the related issue of the principles that ought to govern the allocation of wealth;...\n\n      more description for ECON-SHU  203 »\n\n      \n\n\n\nBegins with a short introduction to mercantilism, then moves to the classical school, examining the contributions of its main figures (Smith, Malthus, Ricardo, Mill, and others). Ends with Marx’s reaction to classical doctrines and the Marginalist Revolution of the late 19th century, which set the foundation of modern neoclassical economics. Conceptually, covers a variety of topics but focuses on two main entities: first, the normative aspects of the debate on the factors determining the value of commodities and the related issue of the principles that ought to govern the allocation of wealth; and second, various theories of economic growth and historical change, including predictions made on the future of capitalism. Prerequisite: ECON-150\n\n      less description for ECON-SHU  203 «",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 204",
            "course_name": "Ethics and Economics",
            "description": "ECON-SHU  204 Ethics and Economics \nStudy of the interface between ethical and economic theories. Specific topics covered include a brief overview of various ethical ideas, an analysis of the ethical presuppositions of modern economic theory (especially welfare economics), utilitarian ethics, the moral status of free exchange, the ethical implications of imperfect knowledge between bargaining parties, cost-benefit analysis and human rights, the economic content of the “general welfare,” and laissez-faire. Prerequisite: ECON-150",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 205",
            "course_name": "Poverty and Income Distribution",
            "description": "ECON-SHU  205 Poverty and Income Distribution \nDefines poverty and welfare. Analyzes who the poor are, why some people are rich and others poor, equality of opportunity, income and status, inequality, trends in the degree of inequality, government’s role in income distribution, and international comparisons of inequality. Prerequisite: ECON-150",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 206",
            "course_name": "",
            "description": "ECON-SHU  206\n\n   Economics of Energy and the Environment\n\nEconomic analysis of major policy issues in energy and the environment, both domestic and international. Emphasis on market solutions to various problems and market limitations in the allocation of environmental resources. Energy issues focus on OPEC and world oil markets, with attention to reducing oil import vulnerability; taxation and regulation of production and consumption; conservation of natural resources; and the transition to alternative energy sources. Environmental issues include policies to reduce pollution. Substantial attention is paid to global warming caused by consumption of f...\n\n      more description for ECON-SHU  206 »\n\n      \n\n\n\nEconomic analysis of major policy issues in energy and the environment, both domestic and international. Emphasis on market solutions to various problems and market limitations in the allocation of environmental resources. Energy issues focus on OPEC and world oil markets, with attention to reducing oil import vulnerability; taxation and regulation of production and consumption; conservation of natural resources; and the transition to alternative energy sources. Environmental issues include policies to reduce pollution. Substantial attention is paid to global warming caused by consumption of fossil fuels. Prerequisite: ECON-150.\n\n      less description for ECON-SHU  206 «",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 207",
            "course_name": "Urban Economics",
            "description": "ECON-SHU  207 Urban Economics \nThe city as an economic organization. Urbanization trends, functional specialization, and the nature of growth within the city; organization of economic activity within the city and its outlying areas, the organization of the labor market, and problems of urban poverty; the urban public economy; housing and land-use problems; transportation problems; and special problems within the public sector. Prerequisite: ECON-150",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 208",
            "course_name": "Money and Banking",
            "description": "ECON-SHU  208 Money and Banking \nMoney supply; banking as an industry; banks as suppliers of money; the Federal Reserve System and monetary control; monetary theory; and contemporary monetary policy issues. Prerequisite: ECON-150.",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 209",
            "course_name": "Financial Crises",
            "description": "ECON-SHU  209 Financial Crises \nThis course will allow students to understand the origin and evolution of financial crises. Various policy options that may prevent and mitigate financial crises and the restructuring of the global financial architecture to prevent or limit future crises will be examined. Although the course will focus mostly on the US and on the most recent financial crisis, it will also examine earlier financial crises in the US (such as the Great Depression) and past financial bubbles such as the 17th century Dutch Tulip mania and the 1997 Asian crisis. Prerequisite: ECON-150.",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 212",
            "course_name": "",
            "description": "ECON-SHU  212\n\n   Contemporary Chinese Economic Issues\n\nThis course presents a practical and timely overview of the dynamic set of issues related to the major, ongoing changes in the Chinese economy and their effects both in China and abroad. Topics of discussion cover major issues on the macroeconomic, microeconomic, and political-economical front in China today: what China has done and where it is going, China’s coming onto the world economic stage, market entry and access issues, dealing with important cultural issues, moving goods and capital around China, the “winners” and “losers” coming out of the reform, the ongoing process of China’s trans...\n\n      more description for ECON-SHU  212 »\n\n      \n\n\n\nThis course presents a practical and timely overview of the dynamic set of issues related to the major, ongoing changes in the Chinese economy and their effects both in China and abroad. Topics of discussion cover major issues on the macroeconomic, microeconomic, and political-economical front in China today: what China has done and where it is going, China’s coming onto the world economic stage, market entry and access issues, dealing with important cultural issues, moving goods and capital around China, the “winners” and “losers” coming out of the reform, the ongoing process of China’s transition from a primarily agricultural to a primarily industrial/service economy, protecting trade secrets, and other key issues. The readings are meant to be a background to build knowledge, and as this will be structured as a seminar, students are encouraged and graded on their active class participation and address issues of personal interest regarding the Chinese economy. Prerequisite: ECON-202.\n\n      less description for ECON-SHU  212 «",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 213",
            "course_name": "",
            "description": "ECON-SHU  213\n\n   Causal Inference in the Social Sciences\n\nQuestions that have answers in data are called empirically verifiable questions. That is, instead of debating based on logic, anecdotes, past experiences and personal beliefs, we can collect and carefully analyze large amounts of data on what people really did, thought, felt and obtained, to find out what really happened. \nSome causal questions are worth billions of tax-payer dollars. For example, do class size reductions boost student achievement? Does universal childcare improve child development? \nSome causal questions often cause heated social debates. For example, does increasing economic...\n\n      more description for ECON-SHU  213 »\n\n      \n\n\n\nQuestions that have answers in data are called empirically verifiable questions. That is, instead of debating based on logic, anecdotes, past experiences and personal beliefs, we can collect and carefully analyze large amounts of data on what people really did, thought, felt and obtained, to find out what really happened. \nSome causal questions are worth billions of tax-payer dollars. For example, do class size reductions boost student achievement? Does universal childcare improve child development? \nSome causal questions often cause heated social debates. For example, does increasing economic inequality hurt economic growth? Does proliferation of fast food restaurants cause obesity?\nSome causal questions are of personal interest. For example, do tall people get paid more? How much does beauty help one’s career? Do job market outcomes depend on individual names?\nTo design effective policy interventions, to guide meaningful debates on many important social issues, to discover the actual experiences of people of different height, beauty and ethnicity, evidence needs to be credible. \nThe tools introduced in this course will help you become a qualified detective when investigating causal questions related to political, social, economic and business phenomena with data. Students will learn how to interpret, design, and execute empirical research using Stata software.\nPre-requisites: None\n\n      less description for ECON-SHU  213 «",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 1",
            "course_name": "| ECON-SHU  250",
            "description": "ECON-SHU    1 | ECON-SHU  250\n\n   Economics of Global Business for Econ\n\nThis course, intended for Economics students, examines the forces driving toward globalization: the integration of national business activities into globally competitive markets. International trade is a key driver of global integration. The role of comparative advantage as a determinant of the location of production is examined. Also examined are the reasons for and effects of government policies that create impediments to international trade. The second part of the course surveys the role of money and finance in global economic activity. The role of exchange rates as key variables in global ...\n\n      more description for ECON-SHU    1 | ECON-SHU  250 »\n\n      \n\n\n\nThis course, intended for Economics students, examines the forces driving toward globalization: the integration of national business activities into globally competitive markets. International trade is a key driver of global integration. The role of comparative advantage as a determinant of the location of production is examined. Also examined are the reasons for and effects of government policies that create impediments to international trade. The second part of the course surveys the role of money and finance in global economic activity. The role of exchange rates as key variables in global finance is introduced. Also examined is the role of government policies toward the foreign exchange market, including the choice between fixed and floating exchange rates and the use of exchange controls to create impediments to currency exchanges. The course also introduces the concept of foreign direct investment and discusses the rising importance of multinational corporations. Prerequisite: ECON-150.\n\n      less description for ECON-SHU    1 | ECON-SHU  250 «",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 251",
            "course_name": "",
            "description": "ECON-SHU  251\n\n   Economics of Global Business\n\nThe objective of this course is to provide future decision-makers with a systematic understanding of critical aspects of economic development and the global business environment.  We will examine the basic workings of the national economies (macroeconomics) and then explain the role of international trade and international finance.  We show how the forces of globalization affect international business, down to the impact on the future careers of NYU students.  The challenges presented by tepid economic growth in Europe, a soft landing in China, and the changing dynamics in the US, and the long...\n\n      more description for ECON-SHU  251 »\n\n      \n\n\n\nThe objective of this course is to provide future decision-makers with a systematic understanding of critical aspects of economic development and the global business environment.  We will examine the basic workings of the national economies (macroeconomics) and then explain the role of international trade and international finance.  We show how the forces of globalization affect international business, down to the impact on the future careers of NYU students.  The challenges presented by tepid economic growth in Europe, a soft landing in China, and the changing dynamics in the US, and the long run prospects for global economic growth and development are discussed\nThe course is divided into three parts:\t\n•         Part I Understanding the modern macro economy. An understanding of the modern macro economy is essential in order to look at the relationships among countries.  We start by defining the measures that characterize evolving economic well-being, from economic growth to inflation and income distribution. We examine how the economy grows in the long term and the role of productivity. We focus on the business cycle and how fiscal and monetary policies affect the economy in the short run and long run. Finally, we explore the role of banks and central breaks and the importance of financial stability and the consequences of financial crises.\n•\tPart II Trade and trade policy. As international trade plays a central role in fostering globalization, we start with an examination of the economics of international trade in goods and services. We examine the role of comparative advantage as a determinant of the location of production and the direction of trade. We also examine the reasons for and effects of government policies that create impediments to international trade. We show the impact of tariff and subsidies on real life situations, such as the agricultural barriers in Europe and the effect of the MTA on Chinese exports.\n•\tPart III Exchange rates, international finance, crises and development. The final module addresses the role of money and finance in an international context.  We start with the Balance of Payments and macroeconomics of international financial flows.  We then turn to the role of exchange rates in international finance and explore the factors that determine exchange rates such as inflation, growth and interest rates. Government exchange rate policies and the choice between fixed and flexible exchange rates are examined. We discuss the impact of the non-convertibility of the yuan, we ask when a monetary union such as the Euro area makes sense and discuss whether the Euro will survive.   \nIn short, Economics of Global Business provides NYU students with an overview of global economic issues.  It serves as the basis for the International Studies Project and is a guide for many elective courses in international business and economics.\nPre-requisite: ECON-SHU 150\n\n      less description for ECON-SHU  251 «",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 255",
            "course_name": "",
            "description": "ECON-SHU  255\n\n   Economic Development\n\nStudies the problem of economic underdevelopment, with special reference to the countries of Asia, Latin America, and Africa. The building blocks of economic theory are used to understand the historical experiences of these countries. Macroeconomic topics covered include economic growth, income distribution, and poverty, with particular emphasis on the concept of underdevelopment as a circular, self-reinforcing trap. Microeconomic topics include the study of particular markets that are especially relevant to developing countries: those for land, labor, and credit. Notions of market fragmentati...\n\n      more description for ECON-SHU  255 »\n\n      \n\n\n\nStudies the problem of economic underdevelopment, with special reference to the countries of Asia, Latin America, and Africa. The building blocks of economic theory are used to understand the historical experiences of these countries. Macroeconomic topics covered include economic growth, income distribution, and poverty, with particular emphasis on the concept of underdevelopment as a circular, self-reinforcing trap. Microeconomic topics include the study of particular markets that are especially relevant to developing countries: those for land, labor, and credit. Notions of market fragmentation, limited information, and incentive problems receive emphasis. Ends with international issues: trading patterns, capital flows, and global financial crises are studied from the viewpoint of developing countries. Prerequisite: ECON-150.\n\n      less description for ECON-SHU  255 «",
            "offering": false
        },
        {
            "course_id": "ECON-SHU 301",
            "course_name": "Econometrics",
            "description": "ECON-SHU  301 Econometrics \nExamines a number of important areas of econometrics. The topics covered include identification and estimation of simultaneous equations models; model specification and testing; estimation of discrete choice models; and the analysis of duration models. In addition to covering the relevant theoretical issues, the course includes the application of these methods to economic data. Prerequisite: ECON-201.",
            "offering": false
        }
    ]
}