{
    "major_id": "EDUC-AD",
    "file": "./2015-2016/Education_(EDUC-AD).html",
    "courses": [
        {
            "course_id": "EDUC-AD 110",
            "course_name": "Introduction to Education",
            "description": "EDUC-AD  110 Introduction to Education \nThis course examines the relationship between education and other social institutions in comparative context across national borders. What is the purpose of “school” and how has it be defined and redefined over time and in various cultures? Considers such educational ideas as IQ, merit, curriculum, tracking, equal access, and learning, as well as the bureaucratic organization of education. Analyzes the role of teachers, their expectations, and how they interact with students—particularly those of different genders, classes, and ethnic groups.",
            "offering": false
        },
        {
            "course_id": "EDUC-AD 112",
            "course_name": "",
            "description": "EDUC-AD  112\n\n   International Perspectives on Gender and Education\n\nThe course provides an overview of major discussions and debates relative to gender and education in both “developed” and “developing” countries, and examines theoretical understandings of gender, and the intersection of gender, schooling, and global social justice. Key issues to be considered include: gender and education internationally, specifically the educational status of girls and women; empowerment and education; the role of boys and men in promoting gender equality; and the role of international donor agencies, the State, and NGOs. The course concludes by studying the role of teachers...\n\n      more description for EDUC-AD  112 »\n\n      \n\n\n\nThe course provides an overview of major discussions and debates relative to gender and education in both “developed” and “developing” countries, and examines theoretical understandings of gender, and the intersection of gender, schooling, and global social justice. Key issues to be considered include: gender and education internationally, specifically the educational status of girls and women; empowerment and education; the role of boys and men in promoting gender equality; and the role of international donor agencies, the State, and NGOs. The course concludes by studying the role of teachers and innovative educational programs.\n\n      less description for EDUC-AD  112 «",
            "offering": false
        },
        {
            "course_id": "EDUC-AD 113",
            "course_name": "Schooling in Diverse Societies",
            "description": "EDUC-AD  113 Schooling in Diverse Societies \nThe course compares the way that contemporary societies have addressed differences of race, ethnicity, religion, and gender in their educational systems. We place special emphasis upon history, exploring how these societies have changed across time. At the end of the course, we ask how they might instruct each other in a newly globalized world of flux, exchange, and danger.",
            "offering": false
        },
        {
            "course_id": "EDUC-AD 114",
            "course_name": "JX",
            "description": "EDUC-AD  114JX\n\n   Education and Diversity: Historical and Comparative Perspectives\n\nThis course compares the way that contemporary societies have addressed differences of race, ethnicity, class, religion, and gender in their state educational systems. We examine these questions through the lens of history, exploring how these societies—and their schools—have changed across\ntime. We place special emphasis upon education in the U.A.E., interspersing our classes with site visits to schools, state agencies, and non-governmental\norganizations. At the end of the course, we ask what other national school systems might learn from the U.A.E.—and vice versa—in a globalizing world of fl...\n\n      more description for EDUC-AD  114JX »\n\n      \n\n\n\nThis course compares the way that contemporary societies have addressed differences of race, ethnicity, class, religion, and gender in their state educational systems. We examine these questions through the lens of history, exploring how these societies—and their schools—have changed across\ntime. We place special emphasis upon education in the U.A.E., interspersing our classes with site visits to schools, state agencies, and non-governmental\norganizations. At the end of the course, we ask what other national school systems might learn from the U.A.E.—and vice versa—in a globalizing world of flux, opportunity, and danger.\n\n      less description for EDUC-AD  114JX «",
            "offering": false
        },
        {
            "course_id": "EDUC-AD 115",
            "course_name": "J",
            "description": "EDUC-AD  115J\n\n   International Peacebuilding and the Role of Education\n\nThis J-Term course explores how state and nonstate actors pursue peace and security, and the role of education in this process. We explore international peacebuilding, including peacekeeping, institution building, and humanitarian aid. We examine how specific education initiatives such as peace education, education for democracy, Education for All, and citizenship education fit into these strategies. We also examine how education may be used to disrupt peacebuilding. Case studies may include Syria, Afghanistan, Israel/Palestine, Guatemala, UAE, and the United States. Guest speakers will be inv...\n\n      more description for EDUC-AD  115J »\n\n      \n\n\n\nThis J-Term course explores how state and nonstate actors pursue peace and security, and the role of education in this process. We explore international peacebuilding, including peacekeeping, institution building, and humanitarian aid. We examine how specific education initiatives such as peace education, education for democracy, Education for All, and citizenship education fit into these strategies. We also examine how education may be used to disrupt peacebuilding. Case studies may include Syria, Afghanistan, Israel/Palestine, Guatemala, UAE, and the United States. Guest speakers will be invited from relevant organizations to speak about their responsibilities; students will prepare questions to interview the guests.\n\n      less description for EDUC-AD  115J «",
            "offering": false
        },
        {
            "course_id": "EDUC-AD 116",
            "course_name": "J",
            "description": "EDUC-AD  116J\n\n   Inequality and Education\n\nThe course will examine how schools are implicated in the reproduction of inequality in countries throughout the world.  Although policy makers often regard education as a means to promote greater equality and opportunity, empirical evidence suggests that more often than not, a child’s background predicts how well they will perform in school and what types of employment opportunities will be available to them later in life.  However, some nations do a better job than others in using education to expand opportunity.  Understanding why some nations continue to have schools that struggle in their...\n\n      more description for EDUC-AD  116J »\n\n      \n\n\n\nThe course will examine how schools are implicated in the reproduction of inequality in countries throughout the world.  Although policy makers often regard education as a means to promote greater equality and opportunity, empirical evidence suggests that more often than not, a child’s background predicts how well they will perform in school and what types of employment opportunities will be available to them later in life.  However, some nations do a better job than others in using education to expand opportunity.  Understanding why some nations continue to have schools that struggle in their efforts to serve minorities and the poor children, and why other nations are experiencing greater success in this endeavor is the central aim of this course.  We will also consider the ways in which teachers, students, parents and their allies, have used educational settings and the educational process as a focal point for resistance to social and cultural reproduction, and various forms of oppression and discrimination. The role of social identities related to class, race, language and ethnicity in shaping the experiences of students and teachers in the reproduction process, will be a primary focus of the course readings and class discussions.\n\n      less description for EDUC-AD  116J «",
            "offering": false
        },
        {
            "course_id": "EDUC-AD 117",
            "course_name": "J",
            "description": "EDUC-AD  117J\n\n   Teaching the Nation: Education and Nationalism in Modern China\n\nThis course explores how China has developed and transmitted nationalism through a range of educational institutions: schools, universities, museums, stadiums, and mass-media outlets. In course readings and papers, we will examine how the meanings of “nation” in China shifted across the past century. We will also intersperse our classes with visits to schools and other educational sites, to study contemporary trends and dilemmas in the teaching of nationalism. At the end of the course, we will ask what other national school systems might learn from China—and vice versa—in a globalizing world o...\n\n      more description for EDUC-AD  117J »\n\n      \n\n\n\nThis course explores how China has developed and transmitted nationalism through a range of educational institutions: schools, universities, museums, stadiums, and mass-media outlets. In course readings and papers, we will examine how the meanings of “nation” in China shifted across the past century. We will also intersperse our classes with visits to schools and other educational sites, to study contemporary trends and dilemmas in the teaching of nationalism. At the end of the course, we will ask what other national school systems might learn from China—and vice versa—in a globalizing world of flux, danger, and opportunity.\n\n      less description for EDUC-AD  117J «",
            "offering": false
        }
    ]
}