{
    "major_id": "FILMM-AD",
    "file": "./2015-2016/Film_&_Media_(FILMM-AD).html",
    "courses": [
        {
            "course_id": "FILMM-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12799",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 104",
                    "time": "Mon,Wed 9.15 AM - 11.55 AM",
                    "open": true,
                    "professor": "Savio, Joanne"
                }
            ],
            "course_name": "",
            "description": "FILMM-AD  101\n\n   Sound, Image, and Story\n\nAn intensive and practical production workshop introducing the fundamental principles of storytelling through sound, image, and visual sequencing. Using stills and video, integrating theory and practice, students learn the essentials of cinematic language from composition to editing. Themes of Sense of Place, Portrait, and Memoir are explored in the context of projects assigned. Diegetic and non-diegetic sound, and/or voiceover supplement the visual storytelling. Students work individually and in collaboration. Goals of the course include an understanding of professional protocol and the dialo...\n\n      more description for FILMM-AD  101 »\n\n      \n\n\n\nAn intensive and practical production workshop introducing the fundamental principles of storytelling through sound, image, and visual sequencing. Using stills and video, integrating theory and practice, students learn the essentials of cinematic language from composition to editing. Themes of Sense of Place, Portrait, and Memoir are explored in the context of projects assigned. Diegetic and non-diegetic sound, and/or voiceover supplement the visual storytelling. Students work individually and in collaboration. Goals of the course include an understanding of professional protocol and the dialogue of critique. Four lab sessions outside of class are mandatory.\n\n      less description for FILMM-AD  101 «",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 102",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19845",
                    "section": "001",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": "ARTS_CENT 025 with Choi, Douglas; Lennon, Rich; Ahl, Matthew08/30/2015 - 10/20/2015 Thu 3.35 PM - 4.50 PM at ARTS_CENT 025",
                    "time": "Tue 2.10 PM - 4.50 PM",
                    "open": true,
                    "professor": "Choi, Douglas; Lennon, Rich; Ahl, Matthew"
                }
            ],
            "course_name": "Techniques for Safety and Production",
            "description": "FILMM-AD  102 Techniques for Safety and Production \nFilm Production is collaboration between highly specialized crafts. You will learn how to operate safely in multiple hands-on production scenarios. The goal is to learn to protect yourselves and the tools you are given. With these skills at your disposal, you will move into methods for executing creative choices from a technical perspective. By the end of the course, you will have abilities that not only allow you to operate safely and productively, but also allow for artistic growth and flexibility.",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 103",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17185",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 104 with Jeong, Seung-Hoon08/30/2015 - 12/17/2015 Mon 7.00 PM - 9.00 PM at ARTS_CENT 014",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Jeong, Seung-Hoon"
                }
            ],
            "course_name": "Concepts in Film and New Media | Concepts of Film and New Media",
            "description": "FILMM-AD  103 Concepts in Film and New Media | Concepts of Film and New Media \nAn introduction to basic concepts in film and new media studies. The course provides an overview of the historical development of film as an art, technology, and industry and the role of new media as an extension to and reinvention of models for production, distribution, exhibition, and reception. Stu-dents are introduced to documentary, experimental, and narratives modes within different historical and cultural contexts, comparative aesthetics, and the lines of critical enquiry that have been devel-oped for film and new media in dialogue with other fields in the arts and humanities.",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 104",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12906",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 045 with Hudson, Dale08/30/2015 - 12/17/2015 Sun 5.00 PM - 9.00 PM at COMP_RES 017",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Hudson, Dale"
                }
            ],
            "course_name": "X",
            "description": "FILMM-AD  104X\n\n   Understanding MENASA Film and New Media\n\nThis course introduces students to the rich and diverse history of film within the Middle East, North Africa, and South Asia (MENASA) regions as a background for understanding some of the complexities of contemporary film and new media in the UAE.  By examining pre-cinematic artistic practices, aesthetic traditions, cinematic styles, political economies of media, and social change, the course provides a context for understanding productions from major industries in Cairo, Chennai, and Mumbai alongside work by independent filmmakers and new media collectives from throughout the regions.  Studen...\n\n      more description for FILMM-AD  104X »\n\n      \n\n\n\nThis course introduces students to the rich and diverse history of film within the Middle East, North Africa, and South Asia (MENASA) regions as a background for understanding some of the complexities of contemporary film and new media in the UAE.  By examining pre-cinematic artistic practices, aesthetic traditions, cinematic styles, political economies of media, and social change, the course provides a context for understanding productions from major industries in Cairo, Chennai, and Mumbai alongside work by independent filmmakers and new media collectives from throughout the regions.  Students are encouraged to attend film festivals and engage in original research with the NYUAD Library special collection of MENASA film.\n\n      less description for FILMM-AD  104X «",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 105",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17184",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 124",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Gross, Larry"
                }
            ],
            "course_name": "Forms of Writing for Film and New Media",
            "description": "FILMM-AD  105 Forms of Writing for Film and New Media \nWhether narrative or non-narrative, the visceral, emotional, and intellectual power of film and new media depends on understanding the sounds and images within the context of conventions and expectations. This course analyzes and puts into practice principles of different forms of dramatic and dynamic writing: classical, episodic, and parametric in narrative and documentary; rhythmic and contrapuntal in experimental film; episodes and attractions for web platforms; interactive and auto-generative in new media. Writing assignments include both critical analyses and creative exercises.",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 106",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19844",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 016 with Katz, Amos08/30/2015 - 12/17/2015 Thu 12.45 PM - 3.25 PM at HUMANITIES 016",
                    "time": "Tue 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Katz, Amos"
                }
            ],
            "course_name": "The Human Condition: From Script to Screen",
            "description": "FILMM-AD  106 The Human Condition: From Script to Screen \nHuman behavior and our relationships form the basis of most narratives and our insatiable need for story. This course will explore human behavior in the context of evolutionary psychology, and develop that into a working screenplay. Readings and film screenings will focus on observing human behaviors and relationships. You will hopefully leave the class with a well-honed short script, anchored to a frank and honest look at our behaviors and relationships, and perhaps some greater questions and thoughts into the human condition.",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 107",
            "course_name": "J Developing the Web-series",
            "description": "FILMM-AD  107J Developing the Web-series \nThe web series workshop is an in-depth look at the general approaches of web storytelling and production. It explores various formats of interactive web content from fiction to documentary narratives. It primarily gives an overview on multiple platform storytelling and interactive narrative; how to develop content, build a long-term narrative arc, create virtual characters, design interactive elements, gather online communities and tap onto existing ones in order to find a niche for one’s own web platform.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17224",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 124",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Gross, Larry"
                }
            ],
            "course_name": "Writing the Short Screenplay",
            "description": "FILMM-AD  110 Writing the Short Screenplay \nA workshop designed to develop short screenplays from concept to structure to final draft. Topics include theme, character, research, story, conflict, dialogue, and script editing. The course aims to make a connection between the ancient traditions of the oral storyteller and the professional practice of the contemporary screenwriter when pitching to producers. Screenings and discussions focus on\nclassical and contemporary examples of the short film from a variety of genres, traditions, and cultures. All students complete two short screenplays.",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 117",
            "course_name": "",
            "description": "FILMM-AD  117\n\n   Directing the Camera l\n\nThis course focuses on designing and executing the visual elements of a film. Through the universal language of lenses and lighting we learn how these play a central role when working with a set. Students develop the skills to use a motion picture camera in order to tell a good story. The class structure reflects a working film set with emphasis on production. Learning to create a mood advances the ultimate goal of a filmmaker. The heart of visual storytelling is composition: camera placement, camera angles, camera movement, and lens choice. Together with the lighting style a film finds its ow...\n\n      more description for FILMM-AD  117 »\n\n      \n\n\n\nThis course focuses on designing and executing the visual elements of a film. Through the universal language of lenses and lighting we learn how these play a central role when working with a set. Students develop the skills to use a motion picture camera in order to tell a good story. The class structure reflects a working film set with emphasis on production. Learning to create a mood advances the ultimate goal of a filmmaker. The heart of visual storytelling is composition: camera placement, camera angles, camera movement, and lens choice. Together with the lighting style a film finds its own unique life. In each class we look at selected scenes from popular films and recreate them. We shoot exercises in the classroom or on location.\n\n      less description for FILMM-AD  117 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 149",
            "course_name": "",
            "description": "FILMM-AD  149\n\n   Cinema and New Media\n\nThis course considers digital reformulations of the practice of cinema. What happens when film spectators become players of videogames, actors in locative media, or users of new media? What happens to the pleasures (cinephilia) and vulnerabilities (deterioration) of celluloid when we consider glossy compression formats and VOD (video on demand) distribution? How do the notions of virtual reality and artificial life intersect with “virtual migration” and “gold farming?” What can be learned about CGI (computer generated images) in relation to special effects achieved “in camera” or the optical p...\n\n      more description for FILMM-AD  149 »\n\n      \n\n\n\nThis course considers digital reformulations of the practice of cinema. What happens when film spectators become players of videogames, actors in locative media, or users of new media? What happens to the pleasures (cinephilia) and vulnerabilities (deterioration) of celluloid when we consider glossy compression formats and VOD (video on demand) distribution? How do the notions of virtual reality and artificial life intersect with “virtual migration” and “gold farming?” What can be learned about CGI (computer generated images) in relation to special effects achieved “in camera” or the optical printer? Students analyze an array of new media objects from around the world, as well as produce/ construct and distribute their own.\n\n      less description for FILMM-AD  149 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 150",
            "course_name": "Frames of World Cinema: 1960 to present",
            "description": "FILMM-AD  150 Frames of World Cinema: 1960 to present \nThis course surveys the modern history of world cinema in the national, transnational, and global frames. First, we trace the origin and variations of New Wave films from European through Latin American to East Asian nations. Then, we expand the scope to transnational crossroads including pan-Chinese, Balkan, South Asian, and African regions. Finally, we explore how contemporary cinema reflects sociopolitical and cultural phenomena in the age of globalization. Major trends and directors are introduced with close analysis of key films.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 151",
            "course_name": "",
            "description": "FILMM-AD  151\n\n   French New Wave Cinema\n\nThis course offers an historical/critical overview of one of the most influential film movements in the history of cinema—the French New Wave. After examining the philosophical underpinnings of the New Wave in philosophical existentialism (Sartre, de Beauvoir) and the movement’s theoretical underpinnings in the film criticism of Cahiers du Cinéma, we examine a chronological series of films by Cahiers directors (Truffaut, Godard, Chabrol, Rohmer), Left Bank directors (Resnais, Duras, Varda, Marker), and Cinéma Vérité (Rouch, Morin). While focusing on the films themselves, we also take a cultura...\n\n      more description for FILMM-AD  151 »\n\n      \n\n\n\nThis course offers an historical/critical overview of one of the most influential film movements in the history of cinema—the French New Wave. After examining the philosophical underpinnings of the New Wave in philosophical existentialism (Sartre, de Beauvoir) and the movement’s theoretical underpinnings in the film criticism of Cahiers du Cinéma, we examine a chronological series of films by Cahiers directors (Truffaut, Godard, Chabrol, Rohmer), Left Bank directors (Resnais, Duras, Varda, Marker), and Cinéma Vérité (Rouch, Morin). While focusing on the films themselves, we also take a cultural studies approach by seeing the films as part of a broader artistic and mediatic spectrum.\n\n      less description for FILMM-AD  151 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 152",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12929",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 104",
                    "time": "Tue 9.15 AM - 11.55 AM",
                    "open": true,
                    "professor": "Savio, Joanne"
                }
            ],
            "course_name": "",
            "description": "FILMM-AD  152\n\n   Women, Film and Photography\n\nIn an art world saturated by men, do women offer another way of seeing? Through the genres of experimental, narrative, and documentary image-making, this course examines the work of women who have pioneered and re-imagined the methods, theories and ideas of the dominant culture. An eclectic and multi-cultural selection of feature length films, shorts, exhibitions, books, and iconic images will be screened and studied.  During the semester students will sub-mit written responses and critiques to the work presented.  Weekly exercises will help develop the students critical reading, thinking, and...\n\n      more description for FILMM-AD  152 »\n\n      \n\n\n\nIn an art world saturated by men, do women offer another way of seeing? Through the genres of experimental, narrative, and documentary image-making, this course examines the work of women who have pioneered and re-imagined the methods, theories and ideas of the dominant culture. An eclectic and multi-cultural selection of feature length films, shorts, exhibitions, books, and iconic images will be screened and studied.  During the semester students will sub-mit written responses and critiques to the work presented.  Weekly exercises will help develop the students critical reading, thinking, and writing skills. Students will look to their own cultural milieu to make a final image based project  in conjunction with a written essay, and create oral/visual presentations. Field trips outside of class are mandatory.\n\n      less description for FILMM-AD  152 «",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 153",
            "course_name": "",
            "description": "FILMM-AD  153\n\n   Film Style: Theory and Practice\n\nThis course reveals how film style (cinematography, mise-en-scène, and editing) informs how we understand and emotionally respond to films. We will study closely the film style of film directors whose work exemplifies different elements of film style: mise-en-scène and the long take with static camera (Antonioni, Tsai, Tarr); editing in space, shot/reverse shot cutting, eye-line matches, and point-of-view editing (Hitchcock, Ozu); camera movement (Ophuls, Fellini, Tarkovsky); and sound/image montage (Lang, Bresson, Godard). Based on identical scripts, students (working in groups) will be assig...\n\n      more description for FILMM-AD  153 »\n\n      \n\n\n\nThis course reveals how film style (cinematography, mise-en-scène, and editing) informs how we understand and emotionally respond to films. We will study closely the film style of film directors whose work exemplifies different elements of film style: mise-en-scène and the long take with static camera (Antonioni, Tsai, Tarr); editing in space, shot/reverse shot cutting, eye-line matches, and point-of-view editing (Hitchcock, Ozu); camera movement (Ophuls, Fellini, Tarkovsky); and sound/image montage (Lang, Bresson, Godard). Based on identical scripts, students (working in groups) will be assigned four practical film-based exercises modeled upon the films of these directors.\n\n      less description for FILMM-AD  153 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 154",
            "course_name": "",
            "description": "FILMM-AD  154\n\n   Transtextuality: Adaptation Between Novel and Film\n\nThis course treats the theory, practice, and analysis of film adaptations of novels across a broad spectrum that includes novels by such figures as Defoe, Steinbeck, Nabokov, Flaubert, and Clarice Lispector. Combining close readings of the literary source-texts with close analysis of the films, the course will simultaneously explore the “transtextuality” theory that treats the complex and mutating relations between any single text and all the other texts, genres, media, and discourses with which it comes into dialogue. Through these contrapuntal analyses, the course will demonstrate the myriad...\n\n      more description for FILMM-AD  154 »\n\n      \n\n\n\nThis course treats the theory, practice, and analysis of film adaptations of novels across a broad spectrum that includes novels by such figures as Defoe, Steinbeck, Nabokov, Flaubert, and Clarice Lispector. Combining close readings of the literary source-texts with close analysis of the films, the course will simultaneously explore the “transtextuality” theory that treats the complex and mutating relations between any single text and all the other texts, genres, media, and discourses with which it comes into dialogue. Through these contrapuntal analyses, the course will demonstrate the myriad ways that adaptation study can illuminate both media.\n\n      less description for FILMM-AD  154 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 155",
            "course_name": "Stages of American Cinema: 1960 to Present",
            "description": "FILMM-AD  155 Stages of American Cinema: 1960 to Present \nThis course explores temporal stages of post-classical American cinema from the 1960s New Wave to the new millennium global Hollywood. It also maps out historically significant films on three broadly thematic stages: mind, society, and culture. Students acquire psychological, sociopolitical, and cultural perspectives in this regard, while learning about historical shifts, major genres and directors, and key issues on industry and technology. The course aims at shedding new synthetic light on the modern history of the world’s most powerful cinema.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 156",
            "course_name": "",
            "description": "FILMM-AD  156\n\n   Introduction to Film and New Media Curating\n\nCritical to the making and studies of film and new media are sensitivities to how audiences, spectators and publics are developed and effectively engaged. This course introduces students to contexts of visual literacies, concepts, methods and technologies of designing and mounting exhibitions for varieties of locations ranging from cinema halls to art fairs, museums to online platforms, public displays and other cultural spaces. Such skills will be developed side by side cultural and interpretive studies of politics and infrastructures of power, various social and historical contexts, models o...\n\n      more description for FILMM-AD  156 »\n\n      \n\n\n\nCritical to the making and studies of film and new media are sensitivities to how audiences, spectators and publics are developed and effectively engaged. This course introduces students to contexts of visual literacies, concepts, methods and technologies of designing and mounting exhibitions for varieties of locations ranging from cinema halls to art fairs, museums to online platforms, public displays and other cultural spaces. Such skills will be developed side by side cultural and interpretive studies of politics and infrastructures of power, various social and historical contexts, models of cultural and art management, artistic practices and social movements and attitudes, conceptualizing and designing exhibitions.\n\n      less description for FILMM-AD  156 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 157",
            "course_name": "J",
            "description": "FILMM-AD  157J\n\n   Cinema and War\n\nThis course investigates the relationship of cinema and war from the early 20th century to the present. From the Libyan War of 1911-1912 onwards, film has been integral to shaping public consciousness of military events as they unfold and public memory of wars after the guns have fallen silent. The course looks at feature films and non-fiction, with government and clandestine short films shown as well as commercial entertainment films and independent documentaries. Topics to be addressed include how war’s many violences are represented; the filmmakers’ circumstances (censorship, political agen...\n\n      more description for FILMM-AD  157J »\n\n      \n\n\n\nThis course investigates the relationship of cinema and war from the early 20th century to the present. From the Libyan War of 1911-1912 onwards, film has been integral to shaping public consciousness of military events as they unfold and public memory of wars after the guns have fallen silent. The course looks at feature films and non-fiction, with government and clandestine short films shown as well as commercial entertainment films and independent documentaries. Topics to be addressed include how war’s many violences are represented; the filmmakers’ circumstances (censorship, political agendas and pressures, physical danger, the politics of funding); national cinemas; the role of sound; the camera as weapon; the uses of history; and the operation of memory. Case studies may include the two World Wars, civil wars (Spain, Lebanon), anti-colonial wars, the fall of Communism, the war in Iraq, Vietnam, the Israel-Palestinian conflict; and the Egyptian revolution.\n\n      less description for FILMM-AD  157J «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 198",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "13143",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Directed Study",
            "description": "FILMM-AD  198 Directed Study \nOffered by application Prerequisite: permission of the instructor Closely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 201",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12968",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 104",
                    "time": "Mon,Wed 12.15 PM - 3.15 PM",
                    "open": true,
                    "professor": "Bednarz, Wendy"
                }
            ],
            "course_name": "",
            "description": "FILMM-AD  201\n\n   Intermediate Filmmaking\n\nThis course is designed to develop techniques and skills in generating ideas for short films that are shot on digital video and edited on nonlinear editing software. It will focus on strong visualization of story and camera techniques, as opposed to dialogue-based work. Students will develop skills in the elements of visual storytelling through the process of storyboarding and creating shot lists, then working in small crews to direct and shoot the projects. Students will gain knowledge of new photographic techniques, moving the camera dynamically, and the ways in which the craft of editing an...\n\n      more description for FILMM-AD  201 »\n\n      \n\n\n\nThis course is designed to develop techniques and skills in generating ideas for short films that are shot on digital video and edited on nonlinear editing software. It will focus on strong visualization of story and camera techniques, as opposed to dialogue-based work. Students will develop skills in the elements of visual storytelling through the process of storyboarding and creating shot lists, then working in small crews to direct and shoot the projects. Students will gain knowledge of new photographic techniques, moving the camera dynamically, and the ways in which the craft of editing and sound design can be used to support story.\n\n      less description for FILMM-AD  201 «",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 202",
            "course_name": "Web Series Production",
            "description": "FILMM-AD  202 Web Series Production \nThis is a production class providing an exploration of the creative capabilities of producing and directing narrative work in a web-series format.  Students will work with actors and learn to connect script and performance through the production of studio-based short projects.  Written work will be developed and shaped in class and students will also be trained in working with the camera, sound and art direction. Students are encouraged to develop their web-series and write their scripts in FILMM-AD 107J Developing the Web Series.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 209",
            "course_name": "",
            "description": "FILMM-AD  209\n\n   Documentary Techniques and Production\n\nA practical introduction to creating compelling stories in which real people are the characters and real life is the plot. The academic study of classic documentaries is combined with craft training and a review of documentary film styles. Practical exercises are assigned weekly. Working collaboratively in small production teams, each student completes a short documentary portrait. The course includes the introduction of digital filmmaking fundamentals: lighting, camera, and sound recording. The creative role of the editor is also emphasized. Students learn to understand how pacing, transition...\n\n      more description for FILMM-AD  209 »\n\n      \n\n\n\nA practical introduction to creating compelling stories in which real people are the characters and real life is the plot. The academic study of classic documentaries is combined with craft training and a review of documentary film styles. Practical exercises are assigned weekly. Working collaboratively in small production teams, each student completes a short documentary portrait. The course includes the introduction of digital filmmaking fundamentals: lighting, camera, and sound recording. The creative role of the editor is also emphasized. Students learn to understand how pacing, transitions, cuts, and continuity can enhance a documentary film.\n\n      less description for FILMM-AD  209 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 211",
            "course_name": "Person-to-Person: The Interview",
            "description": "FILMM-AD  211 Person-to-Person: The Interview \nExploring the interview in film, radio, television, print, and new media, this class considers a range of theoretical and practical approaches to the shaping of questions, the interviewer/interviewee relationship, character, and constructing an argument. Readings include Plato, Deleuze, and Studs Terkel and the class examines the approaches of Errol Morris, Michael Moore, Sadie Benning, David\nFrost, James Agee, Oprah Winfrey, and others. Class projects investigate these techniques from both a practical and theoretical perspective.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 213",
            "course_name": "",
            "description": "FILMM-AD  213\n\n   Social Software\n\nTraditional broadcast media (television and radio) are in a time of transition, pushed in new directions by the increasing ease of producing compelling\nmaterial, and by the interactive and social nature of the Internet. Blogs and other Internet-based social networks have given rise to an audience that is eager to engage with and participate in the creation of media. The goal of this course\nis to introduce students to new technologies and methods for creating participatory media and making it available to the public. Students develop\nideas for helping this transition along both on the Internet ...\n\n      more description for FILMM-AD  213 »\n\n      \n\n\n\nTraditional broadcast media (television and radio) are in a time of transition, pushed in new directions by the increasing ease of producing compelling\nmaterial, and by the interactive and social nature of the Internet. Blogs and other Internet-based social networks have given rise to an audience that is eager to engage with and participate in the creation of media. The goal of this course\nis to introduce students to new technologies and methods for creating participatory media and making it available to the public. Students develop\nideas for helping this transition along both on the Internet and in the traditional broadcast space.\n\n      less description for FILMM-AD  213 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 215",
            "course_name": "Film Techniques: Story and Style",
            "description": "FILMM-AD  215 Film Techniques: Story and Style \nThis course is designed to give student filmmakers more authority in applying techniques to telling a story visually. These techniques include choice of locations, casting, color palette and production design, camera work, lighting, mise-en-scène, editing, and sound design. Emphasis is given to translating a script into techniques that create a coherent style. The course emphasizes weekly exercises (outside of class, with digital camera), critical readings, and close reading of clips from films produced around the world from the early 1900s to today.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 216",
            "course_name": "Directing the Non-actor: Singular Drama",
            "description": "FILMM-AD  216 Directing the Non-actor: Singular Drama \nThis practical workshop offers students hands-on insight into the process of creating drama in a film using the human capacity to respond emotionally to a fictional situation. Students learn how to direct films that have a precise screenplay and a well-constructed plot in a way that brings non-actors to act out a story without being aware that they are being directed according to a pre-written script.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 221",
            "course_name": "",
            "description": "FILMM-AD  221\n\n   Shorts into Series, Back Again, and Beyond\n\nThis course examines migrations of the short format from the silent era through its serialization as episodes in long-format narrative, such as television series and video games. The course explores the aesthetics and politics of looking from peep shows and television flows into video-on-demand and webcam surveillance, focusing professional and nonprofessional productions. Topics may include: exhibition platforms from nickelodeons to social media, music videos, Brazilian and Mexican telenovelas, Indian mythologicals, Nollywood video-films, Ramadan serials, Korean dramas, video mashups and GIFs...\n\n      more description for FILMM-AD  221 »\n\n      \n\n\n\nThis course examines migrations of the short format from the silent era through its serialization as episodes in long-format narrative, such as television series and video games. The course explores the aesthetics and politics of looking from peep shows and television flows into video-on-demand and webcam surveillance, focusing professional and nonprofessional productions. Topics may include: exhibition platforms from nickelodeons to social media, music videos, Brazilian and Mexican telenovelas, Indian mythologicals, Nollywood video-films, Ramadan serials, Korean dramas, video mashups and GIFs, console video games, vlogs, global talent-show and reality-television franchises, and animated series including Freej.\n\n      less description for FILMM-AD  221 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 223",
            "course_name": "",
            "description": "FILMM-AD  223\n\n   Documentary Techniques\n\nThe course provides a review of current documentaries and a comparison with those made in earlier decades. We examine influential works such as Robert Flaherty’s Nanook of the North, propaganda films, cinéma vérité, social and educational documentaries, the personal documentary, re-enactment and dramatization, experimental works, and the unique voices of artists such as Errol Morris. The course explores the different genres of documentary filmmaking and identifies the specific elements employed in the context of their time, their objective, and their audience. The final project: a 5-7–minute d...\n\n      more description for FILMM-AD  223 »\n\n      \n\n\n\nThe course provides a review of current documentaries and a comparison with those made in earlier decades. We examine influential works such as Robert Flaherty’s Nanook of the North, propaganda films, cinéma vérité, social and educational documentaries, the personal documentary, re-enactment and dramatization, experimental works, and the unique voices of artists such as Errol Morris. The course explores the different genres of documentary filmmaking and identifies the specific elements employed in the context of their time, their objective, and their audience. The final project: a 5-7–minute documentary portrait of “a character work.” This course also includes a final exam.\n\n      less description for FILMM-AD  223 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 224",
            "course_name": "Methods of Editing",
            "description": "FILMM-AD  224 Methods of Editing \nThe emphasis of the course is on storytelling. The class has two components: lectures, in which concepts are discussed and demonstrated and work-in-progress sessions in which students screen and critique each others work. Students work toward the completion of a short film. Seniors are encouraged to edit their Capstone films.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 228",
            "course_name": "New Media Ecologies",
            "description": "FILMM-AD  228 New Media Ecologies \nIf one vector of globalization is accelerated homogenization—McDonaldization, Hollywoodization, Googlization—another vector is expanded diversity of media: amateur, ambient, activist, commercial, documentary, experimental, indigenous, locative, and tactical media. This course examines new media ecologies of digital technologies and distributed networks deployed in production, distribution, exhibition, and reception in Africa, Latin America, indigenous nations, Middle East, North America, South Asia, and through transnational collaborations.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 231",
            "course_name": "",
            "description": "FILMM-AD  231\n\n   World Through the Documentary Lens\n\nThis course is designed for students with an interest in exploring a specific subject through the documentary genre. By focusing on a single issue, the course aims to cover many points of view and to provide a foundation of knowledge, vocabulary, and insight about both the subject matter raised by the films and the techniques and skills of good documentary filmmaking. Through frequent screenings and discussions, and a required reading list, the students study specific subjects in depth. Both classical and contemporary films are shown. Specific examples of fields of study include: civil rights,...\n\n      more description for FILMM-AD  231 »\n\n      \n\n\n\nThis course is designed for students with an interest in exploring a specific subject through the documentary genre. By focusing on a single issue, the course aims to cover many points of view and to provide a foundation of knowledge, vocabulary, and insight about both the subject matter raised by the films and the techniques and skills of good documentary filmmaking. Through frequent screenings and discussions, and a required reading list, the students study specific subjects in depth. Both classical and contemporary films are shown. Specific examples of fields of study include: civil rights, human rights, the environment, biographies, and societies at war.\n\n      less description for FILMM-AD  231 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 232",
            "course_name": "",
            "description": "FILMM-AD  232\n\n   Theories and Methodologies of Film and New Media\n\nThis course illuminates theories and methodologies in film and new media studies on an advanced level. It compares and combines classical, modern, and contemporary debates on aesthetic, psychological, philosophical, sociocultural, and technological issues: image, illusion, representation, identity, subjectivity, sexuality, spectatorship, embodiment, apparatus, interface, etc. It also explores useful methods of archival research and historiography. Theories are examined through a diverse body of films from mainstream to avant-garde. Using them, students develop critical and creative approaches ...\n\n      more description for FILMM-AD  232 »\n\n      \n\n\n\nThis course illuminates theories and methodologies in film and new media studies on an advanced level. It compares and combines classical, modern, and contemporary debates on aesthetic, psychological, philosophical, sociocultural, and technological issues: image, illusion, representation, identity, subjectivity, sexuality, spectatorship, embodiment, apparatus, interface, etc. It also explores useful methods of archival research and historiography. Theories are examined through a diverse body of films from mainstream to avant-garde. Using them, students develop critical and creative approaches to their own research topic.\n\n      less description for FILMM-AD  232 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 233",
            "course_name": "",
            "description": "FILMM-AD  233\n\n   Docu-Fiction\n\nFact may or may not be stranger than fiction, but invariably both exert strong influences in creating narrative. The course explores how documentary and fiction are combined throughout history and in different cultures.  We will examine the work of ten filmmakers who have merged both formats creating singular hybrid films. Dramatic reconstructions, manipulated imagery or fictional interstitials are frequently incorporated into documentaries to elevate realism. Conversely, fiction occasionally crosses over into documentary to create a sense of authenticity or truthfulness. Lastly, the division ...\n\n      more description for FILMM-AD  233 »\n\n      \n\n\n\nFact may or may not be stranger than fiction, but invariably both exert strong influences in creating narrative. The course explores how documentary and fiction are combined throughout history and in different cultures.  We will examine the work of ten filmmakers who have merged both formats creating singular hybrid films. Dramatic reconstructions, manipulated imagery or fictional interstitials are frequently incorporated into documentaries to elevate realism. Conversely, fiction occasionally crosses over into documentary to create a sense of authenticity or truthfulness. Lastly, the division is sometimes completely eradicated making it difficult to distinguish the reality from the imaginary. Over the course of the semester, students will create their own docu-fiction short films. They will bring together fiction and non-fiction story elements reflecting on how each form complements the other.\n\n      less description for FILMM-AD  233 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 301",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12974",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "ARTS_CENT 104",
                    "time": "Sun 9.00 AM - 12.45 PM",
                    "open": true,
                    "professor": "Copti, Scandar"
                }
            ],
            "course_name": "",
            "description": "FILMM-AD  301\n\n   Advanced Filmmaking\n\nIn this intensive course, Film and New Media majors will produce their Capstone short films. This course expands and nurtures the student’s individual and unique voice as a film-maker. With the emphasis on emotional responses to situations and scenes, we will learn how to translate scripts into shooting scripts and shot lists. We will explore different approaches in casting and working with actors and cover topics such as script breakdown, budgeting, location managing, and scheduling. Each student will learn the different roles and responsibilities of a film production crew by participating in...\n\n      more description for FILMM-AD  301 »\n\n      \n\n\n\nIn this intensive course, Film and New Media majors will produce their Capstone short films. This course expands and nurtures the student’s individual and unique voice as a film-maker. With the emphasis on emotional responses to situations and scenes, we will learn how to translate scripts into shooting scripts and shot lists. We will explore different approaches in casting and working with actors and cover topics such as script breakdown, budgeting, location managing, and scheduling. Each student will learn the different roles and responsibilities of a film production crew by participating in all productions.\n\n      less description for FILMM-AD  301 «",
            "offering": true
        },
        {
            "course_id": "FILMM-AD 302",
            "course_name": "",
            "description": "FILMM-AD  302\n\n   Capstone Greenhouse\n\nThis workshop is designed for Film and New Media majors who plan to make a film or new media project to fulfill their Capstone requirement.  Students will explore a variety of forms through a series of written and visual exercises.  The class will focus on screening and analyzing existing work, writing exercises, and producing visual exercises that will further the develop the capstone project.  Students are expected to explore the UAE landscape and to incorporate relevant findings into their stories.  This class is a “greenhouse” for Capstone projects and primarily focuses on the creative pro...\n\n      more description for FILMM-AD  302 »\n\n      \n\n\n\nThis workshop is designed for Film and New Media majors who plan to make a film or new media project to fulfill their Capstone requirement.  Students will explore a variety of forms through a series of written and visual exercises.  The class will focus on screening and analyzing existing work, writing exercises, and producing visual exercises that will further the develop the capstone project.  Students are expected to explore the UAE landscape and to incorporate relevant findings into their stories.  This class is a “greenhouse” for Capstone projects and primarily focuses on the creative process and the development and testing of ideas.  The class aims to develop one's personal voice in the context of particular themes.\n\n      less description for FILMM-AD  302 «",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 390",
            "course_name": "Capstone Seminar",
            "description": "FILMM-AD  390 Capstone Seminar \nThe capstone seminar provides third-year majors with the opportunity to research and develop the concept for their senior Capstone Project. Students are encouraged to integrate studies and practice with the intention of creating a time-based media project, including but not limited to single or multi-channel, multi-platform, documentary, experimental, live action or animated narrative. During the capstone seminar, students define the parameters of their projects and begin exploratory work that will culminate with a treatment, visual presentation and Capstone Proposal.",
            "offering": false
        },
        {
            "course_id": "FILMM-AD 401",
            "course_name": "",
            "description": "FILMM-AD  401\n\n   Capstone Project\n\nThe capstone experience provides seniors with the opportunity to work closely with a faculty mentor and to produce a senior thesis project. Projects may range in form from a creative art project to a theoretical or historical research project. The capstone experience culminates in the public presentation of the Capstone Project. Students may also elect to participate in a Capstone Project with students majoring in other disciplines in the humanities, the natural and social sciences. Collaborating students work with a faculty member to define the overall goals of the group Capstone Project, as ...\n\n      more description for FILMM-AD  401 »\n\n      \n\n\n\nThe capstone experience provides seniors with the opportunity to work closely with a faculty mentor and to produce a senior thesis project. Projects may range in form from a creative art project to a theoretical or historical research project. The capstone experience culminates in the public presentation of the Capstone Project. Students may also elect to participate in a Capstone Project with students majoring in other disciplines in the humanities, the natural and social sciences. Collaborating students work with a faculty member to define the overall goals of the group Capstone Project, as well as the particular goals of each participant.\n\n      less description for FILMM-AD  401 «",
            "offering": false
        }
    ]
}