{
    "major_id": "FRE-GY",
    "file": "./2015-2016/Finance_and_Risk_Engineering_(FRE-GY).html",
    "courses": [
        {
            "course_id": "FRE-GY 5500",
            "classes": [
                {},
                {}
            ],
            "course_name": "BLOOMBERG CERTIFICATION",
            "description": "FRE-GY 5500 BLOOMBERG CERTIFICATION \nThis course tracks the requirement for the self-paced, self-taught Bloomberg certification to be completed through a Bloomberg terminal. | Prerequisite:  Graduate Financial Risk Engineering students only",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6003",
            "classes": [
                {},
                {}
            ],
            "course_name": "Financial Accounting",
            "description": "FRE-GY 6003 Financial Accounting \nThis course provides a solid foundation in the construction and interpretation of financial statements. Topics include accounting terminology; financial statement preparation and analysis; liquidity and credit risk ratios; depreciation calculations; revenue recognition; and accrued liabilities and asset valuation. Also covered are the effects of equity transactions; cash flows; and various accounting methods on financial statements. | Prerequisite: Graduate Standing. Co-Requisite: None. Notes: None.",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6015",
            "course_name": "GUIDED STD IN FIN & RISK MNGT",
            "description": "FRE-GY 6015 GUIDED STD IN FIN & RISK MNGT",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6020",
            "course_name": "GUIDED STD IN FIN & RISK MNGT",
            "description": "FRE-GY 6020 GUIDED STD IN FIN & RISK MNGT",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6021",
            "course_name": "",
            "description": "FRE-GY 6021\n\n   INSURANCE AND FINANCIAL CREDIT DERIVATIVES\n\nDerivatives have moved to the center of modern corporate finance, investments and the management of financial institutions. Option pricing concepts are also applied to actuarial problems such as equity-linked insurance. This advanced course in derivatives introduces binomial option-pricing model and option pricing using the Black-Scholes model. The properties of a lognormal distribution are derived, and the Black-Scholes formula is introduced as a limited expected value for a lognormal distribution. The option Greeks are defined and analyzed. Applications to actuarial problems and risk-managem...\n\n      more description for FRE-GY 6021 »\n\n      \n\n\n\nDerivatives have moved to the center of modern corporate finance, investments and the management of financial institutions. Option pricing concepts are also applied to actuarial problems such as equity-linked insurance. This advanced course in derivatives introduces binomial option-pricing model and option pricing using the Black-Scholes model. The properties of a lognormal distribution are derived, and the Black-Scholes formula is introduced as a limited expected value for a lognormal distribution. The option Greeks are defined and analyzed. Applications to actuarial problems and risk-management techniques such as deltahedging are presented. Finally, interest models (e.g., Vasicek and Cox-Ingersoll-Ross models) for bond pricing are treated in detail. | Prerequisite: FRE-GY 6103 Corporate Finance.  Co-Requisite: None. Notes: None.\n\n      less description for FRE-GY 6021 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6023",
            "classes": [
                {},
                {}
            ],
            "course_name": "Economic Foundations in Finance",
            "description": "FRE-GY 6023 Economic Foundations in Finance \nThis course studies the interactions between money, the financial system and the economy. Topics include supply and demand; consumer theory; theory of the firm; production costs and other subject areas such as interest rates and asset returns. This course summarizes key insights from financial economics as the methodological and conceptual basis of financial engineering. | Prerequisite: Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6025",
            "course_name": "GUIDED STD IN FIN & RISK MNGT",
            "description": "FRE-GY 6025 GUIDED STD IN FIN & RISK MNGT",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6031",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6031\n\n   Money, Banking and Financial Markets\n\nStudies how the interactions among money, the financial system and the economy determine interest rates and asset returns. It utilizes a consistent approach based in economics to explain the role of the financial system in matching savers and borrowers and in providing risk-sharing, liquidity and information services in efficient financial markets. Students study why and how financial markets and financial instruments evolve as a function of transactions and information costs, adverse selection and moral hazard problems, and summarize economic arguments for and against regulation. Finally, the...\n\n      more description for FRE-GY 6031 »\n\n      \n\n\n\nStudies how the interactions among money, the financial system and the economy determine interest rates and asset returns. It utilizes a consistent approach based in economics to explain the role of the financial system in matching savers and borrowers and in providing risk-sharing, liquidity and information services in efficient financial markets. Students study why and how financial markets and financial instruments evolve as a function of transactions and information costs, adverse selection and moral hazard problems, and summarize economic arguments for and against regulation. Finally, they examine the money supply process and monetary policy, in particular the link between monetary authorities and the macro-economy through a transmission mechanism involving banks and the non-financial public. |  Prerequisite: Matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of Department\n\n      less description for FRE-GY 6031 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6041",
            "classes": [
                {}
            ],
            "course_name": "Risk Management in the Real World",
            "description": "FRE-GY 6041 Risk Management in the Real World \nThe course covers failures of financial theory in risk management, deriving from fundamental definitions and assumptions in modeling, including pricing formulae; convexity; stochasticity and volatility; \"fat tails\"; and risk. Other topics: Portfolio robustness and extreme markets and moral hazard; data-mining biases and decision error; and decision-making with incomplete information. | Pre-Requisite: Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6051",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6051\n\n   Insurance Finance and Actuarial Science\n\nThis course highlights essential facets of actuarial science, insurance and the finance-insurance convergence. The course assumes that students are familiar with basic notions of expected utility and stochastic processes, and options pricing. Topics include Insurance Business and Insurance Firms Management; Principles of Actuarial Science and Risk Pricing in Insurance and in Finance (Complete Markets); Expected Utility Approach to Insurance Risk Pricing and Management; Derivatives and the Financial Approach to Insurance Pricing; Insurance Products (Life Insurance, Casualty, Pension Funds and D...\n\n      more description for FRE-GY 6051 »\n\n      \n\n\n\nThis course highlights essential facets of actuarial science, insurance and the finance-insurance convergence. The course assumes that students are familiar with basic notions of expected utility and stochastic processes, and options pricing. Topics include Insurance Business and Insurance Firms Management; Principles of Actuarial Science and Risk Pricing in Insurance and in Finance (Complete Markets); Expected Utility Approach to Insurance Risk Pricing and Management; Derivatives and the Financial Approach to Insurance Pricing; Insurance Products (Life Insurance, Casualty, Pension Funds and Defined Benefits); Principles of Insurance Management in a Dynamic and Global Setting. Throughout, the course uses numerous cases centered on actuarial and insurance problems and analyzes them from a financial perspective. Of particular interest are those related to insurance pricing, reserve policies, insurance pension funds, CATBOND and weather (insurance) derivatives and regulation. | Prerequisite: FRE-GY 6103. Co-Requisite: None. Notes: None.\n\n      less description for FRE-GY 6051 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6083",
            "classes": [
                {},
                {},
                {},
                {}
            ],
            "course_name": "Quantitative Methods in Finance",
            "description": "FRE-GY 6083 Quantitative Methods in Finance \nThis course focuses on quantitative methods and financial modeling. Probability theory, stochastic processes and optimization are studied and applied to a broad variety of financial problems and their derivatives.  Topics include probability spaces; conditional probability; densities; distributions; density estimators; multivariate probability; moment-generating functions; random walks; Markov processes; Poisson processes; and the Brownian-motion process. | Prerequisite: Students are expected to know calculus and elementary probability and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6091",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6091\n\n   Financial Econometrics\n\nThis course focuses on the art and science of statistical modeling of processes applied to business, finance and economics. These may include models of aggregate economic activity, economic behavior of firm or behavior of financial assets. Topics include statistical inference; maximum likelihood estimation; method of moments; Bayesian estimation; least-squares estimation; robust estimation; kernel estimation; copula estimation; analysis of variance; linear regression models; multiple regression; logistic regression; quantile regression; time series estimation; unit root tests; bootstrapping. |...\n\n      more description for FRE-GY 6091 »\n\n      \n\n\n\nThis course focuses on the art and science of statistical modeling of processes applied to business, finance and economics. These may include models of aggregate economic activity, economic behavior of firm or behavior of financial assets. Topics include statistical inference; maximum likelihood estimation; method of moments; Bayesian estimation; least-squares estimation; robust estimation; kernel estimation; copula estimation; analysis of variance; linear regression models; multiple regression; logistic regression; quantile regression; time series estimation; unit root tests; bootstrapping. | Prerequisite: FRE-GY 6083. Students are expected to know basic statistics. Prerequisite FRE-GY 6083 and Graduate Standing\n\n      less description for FRE-GY 6091 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6103",
            "classes": [
                {},
                {},
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6103\n\n   Corporate Finance\n\nThe modern corporation, as issuer of financial securities and end-user of financial risk-management products, is a major participant in financial markets and the economic counterpart to investors and financial intermediaries. The mechanism of financial markets and the valuation of instruments are studied in further detail in other courses. However, this course applies the tools of the trade of financial economics and corporate finance to the financial decision-making process of firms. Upon successful completion of this course, students know how to contribute to optimal financial decisions in a...\n\n      more description for FRE-GY 6103 »\n\n      \n\n\n\nThe modern corporation, as issuer of financial securities and end-user of financial risk-management products, is a major participant in financial markets and the economic counterpart to investors and financial intermediaries. The mechanism of financial markets and the valuation of instruments are studied in further detail in other courses. However, this course applies the tools of the trade of financial economics and corporate finance to the financial decision-making process of firms. Upon successful completion of this course, students know how to contribute to optimal financial decisions in a corporation: valuation; capital budgeting; risk; capital structure; dividend policy; long-term financing; risk management; and mergers and acquisitions. Increasingly important international factors that affect corporate finance are stressed throughout. | Prerequisite: Graduate Standing\n\n      less description for FRE-GY 6103 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6111",
            "classes": [
                {},
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6111\n\n   Investment Banking and Brokerage\n\nThis course introduces an overview of Wall Street, the back office and general brokerage operations, investment banking and capital markets. The course covers subjects essential to understanding how products, once created, are distributed and sold. The course relies heavily on The Wall Street Journal, Financial Times and other trade publications. Topics include a brief history of Wall Street, an understanding of the major securities laws and how they have changed over time, basics of equity and debt securities, creation of debt and equity securities, and pricing and sale of debt and equity sec...\n\n      more description for FRE-GY 6111 »\n\n      \n\n\n\nThis course introduces an overview of Wall Street, the back office and general brokerage operations, investment banking and capital markets. The course covers subjects essential to understanding how products, once created, are distributed and sold. The course relies heavily on The Wall Street Journal, Financial Times and other trade publications. Topics include a brief history of Wall Street, an understanding of the major securities laws and how they have changed over time, basics of equity and debt securities, creation of debt and equity securities, and pricing and sale of debt and equity securities. The course seeks to understand how and where opportunities for creating new securities arise. | Prerequisites: Graduate Standing\n\n      less description for FRE-GY 6111 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6123",
            "classes": [
                {},
                {},
                {},
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6123\n\n   Financial Risk Management and Asset Pricing\n\nThis course introduces the techniques and problems of Financial Risk Management and Asset Pricing. It emphasizes risk finance and attitudes; Value at Risk; risk measurement principles; valuation and expected utility and their relevance in the valuation and the pricing of financial investments; insurance; management of derivatives; and risk management. Throughout, risk-management application problems are explored., The course introduces and focuses on the fundamental principles of the Arrow-Debreu state preference theory used to price derivatives and other assets in complete markets.  Risk neut...\n\n      more description for FRE-GY 6123 »\n\n      \n\n\n\nThis course introduces the techniques and problems of Financial Risk Management and Asset Pricing. It emphasizes risk finance and attitudes; Value at Risk; risk measurement principles; valuation and expected utility and their relevance in the valuation and the pricing of financial investments; insurance; management of derivatives; and risk management. Throughout, risk-management application problems are explored., The course introduces and focuses on the fundamental principles of the Arrow-Debreu state preference theory used to price derivatives and other assets in complete markets.  Risk neutral-Binomial models in option pricing; essential elements of Ito calculus; and the Black-Scholes model for pricing options are introduced and applied to practical financial decision making and risk management problems.  Prerequisite:  Graduate Standing\n\n      less description for FRE-GY 6123 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6131",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6131\n\n   CLEARING AND SETTLEMENT AND OPERATIONAL RISK\n\nThis course focuses on issues involved in processing financial transactions—from order execution to final settlement of transactions—and operational risk in general. The course examines the procedures and market conventions for processing, verifying, and confirming completed transactions; resolving conflicts; decisions involved in developing clearing operations or purchasing clearing services; the role played by clearing houses; and numerous issues associated with cross-border transactions. The course also examines the effects of transaction processing, liquidity management, organizational str...\n\n      more description for FRE-GY 6131 »\n\n      \n\n\n\nThis course focuses on issues involved in processing financial transactions—from order execution to final settlement of transactions—and operational risk in general. The course examines the procedures and market conventions for processing, verifying, and confirming completed transactions; resolving conflicts; decisions involved in developing clearing operations or purchasing clearing services; the role played by clearing houses; and numerous issues associated with cross-border transactions. The course also examines the effects of transaction processing, liquidity management, organizational structure, and personnel and compliance on the nature of operational risk. Qualitative and quantitative measures of operational risk are discussed. | Prerequisite: FRE-GY 6151 and Graduate Standing\n\n      less description for FRE-GY 6131 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6143",
            "course_name": "",
            "description": "FRE-GY 6143\n\n   LIFE CONTINGENCIES I\n\nThis course introduces the Mathematics of Life Insurance. Basic topics covered are survival distributions, time-of-death as a continuous random variable, life tables and their interpretation. Applications include estate planning, tax ramifications and other specific issues related to the multiple uses of life insurance. Characteristics of life annuities are exhibited; the equivalence principle is introduced and used to evaluate future benefits. Prospective future loss on a contract already in force is investigated. An emphasis lies on the integration of life contingencies into a full risk-theo...\n\n      more description for FRE-GY 6143 »\n\n      \n\n\n\nThis course introduces the Mathematics of Life Insurance. Basic topics covered are survival distributions, time-of-death as a continuous random variable, life tables and their interpretation. Applications include estate planning, tax ramifications and other specific issues related to the multiple uses of life insurance. Characteristics of life annuities are exhibited; the equivalence principle is introduced and used to evaluate future benefits. Prospective future loss on a contract already in force is investigated. An emphasis lies on the integration of life contingencies into a full risk-theory framework and the use of modern probabilistic and financial methods. Prerequisites: None. | Prerequisite: FRE-GY 6051 Insurance Finance and Actuarial Science and Graduate Standing\n\n      less description for FRE-GY 6143 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6153",
            "classes": [
                {}
            ],
            "course_name": "FOUNDATIONS OF FINANCIAL TECHNOLOGY",
            "description": "FRE-GY 6153 FOUNDATIONS OF FINANCIAL TECHNOLOGY \nFinancial Institutions spend billions per year to exploit the latest development in information technology.  This course introduces a framework with which to understand and leverage information technology.  The technology components covered include telecommunications, groupware, imaging and document processing, artificial intelligence, networks, protocols, risk, and object-oriented analysis and design.  the course also covers the entire technological-planning process specifically for financial institutions. | Prerequisite: Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6163",
            "course_name": "LIFE CONTINGENCIES II",
            "description": "FRE-GY 6163 LIFE CONTINGENCIES II \nThe course investigates annuity and insurance contracts involving two lives. Subsequently, a more realistic model is introduced in which several causes of decrement are possible.  An overview of risk-theory application to insurance is given. Also covered are an extension of the individual model to incorporate\noperational constraints such as acquisitions and administrative expenses, accounting requirements and the effects of contract termination. | Prerequisite: FRE-GY 6143 Life Contingencies and Graduate Standing",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6171",
            "course_name": "Management of Financial Institutions",
            "description": "FRE-GY 6171 Management of Financial Institutions \nThis course focuses on managing institutions from a financial-management perspective. By analyzing the factors that define the dynamics of the rapidly changing financial-services industry, the course explores the normative consequences of financial management decision-making to create shareholder value. | Prerequisites: FRE-GY 6031, FRE-GY 6023.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6191",
            "course_name": "Advanced Topics in Financial Technology",
            "description": "FRE-GY 6191 Advanced Topics in Financial Technology \nThis course complements the Foundations of Financial Technology by treating in-depth advanced topics in this rapidly changing field. Students prepare and present case studies applying the concepts covered in class. | Prerequisites: FRE-GY 6151.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6211",
            "classes": [
                {}
            ],
            "course_name": "Financial Market Regulation",
            "description": "FRE-GY 6211 Financial Market Regulation \nThis course considers the role and forms of regulation in the U.S. financial markets, the role of the Securities and Exchange Commission (SEC), the Commodity Futures Trading Commission (CFTC), the Federal Reserve, the Office of the Controller of the Currency (OCC), and self-regulating organizations (SROs) such as the National Association of Securities Dealers and the National Futures Association. Also examined are the roles of the state insurance commissions and the STATE OR FEDERAL Department of Labor. | Prerequisites: FRE-GY 6031 and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6223",
            "course_name": "",
            "description": "FRE-GY 6223\n\n   Actuarial Models\n\nMany problems in actuarial science involve building a mathematical model to forecast or predict future insurance losses and revenues. Historical data guide the actuary in selecting the model and in calibrating its unknown parameters. The course introduces discrete and continuous actuarial models such as loss, frequency and severity models and their specific characteristics. It then studies aggregate loss models in which individual risks are pooled into a manageable aggregate risk. Finally, financial tools are used to market price theses losses and allow a securitization of insurance firms’ por...\n\n      more description for FRE-GY 6223 »\n\n      \n\n\n\nMany problems in actuarial science involve building a mathematical model to forecast or predict future insurance losses and revenues. Historical data guide the actuary in selecting the model and in calibrating its unknown parameters. The course introduces discrete and continuous actuarial models such as loss, frequency and severity models and their specific characteristics. It then studies aggregate loss models in which individual risks are pooled into a manageable aggregate risk. Finally, financial tools are used to market price theses losses and allow a securitization of insurance firms’ portfolios. | Prerequisite: FRE-GY 6051 Insurance Finance and Actuarial Science and Graduate Standing\n\n      less description for FRE-GY 6223 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6233",
            "course_name": "",
            "description": "FRE-GY 6233\n\n   OPTIONS PRICING & STOCHASTIC CALCULUS\n\nThis course provides the mathematical foundations of Option Pricing models.  The techniques covered include arithmetic and geometric Brownian motion, first passage time, the reflection principle, the stochastic Ito integral, Ito differential Calculus, change of probability measure, martingales, Stochastic Differential Equations and Partial Differential Equations.  Some of the pricing models considered are the European, Barrier, Asian and American options.  These problems are either solved analytically by the martingale approach or numerically, by applying approximation and simulation methods. ...\n\n      more description for FRE-GY 6233 »\n\n      \n\n\n\nThis course provides the mathematical foundations of Option Pricing models.  The techniques covered include arithmetic and geometric Brownian motion, first passage time, the reflection principle, the stochastic Ito integral, Ito differential Calculus, change of probability measure, martingales, Stochastic Differential Equations and Partial Differential Equations.  Some of the pricing models considered are the European, Barrier, Asian and American options.  These problems are either solved analytically by the martingale approach or numerically, by applying approximation and simulation methods.  Since the same techniques allow the treatment of more complex financial products, examples of credit derivatives will be also presented.  This course is a requirement in the Computational Finance Track | Prerequisite: FRE-GY 6083\n\n      less description for FRE-GY 6233 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6243",
            "course_name": "CREDIBILITY AND LOSS",
            "description": "FRE-GY 6243 CREDIBILITY AND LOSS \nThis course deals with actuarial models and the estimation of their parameters. Statistical parameter estimation techniques and Bayesian methods are used to study and interpret survival models. Quantitative methods for model selection and model testing are introduced. The basics of credibility theory provide the mathematical tools for an insurer’s prospective experience rating on a risk or a group of risks (e.g., to justify policy prices). Finally, model simulation techniques are treated in theory and practice. | Prerequisite: FRE-GY 6223 Actuarial Models.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6251",
            "course_name": "",
            "description": "FRE-GY 6251\n\n   NUMERICAL & SIMULATION TECHNIQUES IN FINANCE\n\nAdvanced numerical techniques for the solution of ordinary, partial and stochastic differential equations are presented.  These techniques are analyzed both mathematically and using computer aided software that allows for the solution and the handling of such problems.  In addition, the course introduces techniques for Monte Carlo simulation techniques and their use to deal with theoretically complex financial products in a tractable and practical manner.  Both self-writing of software as well as using outstanding computer programs routinely used in financial and insurance industries will be u...\n\n      more description for FRE-GY 6251 »\n\n      \n\n\n\nAdvanced numerical techniques for the solution of ordinary, partial and stochastic differential equations are presented.  These techniques are analyzed both mathematically and using computer aided software that allows for the solution and the handling of such problems.  In addition, the course introduces techniques for Monte Carlo simulation techniques and their use to deal with theoretically complex financial products in a tractable and practical manner.  Both self-writing of software as well as using outstanding computer programs routinely used in financial and insurance industries will be used.  | Prerequisite:  FRE-GY 6083 and Graduate Standing\n\n      less description for FRE-GY 6251 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6273",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6273\n\n   VALUATIONS & CORPORATE FINANCE\n\nThis course provides students with corporate finance theory and analytical skills essential to financial decision-making.  It helps students develop a framework that is useful for understanding a broad range of major corporate financial policies and equips students with tools and techniques useful for evaluationg firms and assessing a business' investment and financial policies.  Topics will include: discount cash flow models, financial statement analysis, valuations, capital budgeting analysis, capital structure, cost of capital, dividend policies, initial public offerings, and corporate gove...\n\n      more description for FRE-GY 6273 »\n\n      \n\n\n\nThis course provides students with corporate finance theory and analytical skills essential to financial decision-making.  It helps students develop a framework that is useful for understanding a broad range of major corporate financial policies and equips students with tools and techniques useful for evaluationg firms and assessing a business' investment and financial policies.  Topics will include: discount cash flow models, financial statement analysis, valuations, capital budgeting analysis, capital structure, cost of capital, dividend policies, initial public offerings, and corporate governance.  | Prerequisites: FRE-GY 6103 and FRE-GY 6003\n\n      less description for FRE-GY 6273 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6291",
            "classes": [
                {},
                {},
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6291\n\n   APPLIED DERIVATIVE CONTRACTS\n\nThis course provides an introduction to derivative contracts with a special emphasis on current practical applications in use today by financial institutions for investing, hedging, trading and issuing. The characteristics and features of futures, forwards, swaps, options and structured notes are all covered with a special emphasis on useful applications. For each of the four primary derivative contracts, we review in these lectures the appropriate definitions, terminology, market mechanics and theoretical fair value pricing.  | Prerequisite: FRE-GY 6003, FRE-GY 6023, FRE-GY 6103 and Graduate ...\n\n      more description for FRE-GY 6291 »\n\n      \n\n\n\nThis course provides an introduction to derivative contracts with a special emphasis on current practical applications in use today by financial institutions for investing, hedging, trading and issuing. The characteristics and features of futures, forwards, swaps, options and structured notes are all covered with a special emphasis on useful applications. For each of the four primary derivative contracts, we review in these lectures the appropriate definitions, terminology, market mechanics and theoretical fair value pricing.  | Prerequisite: FRE-GY 6003, FRE-GY 6023, FRE-GY 6103 and Graduate Standing\n\n      less description for FRE-GY 6291 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6303",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6303\n\n   Dynamic Assets and Option Pricing\n\nThis course provides the foundations of option pricing models. The problems are either solved analytically by the martingale and Partial Differential equation approaches,  or numerically, by applying approximation and simulation methods.  The applications to both European and American options, exotic options, and bonds  will be presented. Since the same techniques allow the treatment of more complex financial products, application to fixed income derivatives such as interest rate caps will also be presented. This course is a requirement in the Computational Finance Track and is a track electiv...\n\n      more description for FRE-GY 6303 »\n\n      \n\n\n\nThis course provides the foundations of option pricing models. The problems are either solved analytically by the martingale and Partial Differential equation approaches,  or numerically, by applying approximation and simulation methods.  The applications to both European and American options, exotic options, and bonds  will be presented. Since the same techniques allow the treatment of more complex financial products, application to fixed income derivatives such as interest rate caps will also be presented. This course is a requirement in the Computational Finance Track and is a track elective in the Risk Finance Track. | Prerequisites: Matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of Department & FRE-GY 6083.\n\n      less description for FRE-GY 6303 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6311",
            "course_name": "",
            "description": "FRE-GY 6311\n\n   Dynamic Assets and Options Pricing\n\nThe course focuses on inter-temporal assets pricing in discrete and continuous time. The course explores problems in complete and incomplete markets of both theoretical and practical interest that require an appreciation of financial economic theories and computational techniques. Financial-engineering techniques are introduced including Martingales, stochastic calculus and jump processes; these are applied to engineering problems in finance. Problems and cases are presented that span Stocks and Derivatives (options of various sorts), Bonds and Implied Risk-Neutral Pricing. | Prerequisites: FR...\n\n      more description for FRE-GY 6311 »\n\n      \n\n\n\nThe course focuses on inter-temporal assets pricing in discrete and continuous time. The course explores problems in complete and incomplete markets of both theoretical and practical interest that require an appreciation of financial economic theories and computational techniques. Financial-engineering techniques are introduced including Martingales, stochastic calculus and jump processes; these are applied to engineering problems in finance. Problems and cases are presented that span Stocks and Derivatives (options of various sorts), Bonds and Implied Risk-Neutral Pricing. | Prerequisites: FRE-GY 6083, FRE-GY 6123 and Graduate Standing\n\n      less description for FRE-GY 6311 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6321",
            "course_name": "CASUALTY I",
            "description": "FRE-GY 6321 CASUALTY I \nThis course broadens perspectives on the business environment in which actuaries work and analyzes insurance-pricing cycles and regulatory developments. Rating and solvency issues are covered, as well as the rating of individual risks and the concept of loss reserve. The course also touches on issues behind daily events and the impact of current developments in the actuarial sciences on the actuarial function. | Pre-Requisite: FRE-GY 6051 Insurance Finance and Actuarial Science.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6331",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6331\n\n   FINANCIAL RISK MANAGEMENT AND OPTIMIZATION\n\nThis course provides solutions to the inter-temporal problems in financial management of portfolios, credit risks and market making. Dynamic and stochastic dynamic programming techniques as well as optimal control and stochastic control principles of optimality are presented, and their financial contexts emphasized. Both theoretical and practical facets of inter-temporal management of financial risks and risk pricing are also stressed. The course uses financial and optimization software to solve problems practically. | Prerequisites: FRE-GY 6083, FRE-GY 6123, and FRE-GY 6091 and Graduate Stand...\n\n      more description for FRE-GY 6331 »\n\n      \n\n\n\nThis course provides solutions to the inter-temporal problems in financial management of portfolios, credit risks and market making. Dynamic and stochastic dynamic programming techniques as well as optimal control and stochastic control principles of optimality are presented, and their financial contexts emphasized. Both theoretical and practical facets of inter-temporal management of financial risks and risk pricing are also stressed. The course uses financial and optimization software to solve problems practically. | Prerequisites: FRE-GY 6083, FRE-GY 6123, and FRE-GY 6091 and Graduate Standing.\n\n      less description for FRE-GY 6331 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6341",
            "course_name": "CASUALTY II",
            "description": "FRE-GY 6341 CASUALTY II \nThis course continues FRE-GY 6321. It covers operational issues of Property and Casualty insurance. Specialized Lines of Business are treated. An introduction to Classification Analysis is given. | Prerequisite: FRE-GY 6321.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6351",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6351\n\n   Econometrics and Time Series Analysis\n\nFinancial econometrics has matured into a necessary and essential part of financial engineering that provides opportunities to deal with real and practical problems in finance. For example, techniques such as ARCH and GARCH and their subsequent development are used to estimate the volatility of underlying financial processes; the analysis of intra-day trading data that requires particular models and techniques; memory-based and fractal stochastic processes to study complex markets behaviors and copulas applied routinely to model- and estimate-dependent risks. These financial and risk problems ...\n\n      more description for FRE-GY 6351 »\n\n      \n\n\n\nFinancial econometrics has matured into a necessary and essential part of financial engineering that provides opportunities to deal with real and practical problems in finance. For example, techniques such as ARCH and GARCH and their subsequent development are used to estimate the volatility of underlying financial processes; the analysis of intra-day trading data that requires particular models and techniques; memory-based and fractal stochastic processes to study complex markets behaviors and copulas applied routinely to model- and estimate-dependent risks. These financial and risk problems require the application of advanced financial-econometric techniques, which the course provides from both theoretical and empirical-applied viewpoints. Selected cases provide a real-world sense of financial engineering when it is faced with financial-market reality and complexity. | Prerequisite: FRE-GY 6083 and Graduate Standing\n\n      less description for FRE-GY 6351 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6361",
            "classes": [
                {}
            ],
            "course_name": "Corporate and Financial Strategy",
            "description": "FRE-GY 6361 Corporate and Financial Strategy \nThis is an introduction to financial strategy for MS Financial Engineering students. The course focuses on the role of financial engineers and financial officers in developing and sustaining competitive advantage through the use of financial engineering analyses. | Prerequisites: Matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of the Department & FRE-GY 6023 and FRE-GY 6103.",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6371",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6371\n\n   Contract Economics\n\nThis course covers advanced material in applied economics for students of financial engineering. The topics discussed include the development of contractual relationships between parties with dissimilar interests. These include risks of moral hazard and the design of incentives, adverse selection and market signaling, auction theory and the winner’s curse, and distributed and integrative negotiation. Students who complete this course successfully obtain an appreciation for the theoretical and practical challenges in completing contracts that provide satisfactory economic incentives to each par...\n\n      more description for FRE-GY 6371 »\n\n      \n\n\n\nThis course covers advanced material in applied economics for students of financial engineering. The topics discussed include the development of contractual relationships between parties with dissimilar interests. These include risks of moral hazard and the design of incentives, adverse selection and market signaling, auction theory and the winner’s curse, and distributed and integrative negotiation. Students who complete this course successfully obtain an appreciation for the theoretical and practical challenges in completing contracts that provide satisfactory economic incentives to each party and satisfy the other party’s belief that the required terms will be met. | Prerequisite: FRE-GY 6023 and Graduate Standing\n\n      less description for FRE-GY 6371 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6391",
            "classes": [
                {}
            ],
            "course_name": "MERGERS & ACQUISITIONS",
            "description": "FRE-GY 6391 MERGERS & ACQUISITIONS \nThis course examines the theories and empirical evidence related to mergers and acquisitions and other corporate transactions and reorganizations. The course looks at friendly mergers, hostile takeovers (including takeover and anti-takeover tactics), leveraged buyouts and bankruptcy. Throughout, the course examines the motives behind these transactions and reorganizations. | Prerequisites: FRE-GY 6103 and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6411",
            "classes": [
                {},
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6411\n\n   Fixed Income Securities and Interest Rate Derivatives\n\nThis course examines the body of analytical tools and measures that constitute modern fixed-income markets. The valuation of interest-rate sensitive cash flows is the unifying theme. Major topics include theories of term structure, institutional aspects of fixed-income markets and analytical techniques for managing interest-rate risk. Bond refunding, defeasance, corporate bonds, forwards, futures, options and interest-rate swaps are discussed. The course gives an overview of the major classes of fixed-income securities and the markets in which they trade. Among the major classes of fixed-incom...\n\n      more description for FRE-GY 6411 »\n\n      \n\n\n\nThis course examines the body of analytical tools and measures that constitute modern fixed-income markets. The valuation of interest-rate sensitive cash flows is the unifying theme. Major topics include theories of term structure, institutional aspects of fixed-income markets and analytical techniques for managing interest-rate risk. Bond refunding, defeasance, corporate bonds, forwards, futures, options and interest-rate swaps are discussed. The course gives an overview of the major classes of fixed-income securities and the markets in which they trade. Among the major classes of fixed-income instruments discussed are Treasury and agency securities, mortgage-backed securities (including CMOs and Strips), asset-backed securities, municipals, floating and inverse floating rate securities. | Prerequisite: FRE-GY 6023, FRE-GY 6083, FRE-GY 6103 and Graduate Standing\n\n      less description for FRE-GY 6411 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6451",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6451\n\n   BEHAVIORAL FINANCE\n\nThis course discusses investors’ systematic deviations from the level of financial rationality assumed by modern financial theory. Such biased behavior can lead to market inefficiencies, market opportunities and market failure. After a brief introduction to the topic and its research history, the course focuses on the limits to arbitrage created by decision bias, the equity premium puzzle, market over-reaction and under-reaction. The course seeks to understand how and where opportunities for and threats to wealth accumulation exist as a result of the mismatch between investor behavior and the ...\n\n      more description for FRE-GY 6451 »\n\n      \n\n\n\nThis course discusses investors’ systematic deviations from the level of financial rationality assumed by modern financial theory. Such biased behavior can lead to market inefficiencies, market opportunities and market failure. After a brief introduction to the topic and its research history, the course focuses on the limits to arbitrage created by decision bias, the equity premium puzzle, market over-reaction and under-reaction. The course seeks to understand how and where opportunities for and threats to wealth accumulation exist as a result of the mismatch between investor behavior and the algorithmic assumptions about investment behavior inherent in financial theory. | Prerequisite: FRE-GY 6023 and Graduate Standing.\n\n      less description for FRE-GY 6451 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6471",
            "course_name": "APPLIED FINANCIAL ECONOMETRICS",
            "description": "FRE-GY 6471 APPLIED FINANCIAL ECONOMETRICS \nThis course builds on the concepts covered in FRE 6091 and addresses the design, estimation and application of both univariate and multivariate time-series models that are used widely in finance and risk engineering. Financial econometric techniques such as ARCH-GARCH methods and the use of numerical techniques and simulation. | Prerequisites: FRE-GY 6083, FRE-GY 6091.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6491",
            "classes": [
                {}
            ],
            "course_name": "Credit Risk & Financial Risk Management",
            "description": "FRE-GY 6491 Credit Risk & Financial Risk Management \nThis course provides an overview and analysis of the market for debt obligations of state and local governments. Topics will include the micro structure of the market, including the types of debt issued, and characteristics of the buyers. Federal and state taxation of munis will be discussed, along with industry regulatory structure. Bond structure, risk assessment and risk management using cash bonds, futures and options will be covered. | Prerequisites: FRE-GY 6411 and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6511",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6511\n\n   DERIVATIVES ALGORITHMS\n\nThis course focuses on the algorithms behind derivatives valuation and applications. The focus is on the principles and practice of financial engineering and risk management and on developing intuition: understanding the reasons for the existence of the product, simulating possible paths and possible parameter values as an exploratory process, approximating complex derivatives as a combination of simpler ones, and attempting to replicate the payout. The goal is to prepare you to be able to evaluate an arbitrary derivative given only its term sheet. To that end, the course requires a project al...\n\n      more description for FRE-GY 6511 »\n\n      \n\n\n\nThis course focuses on the algorithms behind derivatives valuation and applications. The focus is on the principles and practice of financial engineering and risk management and on developing intuition: understanding the reasons for the existence of the product, simulating possible paths and possible parameter values as an exploratory process, approximating complex derivatives as a combination of simpler ones, and attempting to replicate the payout. The goal is to prepare you to be able to evaluate an arbitrary derivative given only its term sheet. To that end, the course requires a project almost every week. Projects can be done in any programming language (Excel, Mathematica, R, Python, etc.), but the final result must be stand-alone tables and graphs. The primary prerequisite is familiarity with standard option pricing and Greeks. A portion of the final exam may involve a live computation project. | Prerequisite: FRE-GY 6123 and Graduate Standing\n\n      less description for FRE-GY 6511 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6513",
            "course_name": "",
            "description": "FRE-GY 6513\n\n   INTERM DERIV VALUAT & APPLIC\n\nThis course covers increasingly exotic derivatives. The focus is on the principles and practice of financial engineering and risk management and on developing intuition: understanding the reasons for the existence of the product, simulating possible paths and possible parameter values as an exploratory process, approximating complex derivatives as a combination of simpler ones, and attempting to replicate the payout. The goal is to prepare you to be able to evaluate an arbitrary derivative given only its term sheet. To that end, the course requires a project almost every week. Projects can be ...\n\n      more description for FRE-GY 6513 »\n\n      \n\n\n\nThis course covers increasingly exotic derivatives. The focus is on the principles and practice of financial engineering and risk management and on developing intuition: understanding the reasons for the existence of the product, simulating possible paths and possible parameter values as an exploratory process, approximating complex derivatives as a combination of simpler ones, and attempting to replicate the payout. The goal is to prepare you to be able to evaluate an arbitrary derivative given only its term sheet. To that end, the course requires a project almost every week. Projects can be done in any programming language (Excel, Mathematica, R, Python, etc.), but the final result must be stand-alone tables and graphs. The primary prerequisite is familiarity with standard option pricing and Greeks.  Prerequisite: FRE-GY 6123\n\n      less description for FRE-GY 6513 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6531",
            "course_name": "FINANCIAL TAXATION",
            "description": "FRE-GY 6531 FINANCIAL TAXATION \nPrerequisites:  Graduate Standing",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6551",
            "course_name": "Accounting for Financial Products",
            "description": "FRE-GY 6551 Accounting for Financial Products \nThis course addresses accounting issues pertaining to innovative financial products, risk-management strategies, tax-driven strategies and other manifestations of financial engineering, particularly those in which derivative financial instruments play an important role. Accounting and tax rules are reviewed and applied. | Prerequisites: FRE-GY 6003.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6571",
            "classes": [
                {}
            ],
            "course_name": "Asset-backed Securities and Securitization",
            "description": "FRE-GY 6571 Asset-backed Securities and Securitization \nThis course examines essential contributions in this field and provides a comprehensive coverage of financial securitization and their application to major asset-backed securities, structuring issues and relative value analysis. Topics include the expanding frontiers of asset securitization; introduction to ABS accounting; trends in the structuring of ABSs; and prepayment nomenclature in the ABS market. | Prerequisites: FRE-GY 6411, FRE-GY 6511 and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6591",
            "course_name": "",
            "description": "FRE-GY 6591\n\n   Real Estate Finance and Mortgage-backed Securities\n\nThis course takes the student from a general introduction to real estate finance and applied mortgage-backed securities (MBS) to a detailed treatment of issues that make real estate and these instruments some of the most complex. Students learn the fundamentals of yield curves, mortgage-cash flows, prepayments and analysis. The course covers pass-throughs, CMOs, mortgage derivatives and ARMs. Asset/Liability management of MBS will be discussed. Students build a price-yield calculator for MBS pass-throughs (using a spreadsheet) and complete a course project. | Prerequisites: FRE-GY 6411, FRE-GY...\n\n      more description for FRE-GY 6591 »\n\n      \n\n\n\nThis course takes the student from a general introduction to real estate finance and applied mortgage-backed securities (MBS) to a detailed treatment of issues that make real estate and these instruments some of the most complex. Students learn the fundamentals of yield curves, mortgage-cash flows, prepayments and analysis. The course covers pass-throughs, CMOs, mortgage derivatives and ARMs. Asset/Liability management of MBS will be discussed. Students build a price-yield calculator for MBS pass-throughs (using a spreadsheet) and complete a course project. | Prerequisites: FRE-GY 6411, FRE-GY 6571 and Graduate Standing\n\n      less description for FRE-GY 6591 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6611",
            "course_name": "Credit Derivatives",
            "description": "FRE-GY 6611 Credit Derivatives \nThis course introduces credit derivatives and Collateralized Debt Obligations (CDO’s). The course reviews the most important credit instruments and their marketing, starting with risky bonds and credit default swaps, through basket swaps, structured products and CDO’s. Each instrument is defined and explained, including its markets, modeling, pricing and risk management. Class work is illustrated with theoretical homework and practical Excel projects. | Prerequisite: FRE-GY 6411, FRE-GY 6511.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6631",
            "course_name": "",
            "description": "FRE-GY 6631\n\n   Applied Derivatives and Real Options Finance\n\nThis course focuses on financial-engineering applications using derivatives, alone and in combination with other financial instruments. In addition to studying complex financial-engineering structures, students consider applications of real options to the many industrial and assets management problems dealt with by business firms.  Examples of applications include case problems in real options as well as issues in tax arbitrage, the construction of equity collars on restricted stock, the alteration of the investment characteristics of large portfolios, and the creation of synthetic financial i...\n\n      more description for FRE-GY 6631 »\n\n      \n\n\n\nThis course focuses on financial-engineering applications using derivatives, alone and in combination with other financial instruments. In addition to studying complex financial-engineering structures, students consider applications of real options to the many industrial and assets management problems dealt with by business firms.  Examples of applications include case problems in real options as well as issues in tax arbitrage, the construction of equity collars on restricted stock, the alteration of the investment characteristics of large portfolios, and the creation of synthetic financial instruments. | Prerequisites: FRE-GY 6411, FRE-GY 6511.\n\n      less description for FRE-GY 6631 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6651",
            "course_name": "Term Structure Modeling and Advanced Interest Rate Derivatives",
            "description": "FRE-GY 6651 Term Structure Modeling and Advanced Interest Rate Derivatives \nThis course covers term-structure models, the term structure of volatility, interest-rate processes with time-dependent volatility and mean reversion, a closer look at path-dependent securities, including sinking fund bonds and options with look-back features, multi-factor models and multinomial methods of discrete numerical implementations. Course readings are drawn from current literature. | Prerequisites: FRE-GY 6411, FRE-GY 6511. Students are expected to know numerical analysis.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6671",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6671\n\n   Global Finance\n\nThe level of economic and financial globalization combined with the growth of the multinational firms and virtual firms with no boundaries may have altered the future of finance and its risk engineering. The purpose of this course is to focus attention on the essential elements that both large financial firms and institutions are confronting worldwide, the challenges of national and international financial investments, currencies speculations and investments, regulation as well as managing risks in a strategic and macroeconomic environment. In such an environment, financial markets are multi-p...\n\n      more description for FRE-GY 6671 »\n\n      \n\n\n\nThe level of economic and financial globalization combined with the growth of the multinational firms and virtual firms with no boundaries may have altered the future of finance and its risk engineering. The purpose of this course is to focus attention on the essential elements that both large financial firms and institutions are confronting worldwide, the challenges of national and international financial investments, currencies speculations and investments, regulation as well as managing risks in a strategic and macroeconomic environment. In such an environment, financial markets are multi-polar, geographically distributed with national entities pursuing their own economic and political agenda. | Prerequisites: FRE-GY 6411 and FRE-GY 6511 and matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of the Department\n\n      less description for FRE-GY 6671 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6691",
            "course_name": "Intermediate Credit Derivatives Valuation and Applications",
            "description": "FRE-GY 6691 Intermediate Credit Derivatives Valuation and Applications \nCredit derivatives have emerged as an area of significant interest in global derivatives and risk- management practice. These instruments have the potential to revolutionize the management of credit risk in banking and capital markets. This course introduces the full range of products available in today’s marketplace, the economic value of credit derivatives, valuation techniques and guidelines on using them to manage and control risk. | Prerequisites: FRE-GY 6411, FRE-GY 6511.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6711",
            "classes": [
                {},
                {}
            ],
            "course_name": "Quantitative Portfolio Management",
            "description": "FRE-GY 6711 Quantitative Portfolio Management \nThis course focuses on the quantitative foundations of portfolio management . It teaches the fundamental mathematical models such as the Markowitz,  CAPM, and  the Merton investment-consumption models, and discusses the issues related to the implementation of these models in practice to different types of portfolios. Finally, it also introduces some common portfolio construction and rebalancing techniques. | Prerequisites: Matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of the Department & FRE-GY 6083",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6731",
            "classes": [
                {}
            ],
            "course_name": "Basel 3 & Banking Assets Management",
            "description": "FRE-GY 6731 Basel 3 & Banking Assets Management \nThis course addresses financial risk management and particularly focuses on Basel 3 directives and Value at Risk (VaR), a method to assess risk that employs standard statistical techniques routinely used in other fields. VaR analysis is used by bank and corporate managers and by financial market regulators. | Co-requisite: FRE-GY 6711 and Graduate Standing.",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6751",
            "course_name": "Credit Risk Measurement and Management",
            "description": "FRE-GY 6751 Credit Risk Measurement and Management \nThis course deals with issues in credit-risk measurement, credit-risk management and related areas in which credit considerations are important. These issues arise in credit-rating activity, credit extension by banks and other financial services and in derivative markets where counter-party risk is perceived to be an important management issue. | Co-requisite: FRE-GY 6711.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6771",
            "course_name": "FINANCIAL OPTIMIZATION TECHNIQUES",
            "description": "FRE-GY 6771 FINANCIAL OPTIMIZATION TECHNIQUES \nThe course introduces optimization concepts intended for coping with financial stochastic processes. The course involves both numerical analysis with commercial solvers and analytical approaches for gaining insights into underlying problems. The course covers three major optimization areas: convex optimization, non-convex optimization and stochastic programming. Conceptual frameworks and techniques are taught through applications and problems in financial engineering and management. | Prerequisite: FRE-GY 6311. Co-Requisite: None. Notes: None.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6803",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6803\n\n   Financial Engineering (research course)\n\nThis course is a research/case effort and can be handled in different ways at the discretion of the faculty supervisor. The course may involve a series of cases that are dissected and analyzed. It may involve teaming students with industry personnel for proprietary or non-proprietary research projects. Or it may involve thesis-type research. Generally, students work under faculty supervision, but the course is intended to be largely self-directed within guidelines established by the supervising faculty member. A significant written research component is required. Prerequisites: This course sho...\n\n      more description for FRE-GY 6803 »\n\n      \n\n\n\nThis course is a research/case effort and can be handled in different ways at the discretion of the faculty supervisor. The course may involve a series of cases that are dissected and analyzed. It may involve teaming students with industry personnel for proprietary or non-proprietary research projects. Or it may involve thesis-type research. Generally, students work under faculty supervision, but the course is intended to be largely self-directed within guidelines established by the supervising faculty member. A significant written research component is required. Prerequisites: This course should be taken during the student’s final semester. | Prerequisites vary depending on the student’s track and the nature of the chosen project.\n\n      less description for FRE-GY 6803 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6811",
            "classes": [
                {}
            ],
            "course_name": "FINANCIAL SOFTWARE LABORATORY",
            "description": "FRE-GY 6811 FINANCIAL SOFTWARE LABORATORY \nThis course teaches students to use financial software tools commonly employed in industry. Examples include: @Risk, Yieldbook, Excel, R, and C++.   |  Prerequisites:  Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6821",
            "classes": [
                {}
            ],
            "course_name": "FINANCIAL ECONOMETRIC LABORATORY",
            "description": "FRE-GY 6821 FINANCIAL ECONOMETRIC LABORATORY \nThis course teaches students to use Eviews and Stata.  |  Prerequisites:  Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6831",
            "classes": [
                {},
                {}
            ],
            "course_name": "COMPUTATIONAL FINANCE LABORATORY",
            "description": "FRE-GY 6831 COMPUTATIONAL FINANCE LABORATORY \nThis course teaches students to use Matlab and GAMS.  |  Prerequisites:  Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6841",
            "course_name": "Financial Lab 4: S-Plus and R",
            "description": "FRE-GY 6841 Financial Lab 4: S-Plus and R \nThis course teaches students to use S-Plus and R.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6851",
            "course_name": "Financial Lab 5: C++",
            "description": "FRE-GY 6851 Financial Lab 5: C++ \nThis course teaches students to use C++.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6861",
            "course_name": "",
            "description": "FRE-GY 6861\n\n   FINANCIAL SOFTWARE ENGINEERING LABORATORY\n\nThis financial lab requires students to publicly participate in a large software project. This participation could take the form of contributing to an open-source financial software project with the contributions being accepted and committed to the main branch, or publishing a stand-alone library or package for a programming language commonly used in financial applications, or the development or updating of a brand-new industrial strength financial software application. As the students work on their project, this course will focus on important software engineering considerations specifically a...\n\n      more description for FRE-GY 6861 »\n\n      \n\n\n\nThis financial lab requires students to publicly participate in a large software project. This participation could take the form of contributing to an open-source financial software project with the contributions being accepted and committed to the main branch, or publishing a stand-alone library or package for a programming language commonly used in financial applications, or the development or updating of a brand-new industrial strength financial software application. As the students work on their project, this course will focus on important software engineering considerations specifically as they apply to the fast-paced world of financial projects, such as formalized procedures for revision control and bug tracking and other proven methods of software management in a fast-paced financial environment. | Prerequisite:  Graduate Standing\n\n      less description for FRE-GY 6861 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6871",
            "classes": [
                {},
                {}
            ],
            "course_name": "R in Finance",
            "description": "FRE-GY 6871 R in Finance \nThis course introduces the free programming language R and its many applications to finance including risk management, portfolio construction, strategy development and testing, and trading and execution. Topics covered include financial time series analysis, advanced risk tools, applied econometrics, portfolio management, and derivatives valuation. Students will be required to write some code in R every week. | Prerequisites: Matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of the Department & FRE-GY 6123 and FRE-GY 6083",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6883",
            "classes": [
                {},
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 6883\n\n   Financial Computing\n\nThis course covers programming applications to financial engineering, including C++ and Java and the various common development environments for them. Topics include structured and object-oriented programming in C++ with applications to binomial options pricing, multi-threaded programming in Java with applets and graphical interfaces with applications to risk measurement tools, data-based manipulation and programming in SQL and standard database access libraries with applications to historical financial data series retrieval and management, and other advanced programming concepts important for...\n\n      more description for FRE-GY 6883 »\n\n      \n\n\n\nThis course covers programming applications to financial engineering, including C++ and Java and the various common development environments for them. Topics include structured and object-oriented programming in C++ with applications to binomial options pricing, multi-threaded programming in Java with applets and graphical interfaces with applications to risk measurement tools, data-based manipulation and programming in SQL and standard database access libraries with applications to historical financial data series retrieval and management, and other advanced programming concepts important for financial engineering such as numerical techniques, trading systems, and large-scale software design. | Matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of the Department.\n\n      less description for FRE-GY 6883 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6901",
            "course_name": "SELECTED TOPICS IN FINANCIAL ENGINEERING",
            "description": "FRE-GY 6901 SELECTED TOPICS IN FINANCIAL ENGINEERING \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide focus for further study. Examples might include infrastructure and projects finance, international and global finance, economics and finance in developing countries, global finance in a global world, international investment strategies, finance and taxes, among others. | Prerequisites: advanced standing and instructor’s permission.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6911",
            "course_name": "",
            "description": "FRE-GY 6911\n\n   Financial Regulation\n\nThe course provides an overview of the legal and institutional framework of regulations for capital markets, with a strong emphasis on the United States with some discussion of the financial regulation of banks, insurance firms and financial services in general. In addition, attention is given to regulation in global and emerging markets. The goal is to develop a practical understanding for application in business decision making. The course explores the interplay of regulation (both intended and unintended effects), risk management and the evolution of global modern banking. In light of curre...\n\n      more description for FRE-GY 6911 »\n\n      \n\n\n\nThe course provides an overview of the legal and institutional framework of regulations for capital markets, with a strong emphasis on the United States with some discussion of the financial regulation of banks, insurance firms and financial services in general. In addition, attention is given to regulation in global and emerging markets. The goal is to develop a practical understanding for application in business decision making. The course explores the interplay of regulation (both intended and unintended effects), risk management and the evolution of global modern banking. In light of current market developments, the course develops a critical perspective and discusses potential approaches to the structure of financial regulation. | Prerequisite: None. Co-requisite: None. Notes: None.\n\n      less description for FRE-GY 6911 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6921",
            "course_name": "Selected Topics in Financial Engineering",
            "description": "FRE-GY 6921 Selected Topics in Financial Engineering \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide focus for further study. Examples might include infrastructure and projects finance, international and global finance, economics and finance in developing countries, global finance in a global world, international investment strategies, finance and taxes, among others. | Prerequisites: advanced standing and instructor’s permission.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6931",
            "course_name": "SELECTED TOPICS IN FINANCIAL ENGINEERING",
            "description": "FRE-GY 6931 SELECTED TOPICS IN FINANCIAL ENGINEERING \nPrerequisite: Graduate Standing",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6941",
            "course_name": "SP TPC IN APPLIED CREDIT DERIVATIVES & SECURITIZATION",
            "description": "FRE-GY 6941 SP TPC IN APPLIED CREDIT DERIVATIVES & SECURITIZATION",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6951",
            "course_name": "SELECTED TOPICS IN FINANCIAL ENGINEERING",
            "description": "FRE-GY 6951 SELECTED TOPICS IN FINANCIAL ENGINEERING \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide focus for further study. Examples might include infrastructure and projects finance, international and global finance, economics and finance in developing countries, global finance in a global world, international investment strategies, finance and taxes, among others. | Prerequisites: advanced standing and instructor’s permission.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6961",
            "course_name": "SELECTED TOPICS IN FINANCIAL ENGINEERING",
            "description": "FRE-GY 6961 SELECTED TOPICS IN FINANCIAL ENGINEERING \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide focus for further study. Examples might include infrastructure and projects finance, international and global finance, economics and finance in developing countries, global finance in a global world, international investment strategies, finance and taxes, among others. | Prerequisites: advanced standing and instructor’s permission.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6971",
            "classes": [
                {}
            ],
            "course_name": "SEL TOPICS IN FINANCIAL ENGRFINANCIAL ANALYTICS & BIG DATA",
            "description": "FRE-GY 6971 SEL TOPICS IN FINANCIAL ENGRFINANCIAL ANALYTICS & BIG DATA \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics will be emphasized and provide focus for further study. Examples might include urban finance engineering, environmental\nfinance, infrastructure and projects finance, real estate finance, insurance\nfinance and derivatives, macro hedge funds management, among others. Prerequisites: advanced standing and instructor’s permission and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 6981",
            "course_name": "SEL TOPICS IN FINANCIAL ENGR",
            "description": "FRE-GY 6981 SEL TOPICS IN FINANCIAL ENGR \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics will be emphasized and provide focus for further study. Examples might include urban finance engineering, environmental\nfinance, infrastructure and projects finance, real estate finance, insurance\nfinance and derivatives, macro hedge funds management, among others. Prerequisites: advanced standing and instructor’s permission and Graduate Standing",
            "offering": false
        },
        {
            "course_id": "FRE-GY 6991",
            "course_name": "SEL TPCS IN FINANCIAL ENGINEERING",
            "description": "FRE-GY 6991 SEL TPCS IN FINANCIAL ENGINEERING \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide focus for further study. Examples might include infrastructure and projects finance, international and global finance, economics and finance in developing countries, global finance in a global world, international investment strategies, finance and taxes, among others. Prerequisites: advanced standing and instructor’s permission and Graduate Standing",
            "offering": false
        },
        {
            "course_id": "FRE-GY 7023",
            "classes": [
                {},
                {}
            ],
            "course_name": "Financial Engineering Capstone: Internship",
            "description": "FRE-GY 7023 Financial Engineering Capstone: Internship \nIn this course, the Career Services Office helps the student to secure an internship. Students work under faculty supervision. However, the course is intended to be largely self-directed within the guidelines established by the supervising faculty member. A paper based on the internship work is required. | Prerequisites: This course should be taken during the student’s final semester. Prerequisites vary depending on the student’s track and the nature of the internship and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7043",
            "classes": [
                {},
                {},
                {},
                {}
            ],
            "course_name": "Financial Engineering Capstone: Project",
            "description": "FRE-GY 7043 Financial Engineering Capstone: Project \nIn this project course, students work with faculty on proprietary or non-proprietary research projects. Generally, students work under faculty supervision. However, the course is intended to be largely self-directed within the guidelines established by the supervising faculty member. A significant written research component is required. | Prerequisites: This course should be taken during the student’s final semester. Prerequisites vary depending on the student’s track and the nature of the project to be undertaken  and Graduate Standing.",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7103",
            "course_name": "MACROECONOMICS",
            "description": "FRE-GY 7103 MACROECONOMICS \nMacroeconomics deals with the performance, structure and behavior of a national or regional economy as a whole. This course provides the basic tools for analyzing macroeconomic phenomena. Economic models are developed that explain the relationship between factors such as national income, output, consumption, unemployment, inflation, savings, investment, international trade and international finance. Applications investigate the causes and consequences of short-run fluctuations in national income and attempts at predicting long-run economic growth. | Prerequisite: None.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 7121",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 7121\n\n   Statistical Arbitrage\n\nStatistical arbitrage refers to strategies that combine many relatively independent positive expected value trades so that profit, while not guaranteed, becomes very likely. This course prepares students to research and practice in this area by providing the tools and techniques to generate and evaluate individual trading strategies, combine them into a coherent portfolio, manage the resulting risks, and monitor for excess deviations from expected performance. It introduces theoretical concepts such as cointegration, risk capital allocation, proper backtesting, and factor analysis, as well as ...\n\n      more description for FRE-GY 7121 »\n\n      \n\n\n\nStatistical arbitrage refers to strategies that combine many relatively independent positive expected value trades so that profit, while not guaranteed, becomes very likely. This course prepares students to research and practice in this area by providing the tools and techniques to generate and evaluate individual trading strategies, combine them into a coherent portfolio, manage the resulting risks, and monitor for excess deviations from expected performance. It introduces theoretical concepts such as cointegration, risk capital allocation, proper backtesting, and factor analysis, as well as practical considerations such as data mining, automated systems, and trade execution. Programming languages such as R, Python, or C++ will be used to present applications to data at low, intermediate and high frequency. | Prerequisites: Matriculation into a graduate program sponsored by the Department of Finance & Risk Engineering, or permission of the Department & FRE-GY 6123 and FRE-GY 6083\n\n      less description for FRE-GY 7121 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7211",
            "classes": [
                {}
            ],
            "course_name": "FORENSIC FINANCIAL TECHNOLOGY AND REGULATORY SYSTEMS",
            "description": "FRE-GY 7211 FORENSIC FINANCIAL TECHNOLOGY AND REGULATORY SYSTEMS \nThe goal of this course is to understand the technology behind financial forensics and regulatory systems.  These include innovative database techniques (\"dataveillance\"), artificial intelligence, data mining, and non-parametric outlier methods used by the Secuities Exchange Commission (SEC), the Financial Industry Regulatory Authority (FINRA), as well as the FBI, and other federal and state agencies. Student teams will prepare and present projects or case studies applying hte concepts covered in class. | Prerequisite: FRE-GY 6151 and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7221",
            "course_name": "BIG DATA IN FINANCE",
            "description": "FRE-GY 7221 BIG DATA IN FINANCE \nThis is an advanced course on practical computer science and database topics most relevant to financial applications.  As such it covers fundamental concepts such as financial database design, use, and maintenance, distributed financial computing and associated storage, grid and cloud computing, modeling unstructured financial data, and data mining for risk management. | Prerequisite: FRE-GY 6151 and Graduate Standing",
            "offering": false
        },
        {
            "course_id": "FRE-GY 7241",
            "classes": [
                {}
            ],
            "course_name": "ALGORITHMIC PORTFOLIO MANAGEMENT",
            "description": "FRE-GY 7241 ALGORITHMIC PORTFOLIO MANAGEMENT \nThis course focuses on portfolio construction and rebalancing strategies such as momentum, value, and size strategies, among others. The course emphasizes backtesting and risk factor analysis as well as optimization to reduce tracking error. It will also address how a quantitative investment approach can help both individual and institutional investors make sound long-term investment decisions. | Prerequisite: FRE-GY 6123 and Graduate Standing",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7251",
            "classes": [
                {},
                {}
            ],
            "course_name": "",
            "description": "FRE-GY 7251\n\n   ALGORITHMIC TRADING & HIGH-FREQUENCY FINANCE\n\nAlgorithmic trading refers to the utilization of special computer programs in an order management system that restructure an order into a sequence of sub-orders based on the dimensions of submission time, price, size, and side. The goal of this course is to survey several algorithmic strategies used by financial institutions and to understand their implementation in the context of order management systems and standard financial protocols (such as FIX and FIXatdl). Student teams will prepare and present projects or case studies applying the concepts covered in class. | Prerequisites: FRE-GY 615...\n\n      more description for FRE-GY 7251 »\n\n      \n\n\n\nAlgorithmic trading refers to the utilization of special computer programs in an order management system that restructure an order into a sequence of sub-orders based on the dimensions of submission time, price, size, and side. The goal of this course is to survey several algorithmic strategies used by financial institutions and to understand their implementation in the context of order management systems and standard financial protocols (such as FIX and FIXatdl). Student teams will prepare and present projects or case studies applying the concepts covered in class. | Prerequisites: FRE-GY 6151 and FRE-GY 7221 and Graduate Standing\n\n      less description for FRE-GY 7251 «",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7261",
            "course_name": "",
            "description": "FRE-GY 7261\n\n   NEWS ANALYTICS & STRATEGIES\n\nThe fast-growing field of news analytics requires large databases, fast computation, and robust statistics. This course introduces the tools and techniques of analyzing news, how to quantify textual items based on, for example, positive or negative sentiment, relevance to each stock, and the amount of novelty in the content. Applications to trading strategies are discussed, including both absolute and relative return strategies, and risk management strategies. Students will be exposed to leading software in this cutting-edge space. | Prerequisites: FRE-GY 6151 and FRE-GY 7221 and Graduate Stan...\n\n      more description for FRE-GY 7261 »\n\n      \n\n\n\nThe fast-growing field of news analytics requires large databases, fast computation, and robust statistics. This course introduces the tools and techniques of analyzing news, how to quantify textual items based on, for example, positive or negative sentiment, relevance to each stock, and the amount of novelty in the content. Applications to trading strategies are discussed, including both absolute and relative return strategies, and risk management strategies. Students will be exposed to leading software in this cutting-edge space. | Prerequisites: FRE-GY 6151 and FRE-GY 7221 and Graduate Standing\n\n      less description for FRE-GY 7261 «",
            "offering": false
        },
        {
            "course_id": "FRE-GY 7801",
            "classes": [
                {},
                {},
                {},
                {},
                {}
            ],
            "course_name": "TOPICS IN FINANCE AND FINANCIAL MARKETS IASIA'S FINANCIAL MARKETPRIVATE EQUITYREAL TIME TRADING RISK MANAGEMENTSECURITIZATION",
            "description": "FRE-GY 7801 TOPICS IN FINANCE AND FINANCIAL MARKETS IASIA'S FINANCIAL MARKETPRIVATE EQUITYREAL TIME TRADING RISK MANAGEMENTSECURITIZATION \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide focus for further study. Examples might include Financial Economics, Macroeconomics and Finance, the Bond market, the securities markets, Derivatives markets, Contract Theory, Credit and Counterparty Risks, Banking Finance and others. | Prerequisites: Graduate standing and instructor’s permission",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7811",
            "course_name": "Topics in Finance and Financial Markets 2",
            "description": "FRE-GY 7811 Topics in Finance and Financial Markets 2 \nThe course analyzes and discusses current topics of particular importance in finance and risk engineering. Selected topics are emphasized and provide focus for further study. Examples can include Behavioral Finance, Personal Finance, Investment Theories and Alternative Finance, Corporate and Financial Responsibility, Financial Ethics, Hedge Funds Investment Strategies and their Management and macro hedge funds management, among others. | Prerequisites: Graduate standing and instructor’s permission.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 7821",
            "classes": [
                {},
                {}
            ],
            "course_name": "TOPICS IN RISK FINANCE IACTURIAL MODELSDERIV STRAT IN FIN RISK MGT",
            "description": "FRE-GY 7821 TOPICS IN RISK FINANCE IACTURIAL MODELSDERIV STRAT IN FIN RISK MGT \nCurrent topics of particular importance in Actuarial Science are analyzed and discussed. Course topics may include for example: Pension Funds management, Actuarial Science and Social Security, Life Insurance, Insurance and Financial Products design and management. | Prerequisite: Advanced standing and instructor’s permission.",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7831",
            "course_name": "TOPICS IN FINANCIAL AND RISK ENGINEERING I",
            "description": "FRE-GY 7831 TOPICS IN FINANCIAL AND RISK ENGINEERING I \nCurrent and selected topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide a focus for further study. Topics include Credit Risk and Credit Derivatives, Quantitative Methods in Rare Events, Energy, Oil and Water Finance as well as advanced topics in financial econometrics and computational finance. | Prerequisites: Graduate standing and instructor’s permission.",
            "offering": false
        },
        {
            "course_id": "FRE-GY 7841",
            "classes": [
                {},
                {}
            ],
            "course_name": "TOPICS IN RISK FINANCE II",
            "description": "FRE-GY 7841 TOPICS IN RISK FINANCE II \nCurrent and selected topics of particular importance in Actuarial Science and in the insurance- finance convergence are analyzed and discussed. Course topics may include Risk Engineering and the Insurance Business,  Principles of Insurance Management in a Dynamic and Global Setting, Finance-insurance convergence. | Prerequisite: Advanced standing and instructor’s permission.",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7851",
            "classes": [
                {},
                {}
            ],
            "course_name": "TOPICS IN FINANCIAL AND RISK ENGINEERING 2COMP & ALGORITHMIC FINANCEINTEREST RATE DERIVATIVES",
            "description": "FRE-GY 7851 TOPICS IN FINANCIAL AND RISK ENGINEERING 2COMP & ALGORITHMIC FINANCEINTEREST RATE DERIVATIVES \nCurrent topics of particular importance in finance and risk engineering are analyzed and discussed. Selected topics are emphasized and provide a focus for further study. Examples can include urban finance engineering, environmental finance, infrastructure and projects finance, real-estate finance, insurance finance and derivatives, and macro hedge funds management. | Prerequisites: Graduate standing and instructor’s permission.",
            "offering": true
        },
        {
            "course_id": "FRE-GY 7871",
            "course_name": "TOPICS IN FINANCIAL INFORMATION SERVICES AND TECHNOLOGY",
            "description": "FRE-GY 7871 TOPICS IN FINANCIAL INFORMATION SERVICES AND TECHNOLOGY",
            "offering": false
        },
        {
            "course_id": "FRE-GY 7891",
            "course_name": "TPCS IN MNGT OF FINANCIAL SER",
            "description": "FRE-GY 7891 TPCS IN MNGT OF FINANCIAL SER",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9103",
            "course_name": "QUANT & COMPUTATIONAL FINANCE",
            "description": "FRE-GY 9103 QUANT & COMPUTATIONAL FINANCE",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9203",
            "course_name": "ADVANCED EMPIRICAL FINANCE",
            "description": "FRE-GY 9203 ADVANCED EMPIRICAL FINANCE",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9303",
            "course_name": "MATHMATICS MODEL FOR DERIVATIVE PRICING",
            "description": "FRE-GY 9303 MATHMATICS MODEL FOR DERIVATIVE PRICING",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9403",
            "course_name": "CONTINUOUS TIME FINANCIAL ECONOMICS",
            "description": "FRE-GY 9403 CONTINUOUS TIME FINANCIAL ECONOMICS",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9713",
            "course_name": "SPECIAL TOPICS IN ASSET PRICING",
            "description": "FRE-GY 9713 SPECIAL TOPICS IN ASSET PRICING",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9723",
            "course_name": "SPECIAL TOPICS IN CREDIT DERIVATIVES",
            "description": "FRE-GY 9723 SPECIAL TOPICS IN CREDIT DERIVATIVES",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9733",
            "course_name": "SPEC TOPCS IN FIN ENGR",
            "description": "FRE-GY 9733 SPEC TOPCS IN FIN ENGR",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9743",
            "course_name": "SPEC TOPCS IN RISK MANAGEMENT",
            "description": "FRE-GY 9743 SPEC TOPCS IN RISK MANAGEMENT",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9753",
            "course_name": "SP TPCS IN URBAN INFRAST.RISK",
            "description": "FRE-GY 9753 SP TPCS IN URBAN INFRAST.RISK",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9763",
            "course_name": "SPEC TPCS IN FIN ECONOMICS",
            "description": "FRE-GY 9763 SPEC TPCS IN FIN ECONOMICS",
            "offering": false
        },
        {
            "course_id": "FRE-GY 9973",
            "classes": [
                {}
            ],
            "course_name": "MS THESIS IN FINANCE & RISK ENGINEERING",
            "description": "FRE-GY 9973 MS THESIS IN FINANCE & RISK ENGINEERING \nIn this research course, students undertake proprietary or non-proprietary research and write a thesis-type research paper. Generally, students work under faculty supervision. However, the course is intended to be largely self-directed within guidelines established by the supervising faculty member. | Prerequisites: Graduate Standing.  This course should be taken during the student’s final semester. Prerequisites vary depending on the student’s track and the nature of the thesis project.",
            "offering": true
        }
    ]
}