{
    "major_id": "FOOD-GE",
    "file": "./2015-2016/Food_Studies_(FOOD-GE).html",
    "courses": [
        {
            "course_id": "FOOD-GE 2000",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3453",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 411",
                    "time": "Mon 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Berg, Jennifer"
                }
            ],
            "course_name": "Current Research in Food Studies",
            "description": "FOOD-GE 2000 Current Research in Food Studies \nIntroduction to academic and professional resources at New York University and to career opportunities in food studies and food management, nutrition and dietetics, or public health. Class meets three or four times during the first semester of study.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2003",
            "course_name": "Food & Food Mgmt Intrshp",
            "description": "FOOD-GE 2003 Food & Food Mgmt Intrshp \nPractical work experience in food studies or food management tailored to the specific interests and career goals of each student.  Work may be voluntary or paid and is supported  by in-class discussion, written projects, and presentations.  Should be taken in the last year of study.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2004",
            "course_name": "Fd Service Proj Devel",
            "description": "FOOD-GE 2004 Fd Service Proj Devel \nAdvanced course addressing market needs,research methods, trend projections, feasibility, evaluation strategies, capital budgets, and financing for development of food service projects.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2006",
            "course_name": "Entrepren in Food Mgmt",
            "description": "FOOD-GE 2006 Entrepren in Food Mgmt \nDevelopment of new concepts in food business operations through planning, organization, implementation, and evaluation of independent and multiunit operations: concept development, initiation, financing, site selection, franchising and analysis and control of risk.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2007",
            "course_name": "Food Economics I: Consumer Behavior",
            "description": "FOOD-GE 2007 Food Economics I: Consumer Behavior \nThe goal of this course is to analyze the consumer side of food markers & related policy using tools of microeconomic analysis. In the first half of the course theoretical tools are developed, starting from individual choice & moving up to market demand. In the second part of the course, the focus shifts to applications of consumer economic theory in the food system, & how policies can alter consumer behavior.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2008",
            "course_name": "",
            "description": "FOOD-GE 2008\n\n   Economics of Food II: Firm Strategic Behavior\n\nThe course provides students with an intermediate level understanding of the microeconomics of firm or business behavior, & to apply these tools to current policy issues in the food system. Students explore the effect of firm decision-making on size, scale, & scope, & apply the tools to firms in the food sector. A range of outcomes is explored: free market, firm self regulation, socially responsible firm behavior, shared value firm behavior, & government regulation. The course is designed for policy & food interested students with little as well as no background in economics, or for those who ...\n\n      more description for FOOD-GE 2008 »\n\n      \n\n\n\nThe course provides students with an intermediate level understanding of the microeconomics of firm or business behavior, & to apply these tools to current policy issues in the food system. Students explore the effect of firm decision-making on size, scale, & scope, & apply the tools to firms in the food sector. A range of outcomes is explored: free market, firm self regulation, socially responsible firm behavior, shared value firm behavior, & government regulation. The course is designed for policy & food interested students with little as well as no background in economics, or for those who have completed an introductory course that used a text on par with Krugman & Wells.\n\n      less description for FOOD-GE 2008 «",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2012",
            "course_name": "Food History",
            "description": "FOOD-GE 2012 Food History \nExamination of food and diets from historical and international perspectives. Considers the origins of foods, the co-evolution of world cuisine and civilizations, the international exchange and spread of food technologies following the voyages of Columbus , and the effects of the emergent global economy on food production, diets, and health.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2013",
            "course_name": "The Roles or Food in Social Movements",
            "description": "FOOD-GE 2013 The Roles or Food in Social Movements \nHow food is used as a tool in social movements across cultures and time. Some of the themes of the course are food and revolutions, food as a form of social resistence and food as an apparatus for government policies. Students will learn that food's highly flexible meaning can be both a force for change as well as oppression.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2015",
            "course_name": "Food Policy",
            "description": "FOOD-GE 2015 Food Policy \nAnalysis of the economic and social causes and consequences of current trends in food production, marketing and product development.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2016",
            "course_name": "Food Markets:Concepts and Cases",
            "description": "FOOD-GE 2016 Food Markets:Concepts and Cases \nExplores the conceptual underpinnings of the distributive networks through which food travels from farm to table. Examines the relationships between markets, states, and society in their historical and contemporary forms. Employs case studies of how commodities travel through the food system at the local, national and international levels. Topics include mass markets and niche markets; the culture of markets; reciprocity, exchange and redistribution; conventional and alternative supply chains.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2017",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3454",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GODD B02",
                    "time": "Fri 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Ray, Krishnendu"
                }
            ],
            "course_name": "Contemporary Issues in Food Studies",
            "description": "FOOD-GE 2017 Contemporary Issues in Food Studies \nCovers production, distribution & consumption of food in the context of social, cultural, technological & biological processes under conditions of globalization. Employing approaches from the humanities & the social sciences, this course prepares students to initiate the process of analyzing the current American food system, its global connections, & proposed local alternatives that is developed further in other courses. Through lectures, readings & research the students master established facts & concepts about contemporary urban food cultures & produce new knowledge of the same.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2018",
            "course_name": "Curr Trends in Foods",
            "description": "FOOD-GE 2018 Curr Trends in Foods \nInteraction between current trends in food production, marketing, and service and traditional food consumption practices as observed in current cuisine through lectures, demonstrations, and field trips.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2019",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3455",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 409",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Raviv, Yael"
                }
            ],
            "course_name": "Comparative Cuisine",
            "description": "FOOD-GE 2019 Comparative Cuisine \nExamination of the cuisines of Europe, South America, Asia, and Africa and their influences on late 20th century North American foods, meals, and menus.  Students will analyze these cuisine from perspective of geography, climate and culture, through readings, lectures, films, in-class tastiness, and restaurant field trips.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2021",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3456",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 500",
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Sax, Irene"
                }
            ],
            "course_name": "Food Writing",
            "description": "FOOD-GE 2021 Food Writing \nPractical experience in writing reports, articles, pamphlets, & other information materials in the student’s primary area of interest in foods, along with studies of classic readings in the field.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2025",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4375",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EDUC 1080",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Amatuzzi, Daniel"
                }
            ],
            "course_name": "Beverages",
            "description": "FOOD-GE 2025 Beverages \nBasic principles & practical experience in development of beverage systems & menus. Considers pricing, equipment, legal, merchandising & personnel policies.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4740",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 9.30 AM - 11.10 AM",
                    "open": true,
                    "professor": "EDUC 1078"
                }
            ],
            "course_name": "Introduction to Urban Agriculture",
            "description": "FOOD-GE 2030 Introduction to Urban Agriculture \nThis course provides a practical introduction to urban agriculture.  Students will learn horticultural skills while performing tasks at the NYU Urban Farm Lab.  They will also learn about the biological processes that these tasks manage & how they fit together in a system.  Through visits to other sites around the city, students will be exposed to a wide variety of strategies for practicing horticulture in the urban environment.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2033",
            "course_name": "Food Systems",
            "description": "FOOD-GE 2033 Food Systems \nCovers the US food system from the farm to the intermediary to the consumer, in the context of the market & the policy environment. Using methods of the social sciences, the course provides students with a broad understanding of the benefits & costs of the domestic food system.  Topics include issues such as intermediary market power, unequal food access, & food production technology. Through lectures, readings, discussion & on the ground research, students gain a deep understanding of the current state of the food system.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2035",
            "course_name": "Food Service Systems",
            "description": "FOOD-GE 2035 Food Service Systems \nExamination of food service systems, with emphasis on site-specific and corporate functions and current trends in the industry.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2036",
            "course_name": "Water, Waste and The Urban Environment",
            "description": "FOOD-GE 2036 Water, Waste and The Urban Environment \nInvestigates the final stage of the food system, water and waste disposal, as it is manifested in the urban metropolis. This course also draws upon the historical underpinnings of the systems used to manage water and waste, but also the underlying issues of purity and contamination that these systems are also designed to address.  Issues include water and waste in relation to changing landscapes and demographics, enmeshment in urban policymaking, and competing notions of environmentalism.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2038",
            "course_name": "Strategic Food Svce Mktg",
            "description": "FOOD-GE 2038 Strategic Food Svce Mktg \nDevelopment of plans for marketing food and beverage products and services through evaluation of data on quality management, competition, advertising, and consumer and market research.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2039",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4739",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 405",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Nestle, Marion"
                }
            ],
            "course_name": "",
            "description": "FOOD-GE 2039\n\n   Food Policy and Politics\n\nThe course deals with how governments—particularly that of the United States—design & implement policies & programs to foster social goals such as ensuring a sufficient, safe, affordable,& sustainable food supply.  It examines why & how governments do or do not decide to set policies; reviews how stakeholders in the food system become involved in & influence policy development; identifies the social, cultural, economic, & political factors that influence stakeholder & government positions on policy issues; & describes the ways in which these factors promote or act as barriers to policies aimed...\n\n      more description for FOOD-GE 2039 »\n\n      \n\n\n\nThe course deals with how governments—particularly that of the United States—design & implement policies & programs to foster social goals such as ensuring a sufficient, safe, affordable,& sustainable food supply.  It examines why & how governments do or do not decide to set policies; reviews how stakeholders in the food system become involved in & influence policy development; identifies the social, cultural, economic, & political factors that influence stakeholder & government positions on policy issues; & describes the ways in which these factors promote or act as barriers to policies aimed at promoting the health of people & the planet.\n\n      less description for FOOD-GE 2039 «",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2040",
            "course_name": "Food Advocacy",
            "description": "FOOD-GE 2040 Food Advocacy \nFood advocacy uses sociological methods to question how & why social groups—families, institutions, governments--affect & are affected by systems of food production & consumption, how these systems affect the environment & human health, & how individuals & groups can influence & improve food systems. Today, interest in such issues is so widespread that efforts to improve food systems are considered by some to constitute a social movement.  Food advocacy seeks to describe this movement, & to explore how individuals & groups can effect change in the food system.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2054",
            "course_name": "Food Facility Design and Equipment",
            "description": "FOOD-GE 2054 Food Facility Design and Equipment \nFood facility design, layout, and equipment selection, specification, and organization.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2061",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3460",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "WAVE 369"
                }
            ],
            "course_name": "Research Applications",
            "description": "FOOD-GE 2061 Research Applications \nTheoretical & applied aspects of research design, data analysis, & interpretation.  Students teams   conduct, analyze, & present an evaluative or applied research project in food studies.  Should be taken in the last year of study in the master’s program.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2100",
            "course_name": "Food Legislation, Regulation & Enforcement",
            "description": "FOOD-GE 2100 Food Legislation, Regulation & Enforcement \nThis course examines the legal & regulatory frameworks that underlie domestic food policy. Specific areas of emphasis are the jurisdictions of federal & state agencies, the role of the legislative bodies in creating policy, & the role of the judicial system in enforcing policies & regulations.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2101",
            "course_name": "Managerial Account for Hospitality Industry",
            "description": "FOOD-GE 2101 Managerial Account for Hospitality Industry \nBudget procedures and statistical methods for decision making through a review of accounting systems and food business methods for financial analysis",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2103",
            "course_name": "Foodserv Labor Relat &La",
            "description": "FOOD-GE 2103 Foodserv Labor Relat &La \nLegal and economic framework, labor legislation and collective bargaining in food and food service operation.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2105",
            "course_name": "Integr Mng Syst Food Ser",
            "description": "FOOD-GE 2105 Integr Mng Syst Food Ser \nIntegration of principle management disciplines to develop successful business strategies in the food industry: human resources, organization design, labor relations, industrial engineering, marketing customer service, ethics.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2106",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4805",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Taparia, Hans",
                    "time": "Thu 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Social Entrepreneurship in Sustainable food Business",
            "description": "FOOD-GE 2106 Social Entrepreneurship in Sustainable food Business \nThis course introduces students to the concepts, frameworks & models to systematically build successful, socially-conscious businesses that are both sustainable & public health-driven.  Topics will include how to 1) identify & analyze need-gaps, 2) develop a sustainable-food business concept, 3) identify a profitable niche in the global, social-justice oriented market, & 4) raise capital in innovative ways.  The course will also provide access to domain-specific resources including key industry participants, industry experts & research partners.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2107",
            "course_name": "Mng Food Svce:Industry Personnel",
            "description": "FOOD-GE 2107 Mng Food Svce:Industry Personnel \nExamination and analysis of politicos, procedures and methods needed to effective management of personnel in the food and food service industries.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2109",
            "course_name": "Food Service Legal Envir",
            "description": "FOOD-GE 2109 Food Service Legal Envir \nOverview of legal issues affecting food and food service management: laws, contracts, taxes and relations with administrative and regulatory agencies both domestic and international.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2110",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3463",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "25W4 C-17"
                }
            ],
            "course_name": "International Food Regulation",
            "description": "FOOD-GE 2110 International Food Regulation \nExamines the international legal and regulatory systems that affect global food production and distribution. Explores debates over food regulations and how different countries approach these controversies and the variety of policy outcomes that result from these debates.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2160",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4824",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EDUC 1078",
                    "time": "Thu 7.00 PM - 8.40 PM",
                    "open": true,
                    "professor": "Bardin, Stefani R"
                }
            ],
            "course_name": "",
            "description": "FOOD-GE 2160\n\n   Culinary Physics\n\nThis studio and seminar course explores the basic principles of food biochemistry, enzymology and food processing and how they relate to memory, the senses and the processing of information.  Students will also learn basic principles of molecular gastronomy and modernist cuisine as framing devices for understanding how food also functions in the context of bodily health, environmental health as well as cultural and political narratives.    Assignments for the class will be based on the incorporation of food science into design and technology projects. Workshops involve using liquid nitrogen + ...\n\n      more description for FOOD-GE 2160 »\n\n      \n\n\n\nThis studio and seminar course explores the basic principles of food biochemistry, enzymology and food processing and how they relate to memory, the senses and the processing of information.  Students will also learn basic principles of molecular gastronomy and modernist cuisine as framing devices for understanding how food also functions in the context of bodily health, environmental health as well as cultural and political narratives.    Assignments for the class will be based on the incorporation of food science into design and technology projects. Workshops involve using liquid nitrogen + hydrocolloids as well as creating performative + deployable food objects and a Futurist meal.\n\n      less description for FOOD-GE 2160 «",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2171",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3468",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EDUC 1080",
                    "time": "Fri 8.30 AM - 2.30 PM",
                    "open": true,
                    "professor": "Phillips, Robert"
                }
            ],
            "course_name": "Food Photography",
            "description": "FOOD-GE 2171 Food Photography \nDemonstrations of techniques for photographing foods for use in print and other media formats.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2173",
            "course_name": "Integ Recipe Anal & Devel",
            "description": "FOOD-GE 2173 Integ Recipe Anal & Devel \nAdvanced application of principles and techniques of food preparation to development and reformulation of food recipes and products for media, publication, food service, and consumer markets.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2183",
            "course_name": "Techniques or Regional Cuisine",
            "description": "FOOD-GE 2183 Techniques or Regional Cuisine \nIntroduction to foods from various nationality groups through lectures, demonstrations, and field trips.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2188",
            "course_name": "Food Finance",
            "description": "FOOD-GE 2188 Food Finance \nIntroduction to financial planning, control, fundraising, and investment in food and food service industries.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2190",
            "course_name": "Research Methods in Food Studies",
            "description": "FOOD-GE 2190 Research Methods in Food Studies \nIntroduction to the design, interpretation, and evaluation of research in nutrition  and food studies.  To be taken first semester of the master's program.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2191",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3472",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "WAVE 435"
                }
            ],
            "course_name": "Food and Culture",
            "description": "FOOD-GE 2191 Food and Culture \nStudy of the complex interactions between food and culture, the effects of cultural factors on dietary practices, and the cross-cultural exchange of dietary practices, beliefs, and foods between the United States and countries throughout the world.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2204",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3476",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": "Thu 12.30 PM - 2.10 PM",
                    "open": true,
                    "professor": "WAVE 433"
                }
            ],
            "course_name": "Food in The Arts:",
            "description": "FOOD-GE 2204 Food in The Arts: \nThe ways in which writers, artists, musicians, and filmmakers have used food as a theme or symbol for reasons of aesthetic, social, cultural, or political commentary.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2205",
            "course_name": "Theoretical Perspectives in Food Culture",
            "description": "FOOD-GE 2205 Theoretical Perspectives in Food Culture \nExamination of theoretical literature commonly employed and debated in the field of food studies. Through the work of such established scholars as Freud, Elias, Foucault, de Certeau, Veblen and Barthes, understand their usefulness to recent scholarship in the developing field of food studies. Students focus on the practical task of developing useful tools, such as methods, techniques and concepts, for their own research agendas.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2216",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3477",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 1.30 PM - 4.15 PM",
                    "open": true,
                    "professor": "EDUC 1079"
                }
            ],
            "course_name": "Advanced Foods",
            "description": "FOOD-GE 2216 Advanced Foods \nPrinciples and practice of indentification, comparison, and evaluation of selected foods, ingredients, techniques, and equipment for recipe formulation, menu planning, or preparation with an emphasis on modifications to meet specific nutritional or other requirements.",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2217",
            "course_name": "Food Fundamentals",
            "description": "FOOD-GE 2217 Food Fundamentals \nIdentification and evaluation of food resources: sources, varieties, and qualities of the most commonly consumed food, beverages, and ingredients.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2230",
            "course_name": "Fieldtrips in Foods",
            "description": "FOOD-GE 2230 Fieldtrips in Foods \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2231",
            "course_name": "Fieldtrips in Food:Comm Support Agriculture",
            "description": "FOOD-GE 2231 Fieldtrips in Food:Comm Support Agriculture \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2232",
            "course_name": "Fieldtrips in Food:Urban Agriculture",
            "description": "FOOD-GE 2232 Fieldtrips in Food:Urban Agriculture \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2233",
            "classes": [
                {}
            ],
            "course_name": "Field Trips in Foods: Ethnic New York City",
            "description": "FOOD-GE 2233 Field Trips in Foods: Ethnic New York City \nNo Course Description Available",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2234",
            "course_name": "Fieldtrips in Food: Food Manufacturing",
            "description": "FOOD-GE 2234 Fieldtrips in Food: Food Manufacturing \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2240",
            "course_name": "Advanced Topics in Food Studies",
            "description": "FOOD-GE 2240 Advanced Topics in Food Studies \nAn umbrella course designed for advanced graduate students to explore a specific food topic. It is expected that course themes will vary to relfect debates in the fields of food culture and food systems. Topics may include the following: Women and Food, The Agro-Industrial Complex, Food and Post-Colonial Fiction, Food and the Media, Frankenstein's Kitchen: Food Technology in Historical Perspective, Globalization and the Political Economy of Food.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2241",
            "course_name": "Advanced Topics in Food Studies:",
            "description": "FOOD-GE 2241 Advanced Topics in Food Studies: \nFocuses on the development of an industrialized agricultural system.  Some of the topics that will be covered in class include: taming nature; industrializing the farm; applying science to the food problem; and the social cost of the system. Students will learn about the development of industrial farming practices, environmental issues surrounding industrial agriculture, the politics of food production, and the human cost of inexpensive food.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2242",
            "course_name": "Advanced Topics in Food Studies:",
            "description": "FOOD-GE 2242 Advanced Topics in Food Studies: \nExplores various aspects of women's relationship to food. Some of the themes of the course are the gendering of food, women as food producers, motherhood, feeding women's bodies; kitchen lobar; racial constructions of cooks; and the feminized space of the cookbook. Students will learn that women have a highly complex and contested relationship to food and that prescribed social roles help shape this relationship.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2243",
            "course_name": "Food and Popular Culture",
            "description": "FOOD-GE 2243 Food and Popular Culture \nThis seminar examines the portrayal of food, food intake, dieting, body image, and health as communicated through various forms of contemporary popular culture, including advertising, print, media, television, the internet, film, and restaurant design. Students will also explore methods in communication studies (such as semiotics and critical theory) commonly employed to analyze the complex interactions between food and all kinds of expressions of popular culture.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2244",
            "course_name": "Adv Tpcs Food Studies: Food Sociology",
            "description": "FOOD-GE 2244 Adv Tpcs Food Studies: Food Sociology \nProvides students with a sociological understanding of the food system and food behavior. Students examine the production, distribution and consumption of food to understand 'why we eat the way we do.'",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2245",
            "course_name": "Adv Topics Food Studies: Food and Fine Art",
            "description": "FOOD-GE 2245 Adv Topics Food Studies: Food and Fine Art \nAdvanced Topics in Food Studies: Food and Fine Art will explore the use of food in Fine Arts and how Fine Arts can help to explain food's place in the societies where the art work was produced. Selected examples from history of art (the course is not a thorough survery of art history) will be used to explore the cultural context , the conventions of arts, and aesthetics.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2248",
            "course_name": "",
            "description": "FOOD-GE 2248\n\n   Adv Topics in Food Studies: Mobile Food Cart for 21st Century\n\nThis course traces the history of food vendors as a way to understand their presence in & impact on urban & cultural milieus. Students will use this knowledge to map issues & trends, & will conceptually frame & physically design a 21st Century Mobile Food Vending Cart. Students will assess how to improve cart mobility in the context of the effectiveness of different materials, including newly developed materials, & forms of housing units. The cart’s environmental impact will be studied under multiple assumptions about energy & water usage, including solar power, water reclamation & water filtr...\n\n      more description for FOOD-GE 2248 »\n\n      \n\n\n\nThis course traces the history of food vendors as a way to understand their presence in & impact on urban & cultural milieus. Students will use this knowledge to map issues & trends, & will conceptually frame & physically design a 21st Century Mobile Food Vending Cart. Students will assess how to improve cart mobility in the context of the effectiveness of different materials, including newly developed materials, & forms of housing units. The cart’s environmental impact will be studied under multiple assumptions about energy & water usage, including solar power, water reclamation & water filtration.\n\n      less description for FOOD-GE 2248 «",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2250",
            "course_name": "Global Food Cultures",
            "description": "FOOD-GE 2250 Global Food Cultures \nAn interdisciplinary and intercultural examination of human communication through food. Explores the social, economic, political, and cultural ramifications of food production and consumption. Students will have a unique opportunity to explore various local, regional and transnational, and food rituals.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2251",
            "course_name": "",
            "description": "FOOD-GE 2251\n\n   Global Food Cultures\n\nAn interdisciplinary and intercultural examination of human communication through food. The course explores the social, economic, political, and cultural ramifications of the technology, production, acquisition, preservation, packaging, distribution, promotion, representation, selling, presentation, and consumption of food, as well as the disposal of food-related wastes. Students will have a unique opportunity to explore various local, regional and transnational, and food rituals in Hong Kong as the manifestation of changing social norms, economic realities, and cultural beliefs in an increasi...\n\n      more description for FOOD-GE 2251 »\n\n      \n\n\n\nAn interdisciplinary and intercultural examination of human communication through food. The course explores the social, economic, political, and cultural ramifications of the technology, production, acquisition, preservation, packaging, distribution, promotion, representation, selling, presentation, and consumption of food, as well as the disposal of food-related wastes. Students will have a unique opportunity to explore various local, regional and transnational, and food rituals in Hong Kong as the manifestation of changing social norms, economic realities, and cultural beliefs in an increasingly global and multi-cultural city.\n\n      less description for FOOD-GE 2251 «",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2252",
            "course_name": "Global Food Cultures:",
            "description": "FOOD-GE 2252 Global Food Cultures: \nThis master's level course explores the food and foodways of the culturally and historically rich culinary landscape of Mexico. In the city of Puebla, which is considered to be the birthplace of modern Mexican cusine, students will be fully immersed in traditional Mexican culinary and nutritional practices though classroom instruction, guest, lectures, cooking classes, and a wide variety of field trips to markets, local farms, restaurants, and production sites.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2253",
            "course_name": "",
            "description": "FOOD-GE 2253\n\n   Global Food Cultures: Paris\n\nThis course explores the manner in which the French & Americans think about & interact with their foods. Students will examine the historical development of gastronomic discourse in France  & nutrition discourse in the United States.  Through analyses of the US media coverage of the war against obesity, fat activists’ websites or French artisanal chocolate window displays, we will consider how individuals negotiate these discourses, as well as the collective identities & ethical frames encoded in them. Students will also travel to the Jura region to better understand the notion of “terroir”, &...\n\n      more description for FOOD-GE 2253 »\n\n      \n\n\n\nThis course explores the manner in which the French & Americans think about & interact with their foods. Students will examine the historical development of gastronomic discourse in France  & nutrition discourse in the United States.  Through analyses of the US media coverage of the war against obesity, fat activists’ websites or French artisanal chocolate window displays, we will consider how individuals negotiate these discourses, as well as the collective identities & ethical frames encoded in them. Students will also travel to the Jura region to better understand the notion of “terroir”, & the centrality of taste & place to this concept. Students will learn how taste ties together different actors, places & processes implicated in the terroir process.\n\n      less description for FOOD-GE 2253 «",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2254",
            "course_name": "Global Food Cultures:  Puerto Rico",
            "description": "FOOD-GE 2254 Global Food Cultures:  Puerto Rico \nhis courses is an interdisciplinary & intercultural examination of human communication through food in Puerto Rico. Explores the social, economic, political, & cultural ramifications of food production & consumption. Students will have a unique opportunity to explore various local, regional & transnational, & food rituals.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2261",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FOOD-GE 2261\n\n   Sustainability On The East End of Long Island\n\nSustainability of our food systems - and the communities in which they operate - will be a core focus of this field trip-based course. Using Eastern Long Island as a local case study, we will explore the rationale for, and issues and innovations in, sustainable development, as illuminated by the agriculture, aquaculture, wine industry, and restaurants of Long Island's North and South Forks. The course will include visits to farms, wineries, scallop and oyster fisheries, food businesses, farmers markets, and restaurants, as well as lectures by pioneering land preservationists, community develop...\n\n      more description for FOOD-GE 2261 »\n\n      \n\n\n\nSustainability of our food systems - and the communities in which they operate - will be a core focus of this field trip-based course. Using Eastern Long Island as a local case study, we will explore the rationale for, and issues and innovations in, sustainable development, as illuminated by the agriculture, aquaculture, wine industry, and restaurants of Long Island's North and South Forks. The course will include visits to farms, wineries, scallop and oyster fisheries, food businesses, farmers markets, and restaurants, as well as lectures by pioneering land preservationists, community developers, farmers, winemakers, beekeepers, and others.\n\n      less description for FOOD-GE 2261 «",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2262",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "FOOD-GE 2262\n\n   Sustainability in the Urban Environment\n\nSustainability in the Urban Environment: Urban policy makers began have embraced local food systems as a solution to a myriad of urban problems, including lack of green space and a dearth of healthy food availability. As part of this shift in policy, cities and other jurisdictions have encouraged production in the urban environment.  But at the local and state levels, such policies are often based on a vision of how food might be grown in a city, and do not consider the feasibility or viability of such ventures. Nor do the policies consider how much of a contribution urban farms might make to ...\n\n      more description for FOOD-GE 2262 »\n\n      \n\n\n\nSustainability in the Urban Environment: Urban policy makers began have embraced local food systems as a solution to a myriad of urban problems, including lack of green space and a dearth of healthy food availability. As part of this shift in policy, cities and other jurisdictions have encouraged production in the urban environment.  But at the local and state levels, such policies are often based on a vision of how food might be grown in a city, and do not consider the feasibility or viability of such ventures. Nor do the policies consider how much of a contribution urban farms might make to urban food supplies.  This course studies, in an experiential context, questions such as: much food can urban farms supply? Do farms even have to produce food? What are the differences between urban farms that have claimed nonprofit status, acting more as educational facilities than as commercial farms.\n\n      less description for FOOD-GE 2262 «",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2270",
            "course_name": "Food and Culture",
            "description": "FOOD-GE 2270 Food and Culture \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2271",
            "course_name": "Food and Culture:New Orleans",
            "description": "FOOD-GE 2271 Food and Culture:New Orleans \nThe course will focus on New Orleans with its rich history, unique location and distinctive cultures as a prime location to study the intersection of food, identity and culture. New Orleans has both shaped and been shaped by an idiosyncratic set of food practices, rituals, and beliefs. Through a firsthand study of the city, its history, its people and its food ways, student will gain a thorough understanding of food and culture in New Orleans.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2272",
            "course_name": "Food and Culture:Vermont",
            "description": "FOOD-GE 2272 Food and Culture:Vermont \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2280",
            "course_name": "Advanced Topics in Food Systems",
            "description": "FOOD-GE 2280 Advanced Topics in Food Systems",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2281",
            "course_name": "Adv Topics Food Systems: Food Processing /Industrialization",
            "description": "FOOD-GE 2281 Adv Topics Food Systems: Food Processing /Industrialization \nSurvey of issues surrounding food production from a processing perspective. Students will gain an understanding of various forms of food processing and the issues that surround industrial food production.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2282",
            "course_name": "Adv Topics Food Systems: Organic Food & Agriculture",
            "description": "FOOD-GE 2282 Adv Topics Food Systems: Organic Food & Agriculture \nThis course explores organic agriculture from multiple angles, starting with a historical exploration of organic & finishing with policy approaches to organic. Specific aspects studied include the environmental benefits of organic production systems, the political economy of the US organic regulation, health benefits of organic, & organic consumption and marketing.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2283",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4797",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL27",
                    "time": "Tue 4.55 PM - 5.55 PM",
                    "open": true,
                    "professor": "Setrini, Gustavo Ariel"
                }
            ],
            "course_name": "Adv Topics Food Systems:  Agricultural Globalization",
            "description": "FOOD-GE 2283 Adv Topics Food Systems:  Agricultural Globalization \nCourse examines the process of agricultural globalization & its effects on the process of rural & agricultural development in the global south.  Specifically, analyze the incorporation of agricultural producers & processors in developing countries into the supply chains of global food brands & retailers.  The goal is to identify how globalization is shaping institutions that govern agricultural laborers in poor & middle income communities, who are the most vulnerable actors in the global economy",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2284",
            "course_name": "",
            "description": "FOOD-GE 2284\n\n   Adv Topics Food Systems: Food Systems Planning\n\nCourse examines the role of planning in building sustainable food systems.  The fact that more than 9 million people get fed every day in the city on New York without any apparent plan for how this happens is considered a miracle of free markets. Taking a closer look at this & examining shortcomings in an effort to understand what needs are nor being addresses & what can be done to address them.  Recent case studies will be used to illustrate what non-profits and & local governments can do to build sustainable food systems. The culture of the course is part graduate seminar & part planners wor...\n\n      more description for FOOD-GE 2284 »\n\n      \n\n\n\nCourse examines the role of planning in building sustainable food systems.  The fact that more than 9 million people get fed every day in the city on New York without any apparent plan for how this happens is considered a miracle of free markets. Taking a closer look at this & examining shortcomings in an effort to understand what needs are nor being addresses & what can be done to address them.  Recent case studies will be used to illustrate what non-profits and & local governments can do to build sustainable food systems. The culture of the course is part graduate seminar & part planners workshop, a mix of theoretical and practical.\n\n      less description for FOOD-GE 2284 «",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 2285",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17151",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "SILV 406"
                }
            ],
            "course_name": "",
            "description": "FOOD-GE 2285\n\n   Adv Topics Food Systems:  Gender\n\nCourse explores the intersection of gender, identity, culture & food. Students will analyze the influences of sexual identity, human sexuality, sexual orientation & gender on real & perceived cultural views of food & consumption.  Topics will address how society assigns gender to food by investigating historical & contemporary texts. Employing advertisements, menus, recipes, cookbooks, television programs, films & packaging, students will critically analyze gendering practices. Theoretical frameworks will include queer theory, early feminist theory, Whiteness theory & emerging male studies & t...\n\n      more description for FOOD-GE 2285 »\n\n      \n\n\n\nCourse explores the intersection of gender, identity, culture & food. Students will analyze the influences of sexual identity, human sexuality, sexual orientation & gender on real & perceived cultural views of food & consumption.  Topics will address how society assigns gender to food by investigating historical & contemporary texts. Employing advertisements, menus, recipes, cookbooks, television programs, films & packaging, students will critically analyze gendering practices. Theoretical frameworks will include queer theory, early feminist theory, Whiteness theory & emerging male studies & transgender studies.\n\n      less description for FOOD-GE 2285 «",
            "offering": true
        },
        {
            "course_id": "FOOD-GE 2300",
            "course_name": "Independent Study",
            "description": "FOOD-GE 2300 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point.  Independent study cannot be applied to the established professional education sequence in teaching curricula.  Each departmental program has established its own maximum credit allowance for independent study.  This information may be obtained from the student's department.  Prior to registering for independent study, each student should obtain an Independent Study approval from the adviser.",
            "offering": false
        },
        {
            "course_id": "FOOD-GE 3400",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4645",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Ray, Krishnendu",
                    "time": "Fri 3.00 PM - 6.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Food Studies Doctoral Seminar",
            "description": "FOOD-GE 3400 Food Studies Doctoral Seminar \nThe Food Studies Doctoral seminar is required for all Food Studies doctoral students from their first semester to their last. Food Studies doctoral students enroll each semester until the time of graduation (even for students conducting field work outside of NYC). The doctoral students & faculty meet three times a semester for three hours. Students discuss their progress, read & discuss assigned\nreadings, & give seminars on their research.",
            "offering": true
        }
    ]
}