{
    "major_id": "FOOD-UE",
    "file": "./2015-2016/Food_Studies_(FOOD-UE).html",
    "courses": [
        {
            "course_id": "FOOD-UE 57",
            "course_name": "Food Serv Cost Controls",
            "description": "FOOD-UE   57 Food Serv Cost Controls \nPrinciples of cost control systems and managerial techniques for planning and controlling costs related to food, labor, plant and property operations, maintenance, and other expenses in operations.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 71",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "11158",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 2.00 PM - 4.40 PM",
                    "open": true,
                    "professor": "12WV L120"
                }
            ],
            "course_name": "Fd Issues of Cont Societ",
            "description": "FOOD-UE   71 Fd Issues of Cont Societ \nIssues related to methods of food production, distribution, marketing, trade and politics, and the impact of these methods on foods intake and the environment in contemporary societies.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1000",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "10321",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Ray, Krishnendu",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "FOOD-UE 1000 Ind Study \nIt should be noted that It should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1025",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "11366",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EDUC 1080",
                    "time": "Mon 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Lawry, Linda"
                }
            ],
            "course_name": "Beverages",
            "description": "FOOD-UE 1025 Beverages \nBasic principles & practical experience in development of beverage systems & menus.  Considers pricing, equipment, legal, merchandising & personnel policies.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "11801",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 9.30 AM - 11.10 AM",
                    "open": true,
                    "professor": "EDUC 1078"
                }
            ],
            "course_name": "Intro to Urban Agriculture",
            "description": "FOOD-UE 1030 Intro to Urban Agriculture \nThis course provides a practical introduction to urban agriculture.  Students will learn horticultural skills while performing tasks at the NYU Urban Farm Lab.  They will also learn about the biological processes that these tasks manage & how they fit together in a system.  Through visits to other sites around the city, students will be exposed to a wide variety of strategies for practicing horticulture in the urban environment.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1033",
            "course_name": "Food Systems:Food and Agriculture/20th Century",
            "description": "FOOD-UE 1033 Food Systems:Food and Agriculture/20th Century \nFocuses on a variety of issues surrounding food production from an agricultural and a processing perspective. Students will gain an understanding of the ideological underpinnings of American agriculture as well as the forces that transformed food production from a regional to a national system. Various approaches will be used to examine the food system including the political, economic, social and cultural dimensions of production.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1039",
            "course_name": "Food Service Supervision Training",
            "description": "FOOD-UE 1039 Food Service Supervision Training \nPrinciples of training and supervision in food service management through lectures, demonstrations, and case studies.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1051",
            "course_name": "",
            "description": "FOOD-UE 1051\n\n   Food and Identity\n\nCourse focuses on how people use food to identify themselves as individuals & as groups. Students will ascertain the meaning & significance of food in different cultures by exploring the way that ethnicity, gender, socioeconomic status & religion influence our food choices. In addition, they will also examine how people transmit & preserve culture using food. Through reading scholarly articles, personal essays, book excerpts, newspaper articles, cookbooks & viewing films, students will examine the intricate relationships that people have with food. Course looks critically at the following ques...\n\n      more description for FOOD-UE 1051 »\n\n      \n\n\n\nCourse focuses on how people use food to identify themselves as individuals & as groups. Students will ascertain the meaning & significance of food in different cultures by exploring the way that ethnicity, gender, socioeconomic status & religion influence our food choices. In addition, they will also examine how people transmit & preserve culture using food. Through reading scholarly articles, personal essays, book excerpts, newspaper articles, cookbooks & viewing films, students will examine the intricate relationships that people have with food. Course looks critically at the following questions: how can food have different meanings & uses for different people? How does food function both to foster community feeling & drive wedges among people? What are some prevailing academic theories that help society understand some of these patterns of identification & how do societies change over time?\n\n      less description for FOOD-UE 1051 «",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1054",
            "course_name": "Food Facility and Design Layout",
            "description": "FOOD-UE 1054 Food Facility and Design Layout \nFood facility design, layout, and equipment selection, specification, and organization.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1056",
            "classes": [
                {}
            ],
            "course_name": "Internship in Food Stud & Food Mgmt",
            "description": "FOOD-UE 1056 Internship in Food Stud & Food Mgmt \nPractical work experience in food studies and food management supported by class work, discussion and projects.  The objectives of the course are to apply classroom content to work experience; identify career options through professional seminars; work experience, and class discussions; develop professional skills through personal observations, work experience and class assignments and identify resources and professional networks that support employment opportunities in the field of interest.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1101",
            "course_name": "Food Service Accounting",
            "description": "FOOD-UE 1101 Food Service Accounting \nBasic accounting procedures for the food service industry for control of revenues, expenses, assets and liabilities, along with techniques for costing, budgeting, and pricing, with emphasis on their use in situation analysis and decision-making.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1109",
            "course_name": "Foods Laws and Regulations",
            "description": "FOOD-UE 1109 Foods Laws and Regulations \nOverview of legal issues affecting food service management: laws, contracts, taxes, and relations with administrative and regulatory agencies, both domestic and international.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1110",
            "course_name": "Fd Mgt Essentials I Theory",
            "description": "FOOD-UE 1110 Fd Mgt Essentials I Theory \nSurvey of basic theoretical principles pertaining to food management. An accelerated course for students of food studies, nutrition, and related fields with limited previous knowledge or experience. Objectives: 10 Describe planning, organizing and controlling of food operations; goal setting, planning and strategy formation for food industry operations; and examine the interaction among individuals, groups, and organizations in food operations.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1112",
            "course_name": "Fd Mgt Essentials III Fd Indus Personnel Mgt",
            "description": "FOOD-UE 1112 Fd Mgt Essentials III Fd Indus Personnel Mgt \nObjectives:  Identify policies, procedures, skills, and methods required to recruit, train, manage, develop, and appraise food industry employees; the laws relevant to human resource practices; and to examine the relationship between line and personnel management.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1118",
            "course_name": "Research in Food Studies",
            "description": "FOOD-UE 1118 Research in Food Studies \nExamines both theoretical and applied aspects of research design, data analysis, and interpretation. Through readings, class discussion, guest lectures and written assignments, student will gain a thorough understanding of and practice in the components of good food-focused research. Topics include: articulating a research question, locating and using primary and secondary source information, conducting original research, and structuring and executing a research project.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1130",
            "course_name": "Commun Workshop in Foods & Nutrition",
            "description": "FOOD-UE 1130 Commun Workshop in Foods & Nutrition \nTechniques for communicating information about nutrition to professionals, the public, the media, and food and beverage marketers.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1135",
            "course_name": "Essentials of Cuisine:",
            "description": "FOOD-UE 1135 Essentials of Cuisine: \nIntroduction to the art and science of cuisine characteristics of selected world cultures through lectures, demonstrations, hands-on preparation, and field trips.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1143",
            "course_name": "Fd Evts:Plng & Catering",
            "description": "FOOD-UE 1143 Fd Evts:Plng & Catering \nOrganization of marketing, planning, pricing, purchasing, preparation, delivery, and service of foods and meals for specific purposes and occasions, at both on-premis and off-piste locations.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1180",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17149",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "GODD B02"
                }
            ],
            "course_name": "Food and Nutrition Global Society",
            "description": "FOOD-UE 1180 Food and Nutrition Global Society \nThis course, which fulfills the Integrated Liberal Arts requirement, unites the liberal arts experience with a specialization in food and nutrition. It contains three areas of focus: food and nutrition history; ethical issues in food and nutrition; and emerging technologies as they related to food and nutrition.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1181",
            "course_name": "",
            "description": "FOOD-UE 1181\n\n   Food, Culture and Globalization: New York Sydney\n\nThis course investigates current transformations in the food systems & food cultures of New York City & Sydney, Australia, under conditions of globalization. Globalization is transforming major cities into dynamic centers of capital flows, produce, people, & culture, reconstituting neighborhoods, city centers, & their agrarian peripheries, in complex relationships to each other & to other cities, nations & regions. As a course in new sensory urbanism this curriculum seeks to expand the traditional scope and range of the studied senses from sight (art, architecture) & sound (music), to smell, t...\n\n      more description for FOOD-UE 1181 »\n\n      \n\n\n\nThis course investigates current transformations in the food systems & food cultures of New York City & Sydney, Australia, under conditions of globalization. Globalization is transforming major cities into dynamic centers of capital flows, produce, people, & culture, reconstituting neighborhoods, city centers, & their agrarian peripheries, in complex relationships to each other & to other cities, nations & regions. As a course in new sensory urbanism this curriculum seeks to expand the traditional scope and range of the studied senses from sight (art, architecture) & sound (music), to smell, taste & touch, so as to rethink what it means to be a modern urban subject engaged in the pleasures & powers of consumption.\n\n      less description for FOOD-UE 1181 «",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1183",
            "course_name": "Techin/Regional Cuisine",
            "description": "FOOD-UE 1183 Techin/Regional Cuisine \nIntroduction to foods from various nationality groups through lectures, demonstrations, hands-on food preparation, and field trips.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1188",
            "course_name": "Food Finance",
            "description": "FOOD-UE 1188 Food Finance \nIntroduction to financial planning, control, fundraising, and investment in food and food service industries.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1189",
            "course_name": "Food Service Marketing",
            "description": "FOOD-UE 1189 Food Service Marketing \nPrinciples, functions, and tools of marketing and sales used by distributors, commercial and noncommercial operators, and vendors; investigation of current marketing issues.",
            "offering": false
        },
        {
            "course_id": "FOOD-UE 1204",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "10332",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": "Thu 12.30 PM - 2.10 PM",
                    "open": true,
                    "professor": "WAVE 433"
                }
            ],
            "course_name": "Food in The Arts:Media",
            "description": "FOOD-UE 1204 Food in The Arts:Media \nThe ways in which writers, artists, musicians, and filmmakers have used food as a theme or symbol for reasons of aesthetic, social, cultural, or political commentary.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1217",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17150",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 1.30 PM - 4.15 PM",
                    "open": true,
                    "professor": "EDUC 1079"
                },
                {
                    "format": "Lecture",
                    "class_id": "10335",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EDUC 1079",
                    "time": "Tue 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Carson, Emily M"
                }
            ],
            "course_name": "Advanced Foods:",
            "description": "FOOD-UE 1217 Advanced Foods: \nPrinciples and practice of identification, comparison, and evaluation of selected foods, ingredients, techniques, and equipment for recipe formulation, menu planning, or preparation with an emphasis on modifications to meet specific nutritional or other requirements.",
            "offering": true
        },
        {
            "course_id": "FOOD-UE 1271",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "10338",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "EDUC 1080",
                    "time": "Fri 8.30 AM - 2.20 PM",
                    "open": true,
                    "professor": "Phillips, Robert"
                }
            ],
            "course_name": "Food Photography",
            "description": "FOOD-UE 1271 Food Photography \nDemonstration  of techniques for photographing foods for use in print and other media formats.",
            "offering": true
        }
    ]
}