{
    "major_id": "FLGED-UE",
    "file": "./2015-2016/Foreign_Language_Education_(FLGED-UE).html",
    "courses": [
        {
            "course_id": "FLGED-UE 1018",
            "course_name": "Tchng Foreign Languages to Elem School Children",
            "description": "FLGED-UE 1018 Tchng Foreign Languages to Elem School Children \nModels of learning, methods, instructional strategies, and resources for teaching a foreign language to elementary school children.  Emphasis is on the development of communicative skills.  Includes field observation.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1171",
            "course_name": "Tchng Japanese to Bus Pple/Lang Tchrs:El Lev",
            "description": "FLGED-UE 1171 Tchng Japanese to Bus Pple/Lang Tchrs:El Lev \nIntroduction to Japanese language with a business focus, for Americans whose employment requires daily contact with Japanese-speaking people.  The course aims to provide participants with the basic elements of spoken Japanese grammar and vocabulary with emphasis on practical aspects of the language.  An hour of drill is arranged in addition to a two-hour regular class meeting.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1172",
            "course_name": "Tchng Japanese to Bus Pple & Lang Tchrs:Interm",
            "description": "FLGED-UE 1172 Tchng Japanese to Bus Pple & Lang Tchrs:Interm \nContinuation of elementary course",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1477",
            "course_name": "Superv Student Tchng in Foreign Lang Ed:K-6",
            "description": "FLGED-UE 1477 Superv Student Tchng in Foreign Lang Ed:K-6 \nSupervised student teaching in classroom settings. Prerequisites determined by program adviser. Three half days & two full days a week.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1489",
            "course_name": "Spanish for Health Beginning-Level",
            "description": "FLGED-UE 1489 Spanish for Health Beginning-Level \nA practical course that includes the special vocabulary and idiomatic structures needed by health care professionals who communicate orally with Spanish speaking clients in their daily work. The course will approach the learning of Spanish in topics of culture, attitudes and behavior of Latino populations. This course is for beginners only.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1490",
            "course_name": "Spanish for Health Intermediate",
            "description": "FLGED-UE 1490 Spanish for Health Intermediate \nThis course is designed as a continuation of E29.1489 (Beginning-Level) and will likewise concentrate on enhancing vocabulary, idiomatic structures and intermediate level grammar practice. It is designed for health care professionals who communicate with Spanish speaking patients via intensive oral practice. The course will approach the learning of Spanish topics of culture, attitudes and behavior of Latino populations. This course is for intermediate level students.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1907",
            "course_name": "Tchng Foreign Language in The Secondary School",
            "description": "FLGED-UE 1907 Tchng Foreign Language in The Secondary School \nAims, objectives, and methods; principles, progressive practices, and lesson plans.  Specifically geared to the individual school settings to which participants have been assigned.  Includes discussion, problem solving, and practical guidance for each student teacher.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1911",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "10306",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 435",
                    "time": "Tue 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Collins, Kelsey"
                },
                {
                    "format": "Seminar",
                    "class_id": "10307",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL27",
                    "time": "Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Harvey, Robin"
                }
            ],
            "course_name": "Student Teaching Foreign Language Ed: Middle/High School (1)",
            "description": "FLGED-UE 1911 Student Teaching Foreign Language Ed: Middle/High School (1) \nOne semester supervised student teaching in a foreign language education classroom in grades 7-9 for a minimum of 180 hours with 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum. Participation is required in a weekly student student teaching seminar which offers a practical examination of teaching problems and practices as they related to actual classroom teaching.",
            "offering": true
        },
        {
            "course_id": "FLGED-UE 1914",
            "course_name": "Workshop in Foreign Language Education",
            "description": "FLGED-UE 1914 Workshop in Foreign Language Education \nLearning of alternative methods of teaching second/foreign language through approaches such as humanistic approach, emotional intelligence, multiple intelligence theory, Jazz Chants, etc. A hands-on approach will be followed & students will have a chance to work on resource projects on various innovative approaches to teaching foreign languages.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1915",
            "course_name": "Field Experience Seminar Tchng Foreign Language",
            "description": "FLGED-UE 1915 Field Experience Seminar Tchng Foreign Language \nVisits to foreign language classes, 7-12, and to community resources useful in foreign language teaching. Class discussion focuses on language teaching skills, language development, adolescent development and relations, lesson planning, uses of technology in classrooms, classroom management, learning environment, and parental and community involvement.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1922",
            "course_name": "Student Teaching Foreign Language Ed: Middle/High School (2)",
            "description": "FLGED-UE 1922 Student Teaching Foreign Language Ed: Middle/High School (2) \nOne semester supervised student teaching in a foreign language education classroom in grades 10-12 for a minimum of 180 hours with 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum. Participation is required in a weekly student student teaching seminar which offers a practical examination of teaching problems and practices as they related to actual classroom teaching.",
            "offering": false
        },
        {
            "course_id": "FLGED-UE 1999",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "10310",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 507",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Shen, Hongying"
                },
                {
                    "format": "Lecture",
                    "class_id": "11412",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 501",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Harvey, Robin"
                }
            ],
            "course_name": "Tchng Foreign Language: Theory & Practice",
            "description": "FLGED-UE 1999 Tchng Foreign Language: Theory & Practice \nThe first method course for foreign language education majors.  Course contents include guiding principles and methodology in a variety of approaches to the teaching  of foreign languages, specifically in developing auditory comprehension and oral production; teaching, reading and writing, impact of culture; heritage, socioeconomic level, and educational background on language and literacy  development as well as human development processes and variations.  Also included are skills in motivation, communication, and classroom management.",
            "offering": true
        }
    ]
}