{
    "major_id": "FLGED-GE",
    "file": "./2015-2016/Foreign_Language_Education_(FLGED-GE).html",
    "courses": [
        {
            "course_id": "FLGED-GE 2018",
            "course_name": "Teaching Foreign Lang to Elem School Children",
            "description": "FLGED-GE 2018 Teaching Foreign Lang to Elem School Children \nModels of learning, methods, instructional strategies, and resources for teaching a foreign language to elementary school children. Emphasis is on the development of communicative skills. Includes field observation.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2027",
            "course_name": "Applied Linguisitcs for Teachers of French",
            "description": "FLGED-GE 2027 Applied Linguisitcs for Teachers of French \nA systematic study of advanced French phonological, grammatical, and lexical systems with the focus on forms, function, meaning, and usage in French.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2069",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3432",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 507",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Shen, Hongying"
                },
                {
                    "format": "Lecture",
                    "class_id": "4382",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 501",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Harvey, Robin"
                }
            ],
            "course_name": "Tchng Foreign Languages: Theory and Practice",
            "description": "FLGED-GE 2069 Tchng Foreign Languages: Theory and Practice \nThe first method course for foreign language education majors.  Course contents include guiding principles and methodology in a variety of approaches to the teaching  of foreign languages, specifically in developing auditory comprehension and oral production; teaching, reading and writing, impact of culture; heritage, socioeconomic level, and educational background on language and literacy  development as well as human development processes and variations.  Also included are skills in motivation, communication, and classroom management.",
            "offering": true
        },
        {
            "course_id": "FLGED-GE 2124",
            "course_name": "Adv Chinese for Teach of Chinese: Part I",
            "description": "FLGED-GE 2124 Adv Chinese for Teach of Chinese: Part I \nDeveloping advanced Chinese (Mandarin) language proficiency in both oral and written expression and enhancing knowledge of Chinese language and rhetorical instructions through selected readings of both classical and contemporary Chinese literary works of various genres.  Part I will focus on classical Chinese.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2125",
            "course_name": "Adv Chinese Teach Chinese Foreign Lang: II",
            "description": "FLGED-GE 2125 Adv Chinese Teach Chinese Foreign Lang: II \nDeveloping advanced Chinese (Mandarin) language proficiency in both oral and written expression and enhancing knowledge of Chinese language and rhetorical instructions through selected readings of both classical and contemporary Chinese literary works of various genres.  Part II will focus on contemporary Chinese.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2127",
            "course_name": "Adv Japanese/Teach of Japanese as a for Lang",
            "description": "FLGED-GE 2127 Adv Japanese/Teach of Japanese as a for Lang \nEmphasis on the development and maintenance of communicative oral skills in Japanese.  May include opportunities for attendance at lectures, movies, theatres, and events at which Japanese is spoken.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2128",
            "course_name": "Advanced Spanish for Teachers of Spanish as a Foreign Language",
            "description": "FLGED-GE 2128 Advanced Spanish for Teachers of Spanish as a Foreign Language \nDeveloping Spanish language proficiency in both oral & written expressions & enhancing knowledge of Spanish & its rhetorical structures through selected reading of contemporary Spanish literature.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2129",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "4107",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "194M 204"
                }
            ],
            "course_name": "Adv French for Tchrs of French as a for Lang",
            "description": "FLGED-GE 2129 Adv French for Tchrs of French as a for Lang \nEmphasis on the development and maintenance of communicative oral skills in French.  May include opportunities for attendance at lectures, movies, theatres, and events where French is spoken.",
            "offering": true
        },
        {
            "course_id": "FLGED-GE 2223",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3442",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "12WV L113",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Pally, Marcia"
                }
            ],
            "course_name": "Tch Eng Frgn Lang Int'L Setting",
            "description": "FLGED-GE 2223 Tch Eng Frgn Lang Int'L Setting \nVarious teaching approaches, methods, and techniques to teaching English as a foreign language (EFL) in international settings. A 'learning through doing' approach will be followed so that students will learn how to adapt various approaches and methods to teach EFL in a diverse setting.",
            "offering": true
        },
        {
            "course_id": "FLGED-GE 2300",
            "course_name": "Independent Study",
            "description": "FLGED-GE 2300 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental  program has established its own maximum credit allowance for independent study.  This information may be obtained from the student's department, prior to registering for independent study, each student should obtain an Independent Study approval from the adviser.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2417",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3445",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 275",
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Lan, Yishen"
                }
            ],
            "course_name": "Applied Ling in Chinese",
            "description": "FLGED-GE 2417 Applied Ling in Chinese \nAdvanced systematic study of Chinese (Mandarin) with focus on its grammatical, discourse, and pragmatic systems. A practical study of form, function, meaning and usage in Chinese.",
            "offering": true
        },
        {
            "course_id": "FLGED-GE 2419",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3446",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 567",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Chan, Lionel"
                }
            ],
            "course_name": "Applied Linguistics for Teachers of Spanish",
            "description": "FLGED-GE 2419 Applied Linguistics for Teachers of Spanish \nA systematic study of advanced Spanish phonological, grammatical, and lexical systems with the focus on forms, function, meaning, and usage in Spanish.",
            "offering": true
        },
        {
            "course_id": "FLGED-GE 2421",
            "course_name": "Applied Linguistics for Teachers of Japanese",
            "description": "FLGED-GE 2421 Applied Linguistics for Teachers of Japanese \nA general introduction to the area of applied linguistics for teachers of Japanese.  the overview consists of the formal features of the Japanese language: lexis, phonology, semantics, syntax, and discourse.  It highlights how the Japanese language is both similar to and distinct from other human languages.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2422",
            "course_name": "",
            "description": "FLGED-GE 2422\n\n   Spanish Pragmatics for Teachers\n\nThis course prepares teachers of Spanish to analyze oral & written discourse using the Common Core framework for Literacy. There is an overview of speech act theory, politeness theory, & pragmatic variation within the Spanish-speaking world. This study of routinized language behaviors enables teachers to raise awareness of cultural cues that are necessary to interpret conversations in Spanish accurately. The use of technology as a pedagogical tool is examined with the purpose of enhancing learners' communication strategies. In addition, the course explores innovative, research-based approaches...\n\n      more description for FLGED-GE 2422 »\n\n      \n\n\n\nThis course prepares teachers of Spanish to analyze oral & written discourse using the Common Core framework for Literacy. There is an overview of speech act theory, politeness theory, & pragmatic variation within the Spanish-speaking world. This study of routinized language behaviors enables teachers to raise awareness of cultural cues that are necessary to interpret conversations in Spanish accurately. The use of technology as a pedagogical tool is examined with the purpose of enhancing learners' communication strategies. In addition, the course explores innovative, research-based approaches for teaching pragmatics in the foreign language classroom so that learners can avoid cross-cultural misunderstandings & better interpret texts in Spanish.\n\n      less description for FLGED-GE 2422 «",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2427",
            "course_name": "Spanish Syntax for Teachers",
            "description": "FLGED-GE 2427 Spanish Syntax for Teachers",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2429",
            "course_name": "Adv Spanish Composition for Teachers",
            "description": "FLGED-GE 2429 Adv Spanish Composition for Teachers \nEmphasis on the development and maintenance of oral and written skills in Spanish.  May include opportunities to attend lectures, movies, theatres and events where Spanish is spoken.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2911",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "4755",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 435",
                    "time": "Tue 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Collins, Kelsey"
                },
                {
                    "format": "Seminar",
                    "class_id": "3449",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "7E12 LL27",
                    "time": "Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Harvey, Robin"
                }
            ],
            "course_name": "Student Teaching Foreign Language Ed:  Middle/High School (1)",
            "description": "FLGED-GE 2911 Student Teaching Foreign Language Ed:  Middle/High School (1) \nOne semester supervised student teaching in a foreign language education classroom in grades 7-9 for a minimum of 180 hours with 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum. Participation is required in a weekly student student teaching seminar which offers a practical examination of teaching problems and practices as they related to actual classroom teaching.",
            "offering": true
        },
        {
            "course_id": "FLGED-GE 2914",
            "course_name": "Wkshp in Foreign Lang Ed",
            "description": "FLGED-GE 2914 Wkshp in Foreign Lang Ed \nFor prospective and practicing teachers, heads of departments, supervisors, and coordinators of foreign language programs who desire to work on curriculum revision, audiovisual aids, teaching techniques, testing programs, teaching materials, teacher training, and evaluation, and other aspects of the foreign language program.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 2918",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3452",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC13",
                    "time": "Thu 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "McSweeny, Gisella"
                }
            ],
            "course_name": "Field Experience Sem in Foreign Languages Ed",
            "description": "FLGED-GE 2918 Field Experience Sem in Foreign Languages Ed \nVisits to foreign language classes from K-12 and to resource centers, cultural services and textbook publishers. Class sessions focus on creative utilization of observation findings for practical classroom teaching. Intended for in-service teachers.",
            "offering": true
        },
        {
            "course_id": "FLGED-GE 2922",
            "course_name": "Student Teaching Foreign Language Ed: Middle/High School (2)",
            "description": "FLGED-GE 2922 Student Teaching Foreign Language Ed: Middle/High School (2) \nOne semester supervised student teaching in a foreign language education classroom in grades 10-12 for a minimum of 180 hours with 20 days. Student teaching experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum. Participation is required in a weekly student student teaching seminar which offers a practical examination of teaching problems and practices as they related to actual classroom teaching.",
            "offering": false
        },
        {
            "course_id": "FLGED-GE 9069",
            "course_name": "The Teaching of Foreign Languages: Theory and Practice",
            "description": "FLGED-GE 9069 The Teaching of Foreign Languages: Theory and Practice \nThe first method course for foreign language education majors.  Course contents include guiding principles and methodology in a variety of approaches to the teaching  of foreign languages, specifically in developing auditory comprehension and oral production; teaching, reading and writing, impact of culture; heritage, socioeconomic level, and educational background on language and literacy  development as well as human development processes and variations.  Also included are skills in motivation, communication, and classroom management.",
            "offering": false
        }
    ]
}