{
    "major_id": "FDGR1-GC",
    "file": "./2015-2016/Fundraising_MS_(FDGR1-GC).html",
    "courses": [
        {
            "course_id": "FDGR1-GC 1000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2821",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Stern, Marian",
                    "time": "Wed 6.45 PM - 9.25 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "FDGR1-GC 1000\n\n   Hist & Phil Philanthropy in The United States\n\nThis course provides an understanding of America?s tradition and its relevance for today?s fundraisers.  It examines the history of philanthropy in the U.S., tracing its origins in cultural history and economic development.  Attention is given to changes that emerged as new groups accumulated wealth and their priorities were influenced not only by their own cultural background but also by evolving social and political issues.  The course also examines the various ways organizations themselves changed fundraising strategies to attract each generation of donors.  Lectures on America?s tradition ...\n\n      more description for FDGR1-GC 1000 »\n\n      \n\n\n\nThis course provides an understanding of America?s tradition and its relevance for today?s fundraisers.  It examines the history of philanthropy in the U.S., tracing its origins in cultural history and economic development.  Attention is given to changes that emerged as new groups accumulated wealth and their priorities were influenced not only by their own cultural background but also by evolving social and political issues.  The course also examines the various ways organizations themselves changed fundraising strategies to attract each generation of donors.  Lectures on America?s tradition of philanthropy are augmented by readings, class discussions, relevant videos, and guest speakers.\n\n      less description for FDGR1-GC 1000 «",
            "offering": true
        },
        {
            "course_id": "FDGR1-GC 1005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2465",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Theory & Practice in Fundraising",
            "description": "FDGR1-GC 1005 Theory & Practice in Fundraising \nWhile fundraising is a critical component of all nonprofits, there has been little integration of the 'how-to'? and theory of fundraising.  This course examines the theoretical basis and goals of fundraising activities; how to use such theories to attain goals; the integration of theory and practice into effective fundraising programs; and building a personal fundraising philosophy and framework.  Students consider a variety of fundraising strategies and how they can be integrated into a comprehensive development plan.",
            "offering": true
        },
        {
            "course_id": "FDGR1-GC 1010",
            "course_name": "Theory & Practice in Grantmaking",
            "description": "FDGR1-GC 1010 Theory & Practice in Grantmaking \nThis course focuses on the federal and state legal issues affecting nonprofit organizations that are likely to be confronted by nonprofit managers. Topics include qualification for tax-exempt status; compensation of nonprofit executives; restrictions on lobbying and political campaign activities; charitable solicitations; corporate and trust governance; sales of goods and services; and the unrelated business income tax.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 1015",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3235",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "MEYR 157",
                    "time": "Mon 6.45 PM - 9.25 PM",
                    "open": true,
                    "professor": "Josephson, William; Pigott, James"
                }
            ],
            "course_name": "Ethics, Laws & Board Governance in Phil Org",
            "description": "FDGR1-GC 1015 Ethics, Laws & Board Governance in Phil Org \nThis course examines the ethical questions and value dilemmas encountered by fundraisers, nonprofit managers, and grant makers, with particular emphasis on ethical principles and value analysis derived from philosophy, law, and the humanities.  Class lectures complement reading and discussions and make use of case studies of nonprofit organizations.  Topics include protecting donor intent, board governance and accountability, the law, and standards of professional conduct for fundraisers.",
            "offering": true
        },
        {
            "course_id": "FDGR1-GC 1025",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2947",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mays, Odell09/02/2015 - 12/15/2015 Thu 6.45 PM - 9.25 PM with Mays, Odell",
                    "time": "Thu 5.35 PM - 6.35 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Philanthropy and Fiscal Management",
            "description": "FDGR1-GC 1025 Philanthropy and Fiscal Management",
            "offering": true
        },
        {
            "course_id": "FDGR1-GC 1030",
            "course_name": "Corporate & Foundation Philanthropy",
            "description": "FDGR1-GC 1030 Corporate & Foundation Philanthropy \nThis course examines the philosophy that motivates corporate and foundation giving, reviewing past and current trends and priorities.  The course focuses on the competing forces in institutional philanthropy, including the characteristics of and strategic issues for corporate foundation and corporate giving.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 1035",
            "course_name": "Planned Giving",
            "description": "FDGR1-GC 1035 Planned Giving \nThis course examines the importance of planned giving in fundraising activities.  Attention will be given to the variety of charitable gift structures and their impact on the donor and organization.  Topics include: function of charitable gifts in estate planning; charitable gifts that provide income; lead trusts; and gifts of interest in real property.  Special emphasis is on the role of the development officer in the cultivation, solicitation, and administration of planned gifts.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 1045",
            "course_name": "Globalization & Philanthropy",
            "description": "FDGR1-GC 1045 Globalization & Philanthropy \nThis course examines the effect globalization has had on the non-profit sector.  Attention will be given to defining globalization as a different force than modernization, Americanization, or Westernization.  This course will also examine the role of culture, the reconfiguration and manipulation of identity, the role of globalization on philanthropy in the U.S. and abroad, and the role of multinational corporations.  Theories of globalization are discussed and analyzed.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 1050",
            "course_name": "",
            "description": "FDGR1-GC 1050\n\n   Advncment Svcs, Prospect Resrch& Tech for Fndrsng\n\nA significant portion of P11.2901 has been combined with Y39.1025 significantly expanding the scope and nature of the course. The course description has been revised to reflect the newly added topic area. This course has changed at least 50% and is now considered to be a new course.  Thus the title has changed to reflect the change. The course number has also been re-assigned a new course number to indicate the course to be new. Understanding the nature and scope of essential services in support of advancement initiatives is critical to anyone working in the field ? including managers and deve...\n\n      more description for FDGR1-GC 1050 »\n\n      \n\n\n\nA significant portion of P11.2901 has been combined with Y39.1025 significantly expanding the scope and nature of the course. The course description has been revised to reflect the newly added topic area. This course has changed at least 50% and is now considered to be a new course.  Thus the title has changed to reflect the change. The course number has also been re-assigned a new course number to indicate the course to be new. Understanding the nature and scope of essential services in support of advancement initiatives is critical to anyone working in the field ? including managers and development officers. Prospect research, the application of powerful and diverse technological solutions, and other support functions are critical.  The course will cover: capabilities of fundraising and other systems that support of all aspects of development; structure/makeup of advancement services departments; gift processing; reporting and analyses of results; stewardship;  opportunities/challenges of internet, e-mail,  etc., lists and list management; address and phone number research/maintenance; cost and production efficiencies using postal incentives, automation and mail houses; legal, proprietary and constituent-relations aspects of data security/personal identity information.\n\n      less description for FDGR1-GC 1050 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 1900",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2466",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Stern, Marian",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "FDGR1-GC 1900\n\n   Thesis Research Project\n\nAfter completing all coursework and upon approval of a proposal, each student is required to complete the capstone course, undertaking an original research paper on a subject relevant to his or her specialization in fundraising and philanthropy. This project will allow the student to synthesize the knowledge gained in previous coursework. While the student may address a subject previously explored by another scholar or practitioner, the thesis must offer original research and articulate original conclusions and thought processes that make a practical contribution to the existing body of knowle...\n\n      more description for FDGR1-GC 1900 »\n\n      \n\n\n\nAfter completing all coursework and upon approval of a proposal, each student is required to complete the capstone course, undertaking an original research paper on a subject relevant to his or her specialization in fundraising and philanthropy. This project will allow the student to synthesize the knowledge gained in previous coursework. While the student may address a subject previously explored by another scholar or practitioner, the thesis must offer original research and articulate original conclusions and thought processes that make a practical contribution to the existing body of knowledge in the field of Fundraising. All final papers must be of an academic and research standard that is consistent with the requirements of current journals and publications.  In order to successfully complete the project, the student?s advisor, one other reader from either academe or industry, and the department must approve the thesis.\n\n      less description for FDGR1-GC 1900 «",
            "offering": true
        },
        {
            "course_id": "FDGR1-GC 2000",
            "course_name": "Planned Giving",
            "description": "FDGR1-GC 2000 Planned Giving \nThis course examines the importance of planned giving in fundraising activities.  Attention will be given to the variety of charitable gift structures and their impact on the donor and organization.  Topics include: function of charitable gifts in estate planning; charitable gifts that provide income; lead trusts; and gifts of interest in real property.  Special emphasis is on the role of the development officer in the cultivation, solicitation, and administration of planned gifts.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 2005",
            "course_name": "",
            "description": "FDGR1-GC 2005\n\n   Annual,Capital Campaigns & Major Gifts\n\nThis course examines the role of the annual and capital campaigns in an organization. Attention will be given to the different types of annual and capital campaigns.  This course will also examine the various ways in which organizations utilize campaign strategies to meet fundraising goals. Students will learn to identify, examine and resolve potential conflicts between annual and capital campaigns. Topics include:  campaign strategy, organization and implementation; Boards and volunteers; and resolving campaign conflict. We also examine potential conflicts between annual and capital campaigns...\n\n      more description for FDGR1-GC 2005 »\n\n      \n\n\n\nThis course examines the role of the annual and capital campaigns in an organization. Attention will be given to the different types of annual and capital campaigns.  This course will also examine the various ways in which organizations utilize campaign strategies to meet fundraising goals. Students will learn to identify, examine and resolve potential conflicts between annual and capital campaigns. Topics include:  campaign strategy, organization and implementation; Boards and volunteers; and resolving campaign conflict. We also examine potential conflicts between annual and capital campaigns - and how to resolve them.\n\n      less description for FDGR1-GC 2005 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 2010",
            "course_name": "",
            "description": "FDGR1-GC 2010\n\n   Your Strategic Technology Plan & Informed Fundraising\n\nRegardless of the size of your nonprofit, technology can be integrated into every aspect of your fundraising initiative.  This brand new course will explore how to successfully implement a strategic technology plan to raise more money through prospect research, your donor database, relationship management, and your website.  Through case studies, hands-on computer lab work, and an examination of available technologies for fundraisers, we will consider how best practices can be achieved through a gentle yet dynamic evolution in the way we view relationship building and donor communications in t...\n\n      more description for FDGR1-GC 2010 »\n\n      \n\n\n\nRegardless of the size of your nonprofit, technology can be integrated into every aspect of your fundraising initiative.  This brand new course will explore how to successfully implement a strategic technology plan to raise more money through prospect research, your donor database, relationship management, and your website.  Through case studies, hands-on computer lab work, and an examination of available technologies for fundraisers, we will consider how best practices can be achieved through a gentle yet dynamic evolution in the way we view relationship building and donor communications in the 21st century.\n\n      less description for FDGR1-GC 2010 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 2100",
            "course_name": "",
            "description": "FDGR1-GC 2100\n\n   Strategic Grantmaking\n\nStrategic grantmaking involves disciplined efforts to produce actions that shape and guide progress toward established goals.  Grant recipients are the means through which the grantmaker’s program strategy is advanced.  The grantmaker establishes goals and a strategy to achieve them, makes and evaluates grants, establishes an exit strategy and evaluates the success of the program that the grants are meant to advance.  The success or failure of a program is reported to the public both to ensure transparency and to enable other grant-makers to build on the results.  The course will include a det...\n\n      more description for FDGR1-GC 2100 »\n\n      \n\n\n\nStrategic grantmaking involves disciplined efforts to produce actions that shape and guide progress toward established goals.  Grant recipients are the means through which the grantmaker’s program strategy is advanced.  The grantmaker establishes goals and a strategy to achieve them, makes and evaluates grants, establishes an exit strategy and evaluates the success of the program that the grants are meant to advance.  The success or failure of a program is reported to the public both to ensure transparency and to enable other grant-makers to build on the results.  The course will include a detailed examination of these processes and, as well, the design of programs and how to evaluate grant proposals on funding.\n\n      less description for FDGR1-GC 2100 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 2105",
            "course_name": "",
            "description": "FDGR1-GC 2105\n\n   Philanthropy & Social Change\n\nFoundations and individual philanthropists have long sought to use their grant investments to nurture social change. There is a rich history of both success and failure in these endeavors, and today’s philanthropy for social change takes a variety of forms, including traditional grantmaking, online giving, and socially responsible investing. This highly interactive course will present the history of philanthropy for social change and examine contemporary grantmaking efforts, in such areas as poverty alleviation, the environment, and human rights, ranging from local grassroots initiatives to na...\n\n      more description for FDGR1-GC 2105 »\n\n      \n\n\n\nFoundations and individual philanthropists have long sought to use their grant investments to nurture social change. There is a rich history of both success and failure in these endeavors, and today’s philanthropy for social change takes a variety of forms, including traditional grantmaking, online giving, and socially responsible investing. This highly interactive course will present the history of philanthropy for social change and examine contemporary grantmaking efforts, in such areas as poverty alleviation, the environment, and human rights, ranging from local grassroots initiatives to national and global efforts.  Among the many efforts examined in this course include:  recent foundation initiatives; sustainable philanthropy overseas; new “micro-giving” philanthropy; and the “next generation” of philanthropy.\n\n      less description for FDGR1-GC 2105 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 2110",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2822",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "FDGR1-GC 2110\n\n   Program Evaluation Concepts & Methods\n\nFoundations and individual philanthropists have long sought to use their grant investments to nurture social change. There is a rich history of both success and failure in these endeavors, and today’s philanthropy for social change takes a variety of forms, including traditional grantmaking, online giving, and socially responsible investing. This highly interactive course will present the history of philanthropy for social change and examine contemporary grantmaking efforts, in such areas as poverty alleviation, the environment, and human rights, ranging from local grassroots initiatives to na...\n\n      more description for FDGR1-GC 2110 »\n\n      \n\n\n\nFoundations and individual philanthropists have long sought to use their grant investments to nurture social change. There is a rich history of both success and failure in these endeavors, and today’s philanthropy for social change takes a variety of forms, including traditional grantmaking, online giving, and socially responsible investing. This highly interactive course will present the history of philanthropy for social change and examine contemporary grantmaking efforts, in such areas as poverty alleviation, the environment, and human rights, ranging from local grassroots initiatives to national and global efforts.  Among the many efforts examined in this course include:  recent foundation initiatives; sustainable philanthropy overseas; new “micro-giving” philanthropy; and the “next generation” of philanthropy.\n\n      less description for FDGR1-GC 2110 «",
            "offering": true
        },
        {
            "course_id": "FDGR1-GC 3015",
            "course_name": "Building Cultures of Giving:  Understanding Racial, Ethnic, and Gender-Based Philanthropy",
            "description": "FDGR1-GC 3015 Building Cultures of Giving:  Understanding Racial, Ethnic, and Gender-Based Philanthropy \nThis course examines, in greater depth, the history of philanthropy, with particular emphasis on the influence of women and various cultures on philanthropy.  Attention will be given to changes that emerged as women accumulated wealth, and the impact women have had on organizational development through the last two centuries.  This course will also examine the paradox and potential of women?s philanthropy in the context of American cultural history and contemporary life.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3020",
            "course_name": "Strategic Government Relations for Nonprofit Organizations",
            "description": "FDGR1-GC 3020 Strategic Government Relations for Nonprofit Organizations \nThis course examines the relationship between philanthropic organizations and the U.S. government.  Attention will be paid to how philanthropic organizations fit into the political environment, adapting to the political pendulum, and the various ways in which organizations utilize government relations to meet fundraising goals.  Topics will include: understanding the political environment, developing effective strategies, and crafting a government relations plan.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3025",
            "course_name": "Globalization & Philanthropy",
            "description": "FDGR1-GC 3025 Globalization & Philanthropy \nThis course examines the effect globalization has had on the non-profit sector.  Attention will be given to defining globalization as a different force than modernization, Americanization, or Westernization.  This course will also examine the role of culture, the reconfiguration and manipulation of identity, the role of globalization on philanthropy in the U.S. and abroad, and the role of multinational corporations. Theories of globalization are discussed and analyzed.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3035",
            "course_name": "Psychology of Philanthropy",
            "description": "FDGR1-GC 3035 Psychology of Philanthropy \nThis course examines the psychology of philanthropy, analyzing the motivations, strategies, and satisfactions of donors, fundraisers and organizations.  Attention will be given to the psychological influences in philanthropy. Participants learn how to apply the lessons of psychology to create strategy to become more effective fundraisers.",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3040",
            "course_name": "",
            "description": "FDGR1-GC 3040\n\n   The Nonprofit Board of Directors\n\nRecruiting, developing and sustaining a conscientious and effective Board of Directors is a shared responsibility of the board leadership and nonprofit professionals.  This course covers a wide range of topics that relate to board governance, ethical practice and roles as well as management issues concerning the relationship between the volunteer board members and the professional staff.  This is designed as a practical course that will have applicability at all nonprofit organizations.  We will consider best practices and learn how they can be achieved through a gentle yet dynamic evolution i...\n\n      more description for FDGR1-GC 3040 »\n\n      \n\n\n\nRecruiting, developing and sustaining a conscientious and effective Board of Directors is a shared responsibility of the board leadership and nonprofit professionals.  This course covers a wide range of topics that relate to board governance, ethical practice and roles as well as management issues concerning the relationship between the volunteer board members and the professional staff.  This is designed as a practical course that will have applicability at all nonprofit organizations.  We will consider best practices and learn how they can be achieved through a gentle yet dynamic evolution in the life cycle of the board.\n\n      less description for FDGR1-GC 3040 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3045",
            "course_name": "Strategic Planning for The Nonprofit Sector",
            "description": "FDGR1-GC 3045 Strategic Planning for The Nonprofit Sector",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3051",
            "course_name": "Money. Politics, & Non-Profit Organizations",
            "description": "FDGR1-GC 3051 Money. Politics, & Non-Profit Organizations",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3100",
            "course_name": "",
            "description": "FDGR1-GC 3100\n\n   Prospect Research\n\nThis course teaches students the practical research skills needed for fundraising. It introduces students to assorted research tools, websites, and databases and teaches them to develop targeted research strategies. Within an ethical context, they learn how to obtain information on donors and other funding sources. The course also covers how to summarize research findings and create cultivation and solicitation plans. During this course you will learn how to evaluate a prospect¿s ability and inclination to give and the basics of data mining, database screening and moves management. Basic under...\n\n      more description for FDGR1-GC 3100 »\n\n      \n\n\n\nThis course teaches students the practical research skills needed for fundraising. It introduces students to assorted research tools, websites, and databases and teaches them to develop targeted research strategies. Within an ethical context, they learn how to obtain information on donors and other funding sources. The course also covers how to summarize research findings and create cultivation and solicitation plans. During this course you will learn how to evaluate a prospect¿s ability and inclination to give and the basics of data mining, database screening and moves management. Basic understanding of fundraising concepts and practice, skills in internet research, MS Word, and an excellent command of written English required.\n\n      less description for FDGR1-GC 3100 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3105",
            "course_name": "",
            "description": "FDGR1-GC 3105\n\n   The Wired Nonprofit:  Social Media Strategy & Practice\n\nDevelop a basic social media strategy for your organization and examine the role of social media tools, transparency and crowd-sourcing in managing change. This course provides an easily accessible, highly interactive guide for nonprofit leaders considering a social media campaign to boost fundraising, marketing, partnership initiatives and awareness campaigns for their organizations. A dynamic mix of guest speakers and faculty experts explore the latest social media tools and provide analysis and real-life examples of what works and what doesn't. Students make a 90-second cause video for thei...\n\n      more description for FDGR1-GC 3105 »\n\n      \n\n\n\nDevelop a basic social media strategy for your organization and examine the role of social media tools, transparency and crowd-sourcing in managing change. This course provides an easily accessible, highly interactive guide for nonprofit leaders considering a social media campaign to boost fundraising, marketing, partnership initiatives and awareness campaigns for their organizations. A dynamic mix of guest speakers and faculty experts explore the latest social media tools and provide analysis and real-life examples of what works and what doesn't. Students make a 90-second cause video for their organizations.\n\n      less description for FDGR1-GC 3105 «",
            "offering": false
        },
        {
            "course_id": "FDGR1-GC 3900",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2467",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Rubin, Ruthellen",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "3029",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "FDGR1-GC 3900 Independent Study \nThis course provides the opportunity for specialized and individualized activities that augment a student’s program of study. A student interested in developing competencies in specialized areas of fundraising can elect to either expand on topics within the curriculum or focus on topics not offered in the current curriculum. Under the supervision of an academic advisor, a student will independently research a topic in-depth. The student is required to write a comprehensive paper about the researched topic.",
            "offering": true
        },
        {
            "course_id": "FDGR1-GC 3910",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2468",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hyman, Angeilie",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internshp in Fundraising or Grantmaking",
            "description": "FDGR1-GC 3910 Internshp in Fundraising or Grantmaking \nAn internship in a non-profit organization will provide learning experiences in the various aspects of fundraising or grantmaking.  Approval of the director of the Heyman Center is required, as a limited number of internships are available to students.",
            "offering": true
        }
    ]
}