{
    "major_id": "GLOB1-GC",
    "file": "./2015-2016/Global_Studies_(GLOB1-GC).html",
    "courses": [
        {
            "course_id": "GLOB1-GC 1000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20611",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Oppenheimer, Michael",
                    "time": "Mon 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20612",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Levitt, Richard",
                    "time": "Mon 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20613",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mazzucelli, Colette",
                    "time": "Wed 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20614",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mazzucelli, Colette",
                    "time": "Wed 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20667",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Maier, Silvia",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1000\n\n   International Relations in The Post-Cold War Era\n\nThe demise of the Soviet Union and its empire, the legacy of colonialism, resurgent nationalism and new non-state actors have given rise to a period of complexity and rapid change in international relations.  The academic debate reflects this uncertainty, with contending theories about what constitutes power in the post cold war environment, how to identify the basic units of international affairs, the nature of globalization, the utility and legitimacy of the use of force, the dynamics of the balance of power, the nature of threats to peace and stability, and the role of international institu...\n\n      more description for GLOB1-GC 1000 »\n\n      \n\n\n\nThe demise of the Soviet Union and its empire, the legacy of colonialism, resurgent nationalism and new non-state actors have given rise to a period of complexity and rapid change in international relations.  The academic debate reflects this uncertainty, with contending theories about what constitutes power in the post cold war environment, how to identify the basic units of international affairs, the nature of globalization, the utility and legitimacy of the use of force, the dynamics of the balance of power, the nature of threats to peace and stability, and the role of international institutions.  This course will examine alternative theories and frameworks for understanding post cold war developments, and test these theories against emergent reality.  How, for example, do these contending theories explain the origins and consequences of terrorism and other global threats?  What importance do they assign to the persistence of poverty and global inequality; to internal ethno/religious conflict and political instability; to 'globalization and its discontents'?  How do these theories assess the potential and implications of renewed great power conflict?  How do they address the problem of U.S. hegemony and the reaction of others (states and non-states) to this new reality?\n\n      less description for GLOB1-GC 1000 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20649",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Hill, Thomas",
                    "time": "Thu 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1010\n\n   Peacemaking & Peacebuilding\n\nIn an increasingly interdependent world, the need for negotiations and peacemaking as tools for interactive deliberations, problem solving and deal making is paramount.  This course considers a wide diversity of negotiation styles, such as informal as well as formal negotiations, ranging from Cold War superpower bargaining to multilateral standing conferences to extended negotiation processes involving states, NGOs, and third-party facilitators and brokers.  The course also highlights several approaches to conflict resolution and peacemaking formulated by leading scholars with special emphasis...\n\n      more description for GLOB1-GC 1010 »\n\n      \n\n\n\nIn an increasingly interdependent world, the need for negotiations and peacemaking as tools for interactive deliberations, problem solving and deal making is paramount.  This course considers a wide diversity of negotiation styles, such as informal as well as formal negotiations, ranging from Cold War superpower bargaining to multilateral standing conferences to extended negotiation processes involving states, NGOs, and third-party facilitators and brokers.  The course also highlights several approaches to conflict resolution and peacemaking formulated by leading scholars with special emphasis on negotiation, mediation and other relevant aspects.  Based on an introductory survey of current theoretical approaches to negotiation and peacemaking, a concerted effort will be made to examine in some detail a number of carefully selected cases and extract relevant lessons for a deeper understanding of these methods of dealing with tensions and violent conflicts in the modern world.\n\n      less description for GLOB1-GC 1010 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1020",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20637",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Rudbeck, Jens",
                    "time": "Mon 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1020\n\n   Developing Countries in The Global Economy\n\nThis course will examine the problems poor countries face in today?s interdependent world and the strategies proposed to deal with them, beginning with an analysis of the ways in which the global trading system and the international financial system operate.  It will then review the factors affecting the flow of investment capital to developing countries, either as official development assistance or as private investment, with particular attention to the roles of the United Nations, the World Bank, the International Monetary Fund, transnational corporations and governments of both developed an...\n\n      more description for GLOB1-GC 1020 »\n\n      \n\n\n\nThis course will examine the problems poor countries face in today?s interdependent world and the strategies proposed to deal with them, beginning with an analysis of the ways in which the global trading system and the international financial system operate.  It will then review the factors affecting the flow of investment capital to developing countries, either as official development assistance or as private investment, with particular attention to the roles of the United Nations, the World Bank, the International Monetary Fund, transnational corporations and governments of both developed and developing countries.  Next, it will consider the requirements for sustainable development and the role of non-governmental organizations as well as inter-governmental organizations and national governments, particularly in matters affecting the environment and human rights.  The course will conclude with proposals for reform, based on a comparison of the experiences of selected developing countries and of different approaches to governance of the international trading and financial systems.\n\n      less description for GLOB1-GC 1020 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20617",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Scher, Roger",
                    "time": "Tue 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20618",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Goldberg, Edward",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1030\n\n   International Political Economy\n\nThis course provides an introduction to international political economy - the interaction of economics and politics, of markets and government, in the international arena. The course has three fundamental premises: first, economic factors play an important role in international relations; second, the world economy is becoming increasingly integrated and interdependent; third, political institutions and policies have a significant impact on the world economy. The goal of the course is to give students a better understanding of the world economy, the nature of international economic issues, the ...\n\n      more description for GLOB1-GC 1030 »\n\n      \n\n\n\nThis course provides an introduction to international political economy - the interaction of economics and politics, of markets and government, in the international arena. The course has three fundamental premises: first, economic factors play an important role in international relations; second, the world economy is becoming increasingly integrated and interdependent; third, political institutions and policies have a significant impact on the world economy. The goal of the course is to give students a better understanding of the world economy, the nature of international economic issues, the roles of international economic institutions and multinational enterprises, and the policy challenges of economic interdependence. The first part of the course is intended to provide an interdisciplinary analytical framework for the subject incorporating political science, economics, and recent history. The remaining parts of the course use this analytical framework to examine contemporary issues of international economic relations. These issues are organized under the headings of globalization, economic development, and managing economic interdependence.\n\n      less description for GLOB1-GC 1030 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1040",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20629",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Sabatello, Maya",
                    "time": "Wed 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20630",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Trahan, Jennifer",
                    "time": "Wed 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1040\n\n   International Law\n\nThis course will provide the global studies student with an introductory understanding of the role of public international law in international affairs.  Each session will focus on an important aspect of the discipline and will reveal how and why international law affects world affairs in such a profound way. Among the questions addressed are: How are disputes between states settled and what mechanism does international law provide for their resolution? What are the sources of international law?  Who is bound by it?  How is it interpreted?  When may a state apply its own laws extraterritoriall...\n\n      more description for GLOB1-GC 1040 »\n\n      \n\n\n\nThis course will provide the global studies student with an introductory understanding of the role of public international law in international affairs.  Each session will focus on an important aspect of the discipline and will reveal how and why international law affects world affairs in such a profound way. Among the questions addressed are: How are disputes between states settled and what mechanism does international law provide for their resolution? What are the sources of international law?  Who is bound by it?  How is it interpreted?  When may a state apply its own laws extraterritorially?  The course will examine key international legal institutions such as the International Court of Justice (ICJ), the World Trade Organization (WTO) and the International Criminal Court (ICC) as well as core substantive areas including: use of force, law of the sea, law of territory, human rights, and the global environment.  Discussions emphasize the importance of international law in history and in current international relations.\n\n      less description for GLOB1-GC 1040 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1050",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20635",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mazzucelli, Colette",
                    "time": "Mon 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1050\n\n   Global Civil Society\n\nGathering around causes that inspire them, private citizens have brought real changes to international affairs, from the Geneva Conventions to affordable AIDS medications, women's rights and the ban on land mines.  This course will begin with a history of such non-governmental organizations and of their relations with the United Nations, governments and donors.  It will discuss their achievements and their limitations in humanitarian aid, human rights and conflict resolution, development and democracy, the environment, and other areas.  The class will examine the methods NGOs choose, from glob...\n\n      more description for GLOB1-GC 1050 »\n\n      \n\n\n\nGathering around causes that inspire them, private citizens have brought real changes to international affairs, from the Geneva Conventions to affordable AIDS medications, women's rights and the ban on land mines.  This course will begin with a history of such non-governmental organizations and of their relations with the United Nations, governments and donors.  It will discuss their achievements and their limitations in humanitarian aid, human rights and conflict resolution, development and democracy, the environment, and other areas.  The class will examine the methods NGOs choose, from global advocacy to grassroots service, as they set out to change the world.\n\n      less description for GLOB1-GC 1050 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1060",
            "course_name": "From the Mughals to Modernity:  India's Democracy and its Discontents",
            "description": "GLOB1-GC 1060 From the Mughals to Modernity:  India's Democracy and its Discontents",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 1100",
            "course_name": "",
            "description": "GLOB1-GC 1100\n\n   Inside Latin America\n\nLatin American regional democracies confront myriad challenges, from U.S. military intervention in Colombia to populism in Venezuela and renewed demands for military accountability in the southern cone. Recent market-oriented policies and globalization have generated economic growth and tamed inflation at the cost of income inequality, environmental stresses, and vulnerability to foreign shocks. University strikes in Mexico, a landless movement in Brazil, and labor organizers on the U.S.-Mexican border challenge the neo-liberal agenda. This class explores key regional trends with a focus on Me...\n\n      more description for GLOB1-GC 1100 »\n\n      \n\n\n\nLatin American regional democracies confront myriad challenges, from U.S. military intervention in Colombia to populism in Venezuela and renewed demands for military accountability in the southern cone. Recent market-oriented policies and globalization have generated economic growth and tamed inflation at the cost of income inequality, environmental stresses, and vulnerability to foreign shocks. University strikes in Mexico, a landless movement in Brazil, and labor organizers on the U.S.-Mexican border challenge the neo-liberal agenda. This class explores key regional trends with a focus on Mexico, Chile, Brazil, Colombia, and Argentina.\n\n      less description for GLOB1-GC 1100 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 1105",
            "course_name": "",
            "description": "GLOB1-GC 1105\n\n   Europe in The 21St Century\n\nThis course focuses on the changing realities of modern Europe.  The continent?s main democratic political systems, as well as the European Union, are critically examined.  The course reveals how the enlargement of the European Union is creating a supranational political and economic framework from the Atlantic to the Baltic to the Mediterranean, with tremendous economic power but still-nascent political unity and foreign-policy clout.  Finally, the course examines the process of democratic change and consolidation in post-communist Europe, including both successful and unsuccessful examples. ...\n\n      more description for GLOB1-GC 1105 »\n\n      \n\n\n\nThis course focuses on the changing realities of modern Europe.  The continent?s main democratic political systems, as well as the European Union, are critically examined.  The course reveals how the enlargement of the European Union is creating a supranational political and economic framework from the Atlantic to the Baltic to the Mediterranean, with tremendous economic power but still-nascent political unity and foreign-policy clout.  Finally, the course examines the process of democratic change and consolidation in post-communist Europe, including both successful and unsuccessful examples.  Two crucial countries straddling Europe and Asia - Turkey and Russia - are examined in depth.\n\n      less description for GLOB1-GC 1105 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 1110",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20670",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Borst, Barbara",
                    "time": "Wed 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1110\n\n   Inside Africa Today\n\nThe HIV-AIDS pandemic, wars, civil strife and famine, marginalization in the world economy - most of what one hears from Africa is negative. What is the role of the United Nations and regional and sub-regional organizations such as the African Union, the Southern African Development Community and the Economic Community of West African States in dealing with the challenges confronting contemporary Africa? What are these organizations as well as NGOs and civil society doing in the efforts towards conflict prevention and resolution and in the search for sustainable development? This course takes ...\n\n      more description for GLOB1-GC 1110 »\n\n      \n\n\n\nThe HIV-AIDS pandemic, wars, civil strife and famine, marginalization in the world economy - most of what one hears from Africa is negative. What is the role of the United Nations and regional and sub-regional organizations such as the African Union, the Southern African Development Community and the Economic Community of West African States in dealing with the challenges confronting contemporary Africa? What are these organizations as well as NGOs and civil society doing in the efforts towards conflict prevention and resolution and in the search for sustainable development? This course takes an inside view of the current situation in each major region of the continent, addressing the numerous conflicts which beset it as well as examining the political, economic and social factors which can lead to its revival.\n\n      less description for GLOB1-GC 1110 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1115",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20648",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Cheah, Yee",
                    "time": "Thu 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1115\n\n   Asia Today:  An Introduction\n\nScholars spend their lives becoming experts on Japan or Siberia or China or India or Iran or Turkey - and much else in between. From Ankara to Shanghai and Novosibirsk to Djakarta, Asia has long been a geographical concept with uneven trans-regional interconnections. This class dissects all these countries in some detail and examines the extent of the interconnections among the societies on the continent called Asia. The course seeks to help students understand how Asia, with half the world's population, is likely to collide or collaborate with the US and Europe in the context of a global econ...\n\n      more description for GLOB1-GC 1115 »\n\n      \n\n\n\nScholars spend their lives becoming experts on Japan or Siberia or China or India or Iran or Turkey - and much else in between. From Ankara to Shanghai and Novosibirsk to Djakarta, Asia has long been a geographical concept with uneven trans-regional interconnections. This class dissects all these countries in some detail and examines the extent of the interconnections among the societies on the continent called Asia. The course seeks to help students understand how Asia, with half the world's population, is likely to collide or collaborate with the US and Europe in the context of a global economy and shrinking planet.\n\n      less description for GLOB1-GC 1115 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1120",
            "course_name": "",
            "description": "GLOB1-GC 1120\n\n   The Contemporary Middle East\n\nThis course examines the changing landscape of a region critical to global stability.  We examine the political, socio-economic, and cultural aspects of the Arab world, Iran, Israel, and Turkey and their far-ranging transformation.  Topics include the role played by various ideologies in shaping the evolution of the Middle East since the advent of modernization, the origins, development, and impact of the Palestinian-Israeli struggle, post-Cold War regional dynamics, and the struggle between Islamists and secularists.  We review the domestic structures and regional roles of such local powers a...\n\n      more description for GLOB1-GC 1120 »\n\n      \n\n\n\nThis course examines the changing landscape of a region critical to global stability.  We examine the political, socio-economic, and cultural aspects of the Arab world, Iran, Israel, and Turkey and their far-ranging transformation.  Topics include the role played by various ideologies in shaping the evolution of the Middle East since the advent of modernization, the origins, development, and impact of the Palestinian-Israeli struggle, post-Cold War regional dynamics, and the struggle between Islamists and secularists.  We review the domestic structures and regional roles of such local powers as Egypt, Iran, Israel, Saudi Arabia, and Turkey.  Issues such as civil society, demography, resources, the media, and globalization provide guidance in projecting the direction of change.  We assess the role of outsiders, whether sovereign states or international institutions, and their contributions to the region's adjustments.  Emphasis is placed upon current events and their relationship to the recent history of the Middle East.\n\n      less description for GLOB1-GC 1120 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 1125",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20692",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Kissane, Carolyn",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 1125\n\n   Transformations in Central Asia:  A Global Context\n\nThe region of Central Asia is a fabulous mosaic.  Its complex history, vast landscape, diverse ethnic, linguistic and religious populations, and contemporary geopolitical importance make it an area of the world that is both complex and critical to understand and appreciate.  The region of Central Asia in the context of this course refers to the five states of Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan.  The region is especially important at this juncture in history due to its rich natural resource base, fragile political and economic situation following the dissolution of ...\n\n      more description for GLOB1-GC 1125 »\n\n      \n\n\n\nThe region of Central Asia is a fabulous mosaic.  Its complex history, vast landscape, diverse ethnic, linguistic and religious populations, and contemporary geopolitical importance make it an area of the world that is both complex and critical to understand and appreciate.  The region of Central Asia in the context of this course refers to the five states of Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan and Uzbekistan.  The region is especially important at this juncture in history due to its rich natural resource base, fragile political and economic situation following the dissolution of the Soviet Union, and the region?s location in relation to its closest neighbors, Russia and China.  Since 1991, many governments, non-governmental organizations and investors have actively tried to engage the region through international development assistance around the support for democratic institution building and most critically, in and around the direction of energy supply and security.  \n\nThe year 1991 was pivotal in that it officially severed the relationship between Moscow and the republics that comprised what was the Soviet Union.  Since then, the region is engaged in a difficult process of transition, renewal, and redefinition.  It is vital in this connection to consider the ?historical residue? in Central Asia, where centuries of migrations, colonization, and war have created a unique ethnic, religious and cultural mix of peoples and ideologies. \n\nThis special seminar introduces students to the region of Central Asia with a brief historical overview and a look at each of the five states, and then moves towards developing a more in-depth look at the energy sector with specific attention to the energy rich Caspian and its key player, Kazakhstan.  The geopolitical positioning of the region, and the engagement of three great powers, China, the United States and Russia, is also examined.\n\n      less description for GLOB1-GC 1125 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 1130",
            "course_name": "Russia and the World",
            "description": "GLOB1-GC 1130 Russia and the World",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 1135",
            "course_name": "The Mideast:  National Security, Politics, and Society",
            "description": "GLOB1-GC 1135 The Mideast:  National Security, Politics, and Society",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 1140",
            "course_name": "Vietnam and ASEAN at The Vortex of Geopolitics and the World Economy in the 21st C",
            "description": "GLOB1-GC 1140 Vietnam and ASEAN at The Vortex of Geopolitics and the World Economy in the 21st C",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 1150",
            "course_name": "",
            "description": "GLOB1-GC 1150\n\n   The Great Game Redux? The Geopolitics of Afghanistan and Central Asia\n\nAfghanistan lies at the crossroads of South Asia, Central Asia and the Middle East—an area whose key geopolitical, strategic and economic significance dates back two millennia and has made Afghanistan repeatedly the object of the schemes and stratagems of the great powers as well as the graveyard of these empires. Once again, Afghanistan is a contestant in this “Great Game.” Against the backdrop of the scheduled 2014 withdrawal of American troops and the big question that dominates policy debates “What is the future of Afghanistan? Collapse, Compromise or Conflict?” this seminar explores the m...\n\n      more description for GLOB1-GC 1150 »\n\n      \n\n\n\nAfghanistan lies at the crossroads of South Asia, Central Asia and the Middle East—an area whose key geopolitical, strategic and economic significance dates back two millennia and has made Afghanistan repeatedly the object of the schemes and stratagems of the great powers as well as the graveyard of these empires. Once again, Afghanistan is a contestant in this “Great Game.” Against the backdrop of the scheduled 2014 withdrawal of American troops and the big question that dominates policy debates “What is the future of Afghanistan? Collapse, Compromise or Conflict?” this seminar explores the most important historical, domestic, international, geopolitical and economic dynamics, actors and interests that shape—and have shaped—the politics of Afghanistan and the neighboring “-stans.”\n\n      less description for GLOB1-GC 1150 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20636",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Altier, Mary Beth",
                    "time": "Mon 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2000\n\n   Transnational Security\n\nThe concerns of national and international security have evolved considerably since the days of the Cold War. While states are still concerned with traditional threats such as military aggression from other states, emerging issues present different, yet no less compelling, challenges to security. These new challenges include terrorism and the proliferation of weapons of mass destruction, failed states, environmental catastrophes and major public health crises such as HIV/AIDS. This course explores how security policy issues are addressed at the national and international level. How prepared ar...\n\n      more description for GLOB1-GC 2000 »\n\n      \n\n\n\nThe concerns of national and international security have evolved considerably since the days of the Cold War. While states are still concerned with traditional threats such as military aggression from other states, emerging issues present different, yet no less compelling, challenges to security. These new challenges include terrorism and the proliferation of weapons of mass destruction, failed states, environmental catastrophes and major public health crises such as HIV/AIDS. This course explores how security policy issues are addressed at the national and international level. How prepared are agencies and organizations to meet newer security challenges? Are classic doctrines of deterrence still applicable? To what extent can technology be relied upon, as a tool to address current security needs?\n\n      less description for GLOB1-GC 2000 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20628",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Hill, Thomas",
                    "time": "Tue 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2005\n\n   Conflict Assessment:  Theory and Practice\n\nInternational actors often apply different methodologies to assess conflicts. These methodologies help them determine the best ways to address a conflict and maximize their opportunities to prevent or alleviate crises. This course examines how international actors including the World Bank, UN agencies, bilateral donors and NGOs, analyze conflict and the interaction between conflict dynamics and their own engagement in a given country or region. The class will explore how analytical frameworks can be used to assess the impact of development, humanitarian and peacebuilding programs or projects o...\n\n      more description for GLOB1-GC 2005 »\n\n      \n\n\n\nInternational actors often apply different methodologies to assess conflicts. These methodologies help them determine the best ways to address a conflict and maximize their opportunities to prevent or alleviate crises. This course examines how international actors including the World Bank, UN agencies, bilateral donors and NGOs, analyze conflict and the interaction between conflict dynamics and their own engagement in a given country or region. The class will explore how analytical frameworks can be used to assess the impact of development, humanitarian and peacebuilding programs or projects on existing conflict factors and dynamics. Emphasis will be placed on understanding the concept of conflict assessment, its development and implementation; exploring different approaches to conflict assessment, including an examination of different implicit assumptions and theories of conflict; analyzing specific conflict case studies and identifying real and potential third party responses.\n\n      less description for GLOB1-GC 2005 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2010",
            "course_name": "",
            "description": "GLOB1-GC 2010\n\n   Ethnic Conflicts\n\nThis course examines the dramatic escalation of ethnic conflict in the post-Cold War era. We begin with a thorough analysis of the factors behind ethnic conflicts, including history, culture, attitudes, leadership, outside influences, and the ethnic group's point of view. In our search for resolutions, we explore new approaches to ethnic conflicts using Bosnia, Kosovo, Northern Ireland, East Timor, the Sudan, Palestinians, and Kurds as case studies. We conclude by advancing new ideas about the roles that the UN and the U.S. can play in resolving existing conflicts and preventing new ones from ...\n\n      more description for GLOB1-GC 2010 »\n\n      \n\n\n\nThis course examines the dramatic escalation of ethnic conflict in the post-Cold War era. We begin with a thorough analysis of the factors behind ethnic conflicts, including history, culture, attitudes, leadership, outside influences, and the ethnic group's point of view. In our search for resolutions, we explore new approaches to ethnic conflicts using Bosnia, Kosovo, Northern Ireland, East Timor, the Sudan, Palestinians, and Kurds as case studies. We conclude by advancing new ideas about the roles that the UN and the U.S. can play in resolving existing conflicts and preventing new ones from escalating beyond control.\n\n      less description for GLOB1-GC 2010 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2015",
            "course_name": "Critical Analysis for Global Affairs",
            "description": "GLOB1-GC 2015 Critical Analysis for Global Affairs",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2020",
            "course_name": "",
            "description": "GLOB1-GC 2020\n\n   International Negotiation:  Cases and Lessons\n\nThis course is designed to provide an in-depth understanding of how nations and other international actors go about achieving their objectives through the give-and-take of the negotiation process. First, we will focus on the theory and principles of effective international negotiation, using a number of case studies 9including the Arab-Israeli conflict, UN-Iraq negotiations over inspections and the Kyoto conference on climate change) in which negotiation has been used in recent years. The course will examine the role that different mindsets and cultures play in negotiation and will also pay sp...\n\n      more description for GLOB1-GC 2020 »\n\n      \n\n\n\nThis course is designed to provide an in-depth understanding of how nations and other international actors go about achieving their objectives through the give-and-take of the negotiation process. First, we will focus on the theory and principles of effective international negotiation, using a number of case studies 9including the Arab-Israeli conflict, UN-Iraq negotiations over inspections and the Kyoto conference on climate change) in which negotiation has been used in recent years. The course will examine the role that different mindsets and cultures play in negotiation and will also pay special attention to the importance of developing the negotiating process and attaining mutual benefit from it. Finally, we will review the effective exercise of negotiation to handle issues before they become problems and problems before they become violent conflicts.\n\n      less description for GLOB1-GC 2020 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2025",
            "course_name": "",
            "description": "GLOB1-GC 2025\n\n   Public Diplomacy\n\nPublic diplomacy can be described as official efforts aimed at conveying information about government positions and policies to engender public support. The events of September 11 and its aftermath have given rise to new directions in public diplomacy that have placed powerful information and imaging campaigns at the forefront of international affairs. This includes the use of, and influence upon, public diplomacy by non-state actors. This course will examine the new realities, methodologies and technologies that drive public diplomacy in the early part of the 21st Century and the challenges t...\n\n      more description for GLOB1-GC 2025 »\n\n      \n\n\n\nPublic diplomacy can be described as official efforts aimed at conveying information about government positions and policies to engender public support. The events of September 11 and its aftermath have given rise to new directions in public diplomacy that have placed powerful information and imaging campaigns at the forefront of international affairs. This includes the use of, and influence upon, public diplomacy by non-state actors. This course will examine the new realities, methodologies and technologies that drive public diplomacy in the early part of the 21st Century and the challenges to its effective implementation. The course employs current and historical readings, film and other multimedia.\n\n      less description for GLOB1-GC 2025 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2030",
            "course_name": "",
            "description": "GLOB1-GC 2030\n\n   Machinery and Politics of U.S. Foreign Policy Decision Making\n\nWashington's need to manage foreign policy issues arises from America's far-flung concerns abroad, which impinge on U.S. security, economic, commercial, political, military, and ecological interests. Many federal bureaucracies are involved in solving problems, as well as Congress, the media, universities, non-governmental organizations, and the public. This course studies relevant institutions, their procedures, and their interactions in seeking solutions. We examine several recent cases of decision making, and discuss how major pending challenges in the Middle East, East Asia and elsewhere ma...\n\n      more description for GLOB1-GC 2030 »\n\n      \n\n\n\nWashington's need to manage foreign policy issues arises from America's far-flung concerns abroad, which impinge on U.S. security, economic, commercial, political, military, and ecological interests. Many federal bureaucracies are involved in solving problems, as well as Congress, the media, universities, non-governmental organizations, and the public. This course studies relevant institutions, their procedures, and their interactions in seeking solutions. We examine several recent cases of decision making, and discuss how major pending challenges in the Middle East, East Asia and elsewhere may be addressed.\n\n      less description for GLOB1-GC 2030 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2035",
            "course_name": "",
            "description": "GLOB1-GC 2035\n\n   Ethics in International Affairs\n\nThis course will explore one of the most exciting questions in international relations: Should moral considerations play a role in the conduct of foreign affairs? It is a question that most people would instinctively answer 'yes.' But once specific issues are considered, the answer becomes more complicated. For instance, what is a 'just' war? Can war ever be just and is the current Iraq war a 'just war?' Under what circumstances do we have a right or a duty to intervene in the affairs of another state? Is the killing of civilians justified under any circumstances? Can terrorist acts ever serve...\n\n      more description for GLOB1-GC 2035 »\n\n      \n\n\n\nThis course will explore one of the most exciting questions in international relations: Should moral considerations play a role in the conduct of foreign affairs? It is a question that most people would instinctively answer 'yes.' But once specific issues are considered, the answer becomes more complicated. For instance, what is a 'just' war? Can war ever be just and is the current Iraq war a 'just war?' Under what circumstances do we have a right or a duty to intervene in the affairs of another state? Is the killing of civilians justified under any circumstances? Can terrorist acts ever serve moral ends? What about torture? Where do human rights come from? Are they universal or circumscribed by culture and religion? These are just a few of the questions we will discuss on the basis of classic texts and thought-provoking documentaries. At the end of this course students will have a good understanding of the fundamental ideas regarding ethics in international affairs as well as how they apply to key issues driving current international politics.\n\n      less description for GLOB1-GC 2035 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2040",
            "course_name": "",
            "description": "GLOB1-GC 2040\n\n   The Role of The U.S. in World Affairs\n\nAmerica's current global predominance constitutes, for the first time, a unipolar system with far-reaching political, economic, and security implications. Can the U.S. maintain its supremacy for the foreseeable future? Consider sources of U.S. strength, examine how varied and durable they are, and discuss how resources can be channeled to conduct a more coherent and visionary foreign policy. Attempt to answer an even larger question: How should America deal with other significant powers, such as Russia, China, India, and Japan - not only to thwart any attempt to check or diminish its primacy, ...\n\n      more description for GLOB1-GC 2040 »\n\n      \n\n\n\nAmerica's current global predominance constitutes, for the first time, a unipolar system with far-reaching political, economic, and security implications. Can the U.S. maintain its supremacy for the foreseeable future? Consider sources of U.S. strength, examine how varied and durable they are, and discuss how resources can be channeled to conduct a more coherent and visionary foreign policy. Attempt to answer an even larger question: How should America deal with other significant powers, such as Russia, China, India, and Japan - not only to thwart any attempt to check or diminish its primacy, but to lead with moral authority?\n\n      less description for GLOB1-GC 2040 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2045",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20666",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Oppenheimer, Michael",
                    "time": "Wed 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2045\n\n   The Future of International Relations:  Forces for Change and Alternate Scenarios\n\nRapid change, complexity, and uncertainty characterize the unfolding international system. Theoretical tools designed to help us interpret events, prescribe policies and anticipate trends are essential intellectual equipment.  They can also become part of the problem, creating a false sense of confidence in how we understand global dynamics.  Can we calibrate our actions to a desired effect?  When at the service of great power, an exaggerated sense of understanding and control can produce massive unintended consequences. Policy is constantly playing catch up, scrambling to right itself in the ...\n\n      more description for GLOB1-GC 2045 »\n\n      \n\n\n\nRapid change, complexity, and uncertainty characterize the unfolding international system. Theoretical tools designed to help us interpret events, prescribe policies and anticipate trends are essential intellectual equipment.  They can also become part of the problem, creating a false sense of confidence in how we understand global dynamics.  Can we calibrate our actions to a desired effect?  When at the service of great power, an exaggerated sense of understanding and control can produce massive unintended consequences. Policy is constantly playing catch up, scrambling to right itself in the aftermath of the latest shock. This course accepts uncertainty and surprise as givens, and then proceeds to build alternate scenarios around emerging forces for change and potential `wild card? events. The purpose is not prediction, but a fuller understanding of global dynamics, and of plausible international systems that might emerge. In doing so, we will address theories, sources, indicators and consequences of change, and interactively build alternate future scenarios with students, other interested faculty and outside experts.\n\n      less description for GLOB1-GC 2045 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2046",
            "course_name": "",
            "description": "GLOB1-GC 2046\n\n   Strategic Foresight for International Relations\n\nThis course picks up from where the course \"The Future of International Relations: Forces for Change and Alternative Scenarios\" course ends. Students will be taught how to compose drivers and scenarios in a step-by-step process involving guided practice sessions.  This course is an intensive structural exploration of forecasting and scenario work—how to think like a good forecaster; how to craft scenarios; and how to understand the current science of futures forecasting. The course is split into 2 basic sections, the first being a review of current work on futures forecasting, methodological h...\n\n      more description for GLOB1-GC 2046 »\n\n      \n\n\n\nThis course picks up from where the course \"The Future of International Relations: Forces for Change and Alternative Scenarios\" course ends. Students will be taught how to compose drivers and scenarios in a step-by-step process involving guided practice sessions.  This course is an intensive structural exploration of forecasting and scenario work—how to think like a good forecaster; how to craft scenarios; and how to understand the current science of futures forecasting. The course is split into 2 basic sections, the first being a review of current work on futures forecasting, methodological history and the basics of computational prediction (first 2 weekends) and the second focused on case-specific scenario development and application of methodologies.\n\n      less description for GLOB1-GC 2046 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2050",
            "course_name": "",
            "description": "GLOB1-GC 2050\n\n   The Media and International Affairs\n\nThis course examines the interrelationships between mass media (print and broadcast journalism) and politics in America and abroad. Journalism has both a symbiotic and an adversarial relationship with the political world that it covers. It uses and is used by politicians and their spin-doctors. By exploring the current and historic conflicts between journalists and politicians, students will be made aware of domestic and international U.S. policies and the relationships between Washington and foreign capitals, the United Nations, and regional conflicts. Course topics cover such themes as using...\n\n      more description for GLOB1-GC 2050 »\n\n      \n\n\n\nThis course examines the interrelationships between mass media (print and broadcast journalism) and politics in America and abroad. Journalism has both a symbiotic and an adversarial relationship with the political world that it covers. It uses and is used by politicians and their spin-doctors. By exploring the current and historic conflicts between journalists and politicians, students will be made aware of domestic and international U.S. policies and the relationships between Washington and foreign capitals, the United Nations, and regional conflicts. Course topics cover such themes as using and being used by news sources; journalistic ethics and ethical considerations in the setting of the news agenda; yellow journalism; implications of corporate ownership of media; First Amendment issues such as libel, privacy, prior restraint against publishing the news, protection of sources, the right to gather news, and national security; how governments control and spin the news; the changing role of the foreign correspondent; changes in the U.S. at war; broadcast regulations, including the Fairness Doctrine and the questions of equal time and access; the implications of \"negative\" journalism; the growing role and impact of technological change on newsgathering; and journalism's impact on the 2000 and 2004 Presidential elections.\n\n      less description for GLOB1-GC 2050 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2055",
            "course_name": "Nuclear Non-Proliferation and Disarmament",
            "description": "GLOB1-GC 2055 Nuclear Non-Proliferation and Disarmament",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2060",
            "course_name": "",
            "description": "GLOB1-GC 2060\n\n   Democratic Transitions:  Setbacks and Successes\n\nDeveloping countries are under increasing pressure ? from inside as well as from outside ? to move toward democracy. Opposition parties organize even where it is illegal or risky. Human rights activists and journalists challenge dictators. Citizen groups demand government accountability and the inclusion of the poor, minority groups and women in politics. Western governments, the World Bank and civil society organizations push for reform.  This class will examine the efforts to build democracy and the obstacles to that work in select countries in Africa, Asia, the Middle East and Latin America...\n\n      more description for GLOB1-GC 2060 »\n\n      \n\n\n\nDeveloping countries are under increasing pressure ? from inside as well as from outside ? to move toward democracy. Opposition parties organize even where it is illegal or risky. Human rights activists and journalists challenge dictators. Citizen groups demand government accountability and the inclusion of the poor, minority groups and women in politics. Western governments, the World Bank and civil society organizations push for reform.  This class will examine the efforts to build democracy and the obstacles to that work in select countries in Africa, Asia, the Middle East and Latin America.  We will discuss countries that have achieved considerable success in building democratic structures, others where the search for better government has become entangled in conflict, and still others where democratic movements are just beginning.\n\n      less description for GLOB1-GC 2060 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2065",
            "course_name": "Transnational Crime",
            "description": "GLOB1-GC 2065 Transnational Crime",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2070",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20625",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Galeotti, Mark",
                    "time": "Thu 9.30 AM - 12.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2070\n\n   Intelligence and Counterintelligence\n\nIntelligence refers to the process of gathering and analyzing difficult-to-obtain information. Accurate intelligence is essential for any government to formulate and implement strategy with regards to counterterrorism, counterinsurgency and foreign policy.  This course will introduce students to the diverse methods employed by the United States government for collecting, processing, analyzing and disseminating intelligence in the 21st century. Students will examine the individual organizations comprising America?s national intelligence community and identify the historical successes, failures ...\n\n      more description for GLOB1-GC 2070 »\n\n      \n\n\n\nIntelligence refers to the process of gathering and analyzing difficult-to-obtain information. Accurate intelligence is essential for any government to formulate and implement strategy with regards to counterterrorism, counterinsurgency and foreign policy.  This course will introduce students to the diverse methods employed by the United States government for collecting, processing, analyzing and disseminating intelligence in the 21st century. Students will examine the individual organizations comprising America?s national intelligence community and identify the historical successes, failures and the future challenges that each agency faces in fulfilling their respective missions.  This course will help students to develop an informed appreciation of the capabilities and limitations of intelligence and of the US national intelligence community in particular.\n\n      less description for GLOB1-GC 2070 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2075",
            "course_name": "Counter-Terrorism and Homeland Security",
            "description": "GLOB1-GC 2075 Counter-Terrorism and Homeland Security",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2080",
            "course_name": "",
            "description": "GLOB1-GC 2080\n\n   Transnational Terrorism\n\nThe attacks of September 11, 2001, have brought the issue of transnational terrorism to the forefront of the global agenda.  Terrorism, however, is hardly a new phenomenon.  The employment of terrorist tactics for purposes of achieving social or political goals dates back at least several centuries.  This course explores what terrorism is and how it has evolved.  Some of the key questions that this course deals with include: What exactly is terrorism?  What kinds of actors employ terrorist tactics?  What are the most common terrorist strategies and tactics?  How has terrorism evolved since the...\n\n      more description for GLOB1-GC 2080 »\n\n      \n\n\n\nThe attacks of September 11, 2001, have brought the issue of transnational terrorism to the forefront of the global agenda.  Terrorism, however, is hardly a new phenomenon.  The employment of terrorist tactics for purposes of achieving social or political goals dates back at least several centuries.  This course explores what terrorism is and how it has evolved.  Some of the key questions that this course deals with include: What exactly is terrorism?  What kinds of actors employ terrorist tactics?  What are the most common terrorist strategies and tactics?  How has terrorism evolved since the end of the Cold War?  How much of a threat is terrorism?  What are the new threats posed by terrorists in the current era?  What role do societal factors, such as the media and public opinion, play in dealing with terrorism?  How can governments and societies effectively deter and, if necessary, combat terrorism?  What alternatives are available to the international community for combating transnational terrorism?  What are the tradeoffs and costs societies might be asked to incur in order to wage a war on terrorism?  How have recent wars on terror fared?  How does terrorism end?\n\n      less description for GLOB1-GC 2080 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2085",
            "course_name": "The United States in the World Economy",
            "description": "GLOB1-GC 2085 The United States in the World Economy",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2090",
            "course_name": "Peacebuilding and Development",
            "description": "GLOB1-GC 2090 Peacebuilding and Development",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2095",
            "course_name": "Global Climate Change",
            "description": "GLOB1-GC 2095 Global Climate Change",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2100",
            "course_name": "Political Economy of Development",
            "description": "GLOB1-GC 2100 Political Economy of Development \nThis course examines the various issues and problems associated with economic growth and development from both classical and Marxist perspectives. We look at case studies from East Asia and Latin America; explore the challenges posed by economies in transition in central and eastern Europe; and consider the experience of industrial countries with specific reference to their less developed regions. In particular, the course tries to define the conditions that allow for economic growth and seeks to understand the relationship between economic growth and human development.",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2105",
            "course_name": "",
            "description": "GLOB1-GC 2105\n\n   Economic Security:  Challenges, Prescriptions, and Opportunities in the Post-9/11 Era\n\nTraditional concepts of security have focused on politico-military strength as a means of power projection in international relations with little emphasis on economics and other variables.  Many pundits, however are challenging this traditional notion by highlighting such disparate but inter-related factors as economics, ideology, demography, culture, and geography.  Can a superpower remain one in the face of severe structural economic balances? What are the potential symmetrical and asymmetrical threats to national and global economic vitality? This course not only aims to highlight and bette...\n\n      more description for GLOB1-GC 2105 »\n\n      \n\n\n\nTraditional concepts of security have focused on politico-military strength as a means of power projection in international relations with little emphasis on economics and other variables.  Many pundits, however are challenging this traditional notion by highlighting such disparate but inter-related factors as economics, ideology, demography, culture, and geography.  Can a superpower remain one in the face of severe structural economic balances? What are the potential symmetrical and asymmetrical threats to national and global economic vitality? This course not only aims to highlight and better explain the economic drivers behind national security but also to examine these drivers and their impact on national security in a more holistic and integrated fashion.  In this debate, traditional concepts of national security are being challenged and re-defined.  This course weaves economic assumptions and underpinnings into the fabric of national security aiming to provoke analysis, thought, and discourse regarding the impact of the global economy on national security and national security on the geo-economy.\n\n      less description for GLOB1-GC 2105 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2110",
            "course_name": "",
            "description": "GLOB1-GC 2110\n\n   The Multinational Corporation:  Economic, Political, and Managerial Perspectives\n\nThere are over 60,000 multinational corporations (MNCs). They are the most significant force behind globalization. Whether as customers, suppliers, competitors, regulators, employees, shareholders, or citizens, we are directly affected by their output of products, services, and ideas. Moreover, through trading and investing, MNCs are dramatically compressing our notions of time and space. This course examines the economic dimensions of MNCs' behavior, their interaction with national and local governments and communities, and the ways they organize to operate effectively across borders. Through...\n\n      more description for GLOB1-GC 2110 »\n\n      \n\n\n\nThere are over 60,000 multinational corporations (MNCs). They are the most significant force behind globalization. Whether as customers, suppliers, competitors, regulators, employees, shareholders, or citizens, we are directly affected by their output of products, services, and ideas. Moreover, through trading and investing, MNCs are dramatically compressing our notions of time and space. This course examines the economic dimensions of MNCs' behavior, their interaction with national and local governments and communities, and the ways they organize to operate effectively across borders. Through case studies, students explore issues such as: MNCs and protectionism; environment and labor relations; control of strategic natural and technological resources; and transborder mergers, acquisitions, and joint ventures.\n\n      less description for GLOB1-GC 2110 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2115",
            "course_name": "U.S. Use of Force and the \"Global War on Terror\"",
            "description": "GLOB1-GC 2115 U.S. Use of Force and the \"Global War on Terror\"",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2120",
            "course_name": "Introduction to International Business and Finance",
            "description": "GLOB1-GC 2120 Introduction to International Business and Finance \nThis course provides an introduction to international business and finance and the policy challenges of economic globalization and interdependence. It examines current issues of trade policy, exchange-rate regimes, international economic strategies of developed and developing countries, regional economic integration, multinational corporate management, exporting, importing, foreign direct investment, capital markets and international financial flows.",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2125",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20627",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Hewitt, William",
                    "time": "Tue 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Clean Technology:  Developments, Trends, and Opportunities",
            "description": "GLOB1-GC 2125 Clean Technology:  Developments, Trends, and Opportunities",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2130",
            "course_name": "",
            "description": "GLOB1-GC 2130\n\n   Corporate Social Responsibility -- Global Implications and Future Leadership\n\nAs the power of transnational companies has swelled, so has public preoccupation with corporate social responsibility (CSR). Recent corporate scandals have aggravated anxieties about business responsibility, already highlights by globalization. This course introduces concepts of CSR and the shifting role of NGOs from corporate watchdog to partner. Four global trends are examined: sustainability (including economic development, environmental preservation, poverty alleviation); business awareness of these concerns (including the convergence of sustainability and CSR); growing demand for transpar...\n\n      more description for GLOB1-GC 2130 »\n\n      \n\n\n\nAs the power of transnational companies has swelled, so has public preoccupation with corporate social responsibility (CSR). Recent corporate scandals have aggravated anxieties about business responsibility, already highlights by globalization. This course introduces concepts of CSR and the shifting role of NGOs from corporate watchdog to partner. Four global trends are examined: sustainability (including economic development, environmental preservation, poverty alleviation); business awareness of these concerns (including the convergence of sustainability and CSR); growing demand for transparency (including more stringent corporate governance and worldwide movements for increased accountability); and an international investor awakening to the economic impact of social responsibility.\n\n      less description for GLOB1-GC 2130 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2135",
            "course_name": "Networks as Capacities for Peace",
            "description": "GLOB1-GC 2135 Networks as Capacities for Peace",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2140",
            "course_name": "American Trade Politics and the World Trade System",
            "description": "GLOB1-GC 2140 American Trade Politics and the World Trade System \nThis course examines current issues in the political economy of international trade in the U.S. and the world. Topics include: the politics of open or \"free\" trade vs. protectionism; tariffs and non-tariff trade barriers; \"unfair\" trade; trade in services and trade-related aspects of intellectual property; the World Trade Organization; regional arrangements such as NAFTA and the European Union; U.S.-Japan trade relations; trade embargoes and other economic sanctions; and environmental and human rights issues in trade policy.",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2145",
            "course_name": "Economics for Global Affairs",
            "description": "GLOB1-GC 2145 Economics for Global Affairs",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2150",
            "course_name": "",
            "description": "GLOB1-GC 2150\n\n   Globalization and Its Impacts\n\nFew developments have aroused as much political passion in recent years as the liberalization of global markets, generally termed ?globalization.? This course explores the benefits, risks and drawbacks of economic globalization from the standpoints of both the developing and developed worlds. In evaluating the mixed blessings of globalization, the course will examine: the trend of increased flows of goods, services, capital and people across borders; the evolving impact of information and communications technology, such as the Internet, as well as other forms of high-speed communications; the ...\n\n      more description for GLOB1-GC 2150 »\n\n      \n\n\n\nFew developments have aroused as much political passion in recent years as the liberalization of global markets, generally termed ?globalization.? This course explores the benefits, risks and drawbacks of economic globalization from the standpoints of both the developing and developed worlds. In evaluating the mixed blessings of globalization, the course will examine: the trend of increased flows of goods, services, capital and people across borders; the evolving impact of information and communications technology, such as the Internet, as well as other forms of high-speed communications; the effects of cheaper and growing transport; the increasing importance of non-governmental organizations; growing worldwide socio-political activities; the phenomenon of almost frontier-less private sector business and industrial dealings like outsourcing; and the growing need for global attention to climatic, ecological, and health concerns.\n\n      less description for GLOB1-GC 2150 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2155",
            "course_name": "Post-Conflict Policies for Peace Consolidation:  A Case Study Approach",
            "description": "GLOB1-GC 2155 Post-Conflict Policies for Peace Consolidation:  A Case Study Approach",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2160",
            "course_name": "",
            "description": "GLOB1-GC 2160\n\n   Global Corporate Ethics, Compliance, and Governance:  A Hands-On Approach\n\nIn a world of growing corporate, governmental and other scandals where, due to the digitization and democratization of information, perpetrators can no longer hide, the trend is toward a global convergence of laws, regulations and practices to prevent corporate and other organizational crimes and unethical behaviors.  This course (1) provides an overview of global trends in compliance, business ethics, governance and corporate responsibility, (2) analyzes key crimes and misdemeanors (including corruption, harassment, fraud, cyber-issues, environmental violations, intellectual property, privacy...\n\n      more description for GLOB1-GC 2160 »\n\n      \n\n\n\nIn a world of growing corporate, governmental and other scandals where, due to the digitization and democratization of information, perpetrators can no longer hide, the trend is toward a global convergence of laws, regulations and practices to prevent corporate and other organizational crimes and unethical behaviors.  This course (1) provides an overview of global trends in compliance, business ethics, governance and corporate responsibility, (2) analyzes key crimes and misdemeanors (including corruption, harassment, fraud, cyber-issues, environmental violations, intellectual property, privacy, etc.), and (3) provides a practical, hands-on approach to solving and preventing ethical, compliance and governance crises.  Throughout the course, seminar members are exposed to numerous guest speakers (global leaders in the fields of business ethics, compliance and governance) and are part of a fictitious executive team tackling a broad array of ethical dilemmas and challenges.\n\n      less description for GLOB1-GC 2160 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2165",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20397",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Heckman, Brad",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Build Your Own NGO:  Organizational Development for Global Affairs Professionals",
            "description": "GLOB1-GC 2165 Build Your Own NGO:  Organizational Development for Global Affairs Professionals",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2170",
            "course_name": "",
            "description": "GLOB1-GC 2170\n\n   International Banking\n\nThis course is an overview of global banking and provides a framework for students learning about finance and trade in the world markets. Major themes of globalization, interdependence and sovereign risk will be explored, as well as the critical role of project financing in the developing world, funding strategies, currency crises and their contagion across the globe. Students will gain an understanding of global financial players, banks and global NGOs, that either contribute to economic growth and prosperity or interfere and interrupt market efficiencies and wealth creation in developing cou...\n\n      more description for GLOB1-GC 2170 »\n\n      \n\n\n\nThis course is an overview of global banking and provides a framework for students learning about finance and trade in the world markets. Major themes of globalization, interdependence and sovereign risk will be explored, as well as the critical role of project financing in the developing world, funding strategies, currency crises and their contagion across the globe. Students will gain an understanding of global financial players, banks and global NGOs, that either contribute to economic growth and prosperity or interfere and interrupt market efficiencies and wealth creation in developing countries. Topics will include major trends in today?s financial world including industry mergers, effects of international private banking, the growth of Islamic banking, as well as regulatory compliance and money laundering.\n\n      less description for GLOB1-GC 2170 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2175",
            "course_name": "Politics and Policies of The EU and European Integration",
            "description": "GLOB1-GC 2175 Politics and Policies of The EU and European Integration",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2180",
            "course_name": "",
            "description": "GLOB1-GC 2180\n\n   The Emerging Markets\n\nThis course provides students with an in depth understanding of development in emerging market countries in Latin America and Asia. Topics will include governance, economics, political models and trade as well as discussion of historical, social trends, religion and demographics. The course will compare and contrast the various regions and how they have managed their economic growth, as well as the most recent economic and political crises.  Students will have the opportunity to assess and analyze the divergent actions of governments and international financial organizations in the various cou...\n\n      more description for GLOB1-GC 2180 »\n\n      \n\n\n\nThis course provides students with an in depth understanding of development in emerging market countries in Latin America and Asia. Topics will include governance, economics, political models and trade as well as discussion of historical, social trends, religion and demographics. The course will compare and contrast the various regions and how they have managed their economic growth, as well as the most recent economic and political crises.  Students will have the opportunity to assess and analyze the divergent actions of governments and international financial organizations in the various countries. Course concludes with case studies of specific country pairings in Latin America and Asia.\n\n      less description for GLOB1-GC 2180 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2185",
            "course_name": "Chile:  Democracy of Institutions and Social Market-Friendly Development",
            "description": "GLOB1-GC 2185 Chile:  Democracy of Institutions and Social Market-Friendly Development",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2190",
            "course_name": "Global Public Health",
            "description": "GLOB1-GC 2190 Global Public Health",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2195",
            "course_name": "Building Democracies",
            "description": "GLOB1-GC 2195 Building Democracies",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2200",
            "course_name": "",
            "description": "GLOB1-GC 2200\n\n   Critical Environmental Issues:  Legal and Policy Perspectives\n\nThe latter part of the 20th Century saw an awakening of concern for the status of the global environment. In the new century, few issues promise to be of equal importance in law and policy. Since the Stockholm Conference of 1972 there has been a proliferation of treaties and policies addressing a wide-range of environmental issues such as pollution, protection against climate change, endangered and migratory species and biodiversity. How can the world community adequately protect the 'global commons' of the oceans, the atmosphere and Antarctica? Can states use their national laws to assist the...\n\n      more description for GLOB1-GC 2200 »\n\n      \n\n\n\nThe latter part of the 20th Century saw an awakening of concern for the status of the global environment. In the new century, few issues promise to be of equal importance in law and policy. Since the Stockholm Conference of 1972 there has been a proliferation of treaties and policies addressing a wide-range of environmental issues such as pollution, protection against climate change, endangered and migratory species and biodiversity. How can the world community adequately protect the 'global commons' of the oceans, the atmosphere and Antarctica? Can states use their national laws to assist these efforts? How should questions of 'scientific uncertainty' be dealt with when there is disagreement over the environmental impact of human activity? This course focuses upon the major legal regimes that have arisen to address these problems. Class discussion emphasizes the legal and policy challenges to the effective implementation of these regimes.\n\n      less description for GLOB1-GC 2200 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2205",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20634",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Trahan, Jennifer",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2205\n\n   International Criminal Law and Tribunals (or International Justice)\n\nThis course examines the international and semi-international institutions established to prosecute genocide, war crimes and crimes against humanity.  The tribunals examined will include the International Criminal Tribunal for the former Yugoslavia, the International Criminal Tribunal for Rwanda, the International Criminal Court, and their predecessors - the International Military Tribunal at Nuremberg and the International Military Tribunal for the Far East (Tokyo).  The course additionally examines some of the substantive law of the Yugoslav and Rwanda tribunals, particularly, the elements o...\n\n      more description for GLOB1-GC 2205 »\n\n      \n\n\n\nThis course examines the international and semi-international institutions established to prosecute genocide, war crimes and crimes against humanity.  The tribunals examined will include the International Criminal Tribunal for the former Yugoslavia, the International Criminal Tribunal for Rwanda, the International Criminal Court, and their predecessors - the International Military Tribunal at Nuremberg and the International Military Tribunal for the Far East (Tokyo).  The course additionally examines some of the substantive law of the Yugoslav and Rwanda tribunals, particularly, the elements of the crimes of genocide, war crimes and crimes against humanity, and individual and command responsibility.  We will also examine the prospects of justice for serious crimes committed in places such as Iraq, Darfur and Cambodia.\n\n      less description for GLOB1-GC 2205 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2210",
            "course_name": "",
            "description": "GLOB1-GC 2210\n\n   International Dispute Settlement:  Methods and Procedures\n\nDiplomacy and international law offer the countries of the world a variety of options to resolve their disputes by peaceful means. This course examines these means including: negotiation, mediation, conciliation, arbitration, litigation and the use of international organizations. What are the roles of the United Nations and the World Court? Should they be thought of as methods of last resort for international disputes? How may these various methods be utilized to insure the optimal outcome for the parties? We will look at the evolution of dispute settlement and examine numerous cases, both act...\n\n      more description for GLOB1-GC 2210 »\n\n      \n\n\n\nDiplomacy and international law offer the countries of the world a variety of options to resolve their disputes by peaceful means. This course examines these means including: negotiation, mediation, conciliation, arbitration, litigation and the use of international organizations. What are the roles of the United Nations and the World Court? Should they be thought of as methods of last resort for international disputes? How may these various methods be utilized to insure the optimal outcome for the parties? We will look at the evolution of dispute settlement and examine numerous cases, both actual and hypothetical, to explore dispute settlement concepts.\n\n      less description for GLOB1-GC 2210 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2215",
            "course_name": "Transitional Justice in Theory and Practice",
            "description": "GLOB1-GC 2215 Transitional Justice in Theory and Practice",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2220",
            "course_name": "",
            "description": "GLOB1-GC 2220\n\n   International Trade Law and Policy\n\nThis course examines the laws regulating international trade in goods and services, focusing primarily on the law of the World Trade Organization and General Agreement on Tariffs and Trade, as well as the foreign trade laws of the United States.  Topics include: the institutions and processes of trade policy-making, negotiations, and dispute settlement; tariff and non-tariff barriers; discrimination; regional trade agreements; antidumping, countervailing (anti-subsidy), and safeguard measures; and the relationship of trade rules to intellectual property rights, labor standards, human rights, e...\n\n      more description for GLOB1-GC 2220 »\n\n      \n\n\n\nThis course examines the laws regulating international trade in goods and services, focusing primarily on the law of the World Trade Organization and General Agreement on Tariffs and Trade, as well as the foreign trade laws of the United States.  Topics include: the institutions and processes of trade policy-making, negotiations, and dispute settlement; tariff and non-tariff barriers; discrimination; regional trade agreements; antidumping, countervailing (anti-subsidy), and safeguard measures; and the relationship of trade rules to intellectual property rights, labor standards, human rights, environmental protection, and competition (antitrust) policy.\n\n      less description for GLOB1-GC 2220 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2225",
            "course_name": "",
            "description": "GLOB1-GC 2225\n\n   Law and Policy in International Business\n\nThis course gives global affairs students an understanding of legal and policy issues affecting multinational business enterprises and their transactions and activities.  We examine how public international law, international economic institutions such as the WTO and IMF, conflict-of-laws rules (also known as private international law), and national corporate, tax, and regulatory laws in home and host countries combine to create a multidimensional legal environment for international business.  Within this legal environment we also examine sales law, intellectual property law, antitrust (compet...\n\n      more description for GLOB1-GC 2225 »\n\n      \n\n\n\nThis course gives global affairs students an understanding of legal and policy issues affecting multinational business enterprises and their transactions and activities.  We examine how public international law, international economic institutions such as the WTO and IMF, conflict-of-laws rules (also known as private international law), and national corporate, tax, and regulatory laws in home and host countries combine to create a multidimensional legal environment for international business.  Within this legal environment we also examine sales law, intellectual property law, antitrust (competition) law, host-country and international law of foreign investment, labor law, environmental law, and human rights law. For students in the international law concentration, the course offers an introduction to international economic law.  For students in the private sector concentration, the course surveys the legal environment of international business.\n\n      less description for GLOB1-GC 2225 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2226",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20640",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Galeotti, Mark",
                    "time": "Tue 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2226\n\n   Corruption and Anti-Corruption\n\nBribery. Graft. Blat. Clientelism. Guanxi. Mordida. Corruption goes by many\nnames and comes in many forms, from predatory demands for payoffs through to\ncomplex and subtle economies of favors. It penetrates political and economic\nsystems, solidifies inequalities, undermines the rule of law, devours\ndevelopment aid, and mobilizes to resist attempts to control it around the\nworld.\n\n \n\nNonetheless, reducing corruption is a crucial necessity for good governance,\neffective long-term economic prosperity, and social equity. Although there\nis no single 'silver bullet,' it is crucial not onl...\n\n      more description for GLOB1-GC 2226 »\n\n      \n\n\n\nBribery. Graft. Blat. Clientelism. Guanxi. Mordida. Corruption goes by many\nnames and comes in many forms, from predatory demands for payoffs through to\ncomplex and subtle economies of favors. It penetrates political and economic\nsystems, solidifies inequalities, undermines the rule of law, devours\ndevelopment aid, and mobilizes to resist attempts to control it around the\nworld.\n\n \n\nNonetheless, reducing corruption is a crucial necessity for good governance,\neffective long-term economic prosperity, and social equity. Although there\nis no single 'silver bullet,' it is crucial not only to understand the\nchallenge, but to explore the many ways in which people are trying to\ncontrol corruption. These range from global agreements to grass-roots local\ninitiatives, addressing everything from the culture of bribe-taking and\nbribe-paying, through to issues of business accountability and transparent\ngovernment. This course is strongly policy-oriented, and explores not only\nthe forms and impacts of corruption, but past and future responses.\n\n      less description for GLOB1-GC 2226 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2230",
            "course_name": "",
            "description": "GLOB1-GC 2230\n\n   Contemporary Issues in World Affairs:  A Legal Perspective\n\nCan we protect endangered species? Who controls the oceans? How can we deal with terrorists and dictators? Is free trade working? International law addresses all of these issues. In this course we examine several current problems in international relations from a legal perspective. Topics include: environmental protection; proliferation of weapons of mass destruction; terrorism; tensions between developed and developing states; access to common resources; and the role of the developing International Criminal Court. Discussions explore the political and legal frameworks from which international...\n\n      more description for GLOB1-GC 2230 »\n\n      \n\n\n\nCan we protect endangered species? Who controls the oceans? How can we deal with terrorists and dictators? Is free trade working? International law addresses all of these issues. In this course we examine several current problems in international relations from a legal perspective. Topics include: environmental protection; proliferation of weapons of mass destruction; terrorism; tensions between developed and developing states; access to common resources; and the role of the developing International Criminal Court. Discussions explore the political and legal frameworks from which international problems have arisen and how to address them.\n\n      less description for GLOB1-GC 2230 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2235",
            "course_name": "Hard Power:  The Uses and Abuses of Military Force",
            "description": "GLOB1-GC 2235 Hard Power:  The Uses and Abuses of Military Force",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2240",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20623",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Fomerand, Jacques",
                    "time": "Tue 9.30 AM - 12.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2240\n\n   International Human Rights:  Laws, Mechanisms, and Practices\n\nInternational human rights are not vague concepts of justice.  They are precisely defined international laws, stemming from a series of international treaties and overseen by a complex of United Nations and other mechanisms.  This course provides an introduction to international human rights laws (including special laws for the protection of children, women, racial minorities, and other groups); an explanation of the international procedures for overseeing their protection; and the methods used by NGOs in human rights advocacy.  Particular attention is paid to international economic, social, a...\n\n      more description for GLOB1-GC 2240 »\n\n      \n\n\n\nInternational human rights are not vague concepts of justice.  They are precisely defined international laws, stemming from a series of international treaties and overseen by a complex of United Nations and other mechanisms.  This course provides an introduction to international human rights laws (including special laws for the protection of children, women, racial minorities, and other groups); an explanation of the international procedures for overseeing their protection; and the methods used by NGOs in human rights advocacy.  Particular attention is paid to international economic, social, and cultural rights, including the human rights to food, health, housing, education, and work.\n\n      less description for GLOB1-GC 2240 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2245",
            "course_name": "National Security Decision Making Processes:  Applied Theories",
            "description": "GLOB1-GC 2245 National Security Decision Making Processes:  Applied Theories",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2250",
            "course_name": "",
            "description": "GLOB1-GC 2250\n\n   International Organizations:  A Focus on Geneva\n\nThe number of regional and universal international organizations has skyrocketed in our time - and for good reason. No single institution can deal with the many pressing global issues of our interdependent world. This course provides an analytical overview of inter-governmental organizations at global and regional levels, including the UN system and such non-UN institutions and arrangements as OAS, OAU, OSCE, ASEAN, and others. We examine the structures and processes of these organizations, their size, role, and influence, the issues upon which they focus, and the impact of politics on the rea...\n\n      more description for GLOB1-GC 2250 »\n\n      \n\n\n\nThe number of regional and universal international organizations has skyrocketed in our time - and for good reason. No single institution can deal with the many pressing global issues of our interdependent world. This course provides an analytical overview of inter-governmental organizations at global and regional levels, including the UN system and such non-UN institutions and arrangements as OAS, OAU, OSCE, ASEAN, and others. We examine the structures and processes of these organizations, their size, role, and influence, the issues upon which they focus, and the impact of politics on the realization of their goals\n\n      less description for GLOB1-GC 2250 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2255",
            "course_name": "Human Security:  A New Approach to Today's Global Challenges",
            "description": "GLOB1-GC 2255 Human Security:  A New Approach to Today's Global Challenges",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2260",
            "course_name": "Global Empires:  From History to the Future",
            "description": "GLOB1-GC 2260 Global Empires:  From History to the Future",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2265",
            "course_name": "Environmental Policy",
            "description": "GLOB1-GC 2265 Environmental Policy",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2270",
            "course_name": "Key Foreign Policy Challenges Confronting the United States",
            "description": "GLOB1-GC 2270 Key Foreign Policy Challenges Confronting the United States",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2275",
            "course_name": "Mediation Skills for Global Affairs",
            "description": "GLOB1-GC 2275 Mediation Skills for Global Affairs",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2280",
            "course_name": "Development and Social Change:  A Global Perspective",
            "description": "GLOB1-GC 2280 Development and Social Change:  A Global Perspective",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2285",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20631",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Chang, Patty",
                    "time": "Wed 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Explaining Civil Wars",
            "description": "GLOB1-GC 2285 Explaining Civil Wars",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2290",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20633",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Myers, Everett",
                    "time": "Thu 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "International Business: The Challenge of Global Competition",
            "description": "GLOB1-GC 2290 International Business: The Challenge of Global Competition",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2291",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20653",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Joseph, Regina",
                    "time": "Sat,Sun 10.00 AM - 5.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2291\n\n   Policy Hacking: International Relations by Design\n\nThis course teaches students how to apply information design in the presentation of their research. Students wishing to work in fields where they may be either shaping or dictating policy will inevitably confront the need to tailor their approach in a way that accounts for the minimal time decision-makers have. Long, qualitative reports, while still in use, are losing their utility as global events accelerate in speed; decision-makers, confronted with stacks of reports, usually wind up reading none and craft their policy reactively, as opposed to proactively.\nThe best future policy-makers will...\n\n      more description for GLOB1-GC 2291 »\n\n      \n\n\n\nThis course teaches students how to apply information design in the presentation of their research. Students wishing to work in fields where they may be either shaping or dictating policy will inevitably confront the need to tailor their approach in a way that accounts for the minimal time decision-makers have. Long, qualitative reports, while still in use, are losing their utility as global events accelerate in speed; decision-makers, confronted with stacks of reports, usually wind up reading none and craft their policy reactively, as opposed to proactively.\nThe best future policy-makers will hold visual language skills in order to package their information in a format that resonates with end-users. This requires an understanding not only of the issues at stake, but of the tools and techniques to present these issues quickly, concisely and memorably. This course is designed to help students take research into a visual framework in order to facilitate better policy planning. It is designed to be offered in tandem with other courses on Futures and Foreign Policy work and is meant to give students a basic working knowledge of how to present complex information in new 21st century formats.\n\n      less description for GLOB1-GC 2291 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2295",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20652",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Myers, Everett",
                    "time": "Thu 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Fundamentals of Corporate Finance",
            "description": "GLOB1-GC 2295 Fundamentals of Corporate Finance",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2300",
            "course_name": "",
            "description": "GLOB1-GC 2300\n\n   Human Rights Promotion and Practice:  The Role of NGOs\n\nFrom the mid 19th century victories in Europe of the Anti-Slavery Society to the successful struggles in the 1990's to establish the post of UN High Commissioner for the International Criminal Court, every major human rights and humanitarian victory, including the epic struggles on behalf of Soviet Jewry and against South African apartheid, has been spearheaded by non-governmental organizations (NGOs).  This course examines the unique and historic role of NGOs in creating global human rights machinery, educating the public about human rights, and shaming violating governments into abiding by t...\n\n      more description for GLOB1-GC 2300 »\n\n      \n\n\n\nFrom the mid 19th century victories in Europe of the Anti-Slavery Society to the successful struggles in the 1990's to establish the post of UN High Commissioner for the International Criminal Court, every major human rights and humanitarian victory, including the epic struggles on behalf of Soviet Jewry and against South African apartheid, has been spearheaded by non-governmental organizations (NGOs).  This course examines the unique and historic role of NGOs in creating global human rights machinery, educating the public about human rights, and shaming violating governments into abiding by their human rights commitments.\n\n      less description for GLOB1-GC 2300 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2305",
            "course_name": "The Czech Republic and The New Europe",
            "description": "GLOB1-GC 2305 The Czech Republic and The New Europe",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2310",
            "course_name": "Non-Governmental Organizations in the Developing World:  A Regional Perspective",
            "description": "GLOB1-GC 2310 Non-Governmental Organizations in the Developing World:  A Regional Perspective \nThose interested in working in the non-governmental sector need to familiarize themselves with the diversity and richness of civil society throughout the world.  In this course we consider the views of NGO leaders, UN officials, and diplomats from Africa, Asia, Latin America, the Middle East, and East Europe describe the main characteristics of NGOs within their respective regions; the legal parameters governing their activities; their relationships, cooperative or adversarial, with the respective national governments; and the interrelationship between local and international NGOs.",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2315",
            "course_name": "War Crimes Prosecutions in the Former Yugoslavia: The Pitfalls and Promise of International Justice",
            "description": "GLOB1-GC 2315 War Crimes Prosecutions in the Former Yugoslavia: The Pitfalls and Promise of International Justice",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2320",
            "course_name": "",
            "description": "GLOB1-GC 2320\n\n   Refugees and Internally Displaced Persons:  Protection and Practice\n\nApproximately one in every 200 people in the world is a refugee or internally displaced person.  Uprooted from homes and communities, and often without government support, refugees look to the international community for protection. This course examines the system created for international refugee protection after World War II, as well as current policy and practice.  It also considers the special circumstances and concerns of refugee women, children and adolescents, who account for more than 80% of the world's refugees.  Guest speakers from the International Rescue Committee, Human Rights Wat...\n\n      more description for GLOB1-GC 2320 »\n\n      \n\n\n\nApproximately one in every 200 people in the world is a refugee or internally displaced person.  Uprooted from homes and communities, and often without government support, refugees look to the international community for protection. This course examines the system created for international refugee protection after World War II, as well as current policy and practice.  It also considers the special circumstances and concerns of refugee women, children and adolescents, who account for more than 80% of the world's refugees.  Guest speakers from the International Rescue Committee, Human Rights Watch and other organizations address the class.\n\n      less description for GLOB1-GC 2320 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2325",
            "course_name": "Vietnam/ASEAN Field Intensive",
            "description": "GLOB1-GC 2325 Vietnam/ASEAN Field Intensive",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2330",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20626",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Rudbeck, Jens",
                    "time": "Mon 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2330\n\n   Issues in Humanitarian Assistance and Intervention\n\nHumanitarians rush to help starving children, fleeing refugees and others in crisis, but too often what seems like a straightforward solution becomes a dilemma.  Aid agencies may be forced to assist combatants in order to gain access to their victims.  Food donations may destroy the local economy, making aid a permanent necessity.  Warring factions may deliberately cause suffering in order to attract aid, which they then loot.  Governments may use humanitarian relief as an excuse not to intervene militarily.  This course explores how non-governmental organizations and international agencies wr...\n\n      more description for GLOB1-GC 2330 »\n\n      \n\n\n\nHumanitarians rush to help starving children, fleeing refugees and others in crisis, but too often what seems like a straightforward solution becomes a dilemma.  Aid agencies may be forced to assist combatants in order to gain access to their victims.  Food donations may destroy the local economy, making aid a permanent necessity.  Warring factions may deliberately cause suffering in order to attract aid, which they then loot.  Governments may use humanitarian relief as an excuse not to intervene militarily.  This course explores how non-governmental organizations and international agencies wrestle with the complex issues that arise in emergency situations.\n\n      less description for GLOB1-GC 2330 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2335",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20645",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Haynes, Lukas",
                    "time": "Wed 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Philanthropy's Influence on Global Policy",
            "description": "GLOB1-GC 2335 Philanthropy's Influence on Global Policy",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2340",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20641",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Maier, Silvia",
                    "time": "Tue 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2340\n\n   Gender in International Affairs:  Sex, Power, and Politics\n\nRecent United Nations conferences and agreements on human rights (1993), population (1994) and women (1995), have been followed by stronger national and international women's rights initiatives, especially in countries and regions with traditionally less vigorous civil movements, and by increased networking among women's advocacy NGOs worldwide.  This course focuses on the structure and activities of women's groups and networks working at national and international levels. Lectures address issues salient in women's movements, such as violence ad honor crimes, sexual and reproductive rights and...\n\n      more description for GLOB1-GC 2340 »\n\n      \n\n\n\nRecent United Nations conferences and agreements on human rights (1993), population (1994) and women (1995), have been followed by stronger national and international women's rights initiatives, especially in countries and regions with traditionally less vigorous civil movements, and by increased networking among women's advocacy NGOs worldwide.  This course focuses on the structure and activities of women's groups and networks working at national and international levels. Lectures address issues salient in women's movements, such as violence ad honor crimes, sexual and reproductive rights and the role of religious fundamentalism.\n\n      less description for GLOB1-GC 2340 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2341",
            "course_name": "",
            "description": "GLOB1-GC 2341\n\n   Childrens Rights: International Norms and Standards\n\nThe promotion and protection of the human rights of children is founded in the Universal Declaration of Human Rights, and strengthened by the adoption of international legal instruments and policies, which prescribe measures to ensure that children everywhere enjoy the rights to which they are entitled, and that children are accorded special protection and care. The course will examine the international norms and standards that make up children’s rights from the Convention on the Rights of the Child (CRC) and its three Optional Protocols, to the outcomes of World Summit for Children and a Worl...\n\n      more description for GLOB1-GC 2341 »\n\n      \n\n\n\nThe promotion and protection of the human rights of children is founded in the Universal Declaration of Human Rights, and strengthened by the adoption of international legal instruments and policies, which prescribe measures to ensure that children everywhere enjoy the rights to which they are entitled, and that children are accorded special protection and care. The course will examine the international norms and standards that make up children’s rights from the Convention on the Rights of the Child (CRC) and its three Optional Protocols, to the outcomes of World Summit for Children and a World Fit for Children. \nThe course will also provide an understanding of how children’s rights evolve and progress to take into account the changing international environment, the changing needs of children, and the current issues that children are exposed to by highlighting issues such as, violence against children, children in peace and security, children’s rights in international justice, children and juvenile justice, and children’s rights in international development. Special attention will also be paid to the girl child. And with the world celebrating the 25th anniversary of the CRC, the course will also focus on the implementation and monitoring of children’s rights and ask the question, “Is the world a better place for children?\n\n      less description for GLOB1-GC 2341 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2342",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20686",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Maier, Silvia",
                    "time": "Wed 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2342\n\n   Women and Gender in the Middle East and South Asia\n\nIn this seminar we will critically examine the current state of women’s rights and activism in the Middle East and South Asia with a particular focus on Afghanistan, Pakistan, Iran, Turkey, Egypt and the Gulf States. Specifically, we will separate the myth of the veiled, oppressed or fanatically religious “Muslim Woman” from the lived reality of millions of women in this diverse region by exploring how the gendered discourses of power and citizenship, national ideologies, historical legacies, interpretations of religious law and social traditions affect and shape women’s lives in the real worl...\n\n      more description for GLOB1-GC 2342 »\n\n      \n\n\n\nIn this seminar we will critically examine the current state of women’s rights and activism in the Middle East and South Asia with a particular focus on Afghanistan, Pakistan, Iran, Turkey, Egypt and the Gulf States. Specifically, we will separate the myth of the veiled, oppressed or fanatically religious “Muslim Woman” from the lived reality of millions of women in this diverse region by exploring how the gendered discourses of power and citizenship, national ideologies, historical legacies, interpretations of religious law and social traditions affect and shape women’s lives in the real world, particularly in matters of family law, participation in the labor market and political process. The picture that will emerge will be a surprisingly complex, nuanced and contradictory one, highlighting the very different political and social realities of women in countries such as Egypt, Iran and the Gulf States. We will pay particular attention to Islamic feminism and political Islam as frames and venues for women’s (self-) empowerment and conclude with an exploration of the contours and effectiveness of women’s resistance, self-empowerment and activism in the region.\n\n      less description for GLOB1-GC 2342 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2345",
            "course_name": "The United Nations",
            "description": "GLOB1-GC 2345 The United Nations",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2350",
            "course_name": "Workshop in Applied Peacebuilding",
            "description": "GLOB1-GC 2350 Workshop in Applied Peacebuilding",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2355",
            "course_name": "Human Trafficking and People Smuggling",
            "description": "GLOB1-GC 2355 Human Trafficking and People Smuggling",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2360",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20646",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Cooper, Belinda",
                    "time": "Thu 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Women and Human Rights: International Law and Policy",
            "description": "GLOB1-GC 2360 Women and Human Rights: International Law and Policy",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2365",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20643",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Hill, Thomas; Musallam, Naira",
                    "time": "Tue 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Structures of Peace: Measurement and Application",
            "description": "GLOB1-GC 2365 Structures of Peace: Measurement and Application",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2370",
            "course_name": "Prague and Beyond: Security and Transition in Central Europe",
            "description": "GLOB1-GC 2370 Prague and Beyond: Security and Transition in Central Europe",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2375",
            "course_name": "Negotiation and Facilitation",
            "description": "GLOB1-GC 2375 Negotiation and Facilitation",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2380",
            "course_name": "Joint Research Seminar in Peacebuilding",
            "description": "GLOB1-GC 2380 Joint Research Seminar in Peacebuilding",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2385",
            "course_name": "Gender and Development-Policy and Politics",
            "description": "GLOB1-GC 2385 Gender and Development-Policy and Politics",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2390",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20687",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Goetz, Anne Marie",
                    "time": "Tue 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2390\n\n   Gender, Politics and the State in Development\n\n‘Good governance’ is central-stage as the essential condition for growth in low-income countries, and for human development as well.  A number of the country assistance programs of bilateral and multilateral development agencies are predicated on a minimum set of successful governance reforms including anti-corruption measures and efforts to improve public administration efficiency.  ‘Good governance’ was missing from the Millennium Development Goals, and its inclusion in the post-2015 development framework is currently hotly contested, and being used as a bargaining chip by G77 countries in e...\n\n      more description for GLOB1-GC 2390 »\n\n      \n\n\n\n‘Good governance’ is central-stage as the essential condition for growth in low-income countries, and for human development as well.  A number of the country assistance programs of bilateral and multilateral development agencies are predicated on a minimum set of successful governance reforms including anti-corruption measures and efforts to improve public administration efficiency.  ‘Good governance’ was missing from the Millennium Development Goals, and its inclusion in the post-2015 development framework is currently hotly contested, and being used as a bargaining chip by G77 countries in exchange for more relaxed conditions for aid.  ‘Good governance’ is the primary focus of efforts to improve the effectiveness of aid in particular in the 19 countries that self-define as fragile and conflict-prone.  Definitions of ‘governance’ range from a restricted view focusing on sound management of the economy, and a more expansive one that aims for political liberalization and addresses problems of social inequality.   Governance has an important impact on the distribution of resources and public power between women and men.  In addition, gendered power relations shape approaches to governance.   This course develops an understanding of governance reforms in low-income contexts from a gender-sensitive and feminist political science perspective.\n\n      less description for GLOB1-GC 2390 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2400",
            "course_name": "",
            "description": "GLOB1-GC 2400\n\n   Introduction to Energy Policy\n\nAccess to energy sources is a key focus of international affairs. Much of the world's known reserves of oil are found in a highly volatile region, the Middle East. The use of fossil fuels, in general, is increasingly under attack for being environmentally unfriendly. Countries that attempt to employ nuclear energy face other significant challenges and responsibilities. Disputes over access to energy have led to international crises and even armed conflict in the past. This course surveys the historical, political, economic, legal and environmental factors of energy policy on the international ...\n\n      more description for GLOB1-GC 2400 »\n\n      \n\n\n\nAccess to energy sources is a key focus of international affairs. Much of the world's known reserves of oil are found in a highly volatile region, the Middle East. The use of fossil fuels, in general, is increasingly under attack for being environmentally unfriendly. Countries that attempt to employ nuclear energy face other significant challenges and responsibilities. Disputes over access to energy have led to international crises and even armed conflict in the past. This course surveys the historical, political, economic, legal and environmental factors of energy policy on the international scale.\n\n      less description for GLOB1-GC 2400 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2405",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20651",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Kissane, Carolyn",
                    "time": "Thu 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2405\n\n   Energy, Environment, and Resource Security\n\nThe course seeks to help us understand the importance of energy, environment and resource security in the evolving 21st century including demand for greater energy supplies, and other struggles around resource access and management. The class will examine how the demands of the growing global population will present significant challenges to the United States and international community, which may in turn create opportunities for cooperation.   The course is designed to provide students with a basis for better understanding the emergence of energy security and energy diplomacy as critical comp...\n\n      more description for GLOB1-GC 2405 »\n\n      \n\n\n\nThe course seeks to help us understand the importance of energy, environment and resource security in the evolving 21st century including demand for greater energy supplies, and other struggles around resource access and management. The class will examine how the demands of the growing global population will present significant challenges to the United States and international community, which may in turn create opportunities for cooperation.   The course is designed to provide students with a basis for better understanding the emergence of energy security and energy diplomacy as critical components in international relations study.   The course employs key writings in the areas of energy, the environment, water and other resource management, film, negotiation and guest speakers.\n\n      less description for GLOB1-GC 2405 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2410",
            "course_name": "The Geopolitics of Energy",
            "description": "GLOB1-GC 2410 The Geopolitics of Energy \nSince the early part of the twentieth century, when the British Empire sought to guarantee its access to Arabian oil, petroleum has profoundly influenced the strategic policy of energy dependent states. This course looks at the most significant geo-political issues, currently and historically, presented by oil exploration, transportation and usage. This course focuses upon three (3) main geographic areas: the Persian Gulf, the Caspian Sea and Alaska.",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2415",
            "course_name": "Authoritarianism, Repression, and Corruption",
            "description": "GLOB1-GC 2415 Authoritarianism, Repression, and Corruption",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2420",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20669",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Gadomsky, Chris",
                    "time": "Mon 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2420\n\n   The Economics and Finance of Energy\n\nEnergy is a central focus of international economics and finance. The financial markets in North America, Europe and Asia have long been concerned with coal, oil and gas. As with any commodities, their pricing, transportation and insurance are subject to rapid fluctuations reflecting numerous factors. This course examines these factors and includes a discussion of anticipated future trends in demand, consumption, efficiency and safety. How do the recent mergers of major multinational oil companies affect energy economics and finance? The investment opportunities for research and development of...\n\n      more description for GLOB1-GC 2420 »\n\n      \n\n\n\nEnergy is a central focus of international economics and finance. The financial markets in North America, Europe and Asia have long been concerned with coal, oil and gas. As with any commodities, their pricing, transportation and insurance are subject to rapid fluctuations reflecting numerous factors. This course examines these factors and includes a discussion of anticipated future trends in demand, consumption, efficiency and safety. How do the recent mergers of major multinational oil companies affect energy economics and finance? The investment opportunities for research and development of alternate energy sources are also considered.\n\n      less description for GLOB1-GC 2420 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2425",
            "course_name": "Private Sector Partnerships",
            "description": "GLOB1-GC 2425 Private Sector Partnerships",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2430",
            "course_name": "",
            "description": "GLOB1-GC 2430\n\n   Energy and the Environment\n\nAmong the most profound issues raised by modern energy policy is the question of environmental impact.  The use of energy in the form of fossil fuels and other sources is coincident with the high standard of living enjoyed by the developed world. However, the enormous cost in terms of environmental damage (global warming, acid rain, photochemical smog, spent fuel disposal, etc.) to Planet Earth demands a serious and dedicated examination of how to sustain our life style through the use of unconventional resources and renewables, nuclear power, and the application of international law and agree...\n\n      more description for GLOB1-GC 2430 »\n\n      \n\n\n\nAmong the most profound issues raised by modern energy policy is the question of environmental impact.  The use of energy in the form of fossil fuels and other sources is coincident with the high standard of living enjoyed by the developed world. However, the enormous cost in terms of environmental damage (global warming, acid rain, photochemical smog, spent fuel disposal, etc.) to Planet Earth demands a serious and dedicated examination of how to sustain our life style through the use of unconventional resources and renewables, nuclear power, and the application of international law and agreements (such as the Montreal and Kyoto Protocols)\n\n      less description for GLOB1-GC 2430 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2435",
            "course_name": "Bolivia: A Case Study in Sustainable Development",
            "description": "GLOB1-GC 2435 Bolivia: A Case Study in Sustainable Development",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2440",
            "course_name": "",
            "description": "GLOB1-GC 2440\n\n   Sustainable Development\n\nOne of the most famous definitions of sustainable development is that it 'seeks to meet the needs of the present world without compromising the ability of future generations to meet their own needs.' - Brundtland Commission.  This course introduces students to the concept of sustainable development, which combines concern for economic progress and the elimination of poverty with awareness of environmental limits.  We explore in depth such issues as wealth and poverty, population growth, political economy of food and hunger, the extinction of species, global warming and climatic change, ozone d...\n\n      more description for GLOB1-GC 2440 »\n\n      \n\n\n\nOne of the most famous definitions of sustainable development is that it 'seeks to meet the needs of the present world without compromising the ability of future generations to meet their own needs.' - Brundtland Commission.  This course introduces students to the concept of sustainable development, which combines concern for economic progress and the elimination of poverty with awareness of environmental limits.  We explore in depth such issues as wealth and poverty, population growth, political economy of food and hunger, the extinction of species, global warming and climatic change, ozone depletion, energy conservation, deforestation, and misuse of technology. We seek to integrate debates about globalization and sustainability by examining the nature of development, the impact of globalization on environment and quality of life, and the role of global and national actors and institutions in either creating sustainability or moving further away from it.\n\n      less description for GLOB1-GC 2440 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2445",
            "course_name": "Global Electricity Markets and Policy",
            "description": "GLOB1-GC 2445 Global Electricity Markets and Policy",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2450",
            "course_name": "International Financial Institutions",
            "description": "GLOB1-GC 2450 International Financial Institutions",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2455",
            "course_name": "Mediation for Global Affairs Practicum",
            "description": "GLOB1-GC 2455 Mediation for Global Affairs Practicum",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2460",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20638",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Gadomsky, Chris",
                    "time": "Mon 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Nuclear Energy, the Environment, and Proliferation",
            "description": "GLOB1-GC 2460 Nuclear Energy, the Environment, and Proliferation",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2465",
            "course_name": "Revolutions in Sustainability: A U.S./German Perspective",
            "description": "GLOB1-GC 2465 Revolutions in Sustainability: A U.S./German Perspective",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2470",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20632",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Rudbeck, Jens",
                    "time": "Thu 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Contentious Politics",
            "description": "GLOB1-GC 2470 Contentious Politics",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2475",
            "course_name": "",
            "description": "GLOB1-GC 2475\n\n   Modern Religious Identities:  Competition and Conflict on the World's Stage\n\nFrom Ayodhya, to Hebron, to Dar Es Salaam and Dagestan, religiously inspired violence has gripped the world’s attention over the past few decades, both riveting and perplexing the modern imagination.  Religion occupies a complex position in the modern political arena.  Religious ideologies can be used to legitimize revolution and reform or to justify their suppression.  Religious leaders can help inspire citizens to progressive activism, or mobilize opposition to social and political change.  Religious movements can galvanize peaceful resistance to oppressive states, or lead violent opposition...\n\n      more description for GLOB1-GC 2475 »\n\n      \n\n\n\nFrom Ayodhya, to Hebron, to Dar Es Salaam and Dagestan, religiously inspired violence has gripped the world’s attention over the past few decades, both riveting and perplexing the modern imagination.  Religion occupies a complex position in the modern political arena.  Religious ideologies can be used to legitimize revolution and reform or to justify their suppression.  Religious leaders can help inspire citizens to progressive activism, or mobilize opposition to social and political change.  Religious movements can galvanize peaceful resistance to oppressive states, or lead violent opposition to them.  This course provides students with a framework for thinking about the role of religion in global affairs.  The prominence of religious ideologies and religious movements on the world stage is often described as a recent development coinciding with the end of the Cold War.  This course will probe that assumption, focusing on how some of the world’s great religious traditions have influenced and been influenced by global political, economic, and social changes in the twentieth and twenty-first centuries.  The course will address such topics as: religion and nationalism, religious militancy, global and local religious identities, and the politics of religious synchretism and religious orthodoxy.  Particular attention will be paid to the complex and dynamic role of Islam in the modern world.\n\n      less description for GLOB1-GC 2475 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2480",
            "course_name": "",
            "description": "GLOB1-GC 2480\n\n   Energy Deals\n\nFrom joint ventures to acquisitions and divestitures, deal making occurs at all stages of energy’s value chain.  Energy transactions are prevalent yet complex.  What are the strategic motives for these deals?  How do parties allocate risks?  How do they design contracts to assure cooperation over multi-year terms?  This course will study real transactions, not hypotheticals, and discuss them with actual participants to learn how the energy industry originates and executes deals.  The objective is to provide students with an analytical framework to understand the strategic and structural attrib...\n\n      more description for GLOB1-GC 2480 »\n\n      \n\n\n\nFrom joint ventures to acquisitions and divestitures, deal making occurs at all stages of energy’s value chain.  Energy transactions are prevalent yet complex.  What are the strategic motives for these deals?  How do parties allocate risks?  How do they design contracts to assure cooperation over multi-year terms?  This course will study real transactions, not hypotheticals, and discuss them with actual participants to learn how the energy industry originates and executes deals.  The objective is to provide students with an analytical framework to understand the strategic and structural attributes of energy deals.\n\n      less description for GLOB1-GC 2480 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2485",
            "course_name": "Environmental Finance",
            "description": "GLOB1-GC 2485 Environmental Finance",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2490",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20624",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Barbato, Kristin",
                    "time": "Tue 9.30 AM - 12.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2490\n\n   Energy Management for Portfolios – Putting Policy into Practice\n\nThis course delivers students a practical view and associated tools for management of energy in individual facilities as well as throughout larger portfolios of facilities or assets.  Students will review aspects of the operations involved in the Energy Manager’s role including how energy markets and policies intersect with the facility and portfolio investment and management.  Through class lectures, industry articles, site visits, assigned readings, and expert speakers, the course will provide students with the ability to understand how energy policy, markets, and regulation intersect with o...\n\n      more description for GLOB1-GC 2490 »\n\n      \n\n\n\nThis course delivers students a practical view and associated tools for management of energy in individual facilities as well as throughout larger portfolios of facilities or assets.  Students will review aspects of the operations involved in the Energy Manager’s role including how energy markets and policies intersect with the facility and portfolio investment and management.  Through class lectures, industry articles, site visits, assigned readings, and expert speakers, the course will provide students with the ability to understand how energy policy, markets, and regulation intersect with operational personnel, equipment, budgets, and contracts.  Case studies where students assess the success of various theoretical concepts and applications are included.\n\n      less description for GLOB1-GC 2490 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2500",
            "course_name": "",
            "description": "GLOB1-GC 2500\n\n   Advanced Colloquium (International Relations)\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and ...\n\n      more description for GLOB1-GC 2500 »\n\n      \n\n\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and play a role in furthering the common understanding of the world around us.\n\n      less description for GLOB1-GC 2500 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2505",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20396",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Stephanides, Joseph",
                    "time": "Mon 6.30 PM - 7.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Modern Diplomacy",
            "description": "GLOB1-GC 2505 Modern Diplomacy \nContemporary international diplomacy can be considered as an art, science, craft, practice, institution and process. Topics of discussion in this comprehensive exploration will include the nature and development of diplomacy; diplomatic practice, methods and techniques; types of diplomacy (with special emphasis on multilateral diplomacy); diplomatic privileges and immunities; the role and function of diplomats; the diplomat as foreign affairs professional; and the contribution of diplomacy toward maintaining world order.",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2510",
            "course_name": "",
            "description": "GLOB1-GC 2510\n\n   Cybersecurity\n\nThe exponential expansion of computer technologies and the internet have spawned a variety of new criminal behaviors and provided criminals with a new environment within which to operate. Cybercrime knows no physical, geographic boundaries as the internet provides criminals with access to people, institutions, and businesses around the globe. The reach of the threat defies conventional notions of jurisdiction of sovereign nations, thus making the targeting of cybercriminals particularly challenging for authorities worldwide. This course seeks to enter into the complex world of cybercrime by ex...\n\n      more description for GLOB1-GC 2510 »\n\n      \n\n\n\nThe exponential expansion of computer technologies and the internet have spawned a variety of new criminal behaviors and provided criminals with a new environment within which to operate. Cybercrime knows no physical, geographic boundaries as the internet provides criminals with access to people, institutions, and businesses around the globe. The reach of the threat defies conventional notions of jurisdiction of sovereign nations, thus making the targeting of cybercriminals particularly challenging for authorities worldwide. This course seeks to enter into the complex world of cybercrime by exploring its evolution and critically evaluating the foreign and domestic measures enacted to fight cybercrime. It further explores public and private investigations of cybercrimes, the problems associated with the prosecution of cybercriminals, and the efficacy of policing the internet. Some crimes covered in this course include (but are not limited to): the online sale of illicit drugs, online sex trade, cyberprostitution, child pornography, electronic espionage, trade secret theft, hacking, malicious software distribution, and cyberterrorism. Above all, this course focuses on the global legal, economic, and social impact of cybercrime and the international measures needed to combat it.\n\n      less description for GLOB1-GC 2510 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2515",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20668",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Musallam, Naira",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Applied Statistics",
            "description": "GLOB1-GC 2515 Applied Statistics \nThis statistics course offers an introduction to the statistical concepts and techniques used in diverse social science disciplines with a focus on single-variable (univariate) and bivariate (two-variable) data. The material provides a solid foundation in introductory statistics along with an introduction to SPSS statistical software package. This course is designed to expose students to the relevant statistical theories utilized in the social sciences thereby enabling students to enhance their statistical literacy and hone their skills in becoming a critical consumer of statistical research.",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2520",
            "course_name": "",
            "description": "GLOB1-GC 2520\n\n   Advanced Colloquium (Transnational Security)\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and ...\n\n      more description for GLOB1-GC 2520 »\n\n      \n\n\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and play a role in furthering the common understanding of the world around us.\n\n      less description for GLOB1-GC 2520 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2525",
            "course_name": "Water, Politics, Sustainability, and Opportunities",
            "description": "GLOB1-GC 2525 Water, Politics, Sustainability, and Opportunities \nWater, or more precisely, the lack of clean and abundant supplies has emerged as the next global challenge to human health, prosperity and peace. Although 71% of the globe is covered by water, less than 2% of the world¿s water is fresh, accessible and drinkable, and these resources are by no means equally distributed. The future will see conflicts over access to water, challenges and opportunities relating to efforts to conserve and manage it and its conversion into a crucial economic and political resource.",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2530",
            "classes": [
                {
                    "format": "Colloquium",
                    "class_id": "20644",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Cheah, Yee",
                    "time": "Wed 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 2530\n\n   Advanced Colloquium (Private Sector)\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and ...\n\n      more description for GLOB1-GC 2530 »\n\n      \n\n\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and play a role in furthering the common understanding of the world around us.\n\n      less description for GLOB1-GC 2530 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 2535",
            "course_name": "",
            "description": "GLOB1-GC 2535\n\n   Advanced Colloquium (Human Rights & International Law)\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and ...\n\n      more description for GLOB1-GC 2535 »\n\n      \n\n\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and play a role in furthering the common understanding of the world around us.\n\n      less description for GLOB1-GC 2535 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2540",
            "course_name": "",
            "description": "GLOB1-GC 2540\n\n   Human Rights and the Environment\n\nThis course examines the complex relationship between the Earth¿s rapidly changing environment and the protection of civil/political (C/P) and economic, social and cultural (ESC) human rights, particularly in the developing world. Existing environmental conditions are being exacerbated by climate change in ways that will adversely affect residents of developing countries that are already struggling with highly stressed water, land, air and marine resources. Legal and policy options to confront these environmental challenges (and the related challenge of widespread poverty) will be examined in ...\n\n      more description for GLOB1-GC 2540 »\n\n      \n\n\n\nThis course examines the complex relationship between the Earth¿s rapidly changing environment and the protection of civil/political (C/P) and economic, social and cultural (ESC) human rights, particularly in the developing world. Existing environmental conditions are being exacerbated by climate change in ways that will adversely affect residents of developing countries that are already struggling with highly stressed water, land, air and marine resources. Legal and policy options to confront these environmental challenges (and the related challenge of widespread poverty) will be examined in terms of their implications for both P/C and ESC rights.\n\n      less description for GLOB1-GC 2540 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2545",
            "course_name": "",
            "description": "GLOB1-GC 2545\n\n   Human Rights Research and Advocacy\n\nThis course is designed to develop practical advocacy skills to protect and promote human rights. A focus will be developing an advocacy strategy on a current human rights issue, including the identification of goals and objectives, appropriate advocacy targets, and appropriate methods. Students will explore broad-based human rights campaigns, use of the media, and advocacy with UN bodies, the US government, and the private sector (corporations). Over the course of the semester, students will become familiar with a variety of tools to apply to a human rights issue of their choosing. Case studi...\n\n      more description for GLOB1-GC 2545 »\n\n      \n\n\n\nThis course is designed to develop practical advocacy skills to protect and promote human rights. A focus will be developing an advocacy strategy on a current human rights issue, including the identification of goals and objectives, appropriate advocacy targets, and appropriate methods. Students will explore broad-based human rights campaigns, use of the media, and advocacy with UN bodies, the US government, and the private sector (corporations). Over the course of the semester, students will become familiar with a variety of tools to apply to a human rights issue of their choosing. Case studies will illustrate successful advocacy campaigns on particular issues, such as sexual violence in conflict, keeping human rights offenders off the UN Human Rights Council and access to safe abortion.\n\n      less description for GLOB1-GC 2545 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2550",
            "course_name": "",
            "description": "GLOB1-GC 2550\n\n   Advanced Colloquium (International Development & Humanitarian Assistance)\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and ...\n\n      more description for GLOB1-GC 2550 »\n\n      \n\n\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and play a role in furthering the common understanding of the world around us.\n\n      less description for GLOB1-GC 2550 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2555",
            "course_name": "",
            "description": "GLOB1-GC 2555\n\n   Advanced Colloquium (Environmental/Energy Policy)\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and ...\n\n      more description for GLOB1-GC 2555 »\n\n      \n\n\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and play a role in furthering the common understanding of the world around us.\n\n      less description for GLOB1-GC 2555 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2560",
            "course_name": "",
            "description": "GLOB1-GC 2560\n\n   Advanced Colloquium (Peacebuilding)\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and ...\n\n      more description for GLOB1-GC 2560 »\n\n      \n\n\n\nThe dynamic nature of global affairs means that sometimes events will arise which are unexpected, cross conventional boundaries, do not fit within existing courses or deserve specific and detailed study. This `special topics¿ course will explore a particular breaking development or theme relating to the concentration in question. As such, it will only be offered occasionally, when circumstances demand. Students taking an Advanced Colloquium, though, can expect not just to grapple with contemporary events but also to engage actively in conversations both outside as well as within the class and play a role in furthering the common understanding of the world around us.\n\n      less description for GLOB1-GC 2560 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2565",
            "course_name": "Advanced Research Workshop",
            "description": "GLOB1-GC 2565 Advanced Research Workshop \nIn some cases, students¿ research plans relating to their theses will require additional time, for specialized fieldwork, methodological preparation, negotiating the IRB human subjects approval process or other particular needs. In such cases, this workshop can be taken the semester before the thesis or capstone (or in very rare cases concurrently), with the permission of the program, to accommodate such specific needs.",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2570",
            "course_name": "",
            "description": "GLOB1-GC 2570\n\n   Project Management in International Development\n\nA position in project management is often the first step for anyone interested in a career in international development. Such a position entails the administration and coordination of various types projects in developing countries and this course will provide students with a systematic and comprehensive understanding of the key concepts and skills essential to effective program development and project management within the context of foreign assistance. It examines all phases of the project cycle - from planning, to implementation, to monitoring and evaluation - to provide students with the te...\n\n      more description for GLOB1-GC 2570 »\n\n      \n\n\n\nA position in project management is often the first step for anyone interested in a career in international development. Such a position entails the administration and coordination of various types projects in developing countries and this course will provide students with a systematic and comprehensive understanding of the key concepts and skills essential to effective program development and project management within the context of foreign assistance. It examines all phases of the project cycle - from planning, to implementation, to monitoring and evaluation - to provide students with the techniques and tools used by practitioners in the field.\n\n      less description for GLOB1-GC 2570 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2575",
            "course_name": "",
            "description": "GLOB1-GC 2575\n\n   The Cluster Approach:  Humanitarian Aid in Praxis\n\nThe inefficient and often unpredictable nature of many international responses to humanitarian emergencies prompted, in 2005, the United Nation¿s Emergency Relief Coordinator to launch a review of the global humanitarian system. Following the recommendations of the review, the cluster approach has emerged as the organizing model for the delivery humanitarian aid to areas devastated by violent conflict and natural disasters. This course examines the background, principles, organization, and effects of the cluster approach. \nIt focuses of how the implementation of the cluster approach has streng...\n\n      more description for GLOB1-GC 2575 »\n\n      \n\n\n\nThe inefficient and often unpredictable nature of many international responses to humanitarian emergencies prompted, in 2005, the United Nation¿s Emergency Relief Coordinator to launch a review of the global humanitarian system. Following the recommendations of the review, the cluster approach has emerged as the organizing model for the delivery humanitarian aid to areas devastated by violent conflict and natural disasters. This course examines the background, principles, organization, and effects of the cluster approach. \nIt focuses of how the implementation of the cluster approach has strengthened the effectiveness of humanitarian assistance by clarifying the division of labor among organizations, by defining their roles and responsibilities within the different sectors of the response, and through building partnerships with host governments, local authorities and civil society. While the cluster approach has increased the predictability and accountability of the international response to humanitarian emergencies, the course will discuss a number of cases in which the cluster approach has been applied in order to asses the challenges that still face the international community as it seeks to alleviate the effects of humanitarian emergencies.\n\n      less description for GLOB1-GC 2575 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2580",
            "course_name": "Movement Building Around Sex Trafficking in India:  Theory and Practice",
            "description": "GLOB1-GC 2580 Movement Building Around Sex Trafficking in India:  Theory and Practice",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2585",
            "course_name": "Asymmetric Warfare, Insurgency & Counter-Insurgency",
            "description": "GLOB1-GC 2585 Asymmetric Warfare, Insurgency & Counter-Insurgency",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2590",
            "course_name": "Waging Non-Violent Conflict: A Practical Workshop",
            "description": "GLOB1-GC 2590 Waging Non-Violent Conflict: A Practical Workshop",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 2595",
            "course_name": "Advanced Joint Research Seminar in Peacebuilding",
            "description": "GLOB1-GC 2595 Advanced Joint Research Seminar in Peacebuilding",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3000",
            "course_name": "",
            "description": "GLOB1-GC 3000\n\n   China's Reemergence:  The Changing Political, Economic, and Social Landscape\n\nThe course, China's Reemergence:  The Changing Political, Economic, and Social Landscape, will enable up to twenty graduate students to study and actively engage in the tremendous transitions facing China today.  The program features senior academic, policy and professional presenters and affords participants a two-day practicum to shadow municipal, corporate, educational and non-profit leaders shaping modern Shanghai, a global economic, finance, design and arts destination.  Understanding the new global order without attempting to understand and account for China is impossible.  China is chan...\n\n      more description for GLOB1-GC 3000 »\n\n      \n\n\n\nThe course, China's Reemergence:  The Changing Political, Economic, and Social Landscape, will enable up to twenty graduate students to study and actively engage in the tremendous transitions facing China today.  The program features senior academic, policy and professional presenters and affords participants a two-day practicum to shadow municipal, corporate, educational and non-profit leaders shaping modern Shanghai, a global economic, finance, design and arts destination.  Understanding the new global order without attempting to understand and account for China is impossible.  China is changing rapidly, asserting itself on the world stage, buying itself into Africa and possibly offering the world a new model of development assistance, expanding its spheres of influence and will undoubtedly continue to increase its impact globally.   We believe that in order to provide our students with the best possible opportunity to understand China, it is necessary to travel there and engage not only with China?s economic, political and social changes but also to interact with leaders in the different spheres.  The program aims to harness transitions facing China today and articulate to students the dynamism and strategic realities and dilemma facing decision-makers today.\n\n      less description for GLOB1-GC 3000 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3001",
            "course_name": "",
            "description": "GLOB1-GC 3001\n\n   The Contemporary Chinese Financial System\n\nThe Contemporary Chinese financial system is an exciting topic that deserves in-depth analysis.  At the center of our study will be the critical examination of the key components of the Chinese financial system.  We shall study the central bank in China.  Then the commercial banking systems will be discussed. Policy banks will be part of the framework.   We will go over the insurance companies in China.  Qualitative tools will be introduced to offer market insights. We emphasize the market approach in our study, incorporating historical and cultural perspectives in our analysis. Our goal will ...\n\n      more description for GLOB1-GC 3001 »\n\n      \n\n\n\nThe Contemporary Chinese financial system is an exciting topic that deserves in-depth analysis.  At the center of our study will be the critical examination of the key components of the Chinese financial system.  We shall study the central bank in China.  Then the commercial banking systems will be discussed. Policy banks will be part of the framework.   We will go over the insurance companies in China.  Qualitative tools will be introduced to offer market insights. We emphasize the market approach in our study, incorporating historical and cultural perspectives in our analysis. Our goal will be to develop a thorough understanding of the contemporary Chinese financial system, from both bottom-up market indicators and a top-down political view.\n\n      less description for GLOB1-GC 3001 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3005",
            "course_name": "",
            "description": "GLOB1-GC 3005\n\n   Cuba in the World:  An Intercambio\n\nThe course, Cuba in the World  -  an Intercambio, will engage up to twenty graduate students in a special spring break study trip examining the realities shaping the largest Caribbean island country today.  It will focus on post Cold War Cuba from a  socio-cultural perspective, with a specific look at the country?s complex and evolving relationship with the US and Latin America.\n\nThrough a unique collaboration with the Ludwig Foundation Center, Havana - a non governmental organization dedicated to bridging understanding in Cuba and abroad through cultural exchange - students will gain exclusiv...\n\n      more description for GLOB1-GC 3005 »\n\n      \n\n\n\nThe course, Cuba in the World  -  an Intercambio, will engage up to twenty graduate students in a special spring break study trip examining the realities shaping the largest Caribbean island country today.  It will focus on post Cold War Cuba from a  socio-cultural perspective, with a specific look at the country?s complex and evolving relationship with the US and Latin America.\n\nThrough a unique collaboration with the Ludwig Foundation Center, Havana - a non governmental organization dedicated to bridging understanding in Cuba and abroad through cultural exchange - students will gain exclusive exposure to an 'inside out' perspective of a country that is most often viewed from the 'outside in.' The seminar will be composed of organized lectures, site visits and meetings at local organizations and educational institutions. Pre departure (New York-based) sessions will focus on preparing students with a contemporary historical context of Cuban inter-American relations in order to inform the socio-cultural conversation during the onsite portion of the course.\n\n      less description for GLOB1-GC 3005 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3010",
            "course_name": "",
            "description": "GLOB1-GC 3010\n\n   Ghana: a Case Study in Development\n\nDevelopment in the world?s poor countries is one of the great policy debates and moral imperatives of our day. In Ghana, more than a third of the people live in poverty, despite a decade of democratic rule and nearly a quarter century since economic reform began. In this course, we will examine multiple dimensions of development ? economic, political, environmental, social, cultural and regional ? through the example of Ghana. \n\nAs the first country in sub-Saharan Africa to gain independence from colonial rule, Ghana played a major role in the transformation of the continent. Despite its early...\n\n      more description for GLOB1-GC 3010 »\n\n      \n\n\n\nDevelopment in the world?s poor countries is one of the great policy debates and moral imperatives of our day. In Ghana, more than a third of the people live in poverty, despite a decade of democratic rule and nearly a quarter century since economic reform began. In this course, we will examine multiple dimensions of development ? economic, political, environmental, social, cultural and regional ? through the example of Ghana. \n\nAs the first country in sub-Saharan Africa to gain independence from colonial rule, Ghana played a major role in the transformation of the continent. Despite its early promise, the country has endured political upheaval, military rule and economic collapse, as have many in the region. Today, its market liberalization, democratic transition and political leadership put it in the forefront of what many hope will be an African renaissance. These are among the reasons that a case study of Ghana will fortify a broader look at development in Africa. \n\nThe course will be organized in two segments: three sessions in New York before departure for Accra, and 10 days of talks and field visits in Ghana. Pre-departure sessions will provide students with an overview of development issues, a review of African history and political evolution, and an introduction to Ghana?s history, politics, economy and culture. The sessions will include talks by scholars and practitioners. In Ghana, sessions will go into depth on major dimensions of the country?s development, including political, social and environmental as well as economic. We will learn from talks by political and business leaders, scholars, and representatives of intergovernmental and non-governmental organizations. We also will visit development projects and other sites in the field.\n\n      less description for GLOB1-GC 3010 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3015",
            "course_name": "Berlin:  A Society in Transition",
            "description": "GLOB1-GC 3015 Berlin:  A Society in Transition",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3020",
            "course_name": "South Africa:  Challenges of Transformations",
            "description": "GLOB1-GC 3020 South Africa:  Challenges of Transformations",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3025",
            "course_name": "The Arab-Israeli Conflict",
            "description": "GLOB1-GC 3025 The Arab-Israeli Conflict",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3030",
            "course_name": "Comparative Energy Politics",
            "description": "GLOB1-GC 3030 Comparative Energy Politics",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3035",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20619",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Altier, Mary Beth",
                    "time": "Mon 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20620",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Tramontano, Marisa",
                    "time": "Tue 12.30 PM - 3.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20621",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Musallam, Naira",
                    "time": "Wed 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "20622",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Analytic Skills for Global Affairs",
            "description": "GLOB1-GC 3035 Analytic Skills for Global Affairs",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 3040",
            "course_name": "",
            "description": "GLOB1-GC 3040\n\n   The Two Worlds of India:  Poverty and the Economic Rise of 'New India'\n\nOver the past two decades, India has undertaken a series of economic reforms that have spurred to a period of unprecedented economic growth; growth rates averaging 3-6 percent in the years 1975-90 have doubled during the first decade of the new millennium. Driven by the ICT and service sectors, India has become the 4th largest economy in the world (based on ppp) and is frequently referred to as an emerging global power. Yet despite the economic growth of the past 20 years the number of people living in urban slum has increased by more than 20 percent over the past decade and according to the M...\n\n      more description for GLOB1-GC 3040 »\n\n      \n\n\n\nOver the past two decades, India has undertaken a series of economic reforms that have spurred to a period of unprecedented economic growth; growth rates averaging 3-6 percent in the years 1975-90 have doubled during the first decade of the new millennium. Driven by the ICT and service sectors, India has become the 4th largest economy in the world (based on ppp) and is frequently referred to as an emerging global power. Yet despite the economic growth of the past 20 years the number of people living in urban slum has increased by more than 20 percent over the past decade and according to the Multi-Dimensional Poverty Index 645 million Indians lived below the poverty line in 2010.  Recent estimates by the Indian government based on the daily cost of calories in urban and rural areas suggest that nearly 40% of the Indian population, or 380 million people, live in hunger.\n\n      less description for GLOB1-GC 3040 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3045",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20671",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Borst, Barbara",
                    "time": "Tue 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Children and Youth in Conflict, Peacebuilding, and Development",
            "description": "GLOB1-GC 3045 Children and Youth in Conflict, Peacebuilding, and Development",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 3050",
            "course_name": "Leveraging Foreign Investment for Development in Poor Countries",
            "description": "GLOB1-GC 3050 Leveraging Foreign Investment for Development in Poor Countries",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3055",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20655",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Altier, Mary Beth",
                    "time": "Wed 3.30 PM - 6.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Security Sector Governance and the Rule of Law:  Theory, Norms, and Practices",
            "description": "GLOB1-GC 3055 Security Sector Governance and the Rule of Law:  Theory, Norms, and Practices",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 3060",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20642",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Chen, Kaifeng",
                    "time": "Tue 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Political Risk:  A Multi-Dimensional Analysis",
            "description": "GLOB1-GC 3060 Political Risk:  A Multi-Dimensional Analysis",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 3065",
            "course_name": "A Complete Capital Approach to Impact Investing",
            "description": "GLOB1-GC 3065 A Complete Capital Approach to Impact Investing",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3070",
            "course_name": "Moscow: Security, Stress and Stability in the New Russia",
            "description": "GLOB1-GC 3070 Moscow: Security, Stress and Stability in the New Russia",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3075",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20688",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Goetz, Anne Marie",
                    "time": "Wed 6.30 PM - 9.10 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Women, Peacemaking and Peacebuilding",
            "description": "GLOB1-GC 3075 Women, Peacemaking and Peacebuilding",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 3080",
            "course_name": "",
            "description": "GLOB1-GC 3080\n\n   Humanitarian Aid in Complex Emergencies\n\nWith more than 50 million refugees and IDPs worldwide,\nthe largest number since World War II, there is an unprecedented need for\nhumanitarian assistance. While the current situation is critical and has\nstretched the international humanitarian system to the breaking point, the\nglobal refugee crisis will only worsen over the next decades as climate\nchanges are expected to uproot tens of millions of people, particularly in\ndeveloping countries. This course explores the current state of the\nhumanitarian aid system, and discusses the strategies and practices involved\nin relief operations. I...\n\n      more description for GLOB1-GC 3080 »\n\n      \n\n\n\nWith more than 50 million refugees and IDPs worldwide,\nthe largest number since World War II, there is an unprecedented need for\nhumanitarian assistance. While the current situation is critical and has\nstretched the international humanitarian system to the breaking point, the\nglobal refugee crisis will only worsen over the next decades as climate\nchanges are expected to uproot tens of millions of people, particularly in\ndeveloping countries. This course explores the current state of the\nhumanitarian aid system, and discusses the strategies and practices involved\nin relief operations. It revolves around two major issues. One, by focusing\non the policies, plans, and structures that the host country, NGOs, and the\ninternational community in collaboration have put in place, it seeks to\nprovide students with an understanding of the bureaucratic/administrative\nside of crisis management. Two, the course aims to give students an insight\ninto the daily lives of refugees/IDPs living in camps/urban settlements, and\nthe experiences of aid workers who seek to alleviate the suffering.\n\n      less description for GLOB1-GC 3080 «",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3900",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2469",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Hewitt, William; Pascal, Alexander; Zindar, John; Oppenheimer, Michael; Musallam, Naira; Galeotti, Mark; Cheah, Yee; Kissane, Carolyn; Navia, Patricio; Goetz, Anne Marie; Trahan, Jennifer; Maras, Marie-Helen; Demrovsky, Chloe; Rudbeck, Jens; Maier, Silvia; Gadomsky, Chris; Borst, Barbara; Myers, Everett",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GLOB1-GC 3900\n\n   Graduate Thesis or Capstone Project\n\nThe Independent Research Study should focus on an issue of interest to the student that directly relates to the student's area of concentration. In cases where the topic rests or touches on more than one field, a teamwork project may be substituted for the independent study. Members of the team will be required to contribute material on the selected topic from the vantage point of their respective concentrations. Students will have latitude in selecting their topic but all topics, whether for individual study or a team undertaking, will need faculty approval and will be conducted under the ste...\n\n      more description for GLOB1-GC 3900 »\n\n      \n\n\n\nThe Independent Research Study should focus on an issue of interest to the student that directly relates to the student's area of concentration. In cases where the topic rests or touches on more than one field, a teamwork project may be substituted for the independent study. Members of the team will be required to contribute material on the selected topic from the vantage point of their respective concentrations. Students will have latitude in selecting their topic but all topics, whether for individual study or a team undertaking, will need faculty approval and will be conducted under the stewardship of one faculty person. The study may be a traditional research paper of a case study based on primary research, extensive interviews, and profiles of the protagonists, be they individuals or institutions and should reflect high standards of scholarship.\n\n      less description for GLOB1-GC 3900 «",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 3905",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2769",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Maier, Silvia",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship",
            "description": "GLOB1-GC 3905 Internship",
            "offering": true
        },
        {
            "course_id": "GLOB1-GC 3910",
            "course_name": "Internship",
            "description": "GLOB1-GC 3910 Internship",
            "offering": false
        },
        {
            "course_id": "GLOB1-GC 3915",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2770",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Goetz, Anne Marie; Maier, Silvia; Hill, Thomas; Chang, Patty",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "GLOB1-GC 3915 Independent Study",
            "offering": true
        }
    ]
}