{
    "major_id": "GLBL-AD",
    "file": "./2015-2016/Global_Programs_(GLBL-AD).html",
    "courses": [
        {
            "course_id": "GLBL-AD 9101",
            "course_name": "",
            "description": "GLBL-AD 9101\n\n   Global Orientations: New York and the US Perspective\n\nNew York City is called the Capital of World.  It is a city of neighborhoods and communities, of art, fashion, and culture, of skyscrapers, bridges, and parks; it a center for international diplomacy, for global finance, for commerce and technology.  This course offers a range of topics that enable students to critically engage in a distinct New York experience through a variety of lenses as they navigate the complexities of NYU.  Each section asks students to explore a theme through readings, a field trip, and reflective writing statement.  We will investigate how New York City corresponds to...\n\n      more description for GLBL-AD 9101 »\n\n      \n\n\n\nNew York City is called the Capital of World.  It is a city of neighborhoods and communities, of art, fashion, and culture, of skyscrapers, bridges, and parks; it a center for international diplomacy, for global finance, for commerce and technology.  This course offers a range of topics that enable students to critically engage in a distinct New York experience through a variety of lenses as they navigate the complexities of NYU.  Each section asks students to explore a theme through readings, a field trip, and reflective writing statement.  We will investigate how New York City corresponds to larger U.S. cultural norms, and what factors make New York City a distinct place, physically and culturally.  The sections are taught by NYU’s Faculty Fellows in Residence.  After completing the faculty-led component of the course, student will be asked to continue to engage with NYU programs and New York City-based activities throughout the semester to encourage integration to the site.\n\n      less description for GLBL-AD 9101 «",
            "offering": false
        }
    ]
}