{
    "major_id": "GFMTV-GT",
    "file": "./2015-2016/Graduate_Film_&_TV_(GFMTV-GT).html",
    "courses": [
        {
            "course_id": "GFMTV-GT 2001",
            "course_name": "Editing I",
            "description": "GFMTV-GT 2001 Editing I \nAn introduction to the principles of editing as elements of visual storytelling.  We will examine the design of sequences in various kinds of films, talk about strategies of coverage, and trace the basics of post-production workflow.   This class also incorporates a weekly lab, in which the students will learn the basics of Avid in an intensive hands on environment cutting assigned exercises which will be reviewed looking at issues of pacing, emphasis and sequencing. After the four-minute MOS project is filmed, we will apply those principles as we workshop the students’ films.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2002",
            "course_name": "Documentary Editing",
            "description": "GFMTV-GT 2002 Documentary Editing \nThe first half of the semester will help the students understand how to structure non-fictional footage into a narrative arc while editing their Observational Documentary Projects. We will explore the idea of editing as writing and rewriting. In the second half of the course, students prepare for and edit their first dialogue-driven drama for the Adaptation Project.  We will explore how much editing can shape performances and story. Throughout the course, more advanced Avid techniques will be put into practice.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2003",
            "course_name": "Editing I: Lab",
            "description": "GFMTV-GT 2003 Editing I: Lab",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2006",
            "course_name": "Production Management",
            "description": "GFMTV-GT 2006 Production Management",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2007",
            "course_name": "",
            "description": "GFMTV-GT 2007\n\n   Introduction to Producing\n\nFilm production has many elements that must be organized and coordinated before shooting begins and maintained throughout filming.  The course teaches students the fundamental skills and procedures used in managing the making of a film. \n\nThe course examines crew structure and the collaborative responsibilities of crew members, legal issues regarding agreements, rights, copyright and trademark clearances, insurance, location permits, SAG (Screen Actors Guild) contracts, scheduling, budgeting, transportation, crew deal memos and supplier contracts.  Particular attention is paid to professional ...\n\n      more description for GFMTV-GT 2007 »\n\n      \n\n\n\nFilm production has many elements that must be organized and coordinated before shooting begins and maintained throughout filming.  The course teaches students the fundamental skills and procedures used in managing the making of a film. \n\nThe course examines crew structure and the collaborative responsibilities of crew members, legal issues regarding agreements, rights, copyright and trademark clearances, insurance, location permits, SAG (Screen Actors Guild) contracts, scheduling, budgeting, transportation, crew deal memos and supplier contracts.  Particular attention is paid to professional practice concerning the structure of the workday, shooting hours, turn around time and safety issues that are the mutual responsibility of the producer, director and AD (Assistant Director).\n\nThe course explores techniques for casting, location scouting, tech scouts and read-throughs.  Students are required to learn Movie Magic Scheduling and prepare a production book for their shoot by the fifth week of class which includes their final script, script breakdown pages, shooting schedule, budget, cast list, crew list and location lists.\n\n      less description for GFMTV-GT 2007 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2008",
            "course_name": "",
            "description": "GFMTV-GT 2008\n\n   Festivals, Marketing & Financing The Short Film\n\nThe course is designed to equip students with an understanding of marketing short films to improve their ability to secure financing for their projects.  Students prepare supporting materials such as key art, DVD covers and press kits for their own films to enhance their ability to gain attention in festivals and in the short film marketplace.  With the supporting materials in place, students develop strategies for festival submissions.  With over 3000 film festivals held each year, strategic targeting can help most films gain festival acceptance which enhances the profile of the film and the ...\n\n      more description for GFMTV-GT 2008 »\n\n      \n\n\n\nThe course is designed to equip students with an understanding of marketing short films to improve their ability to secure financing for their projects.  Students prepare supporting materials such as key art, DVD covers and press kits for their own films to enhance their ability to gain attention in festivals and in the short film marketplace.  With the supporting materials in place, students develop strategies for festival submissions.  With over 3000 film festivals held each year, strategic targeting can help most films gain festival acceptance which enhances the profile of the film and the filmmaker.  \n\nStudents review what happens when they take a film to a film market where rights to short films are bought by distributors for their respective territories.  The course also examines specific deal points of licenses, and the role of sales agents and the process of negotiating a deal to represent a film.\n\nOnce the student has a working knowledge of festivals and how a film is brought to market, students prepare for the financing of their 2nd year films by preparing business plans and learning Movie Magic Budgeting software. The course also investigates the uses of social media and Internet crowd funding sites to help finance their films.\n\n      less description for GFMTV-GT 2008 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2009",
            "course_name": "Digital Theory and Practice",
            "description": "GFMTV-GT 2009 Digital Theory and Practice",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2010",
            "course_name": "Aesthetics/Silent",
            "description": "GFMTV-GT 2010 Aesthetics/Silent \nStudents are introduced to basic film techniques in thStudents are introduced to basic film techniques in the context of patterns and variations. Emphasis is given to techniques for rendering story elements visually. Clips will be screened from directors world-wide, past and present to demonstrate the use of location, activity, movement, gesture, camera placement and lighting, blocking and staging as tools which enhance story telling and contribute to aesthetic integrity.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2011",
            "course_name": "",
            "description": "GFMTV-GT 2011\n\n   Aesthetics:\n\nThe class will teach basic 3-act structure and character development. Students will learn how films are built by watching and then deconstructing 6 films. The films have been chosen for this class because they each help to relate structure and characterization to genre.  In addition to teaching students to be comfortable with structure and characterization techniques, analyzing these 6 movies will demonstrate different uses of time, conflict, story shape, themes and use of dialogue in terms of text and subtext.  In class we will review clips from the films the students have screened for the sp...\n\n      more description for GFMTV-GT 2011 »\n\n      \n\n\n\nThe class will teach basic 3-act structure and character development. Students will learn how films are built by watching and then deconstructing 6 films. The films have been chosen for this class because they each help to relate structure and characterization to genre.  In addition to teaching students to be comfortable with structure and characterization techniques, analyzing these 6 movies will demonstrate different uses of time, conflict, story shape, themes and use of dialogue in terms of text and subtext.  In class we will review clips from the films the students have screened for the specific class and will deconstruct and analyze what they have seen.\n\n      less description for GFMTV-GT 2011 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2012",
            "course_name": "",
            "description": "GFMTV-GT 2012\n\n   Mot Pic Cam Tech Beg I\n\nThis is a basic course in cinematography and electronic cinematography. The first half of the course is devoted to the study of black and white cinematography.   The students will be taught the basics of camera operation, light measurement, exposure, and visual composition as well as the observation and study of natural light and its effect on cinematography.  A variety of film emulsions and filters will be used to capture and control images.  The students will be taught to add, modify, and remove light to further enhance their imagery.  We will use set protocol to maximize our efficient use o...\n\n      more description for GFMTV-GT 2012 »\n\n      \n\n\n\nThis is a basic course in cinematography and electronic cinematography. The first half of the course is devoted to the study of black and white cinematography.   The students will be taught the basics of camera operation, light measurement, exposure, and visual composition as well as the observation and study of natural light and its effect on cinematography.  A variety of film emulsions and filters will be used to capture and control images.  The students will be taught to add, modify, and remove light to further enhance their imagery.  We will use set protocol to maximize our efficient use of time in a naturally lit location.  Also, the students will learn the essential job descriptions and division of labor that an efficient film crew requires.  During the latter part of the semester, the students will study and use the MiniDV camera in preparation for class assignments.  Finally and most importantly, we will study the fundamental mechanical procedures and basic terminology required to be a successful cinematographer and artistic collaborator.  In the spring semester the course is intended to introduce the students to basic colorThis is a basic course in cinematography and electronic cinematography. The first half of the course is devoted to the study of black and white cinematography.   The students will be taught the basics of camera operation, light measurement, exposure, and visual composition as well as the observation and study of natural light and its effect on cinematography.  A variety of film emulsions and filters will be used to capture and control images.  The students will be taught to add, modify, and remove light to further enhance their imagery.  We will use set protocol to maximize our efficient use of time in a naturally lit location.  Also, the students will learn the essential job descriptions and division of labor that an efficient film crew requires.  During the latter part of the semester, the students will study and use the MiniDV camera in preparation for class assignments.  Finally and most importantly, we will study the fundamental mechanical procedures and basic terminology required to be a successful cinematographer and artistic collaborator.  In the spring semester the course is intended to introduce the students to basic color moving image-capturing techniques for film and digital media with a concentration in lighting.  We will use color negative, color reversal, and MiniDV tape as capture mediums.  We will discuss basic electricity and its safe use in support of good lighting.  Ultimately, the students will be prepared for studio and location shooting environments.\n\n      less description for GFMTV-GT 2012 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2014",
            "course_name": "Stop Motion Animation",
            "description": "GFMTV-GT 2014 Stop Motion Animation",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2015",
            "course_name": "Film Story Analysis",
            "description": "GFMTV-GT 2015 Film Story Analysis",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2016",
            "course_name": "Mot Pic Cam Tech Beg II",
            "description": "GFMTV-GT 2016 Mot Pic Cam Tech Beg II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2020",
            "course_name": "Alternative Screenwritng",
            "description": "GFMTV-GT 2020 Alternative Screenwritng",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2031",
            "course_name": "",
            "description": "GFMTV-GT 2031\n\n   Sound\n\nIn this class students learn the techniques and methods of sound recording on set.  The course includes lectures as well as hands-on assignments improving the aural sense and the ability to capture ambiences, sound effects, and dialogue, both wild and sync.  By the end of the semester, students should have a working knowledge of the industry standard Sound Devices digital flash card recorder with Smart Slate, AKG and Senheiser Microphones as well as general principles of sound recording that should allow fast understanding of other machines.  Sound theory including concepts of sound perspectiv...\n\n      more description for GFMTV-GT 2031 »\n\n      \n\n\n\nIn this class students learn the techniques and methods of sound recording on set.  The course includes lectures as well as hands-on assignments improving the aural sense and the ability to capture ambiences, sound effects, and dialogue, both wild and sync.  By the end of the semester, students should have a working knowledge of the industry standard Sound Devices digital flash card recorder with Smart Slate, AKG and Senheiser Microphones as well as general principles of sound recording that should allow fast understanding of other machines.  Sound theory including concepts of sound perspective and reverb will be touched upon to ease the transition from the set to editing process.\n\n      less description for GFMTV-GT 2031 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2032",
            "course_name": "Production Workshop II",
            "description": "GFMTV-GT 2032 Production Workshop II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2034",
            "course_name": "Documentary Traditions",
            "description": "GFMTV-GT 2034 Documentary Traditions",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2034",
            "course_name": "",
            "description": "GFMTV-GT 2034\n\n   Directing Wkshp Beg I\n\nDuring the fall semester, each student directs a four-minute black-and-white silent film. A script for this project is initiated in the writing class and developed with the participation of the directing instructors. The film is shot only on exterior locations and uses sound effects but no music. The basics of film language are studied in class and practiced in film exercises. Students work on their projects in crews with each student doing the camera work on another crew member?s project. Each student is therefore exposed and contributes to a number of productions other than his or her own. V...\n\n      more description for GFMTV-GT 2034 »\n\n      \n\n\n\nDuring the fall semester, each student directs a four-minute black-and-white silent film. A script for this project is initiated in the writing class and developed with the participation of the directing instructors. The film is shot only on exterior locations and uses sound effects but no music. The basics of film language are studied in class and practiced in film exercises. Students work on their projects in crews with each student doing the camera work on another crew member?s project. Each student is therefore exposed and contributes to a number of productions other than his or her own. Viewing of clips by master directors, basic readings, and classroom discussions together provide a framework for the heart of the course, which is a super 16 mm production.\n\n      less description for GFMTV-GT 2034 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2035",
            "course_name": "",
            "description": "GFMTV-GT 2035\n\n   Directing II\n\nFor the next project, each student directs a short digital video documentary. The purpose of this project is to heighten and develop the students dramatic skills. This will be shot with one or two person crews, beginning over the Holiday Break, and continuing into the first few weeks of the Spring Semester. The documentary exercise is meant to teach the director to use the camera to capture life as it happens. Similar to improvisational acting, this is improvisational directing. Of course, as in all improvisations, there is important preparatory work: What is the truth of the scene or environm...\n\n      more description for GFMTV-GT 2035 »\n\n      \n\n\n\nFor the next project, each student directs a short digital video documentary. The purpose of this project is to heighten and develop the students dramatic skills. This will be shot with one or two person crews, beginning over the Holiday Break, and continuing into the first few weeks of the Spring Semester. The documentary exercise is meant to teach the director to use the camera to capture life as it happens. Similar to improvisational acting, this is improvisational directing. Of course, as in all improvisations, there is important preparatory work: What is the truth of the scene or environment? How will I approach it as a visual storyteller? What stylistic approach is most appropriate for my subject? What beats will I search for, and how will I capture and even enhance them?\n\n      less description for GFMTV-GT 2035 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2036",
            "course_name": "Digital Sound Design",
            "description": "GFMTV-GT 2036 Digital Sound Design",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2037",
            "course_name": "Independt Study Special",
            "description": "GFMTV-GT 2037 Independt Study Special",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2038",
            "course_name": "",
            "description": "GFMTV-GT 2038\n\n   Location Sound\n\nIn this class students learn the techniques and methods of sound recording on set.  The course includes lectures as well as hands-on assignments improving the aural sense and the ability to capture ambiences, sound effects, and dialogue, both wild and sync.  By the end of the semester, students should have a working knowledge of the industry standard Sound Devices digital flash card recorder with Smart Slate, AKG and Senheiser Microphones as well as general principles of sound recording that should allow fast understanding of other machines.  Sound theory including concepts of sound perspectiv...\n\n      more description for GFMTV-GT 2038 »\n\n      \n\n\n\nIn this class students learn the techniques and methods of sound recording on set.  The course includes lectures as well as hands-on assignments improving the aural sense and the ability to capture ambiences, sound effects, and dialogue, both wild and sync.  By the end of the semester, students should have a working knowledge of the industry standard Sound Devices digital flash card recorder with Smart Slate, AKG and Senheiser Microphones as well as general principles of sound recording that should allow fast understanding of other machines.  Sound theory including concepts of sound perspective and reverb will be touched upon to ease the transition from the set to editing process.\n\n      less description for GFMTV-GT 2038 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2043",
            "course_name": "Actors Craft",
            "description": "GFMTV-GT 2043 Actors Craft \nThis course is designed to provide an understanding of the actor's craft so that directors can guide actors toward delivering optimum performances. The actor's world is explored experientially through a curriculum that lays a foundation of understanding of the actor’s craft through direct participation in acting exercises.  Students learn various acting techniques that will aid in the rehearsal and casting of their MOS projects.  This basic acting course aims to bridge the communication gap between actors and directors by de-mystifying the actor's process.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2044",
            "course_name": "Actors Craft II",
            "description": "GFMTV-GT 2044 Actors Craft II \nIn the spring semester the directors move on to preparation for the Adaptation Project. The emphasis here is on laying a solid foundation for working with actors in scripted material. Students workshop scenes from their Adaptation script as well as other film scripts.  Prior lessons learned are reinforced and new rehearsal methods like improvisation are introduced.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2051",
            "course_name": "Animation Action Analy",
            "description": "GFMTV-GT 2051 Animation Action Analy",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2055",
            "course_name": "Advanced Animation Wkshp",
            "description": "GFMTV-GT 2055 Advanced Animation Wkshp",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2061",
            "course_name": "Cel Animation",
            "description": "GFMTV-GT 2061 Cel Animation",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2065",
            "course_name": "Animation Workshop I",
            "description": "GFMTV-GT 2065 Animation Workshop I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2070",
            "course_name": "Stop Motion Animation",
            "description": "GFMTV-GT 2070 Stop Motion Animation",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2072",
            "course_name": "Visiting Artists/Port Rev",
            "description": "GFMTV-GT 2072 Visiting Artists/Port Rev",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2075",
            "course_name": "History of Animation",
            "description": "GFMTV-GT 2075 History of Animation",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2076",
            "course_name": "Words and Pictures",
            "description": "GFMTV-GT 2076 Words and Pictures",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2077",
            "course_name": "Writing for Animation",
            "description": "GFMTV-GT 2077 Writing for Animation",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2078",
            "course_name": "Character Anim Tech Studio",
            "description": "GFMTV-GT 2078 Character Anim Tech Studio",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2080",
            "course_name": "Storyboarding",
            "description": "GFMTV-GT 2080 Storyboarding",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2081",
            "course_name": "Directing Wkshop Int I",
            "description": "GFMTV-GT 2081 Directing Wkshop Int I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2082",
            "course_name": "Directors First Feature",
            "description": "GFMTV-GT 2082 Directors First Feature",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2083",
            "course_name": "",
            "description": "GFMTV-GT 2083\n\n   Motion Pic Cam Tech II\n\nThis is a basic course in cinematography and electronic cinematography. The first half of the course iThis is a basic course in cinematography and electronic cinematography. The first half of the course is devoted to the study of black and white cinematography.   The students will be taught the basics of camera operation, light measurement, exposure, and visual composition as well as the observation and study of natural light and its effect on cinematography.  A variety of film emulsions and filters will be used to capture and control images.  The students will be taught to add, modify, and re...\n\n      more description for GFMTV-GT 2083 »\n\n      \n\n\n\nThis is a basic course in cinematography and electronic cinematography. The first half of the course iThis is a basic course in cinematography and electronic cinematography. The first half of the course is devoted to the study of black and white cinematography.   The students will be taught the basics of camera operation, light measurement, exposure, and visual composition as well as the observation and study of natural light and its effect on cinematography.  A variety of film emulsions and filters will be used to capture and control images.  The students will be taught to add, modify, and remove light to further enhance their imagery.  We will use set protocol to maximize our efficient use of time in a naturally lit location.  Also, the students will learn the essential job descriptions and division of labor that an efficient film crew requires.  During the latter part of the semester, the students will study and use the MiniDV camera in preparation for class assignments.  Finally and most importantly, we will study the fundamental mechanical procedures and basic terminology required to be a successful cinematographer and artistic collaborator.  In the spring semester the course is intended to introduce the students to basic color moving image-capturing techniques for film and digital media with a concentration in lighting.  We will use color negative, color reversal, and MiniDV tape as capture mediums.  We will discuss basic electricity and its safe use in support of good lighting.  Ultimately, the students will be prepared for studio and location shooting environments.\n\n      less description for GFMTV-GT 2083 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2084",
            "course_name": "Motion Picture Productn Workshop II",
            "description": "GFMTV-GT 2084 Motion Picture Productn Workshop II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2085",
            "course_name": "Fundamentals of Screen Writing",
            "description": "GFMTV-GT 2085 Fundamentals of Screen Writing \nFall - Fundamentals of Screenwriting I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2086",
            "course_name": "Screen Writing",
            "description": "GFMTV-GT 2086 Screen Writing \nA weekly 3 hour workshop continuing the basics of screenwriting by developing a short screenplay inspired by a work of fiction or journalism. The film is no longer than seven minutes, consisting of at least 3 scenes, with at least half being in dialogue.\n\nAfter these scripts are shot, mid-semester, the class focuses on the development of the idea for the second year film.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2087",
            "course_name": "Editing Interm I",
            "description": "GFMTV-GT 2087 Editing Interm I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2088",
            "course_name": "Editing Analysis II",
            "description": "GFMTV-GT 2088 Editing Analysis II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2089",
            "course_name": "Producing Adv I",
            "description": "GFMTV-GT 2089 Producing Adv I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2090",
            "course_name": "Producing II",
            "description": "GFMTV-GT 2090 Producing II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2091",
            "course_name": "Advanced Camera",
            "description": "GFMTV-GT 2091 Advanced Camera",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2092",
            "course_name": "Advanced Camera II",
            "description": "GFMTV-GT 2092 Advanced Camera II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2093",
            "course_name": "Special Topics: Low Budget Feature",
            "description": "GFMTV-GT 2093 Special Topics: Low Budget Feature",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2094",
            "course_name": "Independent Study Production",
            "description": "GFMTV-GT 2094 Independent Study Production",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2098",
            "course_name": "Writing & Directing II: Spring Narrative",
            "description": "GFMTV-GT 2098 Writing & Directing II: Spring Narrative",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2099",
            "course_name": "Production Safety and Set Protocol",
            "description": "GFMTV-GT 2099 Production Safety and Set Protocol",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2101",
            "course_name": "Narrative Editing",
            "description": "GFMTV-GT 2101 Narrative Editing \nSince coverage and editing are inherently related, it is important to identify those kinds of shots that will be necessary in order to edit a specific scene. The lectures will cover various uses of the 180-degree line, eyelines, and screen direction, as they pertain to the editor. Clips used in lecture will concentrate primarily on dialogue scenes, but will also include action sequences. Each student will be required to submit a short paper describing the design of his or her film in regards to the eventual editing style.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2102",
            "course_name": "",
            "description": "GFMTV-GT 2102\n\n   Editing Workshop\n\nA workshop for students to screen and explore the editing of their 2nd year films.  Emphasizing class participation, students will learn the art of feedback as well as editing. This class is designed to take students throughA workshop for students to screen and explore the editing of their 2nd year films.  Emphasizing class participation, students will learn the art of feedback as well as editing. This class is designed to take students through the completion of their 2nd year film. Students will be introduced to After Effects, color correction tools, and techniques for generating high-quality...\n\n      more description for GFMTV-GT 2102 »\n\n      \n\n\n\nA workshop for students to screen and explore the editing of their 2nd year films.  Emphasizing class participation, students will learn the art of feedback as well as editing. This class is designed to take students throughA workshop for students to screen and explore the editing of their 2nd year films.  Emphasizing class participation, students will learn the art of feedback as well as editing. This class is designed to take students through the completion of their 2nd year film. Students will be introduced to After Effects, color correction tools, and techniques for generating high-quality outputs.\n\n      less description for GFMTV-GT 2102 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2103",
            "course_name": "",
            "description": "GFMTV-GT 2103\n\n   Producing The Short Narrative Film\n\nThe course is based on the preparation of the second year narrative short for shooting.  The techniques used are essentially the same techniques whether one is shooting a feature or a ten-minute film.  The course requires that the script be ready for production as we will begin with casting and location scouting techniques, then move on to preparing the marked script, AD Breakdown pages, Production Schedule and stripboard. The course will examine crew organization and responsibilities for narrative synch-sound shooting and the management of the shooting day, including work hours, turn around, ...\n\n      more description for GFMTV-GT 2103 »\n\n      \n\n\n\nThe course is based on the preparation of the second year narrative short for shooting.  The techniques used are essentially the same techniques whether one is shooting a feature or a ten-minute film.  The course requires that the script be ready for production as we will begin with casting and location scouting techniques, then move on to preparing the marked script, AD Breakdown pages, Production Schedule and stripboard. The course will examine crew organization and responsibilities for narrative synch-sound shooting and the management of the shooting day, including work hours, turn around, responsibilities of the AD, script supervision, daily logs for camera and sound, the DP as crew head, and crew and set safety issues.  The course will review insurance, permit and SAG requirements as well as those legal, permission and music license issues that impact on the potential distribution of the completed film.  As the production period nears we will review the securing of locations, tech scouts, and crew read-throughs.  Each student will be required to prepare a production book for hThe course is based on the preparation of the second year narrative short for shooting.  The techniques used are essentially the same techniques whether one is shooting a feature or a ten-minute film.  The course requires that the script be ready for production as we will begin with casting and location scouting techniques, then move on to preparing the marked script, AD Breakdown pages, Production Schedule and stripboard. The course will examine crew organization and responsibilities for narrative synch-sound shooting and the management of the shooting day, including work hours, turn around, responsibilities of the AD, script supervision, daily logs for camera and sound, the DP as crew head, and crew and set safety issues.  The course will review insurance, permit and SAG requirements as well as those legal, permission and music license issues that impact on the potential distribution of the completed film.  As the production period nears we will review the securing of locations, tech scouts, and crew read-throughs.  Each student will be required to prepare a production book for his or her shoot by the sixth week of class that will include final marked script, script breakdown pages, one-liner in script order, one-liner shooting schedule, budget, cast list, crew list and location lists.\n\n      less description for GFMTV-GT 2103 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2104",
            "course_name": "",
            "description": "GFMTV-GT 2104\n\n   Producing for Directors: Independent Features\n\nThe course is intended to prepare producers, writers and directors with the knowledge and practice of independent feature film financing and production so they are better equipped to pursue their own projects when they enter the marketplace.\n\nThe course provides an overview of the process from the idea development stage through marketing and distribution of the finished film.  Steps include optioning material, casting, creating contracts, preparing packages for presentation to potential financiers, pitching, assembling cast and crew, researching distribution channels, creating project specific...\n\n      more description for GFMTV-GT 2104 »\n\n      \n\n\n\nThe course is intended to prepare producers, writers and directors with the knowledge and practice of independent feature film financing and production so they are better equipped to pursue their own projects when they enter the marketplace.\n\nThe course provides an overview of the process from the idea development stage through marketing and distribution of the finished film.  Steps include optioning material, casting, creating contracts, preparing packages for presentation to potential financiers, pitching, assembling cast and crew, researching distribution channels, creating project specific market and budget analyses, and learning the necessary legal requirements throughout the process to insure distribution.\n\n      less description for GFMTV-GT 2104 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2105",
            "course_name": "Film Story Analysis",
            "description": "GFMTV-GT 2105 Film Story Analysis",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2107",
            "course_name": "Production Design",
            "description": "GFMTV-GT 2107 Production Design",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2111",
            "course_name": "Video Whorkshop I",
            "description": "GFMTV-GT 2111 Video Whorkshop I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2112",
            "course_name": "Mot Pic Camera Tech Int",
            "description": "GFMTV-GT 2112 Mot Pic Camera Tech Int",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2113",
            "course_name": "",
            "description": "GFMTV-GT 2113\n\n   Directing The Actor I\n\nThe fall semester seven-week workshop prepares the director to work with actors on their ten-minute narrative film. The goal is to demonstrate the importance of communicating the vision of the script in a vocabulary that has meaning to an actor, and to focus on action and character behavior.  Directors will acquire a working knowledge of the language of actors through the application of various acting techniques created by influential acting teachers from Stanislavsky to the present.  The ultimate goal is creative collaboration between the actor and the director in order to obtain authentic, t...\n\n      more description for GFMTV-GT 2113 »\n\n      \n\n\n\nThe fall semester seven-week workshop prepares the director to work with actors on their ten-minute narrative film. The goal is to demonstrate the importance of communicating the vision of the script in a vocabulary that has meaning to an actor, and to focus on action and character behavior.  Directors will acquire a working knowledge of the language of actors through the application of various acting techniques created by influential acting teachers from Stanislavsky to the present.  The ultimate goal is creative collaboration between the actor and the director in order to obtain authentic, truthful performances for the 2nd year film.\n\n      less description for GFMTV-GT 2113 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2114",
            "course_name": "Developing The Feature",
            "description": "GFMTV-GT 2114 Developing The Feature",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2115",
            "course_name": "",
            "description": "GFMTV-GT 2115\n\n   Directing The Actor II\n\nThe spring semester is an advanced coursed in directing actors through the study and application of established acting techniques and script analysis.  Initially, students focus on different film genres using scenes and monologues from successful film scripts and plays.  In the latter part of the course, scenes from material developed by the students in their writing courses will be staged focusing on character.  The use of improvisation as both a rehearsal and development tool will be emphasized.  The work of influential acting teachers and film directors is used as the basis of exploration o...\n\n      more description for GFMTV-GT 2115 »\n\n      \n\n\n\nThe spring semester is an advanced coursed in directing actors through the study and application of established acting techniques and script analysis.  Initially, students focus on different film genres using scenes and monologues from successful film scripts and plays.  In the latter part of the course, scenes from material developed by the students in their writing courses will be staged focusing on character.  The use of improvisation as both a rehearsal and development tool will be emphasized.  The work of influential acting teachers and film directors is used as the basis of exploration of approach that will help students find their personal directing styles and become more confident in guiding actors in rehearsal and on set.\n\n      less description for GFMTV-GT 2115 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2116",
            "course_name": "",
            "description": "GFMTV-GT 2116\n\n   Cinematography\n\nLighting is the basis of cinematography. Learning the nuances of controlling source and shadow in order to create a mood and a feeling will advance the ultimate goal as filmmakers: to tell a good story.  In this class you will get practical experience, with the tools and the hardware used in the industry, and you will work through the esthetic decisions every cinematographer must make. But lighting is just part of the story. The heart of cinematography is composition: camera placement, camera angles, camera movement and lens choice, which together with the lighting style will give your films t...\n\n      more description for GFMTV-GT 2116 »\n\n      \n\n\n\nLighting is the basis of cinematography. Learning the nuances of controlling source and shadow in order to create a mood and a feeling will advance the ultimate goal as filmmakers: to tell a good story.  In this class you will get practical experience, with the tools and the hardware used in the industry, and you will work through the esthetic decisions every cinematographer must make. But lighting is just part of the story. The heart of cinematography is composition: camera placement, camera angles, camera movement and lens choice, which together with the lighting style will give your films their unique life.  Specifically we will learn: the Arri SR2, the Sony EX1 HD camera, essential lighting and grip equipment, color film stocks, hard light vs. soft light, location shooting, color temperature and fluorescent lights, exterior lighting and control of natural light, covering a scene and continuity from a cinematographer's point of view, composition, and camera and actor choreography.  In each class, we will look at selected scenes from popular films and recreate them, using the elements noted above. We will shoot many exercises with both the film and the HD cameras.\n\n      less description for GFMTV-GT 2116 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2117",
            "course_name": "",
            "description": "GFMTV-GT 2117\n\n   Writing The Short Screenplay\n\nThe goal of this course is to develop engaging and imaginative, original or adapted, ten minute screenplays for production in the second year program. The semester will begin with an ?intensive\" of five consecutive days of three-hour sessions devoted to table readings of first draft scripts written by students over the summer. Each script will be taken through a formal process of oral and written feedback in preparation for the subsequent course work. The objective of the following seven weeks of the course is to rethink, restructure, rewrite and polish the works in progress. After a brief rev...\n\n      more description for GFMTV-GT 2117 »\n\n      \n\n\n\nThe goal of this course is to develop engaging and imaginative, original or adapted, ten minute screenplays for production in the second year program. The semester will begin with an ?intensive\" of five consecutive days of three-hour sessions devoted to table readings of first draft scripts written by students over the summer. Each script will be taken through a formal process of oral and written feedback in preparation for the subsequent course work. The objective of the following seven weeks of the course is to rethink, restructure, rewrite and polish the works in progress. After a brief review of common issues and key principles, each revised script will be read and discussed in class. Additional individual consultations will be offered with the instructor. At the end of this course, each student should have a strong second draft screenplay ready for production.\n\n      less description for GFMTV-GT 2117 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2118",
            "course_name": "Screenwriting: Thesis and Feature Scripts",
            "description": "GFMTV-GT 2118 Screenwriting: Thesis and Feature Scripts \nDESCRIPTION Forthcoming",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2119",
            "course_name": "Advanced Cinematography",
            "description": "GFMTV-GT 2119 Advanced Cinematography",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2121",
            "course_name": "The Director'S Series",
            "description": "GFMTV-GT 2121 The Director'S Series",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2123",
            "course_name": "Aesthetics: Script Analysis",
            "description": "GFMTV-GT 2123 Aesthetics: Script Analysis",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2124",
            "course_name": "Think Films II",
            "description": "GFMTV-GT 2124 Think Films II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2125",
            "course_name": "",
            "description": "GFMTV-GT 2125\n\n   Aesthetics: Narrative Film Style\n\nThe idea of treatment strategy expands in the 2nd year to include the practical and aesthetic requirements of a coherent style. The course provides students a close examination of film techniques that combine to create a particular film style. The techniques include casting, location, production design, camera, lighting, mise en scene, sound design and editing.  Each week is devoted to a different element.  The objective, finally, is to give students an authority over their thinking and ultimately over their directing so that the choices made converge to reveal dexterity, precision and narrati...\n\n      more description for GFMTV-GT 2125 »\n\n      \n\n\n\nThe idea of treatment strategy expands in the 2nd year to include the practical and aesthetic requirements of a coherent style. The course provides students a close examination of film techniques that combine to create a particular film style. The techniques include casting, location, production design, camera, lighting, mise en scene, sound design and editing.  Each week is devoted to a different element.  The objective, finally, is to give students an authority over their thinking and ultimately over their directing so that the choices made converge to reveal dexterity, precision and narrative integration.\n\n      less description for GFMTV-GT 2125 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2126",
            "course_name": "",
            "description": "GFMTV-GT 2126\n\n   Cinematography Studio Lighting II\n\nLighting is the basis of cinematography. Learning the nuances of controlling source and shadow in order to create a mood and a feeling will advance the ultimate goal as filmmakers: to tell a good story.  In this class you will get practical experience, with the tools and the hardware used in the industry, and you will work through the esthetic decisions every cinematographer must make. But lighting is just part of the story. The heart of cinematography is composition: camera placement, camera angles, camera movement and lens choice, which together with the lighting style will give your films t...\n\n      more description for GFMTV-GT 2126 »\n\n      \n\n\n\nLighting is the basis of cinematography. Learning the nuances of controlling source and shadow in order to create a mood and a feeling will advance the ultimate goal as filmmakers: to tell a good story.  In this class you will get practical experience, with the tools and the hardware used in the industry, and you will work through the esthetic decisions every cinematographer must make. But lighting is just part of the story. The heart of cinematography is composition: camera placement, camera angles, camera movement and lens choice, which together with the lighting style will give your films their unique life.  Specifically we will learn: the Arri SR2, the Sony EX1 HD camera, essential lighting and grip equipment, color film stocks, hard light vs. soft light, location shooting, color temperature and fluorescent lights, exterior lighting and control of natural light, covering a scene and continuity from a cinematographer's point of view, composition, and camera and actor choreography.  In each class, we will look at selected scenes from popular films and recreate them, using the elements noted above. We will shoot many exercises with both the film and the HD cameras.\n\n      less description for GFMTV-GT 2126 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2127",
            "course_name": "Aesthetics: Narrative Structure",
            "description": "GFMTV-GT 2127 Aesthetics: Narrative Structure",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2134",
            "course_name": "",
            "description": "GFMTV-GT 2134\n\n   Directing III\n\nThe student arrives on the first day of the fall semester with a script for a ten-minute, color, sound film.  The semester is divided into two sections:  7 weeks of pre-production during which the elements of the film are explored through exercises and screenings, followed by a production period that extends from early November, goes through the Winter Break, and ends when classes begin in mid-January.\n\nEvery one of the tools at the director’s disposal will be explored in a more complex manner, all of which helps the filmmaker discover and explore what style and manner of cinematic storytellin...\n\n      more description for GFMTV-GT 2134 »\n\n      \n\n\n\nThe student arrives on the first day of the fall semester with a script for a ten-minute, color, sound film.  The semester is divided into two sections:  7 weeks of pre-production during which the elements of the film are explored through exercises and screenings, followed by a production period that extends from early November, goes through the Winter Break, and ends when classes begin in mid-January.\n\nEvery one of the tools at the director’s disposal will be explored in a more complex manner, all of which helps the filmmaker discover and explore what style and manner of cinematic storytelling most suits the kind of film being made.\n\n      less description for GFMTV-GT 2134 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2135",
            "course_name": "",
            "description": "GFMTV-GT 2135\n\n   Directing IV/Master Clss\n\nThe purpose of this Master Class is to explore, as a class, what each director is attempting in their work.  Master Class considers the work that has been shot, and early cuts of the material.  Specifically, how camera, blocking, design and performance work toward the director's goal for the film. \n\nFor the first 9 weeks of the semester, the entire class convenes as a group, with all the directing teachers, and occasional guests, to screen dailies, rough and fine cuts of the work.  \n\nThis leads up to the evaluations by the entire departmental faculty during the 10th week of the semester.  Foll...\n\n      more description for GFMTV-GT 2135 »\n\n      \n\n\n\nThe purpose of this Master Class is to explore, as a class, what each director is attempting in their work.  Master Class considers the work that has been shot, and early cuts of the material.  Specifically, how camera, blocking, design and performance work toward the director's goal for the film. \n\nFor the first 9 weeks of the semester, the entire class convenes as a group, with all the directing teachers, and occasional guests, to screen dailies, rough and fine cuts of the work.  \n\nThis leads up to the evaluations by the entire departmental faculty during the 10th week of the semester.  Following the evaluations, the class meets in smaller sections for further discussion of the work done in order to prepare the final version of the film.\n\n      less description for GFMTV-GT 2135 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2136",
            "course_name": "Advanced Editing I",
            "description": "GFMTV-GT 2136 Advanced Editing I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2137",
            "course_name": "Directing Master Class",
            "description": "GFMTV-GT 2137 Directing Master Class",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2144",
            "course_name": "Directing Scenes",
            "description": "GFMTV-GT 2144 Directing Scenes",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2146",
            "course_name": "Avid Training Workshop",
            "description": "GFMTV-GT 2146 Avid Training Workshop",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2147",
            "course_name": "Script Analysis",
            "description": "GFMTV-GT 2147 Script Analysis",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2148",
            "course_name": "Documentary Skills",
            "description": "GFMTV-GT 2148 Documentary Skills",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2169",
            "course_name": "Technical Workshop: Avid and Sound",
            "description": "GFMTV-GT 2169 Technical Workshop: Avid and Sound \nDESCRIPTION Forthcoming",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2170",
            "course_name": "Post Production Sound Design",
            "description": "GFMTV-GT 2170 Post Production Sound Design \nThis course covers basic sound design, sound editing strategies, and technology. Students are introduced to Pro Tools sound editing program and introduced to ADR and Foley. The objective is to design and sound edit second-year films and to prepare for final mix.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2201",
            "course_name": "Independent Study",
            "description": "GFMTV-GT 2201 Independent Study",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2202",
            "course_name": "Independent Study",
            "description": "GFMTV-GT 2202 Independent Study \nStudents may enroll in an Independent Study to do work that would not be covered by an existing course in the Department. Working with a full-time faculty member, students develop a plan of study that outlines the project, the schedule, and the number of contact hours with the faculty (minimum of one meeting every two weeks is required) an approximate number of hours per week to be spent on the project (approximately 5 hours per week for 14 weeks for each point of Independent Study.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2203",
            "course_name": "Camera(for Non-Opmajors)",
            "description": "GFMTV-GT 2203 Camera(for Non-Opmajors)",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2204",
            "course_name": "",
            "description": "GFMTV-GT 2204\n\n   Advanced Cinematography: Techniques\n\nDesigned to give cinematography majors practical and artistic experience in preparing for their professional careers as directors of photography. An intensive hands-on shooting experience; projects are shot and lit on the soundstage and on location while employing numerous exposure techniques using a 35 mm Arri IV camera and Kodak 500T and Kodak 250D film stock to be processed at Technicolor, with the workprint viewed at the beginning of the subsequent class. A team of two students (operator and gaffer) design a scene each week. All students must serve as key grip, gaffer, and AC on each other...\n\n      more description for GFMTV-GT 2204 »\n\n      \n\n\n\nDesigned to give cinematography majors practical and artistic experience in preparing for their professional careers as directors of photography. An intensive hands-on shooting experience; projects are shot and lit on the soundstage and on location while employing numerous exposure techniques using a 35 mm Arri IV camera and Kodak 500T and Kodak 250D film stock to be processed at Technicolor, with the workprint viewed at the beginning of the subsequent class. A team of two students (operator and gaffer) design a scene each week. All students must serve as key grip, gaffer, and AC on each other?s projects.\n\n      less description for GFMTV-GT 2204 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2205",
            "course_name": "Producing The Low Budget Feature",
            "description": "GFMTV-GT 2205 Producing The Low Budget Feature",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2207",
            "course_name": "Producing, Marketing & Distribution",
            "description": "GFMTV-GT 2207 Producing, Marketing & Distribution",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2208",
            "course_name": "Advanced Editing Techniques",
            "description": "GFMTV-GT 2208 Advanced Editing Techniques \nIn this class, students continue to work toward completion of their advanced-level narrative films. Students have the opportunity to direct, shoot, and edit a green screen composite project.  Professional editors visit the class to screen their work and participate in discussions surrounding their aesthetic choices and editing strategies.  During the final six weeks of the course, students will edit the films created in the Directing Projects classes.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2211",
            "course_name": "Writing the Short Form",
            "description": "GFMTV-GT 2211 Writing the Short Form \nThe goal of this course is the development of the thesis script through in class readings and out of class consultations with the instructor. During a three-day period prior to Thanksgiving writers will be assigned a date and time to present their scripts for faculty evaluation. Each script must be read by actors. During follow-up sessions, writers will consult with the individual writing teachers to incorporate feedback from table readings into revised versions of the script.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2212",
            "course_name": "Writing Thesis Workshop",
            "description": "GFMTV-GT 2212 Writing Thesis Workshop",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2213",
            "course_name": "Writing The Feature I",
            "description": "GFMTV-GT 2213 Writing The Feature I \nPrimarily a workshop, this class is designed to develop an advanced draft of the idea each student presented in the previous spring’s Thesis and Feature Scripts class.  If the idea is different from that idea presented, the new idea still must be developed to the level of the first.  \n\nIf developed for a potential thesis, students will prepare a presentation of the project for faculty evaluation during the term, including a written treatment and a 12-minute table reading of excerpted scenes.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2214",
            "course_name": "Writing Feature II",
            "description": "GFMTV-GT 2214 Writing Feature II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2222",
            "course_name": "Comedy Writing Workshop",
            "description": "GFMTV-GT 2222 Comedy Writing Workshop",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2223",
            "course_name": "Production Des Collab I",
            "description": "GFMTV-GT 2223 Production Des Collab I",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2224",
            "course_name": "Production Design II",
            "description": "GFMTV-GT 2224 Production Design II",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2225",
            "course_name": "Digital Producing",
            "description": "GFMTV-GT 2225 Digital Producing",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2226",
            "course_name": "Producing Thesis",
            "description": "GFMTV-GT 2226 Producing Thesis",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2227",
            "course_name": "Aesthetic: Style",
            "description": "GFMTV-GT 2227 Aesthetic: Style",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2228",
            "course_name": "Aesthetics: Genre/Script",
            "description": "GFMTV-GT 2228 Aesthetics: Genre/Script \nThe course reviews the characteristics of 15 popular genres including an investigation of the role of theme, plot, casting, iconography, location and style in serving the tacit agreement between filmmaker and audience that any specific genre requires.  Students become adept at analyzing the relationship between genre and narrative structure.  This process leads to screenplay analysis which includes a study of character, theme, premise, management of time and space and overall structure. Specific scenes are discussed with a close reading of dramatic beats achieved through dialogue and subtext.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2235",
            "course_name": "Independent Study",
            "description": "GFMTV-GT 2235 Independent Study",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2236",
            "course_name": "",
            "description": "GFMTV-GT 2236\n\n   Entertainment Business Law\n\nThis course examines legal agreements required for the business of entertainment.  While students are afforded the opportunity to review legal agreements used by the Professor in her law practice, the course also focuses on the give and take of an agreement, i.e., what is negotiable, how to negotiate, and how to protect your rights (creative or otherwise).  The course is one of contrasts, from the broad strokes of why certain agreements are required, to the micro specifics of the impact of changing a word or a sentence in a contract.  The impact of an agreement is viewed from both sides of the...\n\n      more description for GFMTV-GT 2236 »\n\n      \n\n\n\nThis course examines legal agreements required for the business of entertainment.  While students are afforded the opportunity to review legal agreements used by the Professor in her law practice, the course also focuses on the give and take of an agreement, i.e., what is negotiable, how to negotiate, and how to protect your rights (creative or otherwise).  The course is one of contrasts, from the broad strokes of why certain agreements are required, to the micro specifics of the impact of changing a word or a sentence in a contract.  The impact of an agreement is viewed from both sides of the parties to a contract.\n\n      less description for GFMTV-GT 2236 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2237",
            "course_name": "Internship",
            "description": "GFMTV-GT 2237 Internship",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2240",
            "course_name": "Development for Television and Digital Platforms",
            "description": "GFMTV-GT 2240 Development for Television and Digital Platforms",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2241",
            "course_name": "Directing The Actor",
            "description": "GFMTV-GT 2241 Directing The Actor \nThese courses use classical plays and film scripts as a basis for acting. Focus includes characters, backgrounds, relationship and progression by performance, and the emotional and physical demands of character and improvisation.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2242",
            "course_name": "Directing The Actor IV",
            "description": "GFMTV-GT 2242 Directing The Actor IV \nThese courses use classical plays and film scripts as a basis for acting. Focus includes characters, backgrounds, relationship and progression by performance, and the emotional and physical demands of character and improvisation.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2243",
            "course_name": "Master Series: Directing Strategies",
            "description": "GFMTV-GT 2243 Master Series: Directing Strategies \nSpike Lee mentors students on their own thesis projects, feature plans, and careers. He brings in a stream of industry professionals. Lectures cover Spike Lee?s own work as well as aesthetic and practical issues.  Open only to 3rd year students in the Kanbar Graduate Film Program.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2244",
            "course_name": "",
            "description": "GFMTV-GT 2244\n\n   Master Series:\n\nCAREER STRATEGIES (.01):\nThis course is designed to equip students with the essential information, strategies, and skills required to launch successful careers in the film, television, and related industries, after their graduation from NYU.  \nInitial classes focus on the broad range of professional opportunities and the nature of the competitive challenges ahead.  Each session will be comprised of a one-hour discussion of the current state of the entertainment industry, with the professor (a 30 year veteran of film production) helping the students to strategize their priorities and career obj...\n\n      more description for GFMTV-GT 2244 »\n\n      \n\n\n\nCAREER STRATEGIES (.01):\nThis course is designed to equip students with the essential information, strategies, and skills required to launch successful careers in the film, television, and related industries, after their graduation from NYU.  \nInitial classes focus on the broad range of professional opportunities and the nature of the competitive challenges ahead.  Each session will be comprised of a one-hour discussion of the current state of the entertainment industry, with the professor (a 30 year veteran of film production) helping the students to strategize their priorities and career objectives.  The second part of each class will involve a guest speaker from various segments of the industry (such as key agents, managers, lawyer, financiers, acquisitions and production executives from independent companies and studios).  The take away at the end of the course will be that each student is able to clearly view themselves as an individual enterprise ready to segue way into their desired field in the entertainment business. \n\nINVESTOR RELATIONS (.02):\nThis class will concentrate on shaping and pitching project presentations to film and non-film industry investors.  The class is geared to help students hone their ability to raise money for their feature films. The class also includes guest speakers on film finance.\n\n      less description for GFMTV-GT 2244 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2246",
            "course_name": "Directing",
            "description": "GFMTV-GT 2246 Directing \nThis is a directing class focused on creating a short project and continuing to challenge the student as a filmmaker.  The project may be related to the proposed thesis, or it can simply be an exploration of the writer/director’s voice and style.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2247",
            "course_name": "",
            "description": "GFMTV-GT 2247\n\n   Directing Projects:\n\nTELEVISION SERIES (.01): \nEach student will participate in the writing of an eight-part television series (pilot or webisodes) and then direct one of the episodes. The episodes will be shot near the end of the fall term.\n\nProducing, camera and editing will be coordinated by other 3rd year classes/students. \n\nIn order that the choice of story and scripts can be well prepared and ready at the start of the fall term, the roster needs to be decided in the spring.\n\nCOMMERCIALS (.02): \nThis course explores the art and business of directing commercials and examines some of the ways that film and adve...\n\n      more description for GFMTV-GT 2247 »\n\n      \n\n\n\nTELEVISION SERIES (.01): \nEach student will participate in the writing of an eight-part television series (pilot or webisodes) and then direct one of the episodes. The episodes will be shot near the end of the fall term.\n\nProducing, camera and editing will be coordinated by other 3rd year classes/students. \n\nIn order that the choice of story and scripts can be well prepared and ready at the start of the fall term, the roster needs to be decided in the spring.\n\nCOMMERCIALS (.02): \nThis course explores the art and business of directing commercials and examines some of the ways that film and advertising intersect and cross-pollinate.  Each student will write and direct one 30-second spec commercial.  Through the prism of this very short format, directors will be asked to define their voice and point of view and learn to express themselves succinctly. With the focus on each student's particular assets and interests as filmmakers, the course explores short, medium and long-term career strategies.\n\n      less description for GFMTV-GT 2247 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2248",
            "course_name": "",
            "description": "GFMTV-GT 2248\n\n   Documentary Project\n\nIn this class, through lecture and exercises, students study the styles, tools and skills associated with documentary filmmaking, and discover how they are useful for all storytelling forms.  The course is for students who are considering making a documentary for their thesis or want to make docs in the future, and also benefits those who are writing or considering creating narrative in a documentary style.  The first semester covers conceiving of and preparing a documentary for the thesis table readings and for fundraising, as well as how/what grants to apply for and how to pitch a doc with a...\n\n      more description for GFMTV-GT 2248 »\n\n      \n\n\n\nIn this class, through lecture and exercises, students study the styles, tools and skills associated with documentary filmmaking, and discover how they are useful for all storytelling forms.  The course is for students who are considering making a documentary for their thesis or want to make docs in the future, and also benefits those who are writing or considering creating narrative in a documentary style.  The first semester covers conceiving of and preparing a documentary for the thesis table readings and for fundraising, as well as how/what grants to apply for and how to pitch a doc with a trailer.\n\nAnyone who would like to present a documentary at the thesis presentation in November should discuss it with the Instructor the previous spring before they register for this fall class.  \n\nSince the thesis presentation will involve a trailer of some kind, it is important that students shoot something over the summer if it is not easily accessible from New York.\n\n      less description for GFMTV-GT 2248 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2255",
            "course_name": "Thesis Production",
            "description": "GFMTV-GT 2255 Thesis Production \nDESCRIPTION Forthcoming",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2256",
            "course_name": "Television Writing & Series Development",
            "description": "GFMTV-GT 2256 Television Writing & Series Development \nThe goal of this course is the development of a concept, treatment and pilot for a half or full hour, episodic or serialized television series.  If this is developed for a potential thesis, students will prepare a presentation of the project for faculty evaluation during the term, including the treatment and a 12-minute table reading of excerpted scenes.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2264",
            "course_name": "Non-Linear Editing",
            "description": "GFMTV-GT 2264 Non-Linear Editing",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2269",
            "course_name": "Avid Media Composer",
            "description": "GFMTV-GT 2269 Avid Media Composer \nThis course is designed to give a thorough understanding of film and video post-production using the Avid Media Composer. By the end of the course, students will be able to confidently plan and finish a project digitally. The class has two components: lectures, in which concepts and procedures are discussed and demonstrated, and lab sessions in which students receive hands-on practice while completing a collaborative project using footage and music of their choice.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2270",
            "course_name": "Protools Sound Mixing",
            "description": "GFMTV-GT 2270 Protools Sound Mixing \nThis course is designed to give students hands-on experience in sound editing and mixing using Pro Tools. Concepts in dialogue, music and effects editing will be thoroughly explored with particular emphasis on integrating these elements into a final mixed soundtrack. Through class demonstrations and work outside the classroom, students will familiarize themselves with the editing program and its mixing interface and apply the lessons directly to their own projects. By the end of the term they will have produced a professional sound track.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2272",
            "course_name": "Plot Analysis",
            "description": "GFMTV-GT 2272 Plot Analysis",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2273",
            "course_name": "Aesthetics Workshop",
            "description": "GFMTV-GT 2273 Aesthetics Workshop",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2275",
            "course_name": "Sound and Picture Finishing",
            "description": "GFMTV-GT 2275 Sound and Picture Finishing",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2281",
            "course_name": "",
            "description": "GFMTV-GT 2281\n\n   Feature Budgeting\n\nThe course is designed to provide the student with the skills, tools and \nknowledge to prepare a professional budget for the making of a dramatic feature film through to the delivery of the film with all the delivery elements to the distributor. \nFeature budgets are prepared after the script is finalized, broken down and scheduled \non Film Scheduling Software. Once one has a script and full production schedule the \nprocess of budgeting for the length of the schedule and all the specific elements \nrequired for the production can be initiated. The course will begin with an analysis of\nthe schedu...\n\n      more description for GFMTV-GT 2281 »\n\n      \n\n\n\nThe course is designed to provide the student with the skills, tools and \nknowledge to prepare a professional budget for the making of a dramatic feature film through to the delivery of the film with all the delivery elements to the distributor. \nFeature budgets are prepared after the script is finalized, broken down and scheduled \non Film Scheduling Software. Once one has a script and full production schedule the \nprocess of budgeting for the length of the schedule and all the specific elements \nrequired for the production can be initiated. The course will begin with an analysis of\nthe schedule for a feature project and the initial budget setup and proceed until the \nstudent has prepared-both a budget for a full union shoot and a lower budget for a non» \nunion shoot for the same protect. Competency in Feature Film Budgeting is a \nnecessary skill for Producers, Production Company executives, Production Managers \nand Line Producers. Films are not financed until a full and detailed budget is prepared\nfor which the course will provide the knowledge to accomplish.\n\n      less description for GFMTV-GT 2281 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2283",
            "course_name": "",
            "description": "GFMTV-GT 2283\n\n   Feature Film Packaging Workshop\n\nTo secure financing for an independent feature film, filmmakers assemble a package for potential financiers that provides an introduction to the project and answers key questions about the film: how it will be realized, who are the members of the creative team, how much it will cost and what are its possibilities in the marketplace\n\nThe workshop is a practicum intended for students ready to enter the marketplace with a completed screenplay, and an opportunity to put into practice the concepts presented in the second year PRODUCING THE INDEPENDENT FEATURE class.\n\nPermission of the instructor is...\n\n      more description for GFMTV-GT 2283 »\n\n      \n\n\n\nTo secure financing for an independent feature film, filmmakers assemble a package for potential financiers that provides an introduction to the project and answers key questions about the film: how it will be realized, who are the members of the creative team, how much it will cost and what are its possibilities in the marketplace\n\nThe workshop is a practicum intended for students ready to enter the marketplace with a completed screenplay, and an opportunity to put into practice the concepts presented in the second year PRODUCING THE INDEPENDENT FEATURE class.\n\nPermission of the instructor is required for all participants in the class.\n\n      less description for GFMTV-GT 2283 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2284",
            "course_name": "Film from The Inter- National Perspective",
            "description": "GFMTV-GT 2284 Film from The Inter- National Perspective \nDESCRIPTION Forthcoming",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2285",
            "course_name": "",
            "description": "GFMTV-GT 2285\n\n   Structure and Management of An Ind Film Company\n\nThis course is an in depth exploration of the process of optioning rights to literary material and developing material into fundable narrative feature films. The course will examine successful case studies to illustrate the role of the producer, writer and director throughout the process.  The Development Phase also includes assembling the elements required to secure financing, and case studies will examine those steps as well.\n\nThe second half of the course is devoted to production, marketing and distribution of feature films. The class will examine distribution and marketing strategies with ...\n\n      more description for GFMTV-GT 2285 »\n\n      \n\n\n\nThis course is an in depth exploration of the process of optioning rights to literary material and developing material into fundable narrative feature films. The course will examine successful case studies to illustrate the role of the producer, writer and director throughout the process.  The Development Phase also includes assembling the elements required to secure financing, and case studies will examine those steps as well.\n\nThe second half of the course is devoted to production, marketing and distribution of feature films. The class will examine distribution and marketing strategies with an emphasis on case studies to illustrate principles, and review what materials need to be assembled during production to make sure all the distributor promotional needs are met.\n\n      less description for GFMTV-GT 2285 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2293",
            "course_name": "Rough Cut Documentary Review",
            "description": "GFMTV-GT 2293 Rough Cut Documentary Review",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2294",
            "course_name": "",
            "description": "GFMTV-GT 2294\n\n   Cinematography for Directors\n\nIn today?s motion picture industry, the more knowledgeable a director is about cinematography, the better a director he or she will be. This class will be examination of camera placement, camera movement, lens selection, and photographic storytelling styles. We will examine ways to use the camera to support the narrative of the script In today?s motion picture industry, the more knowledgeable a director is about cinematography, the better a director he or she will be. This class will be examination of camera placement, camera movement, lens selection, and photographic storytelling styles. We w...\n\n      more description for GFMTV-GT 2294 »\n\n      \n\n\n\nIn today?s motion picture industry, the more knowledgeable a director is about cinematography, the better a director he or she will be. This class will be examination of camera placement, camera movement, lens selection, and photographic storytelling styles. We will examine ways to use the camera to support the narrative of the script In today?s motion picture industry, the more knowledgeable a director is about cinematography, the better a director he or she will be. This class will be examination of camera placement, camera movement, lens selection, and photographic storytelling styles. We will examine ways to use the camera to support the narrative of the script by bringing the camera into the scene, rather than simply using it to photograph the actors. Active camera demonstrations and clips from feature films will be used extensively.\n\n      less description for GFMTV-GT 2294 «",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2295",
            "course_name": "Electronic Cinemato- Graphy",
            "description": "GFMTV-GT 2295 Electronic Cinemato- Graphy \nDESCRIPTION Forthcoming",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2296",
            "course_name": "Advanced Cinematography:",
            "description": "GFMTV-GT 2296 Advanced Cinematography: \nThis DP Practicum is designed for directors of photography interested in shooting projects created in the Graduate Film Directing Projects series, which in the fall include the Television Series Production class and the TV Commercials Production class.\n\nAll students work as a Director Of Photography on a production.",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2307",
            "course_name": "Production Management Fo Non-Majors",
            "description": "GFMTV-GT 2307 Production Management Fo Non-Majors",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2334",
            "course_name": "Introduction to Film Production Management",
            "description": "GFMTV-GT 2334 Introduction to Film Production Management",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2335",
            "course_name": "Writ Prop & Grants Film",
            "description": "GFMTV-GT 2335 Writ Prop & Grants Film",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2336",
            "course_name": "Collaborative",
            "description": "GFMTV-GT 2336 Collaborative",
            "offering": false
        },
        {
            "course_id": "GFMTV-GT 2337",
            "course_name": "Internship",
            "description": "GFMTV-GT 2337 Internship",
            "offering": false
        }
    ]
}