{
    "major_id": "GCOM1-GC",
    "file": "./2015-2016/Graphic_Communications_(GCOM1-GC).html",
    "courses": [
        {
            "course_id": "GCOM1-GC 1000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2819",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Management",
            "description": "GCOM1-GC 1000 Management \nThis is an intensive study of effective management theories and practice in graphic communications media. This course emphasizes the accomplishments, results and areas of concern that managers confront. Topics include: organizational theory; leadership evaluation; development; and planning.  The principles of effective management and marketing strategies are also applied to actual problems in the operation of business enterprises specific to the graphic communications media industry. Case studies will be utilized in this course.",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 1010",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2820",
                    "section": "301",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Executive Leadership",
            "description": "GCOM1-GC 1010 Executive Leadership \nExecutive leadership in the graphic communications industry will be studied. Topics include: theories of executive leadership; strategic decision models; visionary and inspirational models; and the role of leadership in building culture. Case studies specific to the graphic communications industry will be analyzed.",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 1030",
            "course_name": "Technologies",
            "description": "GCOM1-GC 1030 Technologies \nThe course surveys the principal technologies for creating and distributing text and images in printed and digital form. Areas of study include e-paper and e-ink; e-reading devices; mobile marketing; QR codes; near field communications (NFC); blogging; social media; augmented reality; and conventional, digital, and 3D printing. Examined in detail are the applications of these technologies to personalized, 1-to-1 marketing; book, magazine, and newspaper publishing; branding and brand management; and branded packaging.",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 1035",
            "course_name": "Financial Management",
            "description": "GCOM1-GC 1035 Financial Management \nExamines strategic financial concepts, methods and analysis for use by innovative strategic managers and leaders in graphic communications. Topics include theory, tools, and applications specific to this dynamic industry. An overall understanding of successful financial models in graphic communications companies will be examined to provide financial vision for the future.  Case studies will be utilized in this course.",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 1040",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2810",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GCOM1-GC 1040\n\n   Managing the Media Mix\n\nPrepares students to learn how to navigate today’s complex media choices and formulate an integrated approach. What are today’s media choices?  How do you select the best media for each situation? How is media interdependent?  How do you allocate dollars?  What are the market trends?  How is the role of print changing? There are two givens:  no two companies should have the same media mix and no one company should use the same media plan two years in a row. The current media landscape is very complex. There are more media choices than ever and plans have to remain fluid to take advantage of op...\n\n      more description for GCOM1-GC 1040 »\n\n      \n\n\n\nPrepares students to learn how to navigate today’s complex media choices and formulate an integrated approach. What are today’s media choices?  How do you select the best media for each situation? How is media interdependent?  How do you allocate dollars?  What are the market trends?  How is the role of print changing? There are two givens:  no two companies should have the same media mix and no one company should use the same media plan two years in a row. The current media landscape is very complex. There are more media choices than ever and plans have to remain fluid to take advantage of opportunities.\nThis course explains all forms of media and their pros and cons. It shows how media determinations should utilize demographic, geographic and psychographic profiles. It explores and reviews current media choices of advertisers, large and small.  New and traditional media pairings are explored as well as the methods of driving media from one to another.  This course provides the necessary dashboard for today’s media decision makers.\n\n      less description for GCOM1-GC 1040 «",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 1900",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2811",
                    "section": "301",
                    "period": "09/12/2015 - 12/19/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Capstone Project",
            "description": "GCOM1-GC 1900 Capstone Project \nThe Culminating Experience project provides an opportunity for students to apply their knowledge and skills (gained in the program and through work experience) under faculty guidance and within an approved framework. The culminating experience project is the final advanced project of the master’s degree program, which allows intensive exploration of an area within graphic communications media.",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 1905",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2812",
                    "section": "201",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research Methods",
            "description": "GCOM1-GC 1905 Research Methods \nLearn research methods and applications specific to graphic communications and integrated media, to prepare for the Capstone Project (Culminating Experience), graduate coursework and industry research opportunities.",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 2370",
            "course_name": "Prague and Beyond: Secutiry and Transition in Central Europe",
            "description": "GCOM1-GC 2370 Prague and Beyond: Secutiry and Transition in Central Europe",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 2590",
            "course_name": "Waging Non-Violent Conflict: A Pratical Workshop",
            "description": "GCOM1-GC 2590 Waging Non-Violent Conflict: A Pratical Workshop",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 3000",
            "course_name": "",
            "description": "GCOM1-GC 3000\n\n   Operations Management in Graphic Communications\n\nShows students how to manage the operation of a graphic communications media company. The course provides an in-depth analysis of the systems and management procedures and organizational techniques necessary for the effective management of operations. Topics include system approach and operations estimating and cost center development, inventory control, production planning purchasing management, quality, human input management and the establishment of maintenance, health and safety programs. The course had an emphasis on the theory of operations management as well as its practical application...\n\n      more description for GCOM1-GC 3000 »\n\n      \n\n\n\nShows students how to manage the operation of a graphic communications media company. The course provides an in-depth analysis of the systems and management procedures and organizational techniques necessary for the effective management of operations. Topics include system approach and operations estimating and cost center development, inventory control, production planning purchasing management, quality, human input management and the establishment of maintenance, health and safety programs. The course had an emphasis on the theory of operations management as well as its practical applications.\n\n      less description for GCOM1-GC 3000 «",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 3010",
            "course_name": "Quality Management in Graphic Communications",
            "description": "GCOM1-GC 3010 Quality Management in Graphic Communications \nOffers a graphic communications manager an in-depth analysis of quality management in graphic communications. Provides a definitive and professional understanding of how principles relate to various forms in integrated media communication. Topics include management of typography, art preparation, photography, color, ink, prepress and press proofing (virtual and hard proofing), production including variable-data/on demand, litho and other processes, binding and finishing. Quality management includes integration of print, web and multimedia.",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 3015",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2813",
                    "section": "001",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Pro Sem: Entrepreneurial Thinking",
            "description": "GCOM1-GC 3015 Pro Sem: Entrepreneurial Thinking \nOffers a dynamic study of entrepreneurial thinking and how it applies to successful ventures and alliances in the graphic communications industry. Topics include: conception, start-up, growth stage, managing resources and long-range planning.",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 3035",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17706",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GCOM1-GC 3035\n\n   Buying and Selling\n\nStudents will focus on the purchasing and sales relationships in graphic communications media. The course centers on such buying topics as training and compensation, the place of quality, service and cost, the team concept of buyer and seller, how to select a vendor and the buyer’s open-door policy. The sales focus is on the selling of print and digital media. The relationship between the salesperson and the buyer will be discussed, as well as methods and procedures to create sales success for both vendors and clients. Students will learn strategies to improve presentations in both buying and ...\n\n      more description for GCOM1-GC 3035 »\n\n      \n\n\n\nStudents will focus on the purchasing and sales relationships in graphic communications media. The course centers on such buying topics as training and compensation, the place of quality, service and cost, the team concept of buyer and seller, how to select a vendor and the buyer’s open-door policy. The sales focus is on the selling of print and digital media. The relationship between the salesperson and the buyer will be discussed, as well as methods and procedures to create sales success for both vendors and clients. Students will learn strategies to improve presentations in both buying and selling.\n\n      less description for GCOM1-GC 3035 «",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 3050",
            "course_name": "Graphic Communications: Design & Persuasion",
            "description": "GCOM1-GC 3050 Graphic Communications: Design & Persuasion \nTeaches students the marketing principles, procedures and processes involved in graphic communications. Topics include: image communication, principles of design and persuasion, use of light and color, typography and layout, photography and digital imaging, workflow and the preparation of data for production in various forms of integrated graphic media.",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 3225",
            "course_name": "Graph Comm Initiatives: Concept Thru Execution",
            "description": "GCOM1-GC 3225 Graph Comm Initiatives: Concept Thru Execution \nThis course empowers students to understand and focus on the workflow process from creative concept through execution in a variety of projects in graphic communications management. Class projects include the development of advertising and promotional campaigns in print, web and multimedia.",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 3235",
            "course_name": "Building a Brand",
            "description": "GCOM1-GC 3235 Building a Brand \nVarious multimedia software presentation packaging will be applied to building a brand and communicating compelling visual identity for various organizations. Special attention will be given to creating consistent branding and visual identity in all forms of graphic presentation media.",
            "offering": false
        },
        {
            "course_id": "GCOM1-GC 3900",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2814",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "GCOM1-GC 3900\n\n   Independent Study\n\nIndependent Study requires a minimum of 45 hours of work per credit. Independent Study provides the opportunity for specialized and individualized activities that augment a student's program of study. Students may choose to do academic research or may choose to do an internship.\n\nInternships require a minimum of 45 hours of work per credit. Students will seek internship opportunities in the dynamic field of graphic communications. Internships provide the opportunity for specialized and individualized activities that augment a student's program of study. The independent study experience may p...\n\n      more description for GCOM1-GC 3900 »\n\n      \n\n\n\nIndependent Study requires a minimum of 45 hours of work per credit. Independent Study provides the opportunity for specialized and individualized activities that augment a student's program of study. Students may choose to do academic research or may choose to do an internship.\n\nInternships require a minimum of 45 hours of work per credit. Students will seek internship opportunities in the dynamic field of graphic communications. Internships provide the opportunity for specialized and individualized activities that augment a student's program of study. The independent study experience may provide domestic as well as international opportunities for students.\n\n      less description for GCOM1-GC 3900 «",
            "offering": true
        },
        {
            "course_id": "GCOM1-GC 3905",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2815",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "2816",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "2817",
                    "section": "003",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "2818",
                    "section": "004",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "2923",
                    "section": "005",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Emerging Topics in GC:TBA",
            "description": "GCOM1-GC 3905 Emerging Topics in GC:TBA \nThis seminar will enhance curriculum by identification, analysis and application of advanced emerging topics pertinent to this degree.  The specific titles and content of each seminar will change to reflect the emerging topic areas of interest which can only be determined at the time of offering.",
            "offering": true
        }
    ]
}