{
    "major_id": "HEAL1-UC",
    "file": "./2015-2016/Healthcare_Management_(HEAL1-UC).html",
    "courses": [
        {
            "course_id": "HEAL1-UC 1971",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "9739",
                    "section": "001",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Blake, Carmelita",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "HEAL1-UC 1971 Independent Study \nIndependent study is designed to allow students to pursue specialized interests that are not addressed in existing courses within the curriculum’s framework . Independent study is self-directed, but students are required to work closely with a faculty mentor who guides and evaluates their work.",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2561",
            "course_name": "Health Advocacy: Patient & Family Rights",
            "description": "HEAL1-UC 2561 Health Advocacy: Patient & Family Rights \n(formerly Foundations of Healthcare Consumer Advocacy) Provides a framework for understanding the legal rights of patients and families and skills for effectively negotiating the healthcare system. Topics include: the history of the patient's bill of rights; the rights of family surrogates, JCAHO/ NYDOH standards and regulations; culture of care giving; conflict/complaint resolution; mediating bio-ethical issues; patient/physician relationships; and the liaison role of healthcare consumer advocates.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2601",
            "course_name": "Community Health",
            "description": "HEAL1-UC 2601 Community Health \nThis survey course considers the role and purpose of community health in the changing healthcare environment. Specific areas of study include assessing community needs, identifying health promotion initiatives as an extension of psychological, social, and medical care needs of health and disease, and epidemiology.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2603",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9741",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "SILV 518",
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Fraser, Lesmah"
                }
            ],
            "course_name": "Foundations of Healthcare Management",
            "description": "HEAL1-UC 2603 Foundations of Healthcare Management \nAn interdisciplinary course that focuses on issues and techniques in healthcare delivery for a variety of healthcare majors. Topics include the healthcare delivery system; medical terminology; interpersonal communications; medical-legal issues; patient assessment; and critical thinking as it relates to patient care, infection control, and Occupational Safety and Health Administration standards.",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2605",
            "course_name": "Customer Service Mgmt in Healthcare Organizations",
            "description": "HEAL1-UC 2605 Customer Service Mgmt in Healthcare Organizations \nCustomer satisfaction has become one of the approaches used to manage competition in the health care industry. This course examines how to understand customer expectations , use effective communication and conflict management when dissatisfaction occurs, and the strategies used to measure, evaluate and improve customer satisfaction.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2606",
            "course_name": "Complementary Healthcare Issues",
            "description": "HEAL1-UC 2606 Complementary Healthcare Issues \nComplementary (alternative) medicine has had tremendous growth in the last few years and is being added to the traditional healthcare treatment modality. Topics focus on an historical overview of complementary medicine and complementary therapies. These therapies include homeopathy, herbal formulas, natural products as preventive and treatment agents, acupuncture, meditation, and biofeedback.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2608",
            "course_name": "Multicultural Issues in Healthcare",
            "description": "HEAL1-UC 2608 Multicultural Issues in Healthcare \nDesigned to recognize and to respect cultural differences and to augment the professionals' sensitivity to some of the many ways an understanding of cultural, class, and ethnic differences affect health-centered encounters. The course focuses on those areas of healthcare (pain, staff relations, dietary practices, death and dying, and mental health) where cultural differences create conflicts and misunderstandings that often result in the provision of less than optimal medical care.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2610",
            "course_name": "",
            "description": "HEAL1-UC 2610\n\n   Computer Applications in Healthcare Organizations\n\nThe delivery of health services has become an information intensive process, and is at the core of most health services professionals' activities . Computers are being used to document patient care, assist in the diagnosis and management of a variety of health conditions, measure clinical outcomes to improve quality of care, and in administrative and financial management decisions.\n\nThis course provides students with knowledge to assist them in understanding the design, evaluation, selection, and utilization of computer applications in health care to support high quality patient care and man...\n\n      more description for HEAL1-UC 2610 »\n\n      \n\n\n\nThe delivery of health services has become an information intensive process, and is at the core of most health services professionals' activities . Computers are being used to document patient care, assist in the diagnosis and management of a variety of health conditions, measure clinical outcomes to improve quality of care, and in administrative and financial management decisions.\n\nThis course provides students with knowledge to assist them in understanding the design, evaluation, selection, and utilization of computer applications in health care to support high quality patient care and management decisions. The need to understand the ethical and legal responsibilities of managers as health information is collected, stored, retrieved and analyzed in this rapidly increasing integration of computer application in health care will also be included.\n\n      less description for HEAL1-UC 2610 «",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2611",
            "course_name": "Managing Ambulatory & Community Based Healthcare Organizations",
            "description": "HEAL1-UC 2611 Managing Ambulatory & Community Based Healthcare Organizations \nThe varied settings for ambulatory care delivery and the growth of these services has been a direct result of a shift in the balance between in patient and outpatient services. Other trends in the health care environment have also increased the number and variety of private practice settings. Discussions will focus on reasons for the growth of ambulatory services, types of ambulatory and private practice settings, and the management of these settings.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2612",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9740",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "194M 206",
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Lombardi, Linda"
                }
            ],
            "course_name": "Management of Healthcare Delivery Systems",
            "description": "HEAL1-UC 2612 Management of Healthcare Delivery Systems \n(Formerly Health Services Management) As the reshaped American healthcare system shifts to preventive medicine and embraces managed care concepts, there is an on-going struggle to create a cost effective system without eroding the high standard of quality care that has been set. In this foundation course, students study the organization and structure of our healthcare system and options that pave the way for the emerging one. Merging theoretical constructs and practical application, students develop an understanding of the healthcare workplace and their place in it.",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2643",
            "course_name": "Public Health Issues",
            "description": "HEAL1-UC 2643 Public Health Issues",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2650",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9745",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Perez, Maria",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HEAL1-UC 2650\n\n   Nursing Home/Long Term Care Administration\n\nhis course provides a framework for acquiring knowledge about the role and responsibilities and accountability of a nursing home administrator and an overview of long term care settings including adult day care, community based outreach services, senior housing, short term rehabilitation programs, sub acute care, assisted living and hospice care.  The domains of practice established by the American College of Health Care Administrators, organizational management, and general management, resident care oversight, overview of human resource management, laws and regulatory codes, marketing, financ...\n\n      more description for HEAL1-UC 2650 »\n\n      \n\n\n\nhis course provides a framework for acquiring knowledge about the role and responsibilities and accountability of a nursing home administrator and an overview of long term care settings including adult day care, community based outreach services, senior housing, short term rehabilitation programs, sub acute care, assisted living and hospice care.  The domains of practice established by the American College of Health Care Administrators, organizational management, and general management, resident care oversight, overview of human resource management, laws and regulatory codes, marketing, financing,  and regulatory management of long term care facilities will be included in the content.\n\n      less description for HEAL1-UC 2650 «",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2670",
            "course_name": "Legal Aspects of Healthcare",
            "description": "HEAL1-UC 2670 Legal Aspects of Healthcare \n(Formerly Medical Law and Ethics) Many decisions that healthcare professionals must make each day are affected by legal principles and have potential legal consequences. Because the law is in a constant state of flux, healthcare management students must possess a basic knowledge of the law as it applies to their areas of responsibility. This course provides a working knowledge of health law and a background on a wide variety of healthcare topics, enabling students to deal with common legal and practical problems facing the healthcare industry.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2671",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9742",
                    "section": "001",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Blake, Carmelita",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "HEAL1-UC 2671\n\n   Internship in Health Services Management I\n\nDesigned for advanced students in the B.S. in Healthcare Management. The internship provides an opportunity for students to use knowledge of healthcare delivery, sciences, and the liberal arts combined with the knowledge provided by professionals and fieldwork supervisors in a variety of healthcare settings to enhance their professional development. Students are required to complete a minimum of 50 hours each semester to earn 2 Credits . In addition, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final summary report. Day placements only; ...\n\n      more description for HEAL1-UC 2671 »\n\n      \n\n\n\nDesigned for advanced students in the B.S. in Healthcare Management. The internship provides an opportunity for students to use knowledge of healthcare delivery, sciences, and the liberal arts combined with the knowledge provided by professionals and fieldwork supervisors in a variety of healthcare settings to enhance their professional development. Students are required to complete a minimum of 50 hours each semester to earn 2 Credits . In addition, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final summary report. Day placements only; no evening or weekend hours.\n\n      less description for HEAL1-UC 2671 «",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2672",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9743",
                    "section": "001",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Blake, Carmelita",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship in Health Services Management II",
            "description": "HEAL1-UC 2672 Internship in Health Services Management II \nSee description for Internship in Health Services I.",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2673",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9744",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Pete, Lauren",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Financial Management of Health Services",
            "description": "HEAL1-UC 2673 Financial Management of Health Services \nThe practical applications of financial management concepts and frameworks as well as the conceptual foundations of financing healthcare in a dynamically changing environment are studied. This includes healthcare cost and reimbursement systems; insurance issues; the roles of budgeting and accounts; the multifunctionality of financial services within a healthcare institution; and the implications of future trends in healthcare financing.",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2674",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "10049",
                    "section": "100",
                    "period": "09/02/2015 - 09/09/2015",
                    "location": "TISC LC15 with Blake, Carmelita09/23/2015 - 09/23/2015 Wed 6.20 PM - 8.50 PM at TISC LC15 with Blake, Carmelita10/07/2015 - 10/07/2015 Wed 6.20 PM - 8.50 PM at TISC LC15 with Blake, Carmelita10/28/2015 - 10/28/2015 Wed 6.20 PM - 8.50 PM at TISC LC15 with Blake, Carmelita11/18/2015 - 11/18/2015 Wed 6.20 PM - 8.50 PM at TISC LC15 with Blake, Carmelita12/09/2015 - 12/16/2015 Wed 6.20 PM - 8.50 PM at TISC LC15 with Blake, Carmelita09/02/2015 - 12/22/2015  at ONLI ",
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Blake, Carmelita"
                }
            ],
            "course_name": "Senior Project: Seminar Healthcare Management",
            "description": "HEAL1-UC 2674 Senior Project: Seminar Healthcare Management \nPolicy changes and the changing needs of society make it essential that health services managers develop an awareness of how these factors affect the healthcare industry. Presented by faculty and guest speakers, this course provides an analysis of current policy issues in healthcare delivery. The course explores issues such as financing healthcare, recently enacted and proposed legislation, management issues, and future trends in organizational behavior.",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2676",
            "course_name": "Tpcs in Healthcare Mgt:",
            "description": "HEAL1-UC 2676 Tpcs in Healthcare Mgt: \nEach semester that this course is offered it will explore a different topic in health care management as it applies to health care. Recent issues such as patient safety,. health communication, complementary/alternative medicine, health policy, healthcare technology and delivery systems, healthcare risk management, professional ethics, and the politics of healthcare will be discussed.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2678",
            "course_name": "",
            "description": "HEAL1-UC 2678\n\n   Issues in Aging: Gerontology\n\nThe primary sources for understanding the baby boomer generation of older adults will require knowledge about the deteriorative changes during the adult period of life and how these changes can affect the individual?s ability to survive. This course will include issues affecting the older adult: human aging as a global experience; theories of aging; physical and psychological aspects of aging; disease conditions associated with the aging process; environmental, economic, political, and sociological issues affecting older adults; ethical considerations, and end of life care needs (death and dyi...\n\n      more description for HEAL1-UC 2678 »\n\n      \n\n\n\nThe primary sources for understanding the baby boomer generation of older adults will require knowledge about the deteriorative changes during the adult period of life and how these changes can affect the individual?s ability to survive. This course will include issues affecting the older adult: human aging as a global experience; theories of aging; physical and psychological aspects of aging; disease conditions associated with the aging process; environmental, economic, political, and sociological issues affecting older adults; ethical considerations, and end of life care needs (death and dying).\n\n      less description for HEAL1-UC 2678 «",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2679",
            "course_name": "",
            "description": "HEAL1-UC 2679\n\n   Research Methods in Health Services\n\nResearch contributes to the development of health and human services professionals and the delivery of healthcare. This course provides an awareness of how different types of research are conducted, and a framework for attaining a high level of competency in conducting and reading health and human services related research. Elements of the research process-recognition of questions/problems that need to be researched, research methods and techniques, sampling procedures, selecting and developing data collection instruments, data collection, and data analysis-are discussed. Students are guided t...\n\n      more description for HEAL1-UC 2679 »\n\n      \n\n\n\nResearch contributes to the development of health and human services professionals and the delivery of healthcare. This course provides an awareness of how different types of research are conducted, and a framework for attaining a high level of competency in conducting and reading health and human services related research. Elements of the research process-recognition of questions/problems that need to be researched, research methods and techniques, sampling procedures, selecting and developing data collection instruments, data collection, and data analysis-are discussed. Students are guided through an investigation in an area of interest.\n\n      less description for HEAL1-UC 2679 «",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2682",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17057",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "SILV 515",
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Schnall, Susan"
                }
            ],
            "course_name": "",
            "description": "HEAL1-UC 2682\n\n   Quality & Patient Safety in Healthcare\n\nAs the emphasis on performance improvement by regulators and consumers increases, the need for continuous management becomes a primary concern for all healthcare providers. This course introduces students to theories of quality management, approaches in performance improvement, and the application of continuous quality improvement/total quality management principles to the delivery of care. The course includes content on benchmarking, change management, clinical pathways, practice guidelines, and CQI/TQM  tools and approaches used in decision-making related to improvement in the outcome of car...\n\n      more description for HEAL1-UC 2682 »\n\n      \n\n\n\nAs the emphasis on performance improvement by regulators and consumers increases, the need for continuous management becomes a primary concern for all healthcare providers. This course introduces students to theories of quality management, approaches in performance improvement, and the application of continuous quality improvement/total quality management principles to the delivery of care. The course includes content on benchmarking, change management, clinical pathways, practice guidelines, and CQI/TQM  tools and approaches used in decision-making related to improvement in the outcome of care.\n\n      less description for HEAL1-UC 2682 «",
            "offering": true
        },
        {
            "course_id": "HEAL1-UC 2690",
            "course_name": "International Health Issues",
            "description": "HEAL1-UC 2690 International Health Issues",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 2849",
            "course_name": "Behavioral Health: Mental Health Issues of Children and Adults",
            "description": "HEAL1-UC 2849 Behavioral Health: Mental Health Issues of Children and Adults \nMental illness among adults and children has become a serious public health problem in the United States. Selected topics for discussion include a comparative analysis of the US mental health system and other nations, socioeconomic/cultural/regional influences on mental health, legislation affecting mental health, and treatment modalities in mental health.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 3245",
            "course_name": "Anatomy & Physiology for Allied Health",
            "description": "HEAL1-UC 3245 Anatomy & Physiology for Allied Health \nThis course is a study of human anatomy and physiology, including all systems of the body, designed for students entering an Allied Health program. It details the anatomy and physiology of the integumentary, skeletal, joint, muscular, and nervous systems. The course requires internet access.",
            "offering": false
        },
        {
            "course_id": "HEAL1-UC 6474",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17393",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "SILV 404",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Sadler, Rufus"
                }
            ],
            "course_name": "Managerial Ethical Issues in Healthcare",
            "description": "HEAL1-UC 6474 Managerial Ethical Issues in Healthcare \nThe complex interaction of ethical commitments on both personal and professional levels imposes significant decision-making obligations on managers, administrators, and staff in the workplace. In addition to ethical elements found in the work environment, individuals carry their own values, morals, and ethics. In a seminar format using case studies, students explore a cross section of current ethical issues. Students have the opportunity to examine diverse ethical theories and reflect on how they may apply these principles in their organizational and personal lives.",
            "offering": true
        }
    ]
}