{
    "major_id": "HIST-AD",
    "file": "./2015-2016/History_(HIST-AD).html",
    "courses": [
        {
            "course_id": "HIST-AD 50",
            "course_name": "Global Histories",
            "description": "HIST-AD   50 Global Histories",
            "offering": false
        },
        {
            "course_id": "HIST-AD 50",
            "course_name": "B Global Histories - Part B",
            "description": "HIST-AD   50B Global Histories - Part B",
            "offering": false
        },
        {
            "course_id": "HIST-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19572",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Tue,Thu 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Swislocki, Mark"
                }
            ],
            "course_name": "Introduction to Global Histories",
            "description": "HIST-AD  101 Introduction to Global Histories \nWhat is global history?  How does it differ from world history? International history? Transnational history? And why has writing global histories become a new intellectual imperative for historians today? This gateway course for the history program provides students with skills to answer these questions. It challenges them to examine when categories like the nation and civilization enhance or inhibit historical understanding, and to consider alternatives to identifying meaningful units of place and space for historical inquiry. \nRecommended for declared history majors during sophomore year.",
            "offering": true
        },
        {
            "course_id": "HIST-AD 102",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12796",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 003",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Minsky, Amir"
                }
            ],
            "course_name": "Theory and Practice of History",
            "description": "HIST-AD  102 Theory and Practice of History \nWhat is history? This course offers an introduction to theories and practices of history. Students engage with a wide array of sources (written documents, material artifacts, oral histories, and visual culture), are introduced to methods of archival research, and learn to critically assess the influence of such elements as narrative, rhetoric, underlying interests and perspective on the reliability of historical accounts.  Recommended for declared history majors during junior year.",
            "offering": true
        },
        {
            "course_id": "HIST-AD 110",
            "course_name": "Global Cold War",
            "description": "HIST-AD  110 Global Cold War \nThe subject is the Cold War as global conflict. The course focuses on Europe and the Global South, as well as on the United States and the Soviet Union. It examines issues in international politics and diplomacy, nuclear rivalry and the culture of the bomb, Cold War economic competition and development policies, and the impact of the Cold War on culture and gender in various countries.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 111",
            "course_name": "",
            "description": "HIST-AD  111\n\n   Global Environmental History\n\nWhat are the major causes of deforestation, pollution, and climate change?  When and where did these, and other pressing environmental concerns, have their origins?  What can history teach us about how we might best address these issues in the present?  This course offers a comprehensive overview of the world’s environmental history with a focus on the period from 1500 C.E. to the present – a time marked by a dramatic intensification in the use of land, water, and energy resources.  The course’s central goal is to understand the relationships between globalization, natural resource and energy ...\n\n      more description for HIST-AD  111 »\n\n      \n\n\n\nWhat are the major causes of deforestation, pollution, and climate change?  When and where did these, and other pressing environmental concerns, have their origins?  What can history teach us about how we might best address these issues in the present?  This course offers a comprehensive overview of the world’s environmental history with a focus on the period from 1500 C.E. to the present – a time marked by a dramatic intensification in the use of land, water, and energy resources.  The course’s central goal is to understand the relationships between globalization, natural resource and energy use, and environmental change, and to explain how these relationships unfolded, and continue to unfold, differently in major world regions, including the Gulf.  By incorporating material from the fields of ecology, biology, geology, demography, economics, political science, and anthropology, this course also provides students with important historical grounding in the multidisciplinary field of global environmental studies.\n\n      less description for HIST-AD  111 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 112",
            "course_name": "",
            "description": "HIST-AD  112\n\n   Global History of Medicine\n\nWhat are the major causes of epidemics and pandemics including HIV/AIDS, Ebola, Malaria, Bubonic Plague, Cholera, Diabetes and Cancer?  When, where, and why did these diseases, among others, establish themselves in humans and spread?  What can history teach us about the most effective ways to reduce the number of lives that they claim?  This course explores the historical relationships between globalization, economic development, and public health and medicine.  It highlights important connections between the ways in which people understand the underlying causes of sickness – explanations that...\n\n      more description for HIST-AD  112 »\n\n      \n\n\n\nWhat are the major causes of epidemics and pandemics including HIV/AIDS, Ebola, Malaria, Bubonic Plague, Cholera, Diabetes and Cancer?  When, where, and why did these diseases, among others, establish themselves in humans and spread?  What can history teach us about the most effective ways to reduce the number of lives that they claim?  This course explores the historical relationships between globalization, economic development, and public health and medicine.  It highlights important connections between the ways in which people understand the underlying causes of sickness – explanations that are at once cultural and political – and the particular approaches to healing and disease prevention that they adopt.  Paying special attention to these dynamics in the global Gulf, students consider both biomedical approaches and those conventionally classified as “traditional” and “folk” medicine.\n\n      less description for HIST-AD  112 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 114",
            "course_name": "",
            "description": "HIST-AD  114\n\n   Global Sixties\n\nThis course explores the artistic and intellectual avant-gardes, counter-cultures and protest movements of the 1960s and the early 1970s from a global perspective, assessing their impact on individual identities, social and gender hierarchies, domestic politics and international relations during the Cold War. It traces the history of the various protest movements and explores a plethora of national experiences with respect to domestic and transnational networks of dissent as well as global imaginaries. Taking into account the aesthetics and performativity of protest, the course examines the ro...\n\n      more description for HIST-AD  114 »\n\n      \n\n\n\nThis course explores the artistic and intellectual avant-gardes, counter-cultures and protest movements of the 1960s and the early 1970s from a global perspective, assessing their impact on individual identities, social and gender hierarchies, domestic politics and international relations during the Cold War. It traces the history of the various protest movements and explores a plethora of national experiences with respect to domestic and transnational networks of dissent as well as global imaginaries. Taking into account the aesthetics and performativity of protest, the course examines the role of cultural practices, action repertoires, the media, visual representations, lifestyle and fashion, the politics of memory, and the impact of dissent on political decision-makers and society at large.\n\n      less description for HIST-AD  114 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 115",
            "course_name": "Topics in Global History",
            "description": "HIST-AD  115 Topics in Global History \nCourse topics may include: slavery; world history of science and technology; global history of women and gender; labor migrations; global revolutions; history of the modern city; empire and globalization; the industrial age; consumption and modernity; pirates and piracy in world history; opium; and others.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 116",
            "course_name": "Global Revolutions 1789-1989",
            "description": "HIST-AD  116 Global Revolutions 1789-1989 \nThe course explores the phenomenology, theory, and practice of revolution from the French Revolution to the fall of Soviet communism. It seeks to answer three fundamental questions: What are the underlying causes of revolution; how and why do revolutions migrate or undergo cultural translation; and to what extent have revolutions become the catalyst for societal (dis-/re-)organization in modernity. Students develop dexterities in close reading and interpretation of historical primary sources, as well as major theoretical works by Tocqueville, Marx, Lenin, Arendt, Fanon, and Khomeini.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 117",
            "course_name": "Urbanism and Modernity: Paris, Istanbul, Berlin",
            "description": "HIST-AD  117 Urbanism and Modernity: Paris, Istanbul, Berlin \nThis course explores the emergence of the “modern city” in three significant urban centers (Paris, Istanbul, Berlin) in relation to the demographic, economic, and political pressures of the nineteenth and twentieth centuries. Attention is given to the foundations of community, the changing uses of public space, the appearance of new strategies of urban planning, and the contested process of\ndefining the “modern” within a specific local culture.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 120",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19702",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Roth, Nadine"
                }
            ],
            "course_name": "",
            "description": "HIST-AD  120\n\n   World War II in Global Perspective\n\nThe Second World War was the most destructive in human history and has become a touchstone for historical understanding in the postwar period. This course seeks to examine not only the strategic decisions of major belligerent states (Germany, the Soviet Union, Japan, Britain and the United States), but also the transformative power of the war in societies across the globe. Course topics will include the experience of soldiers and civilians, the mobilization of populations within far-flung empires, the use of new weapons and occupation strategies, and the critical social and political consequen...\n\n      more description for HIST-AD  120 »\n\n      \n\n\n\nThe Second World War was the most destructive in human history and has become a touchstone for historical understanding in the postwar period. This course seeks to examine not only the strategic decisions of major belligerent states (Germany, the Soviet Union, Japan, Britain and the United States), but also the transformative power of the war in societies across the globe. Course topics will include the experience of soldiers and civilians, the mobilization of populations within far-flung empires, the use of new weapons and occupation strategies, and the critical social and political consequences of the war on populations across Europe, Asia, Africa, America and the Middle East.\n\n      less description for HIST-AD  120 «",
            "offering": true
        },
        {
            "course_id": "HIST-AD 124",
            "course_name": "X",
            "description": "HIST-AD  124X\n\n   Islam in the Indian Ocean World\n\nWhy do most of the world’s Muslims live in the Indian Ocean world – a region often referred to as the ‘cradle of globalization’?  How, specifically, did Islam spread in relation to the extension and intensification of agriculture and trade?  What diverse forms have Islamic ideas, institutions, practices, and subjectivities taken in this expansive world region?  What, additionally, is the relationship between Indian Ocean Muslims’ beliefs and practices and those of the followers of other religions, including Hinduism, Buddhism, and Christianity?  This course addresses these questions by engagin...\n\n      more description for HIST-AD  124X »\n\n      \n\n\n\nWhy do most of the world’s Muslims live in the Indian Ocean world – a region often referred to as the ‘cradle of globalization’?  How, specifically, did Islam spread in relation to the extension and intensification of agriculture and trade?  What diverse forms have Islamic ideas, institutions, practices, and subjectivities taken in this expansive world region?  What, additionally, is the relationship between Indian Ocean Muslims’ beliefs and practices and those of the followers of other religions, including Hinduism, Buddhism, and Christianity?  This course addresses these questions by engaging with cutting-edge scholarship from the fields of global, Indian Ocean, and Islamic history, as well as a wide variety of primary source materials.  Throughout, students also probe the relationship between power and the production of knowledge about Islam.\n\n      less description for HIST-AD  124X «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 127",
            "course_name": "X",
            "description": "HIST-AD  127X\n\n   South Asia in the Indian Ocean World\n\nThis course offers an opportunity for in-depth study of the history and culture of the South Asians who comprise the majority population of the UAE.  Situated at the center of the Indian Ocean world, the Indian subcontinent is currently home to over a billion people, and is the site of richly interconnected histories with regions around the wider Indian Ocean, including the Gulf.  The course explores these histories, with a focus on understanding major cultural, political, economic, and environmental connections and changes as they affected ordinary people (including migrant laborers) and shap...\n\n      more description for HIST-AD  127X »\n\n      \n\n\n\nThis course offers an opportunity for in-depth study of the history and culture of the South Asians who comprise the majority population of the UAE.  Situated at the center of the Indian Ocean world, the Indian subcontinent is currently home to over a billion people, and is the site of richly interconnected histories with regions around the wider Indian Ocean, including the Gulf.  The course explores these histories, with a focus on understanding major cultural, political, economic, and environmental connections and changes as they affected ordinary people (including migrant laborers) and shaped the nature of collective identities (ethnic, national, religious, caste, class, gender, regional, and linguistic) over time.  In developing an understanding of how collective identities were produced historically, students ultimately acquire valuable tools for appraising and navigating competing models of nationalism, cosmopolitanism, and universalism in the wider Indian Ocean world today.\n\n      less description for HIST-AD  127X «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 129",
            "course_name": "Topics in Indian Ocean History",
            "description": "HIST-AD  129 Topics in Indian Ocean History \nCourse topics may include: Southern Africa; trading networks of the Indian Ocean; colonialism, imperialism, and nationalism in the Middle East; the Portuguese seaborne empire; Iran past and present; Southeast Asia; and others.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 130",
            "course_name": "J",
            "description": "HIST-AD  130J\n\n   Islam in Africa\n\nDrawing on both secondary and primary sources, this course begins with an examination of the history of Islam in Africa, focusing primarily on developments in the western Sudan, al-Maghrib, and East Africa.  Introduced by merchant activity in the eighth century CE, Islam by the fifteenth century had become the religion of ruling elites throughout much of the western Sudan and along the East African littoral, where it was the foundation for a celebrated urban development.  A sustained period of Islamic reform ensued in the western Sudan from the seventeenth through the nineteenth centuries, cot...\n\n      more description for HIST-AD  130J »\n\n      \n\n\n\nDrawing on both secondary and primary sources, this course begins with an examination of the history of Islam in Africa, focusing primarily on developments in the western Sudan, al-Maghrib, and East Africa.  Introduced by merchant activity in the eighth century CE, Islam by the fifteenth century had become the religion of ruling elites throughout much of the western Sudan and along the East African littoral, where it was the foundation for a celebrated urban development.  A sustained period of Islamic reform ensued in the western Sudan from the seventeenth through the nineteenth centuries, coterminous with the transatlantic slave trade, whose end arguably stimulated slaving activity across the Sahara and Indian Ocean (activity that long antedates that of the Atlantic).  By means of these various trades and other mechanisms, many African Muslims were transported into the Americas as well as the Indian Ocean, and the course will follow their experiences as well as their legacies among African-descended populations, concluding with a consideration of their relationship, as well as that of Africa itself, to developments in the broader Muslim world up to the present day.\n\n      less description for HIST-AD  130J «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 131",
            "course_name": "",
            "description": "HIST-AD  131\n\n   Muslim Societies in African History\n\nThe objective of this course is to trace and understand the history of Islam as a religious tradition and Muslim societies in Africa as part of a larger world. This course surveys the history and historiography of Islam in Africa from its arrival in North Africa in the seventh century through the present day in postcolonial Africa while also paying attention to continuing points of contact and exchange between Muslims in Africa across the Sahara as well as the Atlantic and Indian Ocean worlds. Students will examine the history of Islam in Africa in light of issues such as conversion, interacti...\n\n      more description for HIST-AD  131 »\n\n      \n\n\n\nThe objective of this course is to trace and understand the history of Islam as a religious tradition and Muslim societies in Africa as part of a larger world. This course surveys the history and historiography of Islam in Africa from its arrival in North Africa in the seventh century through the present day in postcolonial Africa while also paying attention to continuing points of contact and exchange between Muslims in Africa across the Sahara as well as the Atlantic and Indian Ocean worlds. Students will examine the history of Islam in Africa in light of issues such as conversion, interactions with other religious traditions, reform movements, slavery and race, education, gender, European colonial rule, and postcolonial politics. Possible sources for the course include Arab geographical and travel accounts, juridical texts debating social categories of race, slavery and gender, regional chronicles reflecting the interface between Islam and local African religious traditions, colonial reports revealing fears of Islam as a unifying force across empires, and audio recordings of religious sermons.\n\n      less description for HIST-AD  131 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 132",
            "course_name": "Silk Roads Past and Present",
            "description": "HIST-AD  132 Silk Roads Past and Present \nAspects of the Silk Roads from ancient times to the very recent past, including actual conditions and representations, accurate, and imagined. For centuries travelers have moved between China, India and points west along the various ancient routes that became known as the Silk Roads. The area they covered, corresponding to most of today’s Central and Inner Asia, remains a contested area drawing global attention from various powers vying for control.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 140",
            "course_name": "",
            "description": "HIST-AD  140\n\n   Made in China\n\nTHow do you build a country for 1.4 billion people? You make things, and not only things like consumer goods for export, but, houses, and food, and clothing, for starters, and ... well ... more babies, as well as money and borders, and art and literature. How do all these things get made in China?  Why are there so many people? Who feeds them? Why does the Great Wall run through the middle of the country?  How did China get so poor, and what is making it so rich, again? And why are Chinese restaurants as ubiquitous as Chinese manufactured goods? This course addresses many things you always wan...\n\n      more description for HIST-AD  140 »\n\n      \n\n\n\nTHow do you build a country for 1.4 billion people? You make things, and not only things like consumer goods for export, but, houses, and food, and clothing, for starters, and ... well ... more babies, as well as money and borders, and art and literature. How do all these things get made in China?  Why are there so many people? Who feeds them? Why does the Great Wall run through the middle of the country?  How did China get so poor, and what is making it so rich, again? And why are Chinese restaurants as ubiquitous as Chinese manufactured goods? This course addresses many things you always wanted to know about China and can now ask (in an historical perspective).  May include a trip to Calcutta.  What?\n\n      less description for HIST-AD  140 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 141",
            "course_name": "Eurasian Empires",
            "description": "HIST-AD  141 Eurasian Empires \nExplores empires that have emerged, expanded, and competed in Eurasia. Topics include the Turkic, Xiongnu, and Mongol empires; their technological achievements, imperial strategies, intersections with empires, peoples and cities on their edges, as well as the impact of these empires on politics and culture across Eurasia.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 142",
            "course_name": "",
            "description": "HIST-AD  142\n\n   Russia’s Multiethnic Empire\n\nWhat was it that kept the Russian empire together for centuries?  This course is designed as a survey of Russia’s multiethnic empire from the conquest of the Khanate of Kazan to the early Soviet-era formation of the “affirmative action empire.” Topics to be covered include patterns of imperial expansion, gender and the nature of autocratic authority, religious institutions and practices, colonialism, intellectual debates and key thinkers, serfdom and emancipation, radicalism and the revolutions of 1905 and 1917, early Soviet nationalities policies, the \"New Soviet Person,\" and revolutionary cu...\n\n      more description for HIST-AD  142 »\n\n      \n\n\n\nWhat was it that kept the Russian empire together for centuries?  This course is designed as a survey of Russia’s multiethnic empire from the conquest of the Khanate of Kazan to the early Soviet-era formation of the “affirmative action empire.” Topics to be covered include patterns of imperial expansion, gender and the nature of autocratic authority, religious institutions and practices, colonialism, intellectual debates and key thinkers, serfdom and emancipation, radicalism and the revolutions of 1905 and 1917, early Soviet nationalities policies, the \"New Soviet Person,\" and revolutionary culture.\n\n      less description for HIST-AD  142 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 144",
            "course_name": "",
            "description": "HIST-AD  144\n\n   Topics in Asia-Pacific History:\n\nCourse topics may include: ancient China; the Mongols; food and drugs in Chinese history; Mao Zedong; history of Vietnam; Asian diasporas past and present; Japan in World War II; Pacific Rim history; and others.\nAmerica's Wars, Past and Present:\nThis is a course taught in wartime – however invisible -- about wars. We shall begin by considering the post-1945 wars of the 20th century and then move on to discuss the series of wars that have marked the 21st century.  The history, political uses, memory and forgetting of the Korean and Vietnam Wars will be the subject of the first part of the cours...\n\n      more description for HIST-AD  144 »\n\n      \n\n\n\nCourse topics may include: ancient China; the Mongols; food and drugs in Chinese history; Mao Zedong; history of Vietnam; Asian diasporas past and present; Japan in World War II; Pacific Rim history; and others.\nAmerica's Wars, Past and Present:\nThis is a course taught in wartime – however invisible -- about wars. We shall begin by considering the post-1945 wars of the 20th century and then move on to discuss the series of wars that have marked the 21st century.  The history, political uses, memory and forgetting of the Korean and Vietnam Wars will be the subject of the first part of the course. The ongoing influence of those wars on contemporary politics will occupy the second part of the course. The way Gulf War I (Operation Desert Storm) was fought and reported upon was shaped by the specific understanding the administration of George H.W. Bush had of the Vietnam War. The 2nd war in the Gulf (Operation Iraqi Freedom) and the war in Afghanistan were shaped by the outcome of the first Gulf War. But they were also fought in the shadow of Vietnam analogies that were used by those who supported and those who opposed the war.  The course will examine these analogies with some care. There are two connected questions: can history teach? What does it teach?\n\n      less description for HIST-AD  144 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 145",
            "course_name": "J",
            "description": "HIST-AD  145J\n\n   Food and Drugs in Chinese History\n\nThe goal of this course is to examine Chinese society and culture through the lens of the consumption of food and drugs and to elucidate the central role played at different times by food and drugs in Chinese culture and its representations. We examine the role of food and drugs in Chinese social, cultural, economic, and political history, with an emphasis on the pre-modern period. Topics may include the relationship of health and diet; food in religious\nand ritual practice, gastronomy, consumption and the material culture of food and drugs, restaurants and catering; famine; imperial dining pr...\n\n      more description for HIST-AD  145J »\n\n      \n\n\n\nThe goal of this course is to examine Chinese society and culture through the lens of the consumption of food and drugs and to elucidate the central role played at different times by food and drugs in Chinese culture and its representations. We examine the role of food and drugs in Chinese social, cultural, economic, and political history, with an emphasis on the pre-modern period. Topics may include the relationship of health and diet; food in religious\nand ritual practice, gastronomy, consumption and the material culture of food and drugs, restaurants and catering; famine; imperial dining practices;\ntobacco smoking; opium smoking, cultivation, and elimination; the Opium Wars; and food, drugs, and identity, including the global association of China with food and with opium.\n\n      less description for HIST-AD  145J «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 146",
            "course_name": "Empires and Imperialism in East Asia",
            "description": "HIST-AD  146 Empires and Imperialism in East Asia \nThis course examines empire building and cultural encounters in the East Asia region, comparing the character of empires across time and space, as well\nas the politics of human diversity. We look at the nuts and bolts of empire building, as well as how cultures of conquest shape identity (especially\nethnicity and gender) and regional geopolitics.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 147",
            "course_name": "",
            "description": "HIST-AD  147\n\n   Environmental History of China\n\nWill China “choke the world”?  The goal of the course is to identify the best ways of asking and answering questions about the widespread environmental challenges that are seemingly inherent in China’s economic development.  Are the challenges new to Chinese history – particular to modernization – or are they rooted in long-standing patterns of land use and resource exploitation?  How to do we square the history of damage wrought to nature with the equally salient history of “Asian” notions of “living in harmony” with nature, exemplified by philosophical Daoism and millennia of poetic and pain...\n\n      more description for HIST-AD  147 »\n\n      \n\n\n\nWill China “choke the world”?  The goal of the course is to identify the best ways of asking and answering questions about the widespread environmental challenges that are seemingly inherent in China’s economic development.  Are the challenges new to Chinese history – particular to modernization – or are they rooted in long-standing patterns of land use and resource exploitation?  How to do we square the history of damage wrought to nature with the equally salient history of “Asian” notions of “living in harmony” with nature, exemplified by philosophical Daoism and millennia of poetic and painting traditions extolling the beauty and wonder of nature?  Who, moreover, is entitled to do what with and about the environment: what are the roles of the state?; of scientists and engineers?; of humanists?  The course doubles as an introduction to the history of China, and to the multidisciplinary field of environmental studies.\n\n      less description for HIST-AD  147 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 148",
            "course_name": "",
            "description": "HIST-AD  148\n\n   Asian Borderlands\n\nHow do we write the histories of peoples and places without states, societies that lie within the “borderlands” separating larger powers? This course looks closely at borderlands between China and other sovereign states, and borderlands between upland and lowland peoples in and around the region that some scholars call “Zomia,” the elevated parts of mainland Southeast Asia that often lie beyond the reach of governments based in lowland population centers.  The course readings raise questions about indigeneity, migration, and state-building in what may be the most ethnically diverse part of the...\n\n      more description for HIST-AD  148 »\n\n      \n\n\n\nHow do we write the histories of peoples and places without states, societies that lie within the “borderlands” separating larger powers? This course looks closely at borderlands between China and other sovereign states, and borderlands between upland and lowland peoples in and around the region that some scholars call “Zomia,” the elevated parts of mainland Southeast Asia that often lie beyond the reach of governments based in lowland population centers.  The course readings raise questions about indigeneity, migration, and state-building in what may be the most ethnically diverse part of the world.  It tests the heuristic limits of key historical categories like nation, state, and citizenship, and further explores alternative notions of political and cultural community.\n\n      less description for HIST-AD  148 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 150",
            "course_name": "",
            "description": "HIST-AD  150\n\n   Africa Before 1850\n\nThis course is a survey of African history before the continent’s colonization by European imperialist powers in the 19th Century. The course will explore the African past in its diversity. Students will explore the continent’s political complexity and social creativity across a period of several millennia. The class will consider the impact of gender, religion, healing practices, trade, mobility, and the environment on major historical developments in Africa before 1850.  Among other themes, students will learn about the history of ancient African civilizations, the history of Islam and Chris...\n\n      more description for HIST-AD  150 »\n\n      \n\n\n\nThis course is a survey of African history before the continent’s colonization by European imperialist powers in the 19th Century. The course will explore the African past in its diversity. Students will explore the continent’s political complexity and social creativity across a period of several millennia. The class will consider the impact of gender, religion, healing practices, trade, mobility, and the environment on major historical developments in Africa before 1850.  Among other themes, students will learn about the history of ancient African civilizations, the history of Islam and Christianity on the continent, the development of state-cities on the Swahili coast, and the destructive and transformative impact of the Atlantic slave trade in West and West-Central Africa. The course will also introduce students to African history’s methodology and to the use of linguistic, material, and oral sources in the writing of history.\n\n      less description for HIST-AD  150 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 151",
            "course_name": "",
            "description": "HIST-AD  151\n\n   Africa Since 1850\n\nThis course is a survey of African history since 1850, a date marking the period just after the abolition of the trans-Atlantic slave trade by European powers and also the eve of European colonization. The course will introduce students to the major themes of African history during the colonial and postcolonial eras through a series of case studies. The course will focus on historical developments such as the end of the external and continuation of the internal slave trades, the process of European colonization, religious conversion and reform movements, the period of independence, national po...\n\n      more description for HIST-AD  151 »\n\n      \n\n\n\nThis course is a survey of African history since 1850, a date marking the period just after the abolition of the trans-Atlantic slave trade by European powers and also the eve of European colonization. The course will introduce students to the major themes of African history during the colonial and postcolonial eras through a series of case studies. The course will focus on historical developments such as the end of the external and continuation of the internal slave trades, the process of European colonization, religious conversion and reform movements, the period of independence, national politics during the Cold War, urbanization, and AIDS. We will also examine various themes, such as local and imposed notions of race and ethnicity, lived experiences of and Africans’ responses to colonialism on the continent, cultural traditions, issues of gender and class, political resistance, and issues of health and healing. The course will also address African history’s methodology and to the use of ethnographic, material, and oral sources in the writing of history.\n\n      less description for HIST-AD  151 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 152",
            "course_name": "",
            "description": "HIST-AD  152\n\n   Love in Africa\n\nThis course focuses on love in Africa, from the late 19th Century to the present. By doing so, the course introduces students to a multiplicity of themes in African history, from the history of gender and sexuality to popular culture, generational conflicts, and the AIDS epidemics. Studying love is central to understanding how Africans have imagined and lived their lives as gendered individuals and members of their societies, often in the face of oppressive colonial regimes and strenuous living conditions. We will study love in its various declensions: as an emotion and expression of intimacy ...\n\n      more description for HIST-AD  152 »\n\n      \n\n\n\nThis course focuses on love in Africa, from the late 19th Century to the present. By doing so, the course introduces students to a multiplicity of themes in African history, from the history of gender and sexuality to popular culture, generational conflicts, and the AIDS epidemics. Studying love is central to understanding how Africans have imagined and lived their lives as gendered individuals and members of their societies, often in the face of oppressive colonial regimes and strenuous living conditions. We will study love in its various declensions: as an emotion and expression of intimacy (the notion of romantic love), as virtue (love in theological and political discourses), as a set practices at the chore of conjugality and sexuality, and as an object of debate in the public sphere. Students will learn how to historicize affects and their relationships to society, politics, and economy. We will read fiction and primary sources, watch movies, and discuss recent academic works that will help us understand change and continuities in how individuals and communities across Africa have defined, debated, and experienced love.\n\n      less description for HIST-AD  152 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 153",
            "course_name": "",
            "description": "HIST-AD  153\n\n   “How to save Africa?” History of Salvation Projects in Africa\n\nSalvation projects focusing on Africa have been numerous and nearly continuous since British activists launched sustained campaigns to abolish the Atlantic slave trade at the end of the 18thth Century. “Saving Africa” has been one of the major mantras of the “West” as it has imagined its relationship with Africans, before, during, and after the European colonization of the continent. Students in this course will study the histories of antislavery campaigns, missionary Christianity, colonial development, and contemporary humanitarian campaigns. We will use recent scholarship to discuss these di...\n\n      more description for HIST-AD  153 »\n\n      \n\n\n\nSalvation projects focusing on Africa have been numerous and nearly continuous since British activists launched sustained campaigns to abolish the Atlantic slave trade at the end of the 18thth Century. “Saving Africa” has been one of the major mantras of the “West” as it has imagined its relationship with Africans, before, during, and after the European colonization of the continent. Students in this course will study the histories of antislavery campaigns, missionary Christianity, colonial development, and contemporary humanitarian campaigns. We will use recent scholarship to discuss these diverse projects and their historical contexts. We will also closely read a set of primary sources – memoirs, newspaper articles, and films – and we will subject them to similar questions: what did Africa need to be delivered from? Who were the agents of redemption? What were the effects of the salvation projects? How did Africans react to them? The goal of this course is to deconstruct the prejudices about Africans embedded within salvation projects and to explain how these campaigns have been part of the larger dynamics of power that have defined Africa’s position in the world since the late 18th Century.\n\n      less description for HIST-AD  153 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 154",
            "course_name": "",
            "description": "HIST-AD  154\n\n   African History through Film and Literature\n\nThis course introduces students to the major themes of African history through film, literature, and music. Beginning with recordings of oral tradition originating in the early empire of Mali to novels addressing the roles of African colonial intermediaries to music protesting apartheid in South Africa, students will engage with a variety of sources of cultural and artistic nature. The course will focus on historical developments such as the Atlantic and internal slave trades, the process of European colonization, religious practice, decolonization, genocide and migration, urbanization, and AI...\n\n      more description for HIST-AD  154 »\n\n      \n\n\n\nThis course introduces students to the major themes of African history through film, literature, and music. Beginning with recordings of oral tradition originating in the early empire of Mali to novels addressing the roles of African colonial intermediaries to music protesting apartheid in South Africa, students will engage with a variety of sources of cultural and artistic nature. The course will focus on historical developments such as the Atlantic and internal slave trades, the process of European colonization, religious practice, decolonization, genocide and migration, urbanization, and AIDS.  \nWe will also examine various themes, such as local and imposed notions of race and ethnicity, lived experiences of and Africans’ responses to colonialism on the continent, issues of gender and class, and political resistance. Our broad goal is to investigate to what extent long-term historical dynamics determine the present. Students will not only watch films, listen to music, and read literature, but also read reflections on the methods of using these sources as a way of studying the history of Africa. Course requirements provide students with a language and historical framework for understanding the dynamic history of the continent.\n\n      less description for HIST-AD  154 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 155",
            "course_name": "Euro-American Empires, 1492–1821",
            "description": "HIST-AD  155 Euro-American Empires, 1492–1821 \nExamines European expansion in the early modern period and the creation of an interconnected Atlantic world with particular emphasis on North America and the Caribbean; the roles of Europeans, American natives, and Africans in forming systems of trade and patterns of settlement; the evolution of slavery; and the development of new political structures, changing religious beliefs, and evolving family relationships in America. The course also assesses the imperial context of these developments.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 156",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19703",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Bowen, Martin"
                }
            ],
            "course_name": "",
            "description": "HIST-AD  156\n\n   Colonial Latin America and the Atlantic World\n\nThis course introduces students to the colonial origins of Latin America and examines their impact on the region’s development until the present. It follows the unfolding and demise of a new social order under European rule over a period spanning from the 16th-century conquest through the early 19th-century wars of independence, highlighting international and global connections that shaped this region’s social, cultural, and political history. Specific topics covered include Pre-Columbian worlds, Indian-European confrontations and negotiations, the Catholic Church and popular religiosity, patr...\n\n      more description for HIST-AD  156 »\n\n      \n\n\n\nThis course introduces students to the colonial origins of Latin America and examines their impact on the region’s development until the present. It follows the unfolding and demise of a new social order under European rule over a period spanning from the 16th-century conquest through the early 19th-century wars of independence, highlighting international and global connections that shaped this region’s social, cultural, and political history. Specific topics covered include Pre-Columbian worlds, Indian-European confrontations and negotiations, the Catholic Church and popular religiosity, patriarchy and honor codes, racial dynamics and slavery, the development of capitalism, anti-colonial struggles, imperial rivalry, reform and decline, as well as colonial legacies.\n\n      less description for HIST-AD  156 «",
            "offering": true
        },
        {
            "course_id": "HIST-AD 157",
            "course_name": "The Holocaust: The Third Reich and the Jews",
            "description": "HIST-AD  157 The Holocaust: The Third Reich and the Jews \nThis course offers a historical investigation of the evolution of Nazi policies toward Jews; of Jewish behavior in the face of those policies; and of the attitudes of other countries, both within and outside the Nazi orbit, toward the situation of Jews under the rule of the Third Reich.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 158",
            "course_name": "Arts and Politics in Modern Latin America (1780 to the present)",
            "description": "HIST-AD  158 Arts and Politics in Modern Latin America (1780 to the present) \nThe course explores the relationship between arts and politics in modern Latin America. It focuses on the role played by the arts in some of the region’s main political processes, such as state formation, revolutions, and modernization. The course traces the intellectual and social repercussions of theater plays, music, literature, and the visual arts in Latin American societies. Specific themes include baroque and neoclassical poetics, nationalism, modernism, race and ethnicity, avant-gardes, memory, and truth.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 162",
            "course_name": "Topics in Atlantic History",
            "description": "HIST-AD  162 Topics in Atlantic History \nCourse topics may include The Enlightenment; American colonial history; Atlantic immigration; race, gender, and sexuality in U.S. history; African- American history; New York City past and present; women and slavery in the Americas; the New Deal; and others.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 163",
            "course_name": "",
            "description": "HIST-AD  163\n\n   Ideas into Ideologies: Nineteenth-Century German Ideas and Their Global Legacies\n\nWhat makes ideas historical? How do ideas travel beyond their originating contexts and become embedded in different temporal, linguistic, and cultural settings, often with vastly unexpected consequences? How do intellectuals feature as cultural agents and producers of ideology in such processes? The course explores these and other issues by following the trajectories of some influential ideas articulated in German letters during the “Long Nineteenth Century” (1789–1914) and seeks to explain the diverse European and global legacies they inspired during and after this period. Focusing on the int...\n\n      more description for HIST-AD  163 »\n\n      \n\n\n\nWhat makes ideas historical? How do ideas travel beyond their originating contexts and become embedded in different temporal, linguistic, and cultural settings, often with vastly unexpected consequences? How do intellectuals feature as cultural agents and producers of ideology in such processes? The course explores these and other issues by following the trajectories of some influential ideas articulated in German letters during the “Long Nineteenth Century” (1789–1914) and seeks to explain the diverse European and global legacies they inspired during and after this period. Focusing on the interplay between theory and practice, the course investigates how such ideas changed in the course of their dissemination, appropriation, and re-interpretation, in ways that radically transformed the modern world.\n\n      less description for HIST-AD  163 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 167",
            "course_name": "",
            "description": "HIST-AD  167\n\n   United States in a Transnational and Global Perspective 1: America and the World until 1898\n\nRethinking the traditional narratives of U.S. history, this course explores America’s past from a transnational and global perspective. Chronologically, it covers America’s interaction with the wider world from the earliest European\nsettlements to the Spanish-American War of 1898, examining the Colonial Period, the Revolutionary War, the founding of the republic, the War of 1812, westward expansion, as well as the Civil War, the abolition of slavery, and Reconstruction. Readings and classroom discussions focus on the major political, economic, and cultural forces that shaped the process of Ame...\n\n      more description for HIST-AD  167 »\n\n      \n\n\n\nRethinking the traditional narratives of U.S. history, this course explores America’s past from a transnational and global perspective. Chronologically, it covers America’s interaction with the wider world from the earliest European\nsettlements to the Spanish-American War of 1898, examining the Colonial Period, the Revolutionary War, the founding of the republic, the War of 1812, westward expansion, as well as the Civil War, the abolition of slavery, and Reconstruction. Readings and classroom discussions focus on the major political, economic, and cultural forces that shaped the process of American nation-building, reevaluating the allegedly “exceptional” elements of U.S. history in relation to networks, identities, and events that transcended the nation-state.\n\n      less description for HIST-AD  167 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 168",
            "course_name": "",
            "description": "HIST-AD  168\n\n   United States in a Transnational and Global Perspective 2: America and the World since 1898\n\nRethinking the traditional narratives of U.S. history, this course explores the country’s past from a transnational and global perspective. Chronologically, it covers America’s interaction with the wider world from the Spanish-American War to the presidency of Barack Obama, examining America’s emergence as a global power leading up to World War I, the progressive reform movement, the Great Depression and the New Deal, World War II, the Cold War, the African American civil rights struggle, the political turmoil of the 1960s, Watergate, as well as the “conservative revolution” of the 1980s, the ...\n\n      more description for HIST-AD  168 »\n\n      \n\n\n\nRethinking the traditional narratives of U.S. history, this course explores the country’s past from a transnational and global perspective. Chronologically, it covers America’s interaction with the wider world from the Spanish-American War to the presidency of Barack Obama, examining America’s emergence as a global power leading up to World War I, the progressive reform movement, the Great Depression and the New Deal, World War II, the Cold War, the African American civil rights struggle, the political turmoil of the 1960s, Watergate, as well as the “conservative revolution” of the 1980s, the end of the Cold War and America after 9/11. Readings and classroom discussions focus on the major political, economic, and cultural forces that shaped the “American century” and\nthe country’s present, reevaluating the allegedly “exceptional” elements of U.S. history in relation to networks, identities, and events that transcended the nation-state.\n\n      less description for HIST-AD  168 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 169",
            "course_name": "",
            "description": "HIST-AD  169\n\n   From the \"Chilean Road to Socialism\" to the Pinochet Era: Chile and the Global Cold War\n\nThis course explores some of Latin America’s most significant social and political events during the Cold War: the democratic election in 1970 of a Marxist president in Chile, his overthrow by a military coup d’état in 1973, and the installation of a military regime led by General Augusto Pinochet that lasted until 1989. During this period, Chile attracted the world’s attention for many different reasons. Among them was the experimental nature of its social and political transformations, namely a democratic transition to socialism, as well as the authoritarian implantation of neo-liberal polic...\n\n      more description for HIST-AD  169 »\n\n      \n\n\n\nThis course explores some of Latin America’s most significant social and political events during the Cold War: the democratic election in 1970 of a Marxist president in Chile, his overthrow by a military coup d’état in 1973, and the installation of a military regime led by General Augusto Pinochet that lasted until 1989. During this period, Chile attracted the world’s attention for many different reasons. Among them was the experimental nature of its social and political transformations, namely a democratic transition to socialism, as well as the authoritarian implantation of neo-liberal policies. \nThis course seeks to understand both of these experiments, focusing on their global connections beyond the well-known diplomatic tensions of the Cold War. Along with an analysis of Chile's social structure, political system, and economic history, this course will highlight the importance of gender roles, subaltern agency, and popular movements. Finally, the course will also address the traumatic dimension of Chile’s Cold War experience trough the study of violence, truth, and memory during Pinochet’s regime.\n\n      less description for HIST-AD  169 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 171",
            "course_name": "The Ancient Mediterranean World",
            "description": "HIST-AD  171 The Ancient Mediterranean World \nCrosslisted with The Ancient World\nThe ancient Mediterranean, from Spain to Egypt and the Levant, is the cradle from which Western civilization grew. This course covers the different cultures of the region, with particular interest in their interaction and the conquest of the entire region by Rome. The course examines the complex dynamics of Rome’s relationship to its subject peoples, as Roman trappings were overlaid upon native traditions.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 172",
            "course_name": "The Crusades",
            "description": "HIST-AD  172 The Crusades \nThe history of the Crusades (1095–1291 C.E.) is an important chapter in European imperialism and a manifestation of deep religious conviction.\nExamines the background in Europe leading to the Crusades; the social, political, and economic situation in the eastern Mediterranean before the Crusades; the fortunes of the Crusader (Latin) Kingdom of Jerusalem; and the reactions of Europeans and Easterners to one another. Examines and reevaluates the legacy of the Crusades on both the Eastern and the Western worlds.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 173",
            "course_name": "",
            "description": "HIST-AD  173\n\n   Central Asia and the Middle East\n\nTThis course examines the interconnected histories, cultures, and societies of Central Asia and the Middle East. It will begin with an overview of the Mongol empire and its legacies in Central Asia and the broader Muslim world. We will compare the emerging post-Mongol Eurasian and Ottoman states through the lenses of law, political legitimacy, succession, and ruling institutions. We will then compare Russian and Ottoman civilizing missions, imperial nationalisms, treatments of sectarianism and ethnic minorities, constitutionalisms, public health policies, responses to Islamic modernism, Marxis...\n\n      more description for HIST-AD  173 »\n\n      \n\n\n\nTThis course examines the interconnected histories, cultures, and societies of Central Asia and the Middle East. It will begin with an overview of the Mongol empire and its legacies in Central Asia and the broader Muslim world. We will compare the emerging post-Mongol Eurasian and Ottoman states through the lenses of law, political legitimacy, succession, and ruling institutions. We will then compare Russian and Ottoman civilizing missions, imperial nationalisms, treatments of sectarianism and ethnic minorities, constitutionalisms, public health policies, responses to Islamic modernism, Marxist and other radical leftist ideas, and women’s emancipation. The course will conclude by considering how post-imperial modernization projects transformed identity, gender, and religion in Central Asia and the Middle East.\n\n      less description for HIST-AD  173 «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 176",
            "course_name": "Topics in Mediterranean History",
            "description": "HIST-AD  176 Topics in Mediterranean History \nTopics may include history of Egypt; the Roman Empire; religion and culture from Alexander to Muhammad; Venice and the Mediterranean; premodern science; Western expansion in the Eastern Mediterranean, 11th–15th centuries; Napoleon; modern Greek history; Israel and Palestine; and others.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 177",
            "course_name": "J",
            "description": "HIST-AD  177J\n\n   Renaissance Humanism and Humanity Today\n\nThis intellectual history course examines the emergence of Renaissance humanism, particularly in Florence from Petrarch to Pico and Machiavelli, by examining the political and cultural foundations of humanism, the turn toward Ancient Greece and Rome, and the establishment of a human-centered point of view in poetry, philosophy, religious thought, and art. What picture of the human being emerged with this turn? How did the turn toward the Classics contribute to the development of modern humanism? How was this humanism itself taken up in the Enlightenment and the development of modern education ...\n\n      more description for HIST-AD  177J »\n\n      \n\n\n\nThis intellectual history course examines the emergence of Renaissance humanism, particularly in Florence from Petrarch to Pico and Machiavelli, by examining the political and cultural foundations of humanism, the turn toward Ancient Greece and Rome, and the establishment of a human-centered point of view in poetry, philosophy, religious thought, and art. What picture of the human being emerged with this turn? How did the turn toward the Classics contribute to the development of modern humanism? How was this humanism itself taken up in the Enlightenment and the development of modern education systems, and what remains of humanism today?\n\n      less description for HIST-AD  177J «",
            "offering": false
        },
        {
            "course_id": "HIST-AD 178",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19704",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Kirasirova, Masha"
                }
            ],
            "course_name": "Cold War in the Middle East",
            "description": "HIST-AD  178 Cold War in the Middle East \nThis seminar explores the involvement of the United States and the Soviet Union in the Middle East from the nineteenth century down to the near-present, with emphasis on the Cold War period. We will consider different – sometimes conflicting – interpretations of the sources, character and consequences of US and Soviet foreign policy in this part of the world, along with the images and representations of the Middle East and its peoples that have informed (and, some argue) helped shape American and Soviet policy and public debates.",
            "offering": true
        },
        {
            "course_id": "HIST-AD 298",
            "course_name": "Directed Study",
            "description": "HIST-AD  298 Directed Study \nClosely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        },
        {
            "course_id": "HIST-AD 299",
            "course_name": "Directed Study",
            "description": "HIST-AD  299 Directed Study \nClosely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        }
    ]
}