{
    "major_id": "HSAEP-UC",
    "file": "./2015-2016/HS_Academy_Edge_Program_(HSAEP-UC).html",
    "courses": [
        {
            "course_id": "HSAEP-UC 211",
            "course_name": "GLOBAL SUSTAINABILITY",
            "description": "HSAEP-UC  211 GLOBAL SUSTAINABILITY \nThis course will explore how governments, corporations, and educational institutions are addressing the two main sustainability challenges of our time:  climate change and finite planetary resources.  Throughout the course, we will consider individual as well as collective initiatives to meet these challenges.  Working on their own and in teams, students will develop practical guidelines for sustainability advocacy.  Students will learn about how employers in the public and private sectors are seeking employees who are knowledgeable about a wide spectrum of sustainability practices.",
            "offering": false
        },
        {
            "course_id": "HSAEP-UC 212",
            "course_name": "",
            "description": "HSAEP-UC  212\n\n   SPORTS MANAGEMENT\n\nThis course will explore how businesses, organizations and political entities effect and are affected by the sports industry.   Topics include: the function and organization of governing bodies at the international, professional, collegiate and recreational levels, broadcast and new media entities, sporting goods manufacturers, sports agencies, and marketing firms.  By understanding the fundamental components of the contemporary landscape students will develop practical guidelines for a career in sports management.  Students will learn how employers in the sports industry are seeking flexible ...\n\n      more description for HSAEP-UC  212 »\n\n      \n\n\n\nThis course will explore how businesses, organizations and political entities effect and are affected by the sports industry.   Topics include: the function and organization of governing bodies at the international, professional, collegiate and recreational levels, broadcast and new media entities, sporting goods manufacturers, sports agencies, and marketing firms.  By understanding the fundamental components of the contemporary landscape students will develop practical guidelines for a career in sports management.  Students will learn how employers in the sports industry are seeking flexible and adaptable employees who can apply their knowledge and skill sets towards creating successful sports enterprises.\n\n      less description for HSAEP-UC  212 «",
            "offering": false
        },
        {
            "course_id": "HSAEP-UC 213",
            "course_name": "",
            "description": "HSAEP-UC  213\n\n   MARKETING IN A DIGITAL WORLD\n\nTo market products and services successfully, firms have to contend with two fundamental changes occurring in today's business environment: (1) the rapid technological changes that are constantly changing the media through which advertising and promotion occurs, and (2) the globalization of markets.  This course will examine the major concepts and applications of integrating the elements of advertising, sales promotion, public relations, direct marketing, e-commerce and other essentials of the marketing mix to support the overall marketing strategy to reach customers worldwide and be competiti...\n\n      more description for HSAEP-UC  213 »\n\n      \n\n\n\nTo market products and services successfully, firms have to contend with two fundamental changes occurring in today's business environment: (1) the rapid technological changes that are constantly changing the media through which advertising and promotion occurs, and (2) the globalization of markets.  This course will examine the major concepts and applications of integrating the elements of advertising, sales promotion, public relations, direct marketing, e-commerce and other essentials of the marketing mix to support the overall marketing strategy to reach customers worldwide and be competitive.\n\n      less description for HSAEP-UC  213 «",
            "offering": false
        },
        {
            "course_id": "HSAEP-UC 214",
            "course_name": "",
            "description": "HSAEP-UC  214\n\n   PSYCHOLOGY OF THE SELF\n\nThis course provides a comprehensive overview of the scientific study of thought and behavior.  The content explores questions about nature and nurture, free will, consciousness, human differences, and self/society. Included are topics such as perception, communication, learning, memory, decision-making, persuasion, and motivation.  A particular focus is how these aspects of the mind connect to the brain, develop throughout our lifespan and differ across people. Students will learn via classic studies and current research.  The student is the subject matter with course content providing insigh...\n\n      more description for HSAEP-UC  214 »\n\n      \n\n\n\nThis course provides a comprehensive overview of the scientific study of thought and behavior.  The content explores questions about nature and nurture, free will, consciousness, human differences, and self/society. Included are topics such as perception, communication, learning, memory, decision-making, persuasion, and motivation.  A particular focus is how these aspects of the mind connect to the brain, develop throughout our lifespan and differ across people. Students will learn via classic studies and current research.  The student is the subject matter with course content providing insight and understanding in the ways people relate to self and the world around them.\n\n      less description for HSAEP-UC  214 «",
            "offering": false
        }
    ]
}