{
    "major_id": "INDIV-GG",
    "file": "./2015-2016/Individualized_Projects_(INDIV-GG).html",
    "courses": [
        {
            "course_id": "INDIV-GG 2701",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "INDIV-GG 2701\n\n   Private Lesson\n\nPrivate lessons provide students with the opportunity to earn academic credit for their studies at performing or visual arts studios in the New York area.  These studies are meant to supplement work begun in regularly scheduled classes at NYU or to provide students with the opportunity to study areas for which comparable courses at the University are unavailable to Gallatin students.  Private lessons may be taken in voice, music, dance, acting, and the visual arts, with teachers or studios of their choice—as long as they have met with the approval of the Gallatin faculty.  Credit for private l...\n\n      more description for INDIV-GG 2701 »\n\n      \n\n\n\nPrivate lessons provide students with the opportunity to earn academic credit for their studies at performing or visual arts studios in the New York area.  These studies are meant to supplement work begun in regularly scheduled classes at NYU or to provide students with the opportunity to study areas for which comparable courses at the University are unavailable to Gallatin students.  Private lessons may be taken in voice, music, dance, acting, and the visual arts, with teachers or studios of their choice—as long as they have met with the approval of the Gallatin faculty.  Credit for private lessons is determined by the number of instruction hours per semester.  Students taking private lessons are required to submit a journal and final assessment paper to the faculty adviser.  Unlike private lessons offered elsewhere in the University, Gallatin's private lessons are arranged and paid for by the student. The student is responsible for full payment to the studio or instructor for the cost of the private lessons, as well as to NYU, for the tuition expenses incurred by the number of private lessons course credits.\n\n      less description for INDIV-GG 2701 «",
            "offering": true
        },
        {
            "course_id": "INDIV-GG 2801",
            "classes": [
                {}
            ],
            "course_name": "Internship",
            "description": "INDIV-GG 2801 Internship \nInternships offer Gallatin students an opportunity to learn experientially at one of New York City?s many social institutions, art and cultural organizations, community-based organizations, or corporations.  Students gain first-hand work experience and de",
            "offering": true
        },
        {
            "course_id": "INDIV-GG 2901",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4873",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INDIV-GG 2901\n\n   Independent Study\n\nIn an independent study, students work one-on-one with a faculty member on a particular topic or creative project.  Often the idea for an independent study arises in a course; for example, in a seminar on early 20th-century American history, a student may develop an interest in the Harlem Renaissance and ask the professor to supervise an independent study focused exclusively on this topic during the next semester.  Students may also develop creative projects in areas such as music composition, filmmaking, or fiction writing.  Independent studies are graded courses, the details of which are for...\n\n      more description for INDIV-GG 2901 »\n\n      \n\n\n\nIn an independent study, students work one-on-one with a faculty member on a particular topic or creative project.  Often the idea for an independent study arises in a course; for example, in a seminar on early 20th-century American history, a student may develop an interest in the Harlem Renaissance and ask the professor to supervise an independent study focused exclusively on this topic during the next semester.  Students may also develop creative projects in areas such as music composition, filmmaking, or fiction writing.  Independent studies are graded courses, the details of which are formulated by the student and his or her instructor; these specifics are described in the Independent Study proposal and submitted to the Dean’s Office for approval.  The student and instructor meet regularly throughout the semester to discuss the readings, the research, and the student’s work.  Credit is determined by the amount of work entailed in the study and should be comparable to that of a Gallatin classroom course.  Generally, independent studies, like other courses, are 2 to 4 credits.  Meeting hours correspond to course credits; a 4-credit independent study requires at least seven contact hours per term between the teacher and the student.\n\n      less description for INDIV-GG 2901 «",
            "offering": true
        },
        {
            "course_id": "INDIV-GG 2925",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4895",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4900",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INDIV-GG 2925\n\n   Tutorial:\n\nTutorials are small groups of two to five students working closely with a faculty member on a common topic, project, or skill.  Tutorials are usually student-generated projects and like independent studies, ideas for tutorials typically follow from questions raised in a particular course.  Students may collaborate on creative projects as well, and some titles of recent tutorials include “Writing Long Fiction,” “Dante’s Literary and Historical Background,” and “Environmental Design.”  Tutorials are graded courses, and students work together with the instructor to formulate the structure of the ...\n\n      more description for INDIV-GG 2925 »\n\n      \n\n\n\nTutorials are small groups of two to five students working closely with a faculty member on a common topic, project, or skill.  Tutorials are usually student-generated projects and like independent studies, ideas for tutorials typically follow from questions raised in a particular course.  Students may collaborate on creative projects as well, and some titles of recent tutorials include “Writing Long Fiction,” “Dante’s Literary and Historical Background,” and “Environmental Design.”  Tutorials are graded courses, and students work together with the instructor to formulate the structure of the tutorial, the details of which are described in the tutorial proposal and submitted to the Gallatin School for approval.  The tutorial group meets regularly throughout the semester, and students follow a common syllabus: all participants complete the same readings, write papers on similar topics, etc.  Students in the same tutorial must register for the same number of credits.  Credit is determined by the amount of work (readings and other types of assignments) and should be comparable to that of a Gallatin classroom course.  Tutorials range from 2 to 4 credits.  Meeting hours correspond to course credits: a 4-credit tutorial requires at least fourteen contact hours per term between the teacher and students.\n\n      less description for INDIV-GG 2925 «",
            "offering": true
        },
        {
            "course_id": "INDIV-GG 9001",
            "course_name": "Independent Study",
            "description": "INDIV-GG 9001 Independent Study",
            "offering": false
        }
    ]
}