{
    "major_id": "INFO-UB",
    "file": "./2015-2016/Information_Systems_(INFO-UB).html",
    "courses": [
        {
            "course_id": "INFO-UB 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9274",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-140",
                    "time": "Mon,Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Tambe, Prasanna"
                },
                {
                    "format": "Lecture",
                    "class_id": "9275",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-140",
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Horton, John"
                },
                {
                    "format": "Lecture",
                    "class_id": "9276",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-140",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Horton, John"
                },
                {
                    "format": "Lecture",
                    "class_id": "9277",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-140",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Horton, John"
                }
            ],
            "course_name": "Info Tech in Bus & Society",
            "description": "INFO-UB    1 Info Tech in Bus & Society \nProvides the background necessary to make decisions about computer-based information systems and to be an “end-user”. Two major parts of the course are hands-on experience with personal computers and information systems management. Group and individual computer assignments expose students to electronic spreadsheet analysis and database management on a personal computer. Management aspects focus on understanding computer technology, systems analysis and design, and control of information processing by managers.",
            "offering": true
        },
        {
            "course_id": "INFO-UB 1",
            "course_name": "Info Tech in Bus & Society",
            "description": "INFO-UB    1 Info Tech in Bus & Society",
            "offering": false
        },
        {
            "course_id": "INFO-UB 22",
            "course_name": "Design and Development of Web and Mobile Apps",
            "description": "INFO-UB   22 Design and Development of Web and Mobile Apps \nThe internet has become the most common way to distribute applications to end users, whether they are web-based applications or mobile device-based applications. This course covers application development, from a web page to a web site, including mobile applications. Students have access to a cloud environment in which to experiment with their ideas. Custom servers can be built for individual projects, depending on the needs of the project. Access to the cloud remains available for eight months after the course has officially ended for those groups pursuing financing.",
            "offering": false
        },
        {
            "course_id": "INFO-UB 23",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17253",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC21",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Ipeirotis, Panagiotis"
                }
            ],
            "course_name": "",
            "description": "INFO-UB   23\n\n   Introduction to Programming and Data Science\n\nThis course is the recommended starting point for undergraduate students who 1) are interested in jobs in the rapidly growing fields of data science and data analytics or 2) who are interested in acquiring the technical and data analysis skills that are becoming increasingly relevant in other disciplines such as finance and marketing. The course does not have any prerequisites. It will provide an introduction to programming (using Python) and cover related topics related to the collection, storage, organization, management, and analysis of large volumes of data, both structured (record-based) ...\n\n      more description for INFO-UB   23 »\n\n      \n\n\n\nThis course is the recommended starting point for undergraduate students who 1) are interested in jobs in the rapidly growing fields of data science and data analytics or 2) who are interested in acquiring the technical and data analysis skills that are becoming increasingly relevant in other disciplines such as finance and marketing. The course does not have any prerequisites. It will provide an introduction to programming (using Python) and cover related topics related to the collection, storage, organization, management, and analysis of large volumes of data, both structured (record-based) and unstructured (such as text).\n\n      less description for INFO-UB   23 «",
            "offering": true
        },
        {
            "course_id": "INFO-UB 24",
            "course_name": "Projects in Programming and Data Sciences",
            "description": "INFO-UB   24 Projects in Programming and Data Sciences",
            "offering": false
        },
        {
            "course_id": "INFO-UB 35",
            "course_name": "",
            "description": "INFO-UB   35\n\n   Programming in Python and Fundamentals of Software Development\n\nThis course provides an introduction to programming languages and to the software design methods. The programming language of choice is Python. However, the course will introduce the students to the fundamental programming concepts appearing in various other programming languages, including Java and C, that go well beyond the specifics of Python. Upon completion of this course, the students will be able to acquire practical programming skills in Python and understand the principles of structured software development. They will also understand the principles of designing large software systems ...\n\n      more description for INFO-UB   35 »\n\n      \n\n\n\nThis course provides an introduction to programming languages and to the software design methods. The programming language of choice is Python. However, the course will introduce the students to the fundamental programming concepts appearing in various other programming languages, including Java and C, that go well beyond the specifics of Python. Upon completion of this course, the students will be able to acquire practical programming skills in Python and understand the principles of structured software development. They will also understand the principles of designing large software systems and what it takes to plan, analyze, design, implement and support large Information Systems throughout their entire System Development Lifecycle.\n\n      less description for INFO-UB   35 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 37",
            "course_name": "",
            "description": "INFO-UB   37\n\n   Electronic Communities\n\nAn eCommunity is defined as a group of people organized online around a topic or issue. In this course, students will be introduced to the landscape of online communities and social networks. Examples and case studies of online communities will be discussed and analyzed to identify the characteristics of effective communities and methods for evaluation. Students will review and interact with several online platforms used to design, develop and maintain online community. Students will use this knowledge to design and/or redesign an online community for a business client. Student will work in te...\n\n      more description for INFO-UB   37 »\n\n      \n\n\n\nAn eCommunity is defined as a group of people organized online around a topic or issue. In this course, students will be introduced to the landscape of online communities and social networks. Examples and case studies of online communities will be discussed and analyzed to identify the characteristics of effective communities and methods for evaluation. Students will review and interact with several online platforms used to design, develop and maintain online community. Students will use this knowledge to design and/or redesign an online community for a business client. Student will work in teams with a small business owner or organization leader to analyze their online community presence, their competitors, and propose and maybe implement a new online community strategy. To provide cutting edge perspectives several industry professionals will be invited to lead class discussions on special topics. Guest speakers in the past included Helen Todd, founder of SocialitySquared Christian Erhardt, V.P. of Marketing @ Leica, Angie Gentile, Assistant Marketing Manager for the Mountain Dew Brand @ PepsiCo, Lauren Drell, Assistant Editor @ Mashable and Community Manager for Luke’s Lobster, Erica Swallow, Assistant Editor @ Mashable, Dina Gold, Account Manager @ Facebook, and Eric Friedman, Business Development Manager @ FourSquare\n\n      less description for INFO-UB   37 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 38",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9556",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC21",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Ghose, Anindya"
                }
            ],
            "course_name": "",
            "description": "INFO-UB   38\n\n   Social Media and Digital Marketing Analytics\n\nThe internet continues to revolutionize the way people, businesses, and governments interact with each other. From Twitter to Facebook to Google, the shared infrastructure of IT-enabled platforms are playing a massive transformational role in today's digital age. The web is now encroaching upon core business activities such as new product design, advertising, marketing and sales, word-of-mouth, and customer service. It is fostering newer kinds of community-based business models. There is a significant amount of economic value accruing from the content generated in spaces mediated by social med...\n\n      more description for INFO-UB   38 »\n\n      \n\n\n\nThe internet continues to revolutionize the way people, businesses, and governments interact with each other. From Twitter to Facebook to Google, the shared infrastructure of IT-enabled platforms are playing a massive transformational role in today's digital age. The web is now encroaching upon core business activities such as new product design, advertising, marketing and sales, word-of-mouth, and customer service. It is fostering newer kinds of community-based business models. There is a significant amount of economic value accruing from the content generated in spaces mediated by social media, and there are tangible means for monetization of such content through newer forms of online and mobile advertising. These processes are just beginning and will have enormous impact on daily activities and the way users relate to people and organizations. This course examines the major trends in electronic and mobile commerce and the emerging phenomena of user-generated content. In addition to internet marketing strategies and business applications, the course covers the business implications of social media such as blogs and microblogs, wikis, social networking sites, search engine and display advertising, and other multimedia content emerging on mobile phone-based platforms.\n\n      less description for INFO-UB   38 «",
            "offering": true
        },
        {
            "course_id": "INFO-UB 43",
            "course_name": "",
            "description": "INFO-UB   43\n\n   Systems Analy & Design\n\nThis course stresses concepts and methods used in the analysis and design of computer-based information systems. It explores the major issues at each stage in the design of a system, including the management of the implementation process. Various technical tools ranging from flow charts and decision tables to automated design techniques are discussed. The course emphasizes the importance of users in the design process and focuses on approaches that improve the successful implementation of a computer system. A team project provides students with an opportunity to apply the concepts learned in c...\n\n      more description for INFO-UB   43 »\n\n      \n\n\n\nThis course stresses concepts and methods used in the analysis and design of computer-based information systems. It explores the major issues at each stage in the design of a system, including the management of the implementation process. Various technical tools ranging from flow charts and decision tables to automated design techniques are discussed. The course emphasizes the importance of users in the design process and focuses on approaches that improve the successful implementation of a computer system. A team project provides students with an opportunity to apply the concepts learned in class to a systems analysis and design problem. (This course is usually taught in summer and cross-listed as the MBA course, Business Process Design and Implementation).\n\n      less description for INFO-UB   43 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 46",
            "course_name": "",
            "description": "INFO-UB   46\n\n   Dealing with Data\n\nThis course is focused on how one deals with data, from its initial acquisition to its final analysis. Topics include data acquisition, data cleaning and formatting, common data formats, data representation and storage, data transformations, data base management systems, “big data” or nosql solutions  for storing and analyzing data,.  Students will learn unix tools, the basics of relational database technologies, including SQL and how to apply these tools in Windows, linux and big data environments. Students are formed into teams and there is a team project as well as a mid-term and  bi-weekly...\n\n      more description for INFO-UB   46 »\n\n      \n\n\n\nThis course is focused on how one deals with data, from its initial acquisition to its final analysis. Topics include data acquisition, data cleaning and formatting, common data formats, data representation and storage, data transformations, data base management systems, “big data” or nosql solutions  for storing and analyzing data,.  Students will learn unix tools, the basics of relational database technologies, including SQL and how to apply these tools in Windows, linux and big data environments. Students are formed into teams and there is a team project as well as a mid-term and  bi-weekly homework assignments.\n\n      less description for INFO-UB   46 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 50",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17252",
                    "section": "001",
                    "period": "09/29/2015 - 12/22/2015",
                    "location": "Donefer, Bernard",
                    "time": "Tue 6.00 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INFO-UB   50\n\n   Financial Information Systems\n\nThe financial services industry is being transformed by regulation, competition, consolidation, technology and globalization. These forces will be explored, focusing on how technology is both a driver of change as well as the vehicle for their implementation. The course focuses on payment products and financial markets, their key systems, how they evolved and where might they be going, algorithmic trading, market structure dark, liquidity and electronic markets. Straight through processing, risk management and industry consolidation and convergence will be viewed in light of current events. Th...\n\n      more description for INFO-UB   50 »\n\n      \n\n\n\nThe financial services industry is being transformed by regulation, competition, consolidation, technology and globalization. These forces will be explored, focusing on how technology is both a driver of change as well as the vehicle for their implementation. The course focuses on payment products and financial markets, their key systems, how they evolved and where might they be going, algorithmic trading, market structure dark, liquidity and electronic markets. Straight through processing, risk management and industry consolidation and convergence will be viewed in light of current events. The course objective is to bring both the business practitioner and technologist closer together. Topics will be covered through a combination of lectures, readings, news, case studies and projects.\n\n      less description for INFO-UB   50 «",
            "offering": true
        },
        {
            "course_id": "INFO-UB 55",
            "course_name": "",
            "description": "INFO-UB   55\n\n   Financial Engineering\n\nThis course introduces students to a variety of financial engineering problems and solution approaches using software systems such as Excel, Matlab, and SAS. Emphasis is on the underlying data and how to access it, as well as techniques for attacking common problems such as the pricing of derivatives, evaluating risk, approaches to building quantitative trading systems, and monte carlo simulation approaches in Value at Risk calculations. While by its nature, the course requires some mathematical skills and understanding of probability theory, there is no assumption that students have a backgro...\n\n      more description for INFO-UB   55 »\n\n      \n\n\n\nThis course introduces students to a variety of financial engineering problems and solution approaches using software systems such as Excel, Matlab, and SAS. Emphasis is on the underlying data and how to access it, as well as techniques for attacking common problems such as the pricing of derivatives, evaluating risk, approaches to building quantitative trading systems, and monte carlo simulation approaches in Value at Risk calculations. While by its nature, the course requires some mathematical skills and understanding of probability theory, there is no assumption that students have a background in many of the advanced mathematical concepts used in the theory of financial engineering. Students should either be taking the Futures and Options course, or have a basic familiarity with the concept of options and other financial derivatives.\n\n      less description for INFO-UB   55 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 57",
            "course_name": "",
            "description": "INFO-UB   57\n\n   Data Mining for Business Analytics\n\nThis course teaches students how to structure and solve business problems using data-driven analysis and modeling. The course has three closely related goals: 1. To introduce students to state-of-the-art data-mining methods that support decision making by extracting useful knowledge from the increasingly large volume of data that organizations collect; 2. To provide an analytical framework within which students can apply these data-mining techniques successfully to data-rich business problems; 3. To give students hands-on experience with using the techniques to extract knowledge from data.  Th...\n\n      more description for INFO-UB   57 »\n\n      \n\n\n\nThis course teaches students how to structure and solve business problems using data-driven analysis and modeling. The course has three closely related goals: 1. To introduce students to state-of-the-art data-mining methods that support decision making by extracting useful knowledge from the increasingly large volume of data that organizations collect; 2. To provide an analytical framework within which students can apply these data-mining techniques successfully to data-rich business problems; 3. To give students hands-on experience with using the techniques to extract knowledge from data.  The emphasis is on creative problem formulation and analysis. The course assumes prior knowledge of Microsoft Excel and the fundamentals of finance, marketing, and operations at the level of the core courses at Stern. Prior experience with a programming language or with data mining is useful but not necessary.\n\n      less description for INFO-UB   57 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 59",
            "course_name": "",
            "description": "INFO-UB   59\n\n   Practical Data Science\n\nThis class is an introduction to the practice of data science. The student will leave the class with a broad set of practical data analytic skills based on building real analytic applications on real data. These skills include accessing and transferring data, applying various analytical frameworks, applying methods from machine learning and data mining, conducting large-scale rigorous evaluations with business goals in mind, and the understanding, visualization, and presentation of results. The student will have experience processing “big data,” the latest buzz concept in a field awash with bu...\n\n      more description for INFO-UB   59 »\n\n      \n\n\n\nThis class is an introduction to the practice of data science. The student will leave the class with a broad set of practical data analytic skills based on building real analytic applications on real data. These skills include accessing and transferring data, applying various analytical frameworks, applying methods from machine learning and data mining, conducting large-scale rigorous evaluations with business goals in mind, and the understanding, visualization, and presentation of results. The student will have experience processing “big data,” the latest buzz concept in a field awash with buzz. Specifically, the student will be able to analyze data that are too big to fit in the computer’s memory, and therefore thwart many standard analytical tools. The student will have experience with unstructured data, for example processing text for applications such as “sentiment analysis” of user-generated content on the web.\nStudents will program throughout the course and are expected to have some programming experience coming in, or a keen desire to learn on the fly. The emphasis of the course will be on rigor and practical usefulness. This is not a replacement for a class on machine learning, database, data mining theory or algorithms. (This class is cross-listed with the MBA Class)\n\n      less description for INFO-UB   59 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 60",
            "course_name": "",
            "description": "INFO-UB   60\n\n   Networks, Crowds and Markets\n\nThis is a course on how the social, technological, and natural worlds are connected, and how the study of networks sheds light on these connections.  Topics include:  social network structure and its effects on business and culture, crowdsourcing, games on graphs, the propagation through networks of information, fads and disease, small worlds, network effects and rich-get-richer phenomena, the power of networks for prediction, the power of the network for web search, networks and social revolutions, and the melding of economics, machine learning, and technology into new markets, such as predic...\n\n      more description for INFO-UB   60 »\n\n      \n\n\n\nThis is a course on how the social, technological, and natural worlds are connected, and how the study of networks sheds light on these connections.  Topics include:  social network structure and its effects on business and culture, crowdsourcing, games on graphs, the propagation through networks of information, fads and disease, small worlds, network effects and rich-get-richer phenomena, the power of networks for prediction, the power of the network for web search, networks and social revolutions, and the melding of economics, machine learning, and technology into new markets, such as prediction markets or markets for on-line advertisements.\n\n      less description for INFO-UB   60 «",
            "offering": false
        },
        {
            "course_id": "INFO-UB 70",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17891",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Levina, Natalia",
                    "time": "Tue 1.30 PM - 4.20 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INFO-UB   70\n\n   Globalization, Open Innovation, Crowdsourcing: New Ways of Organizing\n\nThis course explores new ways in which organizations become innovative and efficient in today’s economy by tapping into expertise that exists outside firm’s boundaries and its major geographical locations.  While neither globalization of work nor involving other firms or customers into a firm’s innovation processes is new per se, there is unprecedented growth of these practices in modern organizations enabled by new technological platforms.  Yet, the practices of opening up the enterprise through offshoring, outsourcing, and crowdsourcing knowledge work come with some costs and risks of failur...\n\n      more description for INFO-UB   70 »\n\n      \n\n\n\nThis course explores new ways in which organizations become innovative and efficient in today’s economy by tapping into expertise that exists outside firm’s boundaries and its major geographical locations.  While neither globalization of work nor involving other firms or customers into a firm’s innovation processes is new per se, there is unprecedented growth of these practices in modern organizations enabled by new technological platforms.  Yet, the practices of opening up the enterprise through offshoring, outsourcing, and crowdsourcing knowledge work come with some costs and risks of failure.  In this course, we will discuss how to evaluate risks and benefits of such practices by doing qualitative analysis of cases, discussing strategic theories, learning decision making tools, and engaging in real-time crowdsourcing projects.  Specific topics covered include: 1) strategic considerations of whether an activity should stay within or outside the firm boundaries; 2) strategic evaluation of geographical locations for a particular type of knowledge work; 3) service or platform provider competencies: how to grow them and how to evaluate them; 4) when and how to partner for product innovation; 5) how to organize a crowd of customers or experts; 6) contracting and governance; 7) enabling innovation in distributed teams.   This course is designed to give students a truly multidisciplinary perspective on these issues drawing on theories and practices from international business, strategy, and innovation management.\n\n      less description for INFO-UB   70 «",
            "offering": true
        },
        {
            "course_id": "INFO-UB 94",
            "course_name": "Ind Study in Info Sys",
            "description": "INFO-UB   94 Ind Study in Info Sys \nStudents work one-on-one with a faculty member on a topic selected by the student and approved by the supervising faculty member. Students are expected to spend as much time on the independent study as would be spent on a regular course, and the topic selected may not replicate an existing course.",
            "offering": false
        },
        {
            "course_id": "INFO-UB 95",
            "course_name": "Ind Study in Info Sys",
            "description": "INFO-UB   95 Ind Study in Info Sys \nStudents work one-on-one with a faculty member on a topic selected by the student and approved by the supervising faculty member. Students are expected to spend as much time on the independent study as would be spent on a regular course, and the topic selected may not replicate an existing course.",
            "offering": false
        },
        {
            "course_id": "INFO-UB 98",
            "course_name": "Ind Study in Info Sys",
            "description": "INFO-UB   98 Ind Study in Info Sys \nStudents work one-on-one with a faculty member on a topic selected by the student and approved by the supervising faculty member. Students are expected to spend as much time on the independent study as would be spent on a regular course, and the topic selected may not replicate an existing course.",
            "offering": false
        },
        {
            "course_id": "INFO-UB 99",
            "course_name": "Ind Study in Info Sys",
            "description": "INFO-UB   99 Ind Study in Info Sys \nStudents work one-on-one with a faculty member on a topic selected by the student and approved by the supervising faculty member. Students are expected to spend as much time on the independent study as would be spent on a regular course, and the topic selected may not replicate an existing course.",
            "offering": false
        },
        {
            "course_id": "INFO-UB 9001",
            "course_name": "Info Technology in Business & Society",
            "description": "INFO-UB 9001 Info Technology in Business & Society \nProvides the background necessary to make decisions about computer-based information systems and to be an “end-user”. Two major parts of the course are hands-on experience with personal computers and information systems management. Group and individual computer assignments expose students to electronic spreadsheet analysis and database management on a personal computer. Management aspects focus on understanding computer technology, systems analysis and design, and control of information processing by managers.",
            "offering": false
        }
    ]
}