{
    "major_id": "INTL-GP",
    "file": "./2015-2016/International_specialization_course(INTL-GP).html",
    "courses": [
        {
            "course_id": "INTL-GP 2204",
            "course_name": "Development Assistance Accountability and all Effectiveness",
            "description": "INTL-GP 2204 Development Assistance Accountability and all Effectiveness",
            "offering": false
        },
        {
            "course_id": "INTL-GP 2206",
            "course_name": "",
            "description": "INTL-GP 2206\n\n   Conflict and Development\n\nIntrastate conflict and development are intertwined in many ways.  Violent conflict destroys the fruits of previous development efforts and its residues complicate efforts at subsequent development. Large infusions of aid can themselves bring forth communal rivalries and contribute to the emergence or perpetuation of conflict.\n\nThis one-week course will examine the relationships between conflict and development and consider strategies that can address their interplay in a variety of settings, both before violence breaks out across social fault lines, and after.  It will look at the ways in w...\n\n      more description for INTL-GP 2206 »\n\n      \n\n\n\nIntrastate conflict and development are intertwined in many ways.  Violent conflict destroys the fruits of previous development efforts and its residues complicate efforts at subsequent development. Large infusions of aid can themselves bring forth communal rivalries and contribute to the emergence or perpetuation of conflict.\n\nThis one-week course will examine the relationships between conflict and development and consider strategies that can address their interplay in a variety of settings, both before violence breaks out across social fault lines, and after.  It will look at the ways in which social and economic development can contribute to, or undermine, peace; the ways in which conflict complicates development; and the various ways in which peacebuilding strategies can impact development.  Against this background, the course will analyze the intervention strategies of international organizations, national governments and NGOs, and examine how these have evolved during the last 15 years.  It will address the policy dilemmas that most conflict-torn developing countries have in common, and compare how these dilemmas have been solved in specific conflict regions.\n\n      less description for INTL-GP 2206 «",
            "offering": false
        }
    ]
}