{
    "major_id": "INTG1-GC",
    "file": "./2015-2016/Integrated_Marketing_(INTG1-GC).html",
    "courses": [
        {
            "course_id": "INTG1-GC 1000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3137",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2957",
                    "section": "002",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2958",
                    "section": "003",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2493",
                    "section": "004",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2492",
                    "section": "005",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2749",
                    "section": "006",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2763",
                    "section": "007",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3104",
                    "section": "008",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2872",
                    "section": "009",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2956",
                    "section": "010",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1000\n\n   Integrated Marketing\n\nThis course introduces students to the concept of marketing as a distribution process, to the writing and implementation of marketing plans, and to the key elements of managing the integration of marketing across the various elements of the promotion mix: advertising, direct marketing, public relations, and sales promotion. Students learn to identify marketing objectives, plan market research, select appropriate strategies for pricing, product, distribution/channel, and promotion mix, identify segmentation, and develop marketing strategies to achieve business objectives. Through case studies a...\n\n      more description for INTG1-GC 1000 »\n\n      \n\n\n\nThis course introduces students to the concept of marketing as a distribution process, to the writing and implementation of marketing plans, and to the key elements of managing the integration of marketing across the various elements of the promotion mix: advertising, direct marketing, public relations, and sales promotion. Students learn to identify marketing objectives, plan market research, select appropriate strategies for pricing, product, distribution/channel, and promotion mix, identify segmentation, and develop marketing strategies to achieve business objectives. Through case studies and other examples, students will apply the learning to real-business situations.\n\n      less description for INTG1-GC 1000 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2494",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2495",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2875",
                    "section": "003",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2962",
                    "section": "004",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3069",
                    "section": "005",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3070",
                    "section": "006",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3072",
                    "section": "007",
                    "period": "09/12/2015 - 12/19/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3073",
                    "section": "008",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1005\n\n   Campaign I: Strategy & Execution\n\nThis course is taken in the same semester as INTG1-GC10155, Campaign II: Planning and Management. Together, the two courses provide coordinated learning in how to develop strategy, plan, execute, and manage marketing campaigns. Campaign I focuses on creative and will start by exploring core concepts that transcend all marketing channels, such as the difference between a feature and a benefit, and how to develop brand positioning. By studying how creative strategy is executed across all elements of the marketing mix that are available to an integrated marketer’s television, radio, print, direct...\n\n      more description for INTG1-GC 1005 »\n\n      \n\n\n\nThis course is taken in the same semester as INTG1-GC10155, Campaign II: Planning and Management. Together, the two courses provide coordinated learning in how to develop strategy, plan, execute, and manage marketing campaigns. Campaign I focuses on creative and will start by exploring core concepts that transcend all marketing channels, such as the difference between a feature and a benefit, and how to develop brand positioning. By studying how creative strategy is executed across all elements of the marketing mix that are available to an integrated marketer’s television, radio, print, direct mail, e-mail, digital, and wireless;  students will build their knowledge of what works and how to manage all elements for consistent strategy, consistent branding, and successful integration. To achieve these objectives, the course will use lectures, guest speakers from advertising, PR, promotion, and interactive agencies, as well as speakers from client-side companies, as well as an ongoing project in which students engage in the creative process to fully understand it. To apply the learning from lectures, readings, and guest speakers, students will build an integrated campaign.\n\n      less description for INTG1-GC 1005 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1011",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2496",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3081",
                    "section": "004",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2497",
                    "section": "002",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2889",
                    "section": "003",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1011\n\n   Competitive Strategy\n\nThis course focuses on how companies use strategic analysis and planning to achieve growth. Now and in the future, marketers need to understand the role of marketing within a company’s business strategy, and how a company’s business strategy affects marketing strategy. Through three modules, students learn to plan, develop, and implement business strategies, so that they understand the framework in which marketing can help to achieve business objectives. In the first module, Strategic Planning, they study the classic and new methodologies for assessing the options that a company has for growth...\n\n      more description for INTG1-GC 1011 »\n\n      \n\n\n\nThis course focuses on how companies use strategic analysis and planning to achieve growth. Now and in the future, marketers need to understand the role of marketing within a company’s business strategy, and how a company’s business strategy affects marketing strategy. Through three modules, students learn to plan, develop, and implement business strategies, so that they understand the framework in which marketing can help to achieve business objectives. In the first module, Strategic Planning, they study the classic and new methodologies for assessing the options that a company has for growth. In the second module, Competitive Advantage, they learn to identify and implement the strategies that have the strongest potential for achieving competitive advantage versus other companies in the same category or segment. In the third module, Innovation, they study how to be prepared for competition in a global, 24/7, 365, digitally connected business environment where change is a constant, learning the role of innovation in building a breakthrough business and how to manage innovation--from idea to execution--to achieve growth. These goals will be accomplished through lectures, readings, case-study discussions, and class exercises designed to build students understanding of the three course modules.\n\n      less description for INTG1-GC 1011 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1015",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2498",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2499",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2876",
                    "section": "003",
                    "period": "09/06/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2963",
                    "section": "004",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3075",
                    "section": "005",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3076",
                    "section": "006",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3078",
                    "section": "007",
                    "period": "09/12/2015 - 12/19/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3079",
                    "section": "008",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1015\n\n   Campaign II: Planning & Management\n\nThis course is taken in the same semester as INTG1-GC1005, Campaign I: Strategy and Execution. Together, the two courses provide coordinated learning in how to develop strategy, plan, execute, and manage marketing campaigns. Campaign II focuses on media. As companies increasingly seek to integrate their messages across media channels, and as emerging media such as mobile, online video, and search compete with traditional media such as television, print, radio, direct mail, e-mail, and online for the attention of target customers, managers must make decisions about budget allocation relative to...\n\n      more description for INTG1-GC 1015 »\n\n      \n\n\n\nThis course is taken in the same semester as INTG1-GC1005, Campaign I: Strategy and Execution. Together, the two courses provide coordinated learning in how to develop strategy, plan, execute, and manage marketing campaigns. Campaign II focuses on media. As companies increasingly seek to integrate their messages across media channels, and as emerging media such as mobile, online video, and search compete with traditional media such as television, print, radio, direct mail, e-mail, and online for the attention of target customers, managers must make decisions about budget allocation relative to contact strategy and about media strategy relative to creative strategy. Throughout the semester, students will have opportunities to apply the learning, and the course will culminate with each student developing a complete integrated-media plan.\n\n      less description for INTG1-GC 1015 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1020",
            "course_name": "",
            "description": "INTG1-GC 1020\n\n   Consumer Behavior/Market Research\n\nThis course is structured into two segments. The first segment, focusing on consumer behavior, uses behavioral science concepts to explain consumer motivation and behavior as they relate to effective market segmentation, product positioning, and overall market strategy. The second segment concentrates on the study of market research. Both primary and secondary research methodologies and tools are explored, including the use of on-line information sources. Students learn how to select and evaluate various research alternatives. Additional topics include behavior models, surveys, qualitative and...\n\n      more description for INTG1-GC 1020 »\n\n      \n\n\n\nThis course is structured into two segments. The first segment, focusing on consumer behavior, uses behavioral science concepts to explain consumer motivation and behavior as they relate to effective market segmentation, product positioning, and overall market strategy. The second segment concentrates on the study of market research. Both primary and secondary research methodologies and tools are explored, including the use of on-line information sources. Students learn how to select and evaluate various research alternatives. Additional topics include behavior models, surveys, qualitative and quantitative methods, and evaluation techniques.\n\n      less description for INTG1-GC 1020 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 1025",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2500",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "2795",
                    "section": "002",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "2891",
                    "section": "003",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3141",
                    "section": "004",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3142",
                    "section": "005",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3216",
                    "section": "006",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "17601",
                    "section": "008",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3226",
                    "section": "207",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1025\n\n   Database Mgmt & Modeling\n\nStudents will learn the basic of database set up and management, as well as the analytical techniques and tools used in direct and digital marketing to assess, enhance, and profit from customer-relationship management. In particular, this course will cover the following: \n•  Building a customer database why, how, and types \n•  Defining customer data requirements  short- and long-term needs, considerations by division, off- and online data-integration issues, and special considerations \n•  Maintenance of the database, NCOA processing, address standardization, deduping, and other methods for ...\n\n      more description for INTG1-GC 1025 »\n\n      \n\n\n\nStudents will learn the basic of database set up and management, as well as the analytical techniques and tools used in direct and digital marketing to assess, enhance, and profit from customer-relationship management. In particular, this course will cover the following: \n•  Building a customer database why, how, and types \n•  Defining customer data requirements  short- and long-term needs, considerations by division, off- and online data-integration issues, and special considerations \n•  Maintenance of the database, NCOA processing, address standardization, deduping, and other methods for cost efficiency and accuracy \n•  Database technology, organization and planning- technology needs and outsourcing considerations \n•  Sampling techniques - nth selects and frozen files \n•  Creating powerful predictor variables - univariate and cross tabulations, ratios, time series variables, and other measures \n•  Segmenting the customer file - cross-tabulations, RFM analysis, CHAID, factor analysis and cluster analysis \n•  Predicting customer actions - using multiple linear regression and logistic regression to model response, payment, attrition, churn, and other factors \n•  Outside list selection options - best customer models, response models, manual selects \n•  Gains charts and expected profit calculations - selecting the best customer for promotion based on profitability \n•  Introduction to mining with SAS - an introduction to the use of SAS, the most widely used software available today for database mining and modeling.\n\n      less description for INTG1-GC 1025 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2501",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2502",
                    "section": "002",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2750",
                    "section": "003",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2768",
                    "section": "004",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2871",
                    "section": "005",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3105",
                    "section": "006",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2959",
                    "section": "007",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2960",
                    "section": "008",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2961",
                    "section": "009",
                    "period": "09/12/2015 - 12/19/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3068",
                    "section": "010",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1030\n\n   Finance for Marketing Decisions\n\nThe course covers the basic metrics, terminology, methodology, and formulas for calculating all aspects of planning, managing, and analyzing marketing programs. Students will learn how to develop a marketing Profit and Loss (P&L) projection, how to analyze the P&L for the key variables that can increase marketing success, and how to manage marketing programs in order to set and achieve financial goals. They will learn how to develop Breakeven analysis for new-product launch and for customer acquisition, how to compute and analyze the Marketing Allowable for a campaign in direct or digital medi...\n\n      more description for INTG1-GC 1030 »\n\n      \n\n\n\nThe course covers the basic metrics, terminology, methodology, and formulas for calculating all aspects of planning, managing, and analyzing marketing programs. Students will learn how to develop a marketing Profit and Loss (P&L) projection, how to analyze the P&L for the key variables that can increase marketing success, and how to manage marketing programs in order to set and achieve financial goals. They will learn how to develop Breakeven analysis for new-product launch and for customer acquisition, how to compute and analyze the Marketing Allowable for a campaign in direct or digital media, how to apply the elements of Breakeven and Marketing Allowable to developing the marketing budget and targeting such key metrics as Cost Per Inquiry, Cost Per Response or Order, Cost Per Click Through, and Targeted Response Rate. In addition, they will learn to develop a Customer Life Time Value model to project the value of relationship marketing, relative to Net Present Value (NPV) and CLTV. By studying the best practices of direct marketing, they will understand how to plan measurable marketing campaigns and how to set the criteria for success, as well as how to apply those metrics to direct and digital media, including e-commerce Websites.\n\n      less description for INTG1-GC 1030 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1035",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2503",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2504",
                    "section": "002",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3138",
                    "section": "003",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1035\n\n   Digital Marketing\n\nStudents will learn the existing and emerging formats of digital marketing in order to know how to integrate them into their marketing plans, how to use them to achieve business objectives, and how to assess emerging trends, so that they have the basis for adapting to new and emerging digital formats. Among the topics covered are dominant, established forms of online marketing such as websites, search, email, and analytics, as well as emerging trends such as behavioral targeting, online video, PR, social media such as RSS, blogging, and podcasting, and user-generated content, and mobile. The c...\n\n      more description for INTG1-GC 1035 »\n\n      \n\n\n\nStudents will learn the existing and emerging formats of digital marketing in order to know how to integrate them into their marketing plans, how to use them to achieve business objectives, and how to assess emerging trends, so that they have the basis for adapting to new and emerging digital formats. Among the topics covered are dominant, established forms of online marketing such as websites, search, email, and analytics, as well as emerging trends such as behavioral targeting, online video, PR, social media such as RSS, blogging, and podcasting, and user-generated content, and mobile. The course will also cover current trends and research. Students will gain real-world experience with the types of challenges that marketing managers need to address in acquiring customers, generating leads, activating and loyalizing customers, building brands, promoting brands, enhancing customer relationships, and analyzing consumer behavior in the digital marketplace.\n\n      less description for INTG1-GC 1035 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1045",
            "course_name": "",
            "description": "INTG1-GC 1045\n\n   Database Management & Applications\n\nThis course teaches the ways that information-handling systems are used in direct and interactive marketing.  You learn how transactional and relational databases and data warehouses are developed and built, how they are used, and how they interact with other aspects of business.  You study hardware platforms, software systems, and the decision factors that managers need to specify, select, and manage the most appropriate and effective hardware and software for meeting their current business objectives and projected future needs.  Course work includes options for mainframes, PCs, and client-se...\n\n      more description for INTG1-GC 1045 »\n\n      \n\n\n\nThis course teaches the ways that information-handling systems are used in direct and interactive marketing.  You learn how transactional and relational databases and data warehouses are developed and built, how they are used, and how they interact with other aspects of business.  You study hardware platforms, software systems, and the decision factors that managers need to specify, select, and manage the most appropriate and effective hardware and software for meeting their current business objectives and projected future needs.  Course work includes options for mainframes, PCs, and client-server systems; planning for data mining and other uses of data; Customer-Relationship Management (CRM) systems and how tp evaluate and assess them; as well as the interaction of online data-gathering systems, e-mail marketing, and privacy concerns.  You explore sources of data available to direct and interactive marketers for consumer and business-to-business marketing and examine various types of databases, data-optimization techniques, and basic modeling reports.\n\n      less description for INTG1-GC 1045 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 1050",
            "course_name": "Integrated Direct Marketing",
            "description": "INTG1-GC 1050 Integrated Direct Marketing \nStudents analyze how companies increasingly use direct and interactive marketing in conjunction with general advertising, field sales, sales promotion, public relations, and event/sports marketing.",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 1055",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2751",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2793",
                    "section": "002",
                    "period": "09/12/2015 - 12/19/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2873",
                    "section": "003",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17698",
                    "section": "204",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1055\n\n   Statistical Measurements, Analysis & Research\n\nThis course will teach the marketer both quantitative and qualitative techniques for maximizing the brand and customer relationships in an integrated-marketing environment. In particular, it will cover the following: \n•  Sampling techniques used in marketing - how and why to sample, types of sampling \n•  Measures of central tendency and dispersion - how to develop and assess these measures to better understand potential data issues prior to analysis \n•  Graphical representation of marketing data - the use of bar charts, pie charts, line charts, and other methods for showing consumer data an...\n\n      more description for INTG1-GC 1055 »\n\n      \n\n\n\nThis course will teach the marketer both quantitative and qualitative techniques for maximizing the brand and customer relationships in an integrated-marketing environment. In particular, it will cover the following: \n•  Sampling techniques used in marketing - how and why to sample, types of sampling \n•  Measures of central tendency and dispersion - how to develop and assess these measures to better understand potential data issues prior to analysis \n•  Graphical representation of marketing data - the use of bar charts, pie charts, line charts, and other methods for showing consumer data and purchase data \n•  Important distributional properties of marketing data - the central-limit theorem and the normal distribution \n•  Marketing-test design and analysis - sample-size estimation and test assessment via hypothesis testing \n•  Full factorial test design - the rules of test design \n•  Market-research survey design and execution - types of surveys, types of questions, and test planning \n•  Research-analysis methods - choice modeling/conjoint analysis, rank correlations \n•  Types and usage of syndicated data - Nielsen, IRI, Simmons, and other data sources \n•  Sizing a market- how to assess opportunities in the marketplace via online research and online services \n•  ROI analysis - the various methods of calculating return on marketing investment \n•  Campaign management ¿ spreadsheets, calculations, marketing goals \n•  Competitive research methods and tracking - various qualitative and quantitative techniques to assess competition in the marketplace\n\n      less description for INTG1-GC 1055 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 1060",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2506",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3139",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 1060\n\n   The C-Suite Perspective: Leadership & Int Mktg\n\nThis course, taught by a faculty member with experience as a CEO, focuses on the role of the C-Suite as senior management and how the competing demands of that role shape the divisions and departments of the company and, inevitably, the management and budget for marketing. Key topics will include transformation of the company, growth through acquisition, the impact of the green movement,/sustainable-resource management/social responsibility, and corporate-finance management. These goals will be accomplished through lectures, readings, case-study discussions, and class exercises designed to bui...\n\n      more description for INTG1-GC 1060 »\n\n      \n\n\n\nThis course, taught by a faculty member with experience as a CEO, focuses on the role of the C-Suite as senior management and how the competing demands of that role shape the divisions and departments of the company and, inevitably, the management and budget for marketing. Key topics will include transformation of the company, growth through acquisition, the impact of the green movement,/sustainable-resource management/social responsibility, and corporate-finance management. These goals will be accomplished through lectures, readings, case-study discussions, and class exercises designed to build students¿ understanding of the subject matter. The real-world examples and case studies will give students hands-on experience in applying the learning to challenges they will face in their future.\n\n      less description for INTG1-GC 1060 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2000",
            "course_name": "",
            "description": "INTG1-GC 2000\n\n   Management Principles & Ethical Practices\n\nAs managers move into positions of broader responsibility, they encounter increasing complexity and often experience greater pressure.  Senior executives in today's business world have to make decisions in the context of global competition; communicate with a diverse range of customers and shareholders; exert visionary leadership I the midst of rapid change; evaluate organizational strategies and structure; and demonstrate stewardship of financial and human resources.  This course exposes you to managerial challenges typically encountered in direct and interactive businesses, including such is...\n\n      more description for INTG1-GC 2000 »\n\n      \n\n\n\nAs managers move into positions of broader responsibility, they encounter increasing complexity and often experience greater pressure.  Senior executives in today's business world have to make decisions in the context of global competition; communicate with a diverse range of customers and shareholders; exert visionary leadership I the midst of rapid change; evaluate organizational strategies and structure; and demonstrate stewardship of financial and human resources.  This course exposes you to managerial challenges typically encountered in direct and interactive businesses, including such issues as privacy and the ethical use of data.  You learn types of leadership, leadership strategies and tactics, how to foster teamwork, how to motivate and coach, how to resolve conflicts, and how to apply leadership-development methods to succession and the future.\n\n      less description for INTG1-GC 2000 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 2005",
            "course_name": "Direct Marketing",
            "description": "INTG1-GC 2005 Direct Marketing",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 2015",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2507",
                    "section": "001",
                    "period": "09/04/2015 - 12/11/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship",
            "description": "INTG1-GC 2015 Internship \nStudents who are interning companies that require them to receive academic credit may take this 1-3 credit independent-study course and do a project based on the learning from the internship. There is a wide variety of marketing-internship opportunities at companies in New York. Recent internships include MTV, Sirius Satellite Radio, Time Inc., Redcats U.S.A., G2 Digital, Avenue A/Razorfish, Microsoft, Lacoste.com, WeightWatchers.com, and Ogilvy",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2025",
            "course_name": "",
            "description": "INTG1-GC 2025\n\n   Intensive in American Business\n\nThis course introduces international students to the principles of business as used by U.S. companies. Through a combination of lectures, readings, practical exercises and site visits to companies, students will learn about company structures, departmental functions, typical titles and roles of executives, key marketing segments of consumers and businesses, key media, key companies profiled from the Fortune 500, key trends, and current issues in American business. To prepare students for the format of the graduate program, the class will include assignments that entail individual and group pre...\n\n      more description for INTG1-GC 2025 »\n\n      \n\n\n\nThis course introduces international students to the principles of business as used by U.S. companies. Through a combination of lectures, readings, practical exercises and site visits to companies, students will learn about company structures, departmental functions, typical titles and roles of executives, key marketing segments of consumers and businesses, key media, key companies profiled from the Fortune 500, key trends, and current issues in American business. To prepare students for the format of the graduate program, the class will include assignments that entail individual and group presentations, as well as discussions based on research, reading assignments and on-line collaboration using Blackboard.\n\n      less description for INTG1-GC 2025 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 2100",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2509",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2892",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3096",
                    "section": "003",
                    "period": "09/04/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2100\n\n   Social Media & The Brand\n\nThis course teaches the principles and practices of digital media, with the focus on video display, e-mail, banners, and mobile. It prepares students for planning and implementing the strategy and marketing objectives for digital media, from integration with other elements in the media mix and building awareness to generating leads. Students learn all aspects of video, from pre- and post-roll to display and rich-media ads, the pros and cons of buying through networks and of original, repurposed, syndicated, and user-generated video content, behavioral targeting and optimization, and current an...\n\n      more description for INTG1-GC 2100 »\n\n      \n\n\n\nThis course teaches the principles and practices of digital media, with the focus on video display, e-mail, banners, and mobile. It prepares students for planning and implementing the strategy and marketing objectives for digital media, from integration with other elements in the media mix and building awareness to generating leads. Students learn all aspects of video, from pre- and post-roll to display and rich-media ads, the pros and cons of buying through networks and of original, repurposed, syndicated, and user-generated video content, behavioral targeting and optimization, and current and emerging metrics. For e-mail, they learn best practices for copy and graphics, list strategies; including privacy regulations and ethical considerations, test design, and analytics. For banners, they learn media strategy and campaign management, as well as how to maximize creative impact and click-through. For mobile, they learn how technological enhancements and impediments and customer segmentation for effectiveness and cost efficiency, as well as synergy with other media.\n\n      less description for INTG1-GC 2100 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2105",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2510",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3145",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2105\n\n   Search Marketing\n\nIn this course, students learn all aspects of search, including organic, pay-per-click search, paid/sponsored listings, contextual listings, and paid inclusion, as well as optimization of site content through keywords, algorithms, and meta tags. Building on this foundation of planning and managing search, they learn the metrics of click throughs: how to measure the effectiveness of search with A/B tests of listings, site content, site design, and targeted, measurable landing pages. The course achieves its goals through a combination of lectures, guest lectures, and projects that enable student...\n\n      more description for INTG1-GC 2105 »\n\n      \n\n\n\nIn this course, students learn all aspects of search, including organic, pay-per-click search, paid/sponsored listings, contextual listings, and paid inclusion, as well as optimization of site content through keywords, algorithms, and meta tags. Building on this foundation of planning and managing search, they learn the metrics of click throughs: how to measure the effectiveness of search with A/B tests of listings, site content, site design, and targeted, measurable landing pages. The course achieves its goals through a combination of lectures, guest lectures, and projects that enable students to apply the learning to actual businesses.\n\n      less description for INTG1-GC 2105 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2115",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2511",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3144",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2115\n\n   Operations Strategy\n\nFor managers of all aspects of marketing, from product and brand management to \ne-commerce and multi-channel management, a knowledge of operations strategy is important for ensuring that marketing is able to support a company's growth strategy and competitive position. Continuing the learning about corporate strategy from the INTG1-GC1011 Competitive Strategy course, this course prepares students in the operational and customer-service aspects of businesses. At the most basic level, marketers must ensure that marketing and operations are properly aligned to meet customer expectations. The eff...\n\n      more description for INTG1-GC 2115 »\n\n      \n\n\n\nFor managers of all aspects of marketing, from product and brand management to \ne-commerce and multi-channel management, a knowledge of operations strategy is important for ensuring that marketing is able to support a company's growth strategy and competitive position. Continuing the learning about corporate strategy from the INTG1-GC1011 Competitive Strategy course, this course prepares students in the operational and customer-service aspects of businesses. At the most basic level, marketers must ensure that marketing and operations are properly aligned to meet customer expectations. The efficiency and effectiveness of these processes can make or break a marketing strategy, influence lead conversion, affect customer loyalty and Customer Life-Time Value, and profoundly affect the long-term growth of the business. In this course, students learn how to assess operations for competitive advantage and how to improve the efficiency and the effectiveness of a company's operations, including usability in e-commerce, outsourcing, Six Sigma, and CRM, with specific focus on real companies through case studies, projects, and readings.\n\n      less description for INTG1-GC 2115 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2512",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2893",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2120\n\n   E-Commerce Marketing\n\nThis course teaches the principles and practices of e-commerce marketing, with emphasis on the skills needed to plan, launch, manage, market, and measure a Website that sells products and communicates with prospects and customers. Students will learn the specific processes that constitute core competencies for site development, including merchandising, pricing, and product display; best practices for maximizing click-through rate, stickiness, conversion of site visits to sales, as well as minimizing shopping-cart abandonment. They will also learn how to develop and manage the P&L and Operating...\n\n      more description for INTG1-GC 2120 »\n\n      \n\n\n\nThis course teaches the principles and practices of e-commerce marketing, with emphasis on the skills needed to plan, launch, manage, market, and measure a Website that sells products and communicates with prospects and customers. Students will learn the specific processes that constitute core competencies for site development, including merchandising, pricing, and product display; best practices for maximizing click-through rate, stickiness, conversion of site visits to sales, as well as minimizing shopping-cart abandonment. They will also learn how to develop and manage the P&L and Operating Budgets for an e-commerce business and how to use the best practices of classic direct marketing and the latest technology in digital marketing to test, track and measure for Return on Investment and Customer Life Time Value. The course prepares students for all aspects of e-commerce marketing management, from launch to expansion.\n\n      less description for INTG1-GC 2120 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2895",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17686",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3083",
                    "section": "003",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2200\n\n   Brand Strategy\n\nThe course will consist of 4 modules: Strategy Planning, Strategy Development, Strategy Management, and Brand Assessment. In each, students will learn the key processes entailed in brand strategy. To understand the role of brands in business and their larger role in popular culture, they will study examples of classic brands from the 20th and 21st centuries to see what constitutes success and how brands reflect their time in terms of social, cultural, and technological trends. For a cross-cultural perspective, they will also study brands that are national, multi-national, and global, as well a...\n\n      more description for INTG1-GC 2200 »\n\n      \n\n\n\nThe course will consist of 4 modules: Strategy Planning, Strategy Development, Strategy Management, and Brand Assessment. In each, students will learn the key processes entailed in brand strategy. To understand the role of brands in business and their larger role in popular culture, they will study examples of classic brands from the 20th and 21st centuries to see what constitutes success and how brands reflect their time in terms of social, cultural, and technological trends. For a cross-cultural perspective, they will also study brands that are national, multi-national, and global, as well as the key elements for successful global expansion of brand strategy.\n\n      less description for INTG1-GC 2200 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2205",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2513",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2894",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3087",
                    "section": "003",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2205\n\n   Managing Products & Brands\n\nThe course will consist of two modules:\n1) Product Management: This module will teach the principles and practices of managing new and existing products, including product development, sales forecasting, product-life stage management, pricing, design and packaging, and market testing. \n2) Brand Management: This section will cover brand strategy - how it is developed and then used to plan the corresponding go-to-market objectives and strategies; brand governance - how to help brands to flourish as core strategic assets, from pricing and packaging to portfolio management; brand activation - ho...\n\n      more description for INTG1-GC 2205 »\n\n      \n\n\n\nThe course will consist of two modules:\n1) Product Management: This module will teach the principles and practices of managing new and existing products, including product development, sales forecasting, product-life stage management, pricing, design and packaging, and market testing. \n2) Brand Management: This section will cover brand strategy - how it is developed and then used to plan the corresponding go-to-market objectives and strategies; brand governance - how to help brands to flourish as core strategic assets, from pricing and packaging to portfolio management; brand activation - how to bring brands to life, focusing on the activation techniques that are critical to success, including marketing communications and the corresponding need for brand consistency, the role of the brand in product development, brand extensions, and the customer experience; and brand measurement - how to assess brand strength and impact, from the traditional measurements of attitudes and awareness to more recent metrics for brand\n\n      less description for INTG1-GC 2205 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2210",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2514",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3090",
                    "section": "002",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2210\n\n   Consumer Behavior\n\nThis course will introduce students to how marketers use scientific research to understand the psychological processes involved in consumer behavior. Students will learn the concepts and theories of behavior science that are used to understand and predict behavior in the marketplace, as well as to forecast demand analysis for products and services. Through readings in the textbooks and lectures that provide case histories of how the theory and practice of consumer behavior are applied, students will gain an understanding of how to plan, develop, and implement marketing strategy and how to use ...\n\n      more description for INTG1-GC 2210 »\n\n      \n\n\n\nThis course will introduce students to how marketers use scientific research to understand the psychological processes involved in consumer behavior. Students will learn the concepts and theories of behavior science that are used to understand and predict behavior in the marketplace, as well as to forecast demand analysis for products and services. Through readings in the textbooks and lectures that provide case histories of how the theory and practice of consumer behavior are applied, students will gain an understanding of how to plan, develop, and implement marketing strategy and how to use the methodology of consumer behavior for decision making in marketing management.\n\n      less description for INTG1-GC 2210 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2215",
            "course_name": "Theory, History, & Practice of Public Rel",
            "description": "INTG1-GC 2215 Theory, History, & Practice of Public Rel",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 2300",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2752",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "2986",
                    "section": "002",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3094",
                    "section": "003",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2300\n\n   Business Analytics and Data Visualization Using SAS\n\nMarketing has always used data for developing strategies to build, manage, and retain relationships with prospects and customers. However, recent technological advancements in collecting, storing, processing, and transmitting information have resulted in an increased reliance on data for strategic planning and execution.  This course prepares students to turn business data into actionable information.  The semester is organized into two modules: SAS Enterprise Guide and SAS JMP—software systems for data integration/transformation, analysis and visualization.  Students will learn how to use the...\n\n      more description for INTG1-GC 2300 »\n\n      \n\n\n\nMarketing has always used data for developing strategies to build, manage, and retain relationships with prospects and customers. However, recent technological advancements in collecting, storing, processing, and transmitting information have resulted in an increased reliance on data for strategic planning and execution.  This course prepares students to turn business data into actionable information.  The semester is organized into two modules: SAS Enterprise Guide and SAS JMP—software systems for data integration/transformation, analysis and visualization.  Students will learn how to use the technology in the context of their applications to sales, marketing, and customer relationship management (CRM).  Although our focus will be the use of SAS Enterprise Guide and SAS JMP, the course will cover other methodologies.  Students will learn by doing: that is, guided by the instructor and using software and assigned readings/videos, they will prepare and analyze real-world data sets to learn how to develop strategic recommendations for managerial actions. \n\nStudents who successfully complete the course requirements should be able to:\n\n-\tManage data, including\no\tData access\no\tData cleansing\no\tData preparation\n\n-\tApply techniques for converting data to information, including\no\tData exploration\no\tSummarization\no\tVisualization\n\n-\tAnalyze data\no\tInteractive exploratory analytics\no\tIntroductory predictive analytics\n\n      less description for INTG1-GC 2300 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2305",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "2896",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3099",
                    "section": "002",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Laboratory",
                    "class_id": "3100",
                    "section": "003",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2305\n\n   Web Analytics: Seo/Sem, Ppc, Email & Clickstream\n\nIn this course, students will learn the various online business models, how to optimize use of them to meet business objectives, and how to analyze results. The subject areas to be covered include search-engine marketing, Website optimization, Website submission, link-marketing strategies, pay-per-click advertising campaigns, e-mail marketing tactics, affiliate marketing, customer Web logs, online testing of banner ads, landing pages, and other digital formats, software options for Web mining, analyzing click-stream data, and the key metrics for measuring consumer behavior online, including ba...\n\n      more description for INTG1-GC 2305 »\n\n      \n\n\n\nIn this course, students will learn the various online business models, how to optimize use of them to meet business objectives, and how to analyze results. The subject areas to be covered include search-engine marketing, Website optimization, Website submission, link-marketing strategies, pay-per-click advertising campaigns, e-mail marketing tactics, affiliate marketing, customer Web logs, online testing of banner ads, landing pages, and other digital formats, software options for Web mining, analyzing click-stream data, and the key metrics for measuring consumer behavior online, including basket analysis and other techniques of association. When feasible, students in this course participate in the Google Challenge, a worldwide competition sponsored by Google for the application of search metrics to a local business.\n\n      less description for INTG1-GC 2305 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2310",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2794",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2987",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3095",
                    "section": "003",
                    "period": "09/14/2015 - 12/21/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2310\n\n   Advanced Test, Analysis, & Experimental Design\n\nThis course will teach students the basic concepts of experimental design and analysis techniques for marketing tests in traditional and evolving media channels. In particular, it will cover the following: \n•  What, when and why to test \n•  Assessing marketing test results including direct mail, banner ads, landing pages, email tests, subject line test, PPC ads, etc. \n•  Measuring Website effectiveness \n•  Determine the appropriate level of confidence for test assessment \n•  Rules for assessing smaller marketing-research tests \n•  Full-factorial test design considerations \n•  A/B split ...\n\n      more description for INTG1-GC 2310 »\n\n      \n\n\n\nThis course will teach students the basic concepts of experimental design and analysis techniques for marketing tests in traditional and evolving media channels. In particular, it will cover the following: \n•  What, when and why to test \n•  Assessing marketing test results including direct mail, banner ads, landing pages, email tests, subject line test, PPC ads, etc. \n•  Measuring Website effectiveness \n•  Determine the appropriate level of confidence for test assessment \n•  Rules for assessing smaller marketing-research tests \n•  Full-factorial test design considerations \n•  A/B split tests \n•  Multivariate testing \n•  Establishing online metrics \n•  Analysis of variance (ANOVA) \n•  Assessing element interactions \n•  B-to-B testing considerations \n•  Five rules of test design \n•  Determining the appropriate size for tests \n•  Seasonality testing considerations \n•  Day-parting online testing \n•  Cost / benefit Analysis \n•  Bridging test results from one test series to another\n\n      less description for INTG1-GC 2310 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 2315",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2516",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2897",
                    "section": "002",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 2315\n\n   Crm: Managing Customer Experience\n\nThis course will take a strategic approach to the study of Customer Relationship Marketing, providing students with the knowledge to plan, manage, and assess a CRM program from a non-technical perspective and to understand the strategic options for managing the customer experience for maximum customer equity. CRM is used to enable a company to move from a product-based strategy to a customer-based strategy, so that instead of focusing on product differentiation as the basis of competition, it can focus on increasing the value of its best customers. Students will learn how CRM has evolved and c...\n\n      more description for INTG1-GC 2315 »\n\n      \n\n\n\nThis course will take a strategic approach to the study of Customer Relationship Marketing, providing students with the knowledge to plan, manage, and assess a CRM program from a non-technical perspective and to understand the strategic options for managing the customer experience for maximum customer equity. CRM is used to enable a company to move from a product-based strategy to a customer-based strategy, so that instead of focusing on product differentiation as the basis of competition, it can focus on increasing the value of its best customers. Students will learn how CRM has evolved and can take the form of customer-loyalty programs, relational database management, and total quality management. They will also learn its role within the process that contemporary marketers refer to as managing customer experience, which entails consideration of how to deliver the most positive experiences of the brand and its products/services to target customers, new customers, and existing customers. To provide students with CRM theory as well as practical application to marketing challenges, the course will consist of 4 modules: Criteria for a CRM Program, Planning the CRM Program--including goal setting and selection of methodologies, Implementing the CRM Program, and Metrics for Program Success. Through reading of case studies of business challenges involving the use of CRM, as well as articles on the latest theories and methodologies for relationship management, students will learn why, when, and how to use CRM as a strategy for increasing customer equity in the form of incremental revenue from sales, increased profit, or improved Return on Investment (ROI).\n\n      less description for INTG1-GC 2315 «",
            "offering": true
        },
        {
            "course_id": "INTG1-GC 3000",
            "course_name": "Busn-to-Busn Direct Mktg Domestic & International",
            "description": "INTG1-GC 3000 Busn-to-Busn Direct Mktg Domestic & International \nStudents explore how, as the cost of field-sales operations has increased, companies that sell products or services to businesses have implemented direct and interactive marketing programs.",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3005",
            "course_name": "",
            "description": "INTG1-GC 3005\n\n   Multi-Channel Catalog Merchandising & Mktg\n\nThis course examines the economics, critical elements, and marketing strategies of catalog selling.  Through the Internet, traditional mail-order catalog companies have moved their merchandise online, and companies that were previously limited to retail channels have expanded into virtual catalogs on their Websites.  In addition, entrepreneurs use the Web to start mini-catalog businesses that can generate multi-national sales.  To prepare students for managing catalog businesses and for using the success strategies of catalogs for other business models, this course covers the basics of financi...\n\n      more description for INTG1-GC 3005 »\n\n      \n\n\n\nThis course examines the economics, critical elements, and marketing strategies of catalog selling.  Through the Internet, traditional mail-order catalog companies have moved their merchandise online, and companies that were previously limited to retail channels have expanded into virtual catalogs on their Websites.  In addition, entrepreneurs use the Web to start mini-catalog businesses that can generate multi-national sales.  To prepare students for managing catalog businesses and for using the success strategies of catalogs for other business models, this course covers the basics of financial planning, strategic planning, merchandising, pricing, circulation, media, layout, creative execution, and financial analysis for the full range of catalog businesses--from those that use postal mail to those that are e-catalogs and those that are multi-channel.  Through exposure to the size, dynamics, and economics of the catalog industry, students learn how to apply the principles and practices of classic direct marketing and the newer principles and practices of successful online marketing to catalog selling.  From the basic concepts needed to evaluate, administer, and launch a catalog to the success factors needed for circulation, you will learn how to integrate merchandising, marketing, design strategy, and performance metrics into a single or multi-channel catalog business.\n\n      less description for INTG1-GC 3005 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3010",
            "course_name": "",
            "description": "INTG1-GC 3010\n\n   Retail Direct Marketing\n\nThis course provides the student with an overview of the full scope of direct marketing at the retail store level. Focus is on new developments in direct marketing and database management applications for selling direct to customer and for traffic generation. Students learn how to uncover co-marketing opportunities with manufacturers, negotiate arrangements, and prepare co-marketing promotions. They analyze the key elements of successful retail direct marketing programs, evaluate the media available to accomplish their objectives, learn how to track response, and practice by developing new ret...\n\n      more description for INTG1-GC 3010 »\n\n      \n\n\n\nThis course provides the student with an overview of the full scope of direct marketing at the retail store level. Focus is on new developments in direct marketing and database management applications for selling direct to customer and for traffic generation. Students learn how to uncover co-marketing opportunities with manufacturers, negotiate arrangements, and prepare co-marketing promotions. They analyze the key elements of successful retail direct marketing programs, evaluate the media available to accomplish their objectives, learn how to track response, and practice by developing new retail direct marketing strategies and programs.\n\n      less description for INTG1-GC 3010 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3015",
            "course_name": "Dm for Financial Service",
            "description": "INTG1-GC 3015 Dm for Financial Service \nBanking services, insurance, investment opportunities, credit cards, and financial information and services are all being sold successfully through direct and interactive marketing, but are severely controlled by special legal restrictions. Students learn what can and cannot be done; how to market successfully despite legal limitations; how to utilize database, modeling, and media; and how to adapt direct marketing techniques to these specialized areas.",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3020",
            "course_name": "Customer Relationship Management",
            "description": "INTG1-GC 3020 Customer Relationship Management \nDesigned to provide students with intensive preparation in the theory and application of CRM, this course covers the basic elements of building and managing customer relationships.  Students learn the various methodologies for identifying best customers, for projecting Lifetime Value (LTV), and they learn how to assess the risks and rewards of a CRM program for different types of businesses.  The course covers the vendor selection, testing, program assessment, and program management.",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3040",
            "course_name": "Independent Study",
            "description": "INTG1-GC 3040 Independent Study \nStudents interested in developing competencies in specialized areas of direct and interactive marketing can elect to take a three-credit independent study course with an appropriate faculty member.",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3050",
            "course_name": "Internet Marketing: Methods & Entreprneurshp",
            "description": "INTG1-GC 3050 Internet Marketing: Methods & Entreprneurshp \nIt has been said that all marketing online is direct marketing. Students apply their direct and interactive knowledge to an array of advanced topics in Internet marketing.",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3070",
            "course_name": "",
            "description": "INTG1-GC 3070\n\n   Advanced Database Mining & Modeling\n\nTo provide students with advanced abilities in all aspects of data mining and analysis, this course builds on the learning from Y50.2045, Database Mining and Modeling.  Students gain an in-depth knowledge of data-analysis issues, techniques, and best practices through research and real-life case-analysis projects.  Topics include transforming data for linearity, data imputation and dealing with missing data, modeling attrition and customer churn, modeling risk, zip-code based modeling and analysis, privacy and ethical use of data, building databases inhouse versus outsourcing, database hygiene...\n\n      more description for INTG1-GC 3070 »\n\n      \n\n\n\nTo provide students with advanced abilities in all aspects of data mining and analysis, this course builds on the learning from Y50.2045, Database Mining and Modeling.  Students gain an in-depth knowledge of data-analysis issues, techniques, and best practices through research and real-life case-analysis projects.  Topics include transforming data for linearity, data imputation and dealing with missing data, modeling attrition and customer churn, modeling risk, zip-code based modeling and analysis, privacy and ethical use of data, building databases inhouse versus outsourcing, database hygiene, and best-customer/clone models.  Students conduct data-analysis projects entailing real-life data that give them hands-on practice in regression analysis, cluster analysis, and CHAID analysis.  Most work is performed in the computer laboratory, and students gain extensive experience in presenting the findings of their analyses.\n\n      less description for INTG1-GC 3070 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3075",
            "course_name": "",
            "description": "INTG1-GC 3075\n\n   Web Mining: Advanced Integrated Data Analysis\n\nThis course builds on the concepts from Y50.2045, Database Mining and Modeling. In this class students will gain hands on experience in all aspects of mining both online and offline data. Through research and real life case studies, students will gain knowledge regarding the integration of on and offline data, how such data is used to make marketing decisions, data mining  software, search engine optimization, clickstream data analysis, rating websites, managing PPC campaigns, data prep and hygiene techniques and best analytical practices. The class format will involve presentations, case read...\n\n      more description for INTG1-GC 3075 »\n\n      \n\n\n\nThis course builds on the concepts from Y50.2045, Database Mining and Modeling. In this class students will gain hands on experience in all aspects of mining both online and offline data. Through research and real life case studies, students will gain knowledge regarding the integration of on and offline data, how such data is used to make marketing decisions, data mining  software, search engine optimization, clickstream data analysis, rating websites, managing PPC campaigns, data prep and hygiene techniques and best analytical practices. The class format will involve presentations, case readings, and analytical assignments. This class will be held in the computer lab. All analytical work will be performed in class in a team environment.\n\n      less description for INTG1-GC 3075 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 3080",
            "course_name": "",
            "description": "INTG1-GC 3080\n\n   Global Perspectives: Direct & Interactive Mkt\n\nThis course takes a practical, hands-on approach to the global opportunities and challenges faced by direct and interactive marketers as the boundaries between regions, countries, continents, and time zones become increasingly blurred.  You study the present and future of global. multinational, and regional businesses in terms of the impact on marketing strategies and key issues for direct marketers.  You examine key regions - Japan, Asia/Pacific Rim, India, Latin America, Europe, and North America - in order to understand the factors that drive or inhibit direct marketing in each area, from m...\n\n      more description for INTG1-GC 3080 »\n\n      \n\n\n\nThis course takes a practical, hands-on approach to the global opportunities and challenges faced by direct and interactive marketers as the boundaries between regions, countries, continents, and time zones become increasingly blurred.  You study the present and future of global. multinational, and regional businesses in terms of the impact on marketing strategies and key issues for direct marketers.  You examine key regions - Japan, Asia/Pacific Rim, India, Latin America, Europe, and North America - in order to understand the factors that drive or inhibit direct marketing in each area, from media availability to technological capability and cultural relevance. In doing so, you learn the specific strategies needed for geographic expansion as well as the decision-making criteria for effective global growth and management\n\n      less description for INTG1-GC 3080 «",
            "offering": false
        },
        {
            "course_id": "INTG1-GC 4000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2517",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2898",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2899",
                    "section": "003",
                    "period": "09/08/2015 - 12/08/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2900",
                    "section": "204",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "INTG1-GC 4000\n\n   Capstone: The Business Plan\n\nThe Capstone is your final project, marking the culmination of your Master's-degree program. Each student enrolls in the Capstone course and begins by developing and evaluating concepts for an individual new business that will use direct and interactive marketing to achieve its sales and marketing objectives. Once your topic is approved by the instructor, you write a complete business plan for your company. It consists of all the sections that go into an actual business plan. Beginning with business strategy to show the scope of your concept and category research to show the financial potentia...\n\n      more description for INTG1-GC 4000 »\n\n      \n\n\n\nThe Capstone is your final project, marking the culmination of your Master's-degree program. Each student enrolls in the Capstone course and begins by developing and evaluating concepts for an individual new business that will use direct and interactive marketing to achieve its sales and marketing objectives. Once your topic is approved by the instructor, you write a complete business plan for your company. It consists of all the sections that go into an actual business plan. Beginning with business strategy to show the scope of your concept and category research to show the financial potential, you move on to target-audience analysis and competitive strategy. Next, you develop the marketing section with brand positioning, customer-acquisition strategies and tactics, and a customer-retention plan for Lifetime Value. Following that, you plan the media, selecting from the full range of direct and interactive media, and then you develop sample advertisements in traditional and interactive formats for your brand, as well as a database plan and a plan for operations and customer service. Your work includes financial projections for your company, from breakeven analysis to a full P&L (profit and loss) analysis, a lifetime value analysis, and an operating budget. Each week, you share your work with your classmates and the instructor in a collaborative workshop setting. At the end of the semester, you present your complete business plan to your classmates and the instructor. A prize is awarded for the best capstone project.\n\n      less description for INTG1-GC 4000 «",
            "offering": true
        }
    ]
}