{
    "major_id": "DM-GY",
    "file": "./2015-2016/Integrated_Digital_Media_(DM-GY).html",
    "courses": [
        {
            "course_id": "DM-GY 613",
            "course_name": "PRODUCTION I",
            "description": "DM-GY  613 PRODUCTION I",
            "offering": false
        },
        {
            "course_id": "DM-GY 623",
            "course_name": "LAW AND PHILOSOPHY I",
            "description": "DM-GY  623 LAW AND PHILOSOPHY I",
            "offering": false
        },
        {
            "course_id": "DM-GY 703",
            "course_name": "STRUCTURES II",
            "description": "DM-GY  703 STRUCTURES II",
            "offering": false
        },
        {
            "course_id": "DM-GY 803",
            "course_name": "MEDIA STRUCTURES III",
            "description": "DM-GY  803 MEDIA STRUCTURES III",
            "offering": false
        },
        {
            "course_id": "DM-GY 813",
            "course_name": "PRODUCTION III",
            "description": "DM-GY  813 PRODUCTION III",
            "offering": false
        },
        {
            "course_id": "DM-GY 997",
            "classes": [
                {}
            ],
            "course_name": "X",
            "description": "DM-GY  997X\n\n   MS THESIS IN DIGITAL MEDIA\n\nThis 6-credit course is the capstone of the MS program in Integrated Digital Media. Each student, guided by a thesis adviser and with the other faculty support as required by the specific project, completes a major media-production project. The thesis form and format are determined by agreement between the student and adviser with department approval. The goal is to advance the student’s career and to contribute to the profession. Students are encouraged to seek professional outlets for their thesis. The department and the Polytechnic School of Engineering will do everything possible to help e...\n\n      more description for DM-GY  997X »\n\n      \n\n\n\nThis 6-credit course is the capstone of the MS program in Integrated Digital Media. Each student, guided by a thesis adviser and with the other faculty support as required by the specific project, completes a major media-production project. The thesis form and format are determined by agreement between the student and adviser with department approval. The goal is to advance the student’s career and to contribute to the profession. Students are encouraged to seek professional outlets for their thesis. The department and the Polytechnic School of Engineering will do everything possible to help ensure that graduates’ excellent work find an audience and a market. The thesis may be undertaken in consecutive 3-credit increments, or all at once by agreement with the thesis adviser.\n\n      less description for DM-GY  997X «",
            "offering": true
        },
        {
            "course_id": "DM-GY 6013",
            "course_name": "PRODUCTION STUDIO SEMINAR I",
            "description": "DM-GY 6013 PRODUCTION STUDIO SEMINAR I",
            "offering": false
        },
        {
            "course_id": "DM-GY 6023",
            "course_name": "INTERACTIVE STUDIO SEMINAR I",
            "description": "DM-GY 6023 INTERACTIVE STUDIO SEMINAR I",
            "offering": false
        },
        {
            "course_id": "DM-GY 6033",
            "course_name": "Media Organizations",
            "description": "DM-GY 6033 Media Organizations \nThis course is a general orientation to a broad range of media-producing organization types, from pirate radio stations and ad-hoc collectives to major corporations. Each organization has specific advantages and disadvantages, and each has a specific range of work types it can support effectively. The ultimate purpose of the course is to provide a “big-picture” orientation to the different environments in which media get made and distributed and to help students clarify goals and needs so they can make wiser choices about directing their studies and work toward the right career.",
            "offering": false
        },
        {
            "course_id": "DM-GY 6043",
            "classes": [
                {},
                {}
            ],
            "course_name": "Theories and Cultural Impact of Media & Technology",
            "description": "DM-GY 6043 Theories and Cultural Impact of Media & Technology \nIn this course, students will examine and analyze the history and theoretical\ndiscourse of media and technology, while connecting these studies to contemporary trends and issues. Students will also explore the cultural impact of media and technology. Lectures, discussions, readings, research, and writing constitute the body of this course.",
            "offering": true
        },
        {
            "course_id": "DM-GY 6053",
            "classes": [
                {}
            ],
            "course_name": "Ideation & Prototyping",
            "description": "DM-GY 6053 Ideation & Prototyping \nIn this class, the creative process will be investigated in order to generate ideas for art, design, technology, and business endeavors. The course will show how ideation, design research & thinking, and prototyping can inspire, inform, and bring depth to what one ultimately creates. Students will expand their arsenal of design research skills, learn how to think critically about their audience, content, form, and processes, as well as, understand the importance of utilizing more than one research and design strategy.",
            "offering": true
        },
        {
            "course_id": "DM-GY 6063",
            "classes": [
                {}
            ],
            "course_name": "Creative Coding",
            "description": "DM-GY 6063 Creative Coding \nThis course is an introductory programming class, appropriate for students with no prior programming experience. Traditionally, introductory programming teaches algorithmic problem-solving, where a sequence of instructions describe the steps necessary to achieve a desired result. In this course, students are trained to go beyond this sequential thinking – to think concurrently and modularly. By its end, students are empowered to write and read code for event-driven, object-oriented, graphical user interfaces.",
            "offering": true
        },
        {
            "course_id": "DM-GY 6103",
            "classes": [
                {}
            ],
            "course_name": "Live Performance Studio",
            "description": "DM-GY 6103 Live Performance Studio \nThis course introduces students to contemporary digital-performance techniques and issues, i.e., integrating computing technology into traditional performing arts. Drawing on contemporary research in performance studies, as well as technical advances in performing-arts production design, students perform research on how digital technology and media are integrated into dance, theater, performance art and concert-music performance. Students develop performance technologies as part of their research and present them to the group at the end of the semester.",
            "offering": true
        },
        {
            "course_id": "DM-GY 6113",
            "course_name": "Sound Studio",
            "description": "DM-GY 6113 Sound Studio \nThis course introduces DM students to contemporary techniques and issues in audio, sound and musical research. The class covers digital signal processing, synthesis, musical informatics and interaction design as it applies to contemporary music production, postproduction and live performance. Students are expected to achieve competence in a number of technologies and to create brief studies based on them.",
            "offering": false
        },
        {
            "course_id": "DM-GY 6123",
            "classes": [
                {}
            ],
            "course_name": "Cinema Studio",
            "description": "DM-GY 6123 Cinema Studio \nStudents use developed skills to explore and exploit digital-video technology.\nCourse material centers on cinema and its many forms. Class time is divided between hands-on technical demonstrations, group work, and case studies of relevant historical work in film and video. A range of cinema approaches is demonstrated and encouraged.",
            "offering": true
        },
        {
            "course_id": "DM-GY 6133",
            "classes": [
                {}
            ],
            "course_name": "",
            "description": "DM-GY 6133\n\n   Mobile Augmented Reality Studio\n\nThis course examines the potential of mobile augmented reality [AR] and its future impact on society. Augmented reality technology is poised to revolutionize the way we understand the world by overlaying physical reality with real time, interactive digital content. AR will change our interaction with digital media by dissolving the user interface and turning it into a physical experience of sight and sound.  This course will explore these emerging possibilities through hands on learning with the latest software and hardware. The class explores techniques and methodologies through guest lecture...\n\n      more description for DM-GY 6133 »\n\n      \n\n\n\nThis course examines the potential of mobile augmented reality [AR] and its future impact on society. Augmented reality technology is poised to revolutionize the way we understand the world by overlaying physical reality with real time, interactive digital content. AR will change our interaction with digital media by dissolving the user interface and turning it into a physical experience of sight and sound.  This course will explore these emerging possibilities through hands on learning with the latest software and hardware. The class explores techniques and methodologies through guest lectures and regular studio practice to give students an overview of the possibilities and the current state of the art, and to prepare them for thesis work or subsequent course work. Students will gain a strong understanding of the AR industry’s past, present, and especially its future trends. It is recommended that students have experience with Photoshop and Maya or 3D Max software.\n\n      less description for DM-GY 6133 «",
            "offering": true
        },
        {
            "course_id": "DM-GY 6143",
            "course_name": "",
            "description": "DM-GY 6143\n\n   Interaction Design Studio\n\nThis seminar introduces students from diverse backgrounds to interaction design as a creative and a design practice. The course surveys application areas, supporting technologies and their impact on individual and group relationships. Group projects introduce the collaborative and interdisciplinary development process common in the professional technology and design. Students are expected to develop technology competencies, including software programming, configuration of hardware devices and the operation of standard digital-media hardware and software tools. Students are also expected to dem...\n\n      more description for DM-GY 6143 »\n\n      \n\n\n\nThis seminar introduces students from diverse backgrounds to interaction design as a creative and a design practice. The course surveys application areas, supporting technologies and their impact on individual and group relationships. Group projects introduce the collaborative and interdisciplinary development process common in the professional technology and design. Students are expected to develop technology competencies, including software programming, configuration of hardware devices and the operation of standard digital-media hardware and software tools. Students are also expected to demonstrate interpretive positions regarding analysis of the impact of technology on individuals and social interactions.\n\n      less description for DM-GY 6143 «",
            "offering": false
        },
        {
            "course_id": "DM-GY 6153",
            "course_name": "Game Design Studio",
            "description": "DM-GY 6153 Game Design Studio \nThis course guides graduate students through contemporary thought in game\ndesign, development, user testing and deployment. The course will benefit\nstudents interested in research or employment opportunities in game design\nor in related fields that require an understanding of human-computer\ninteraction. This studio provides a foundation understanding of how games\nare developed, tested and experienced.",
            "offering": false
        },
        {
            "course_id": "DM-GY 6193",
            "course_name": "Web Studio",
            "description": "DM-GY 6193 Web Studio \nThis project studio is offered for students who have web-design and/or development experience and who are ready to take on new technologies and approaches. Students may participate in large-scale projects directed by the instructor, or work on a personal or small-group project. Participants are expected to complete a major semester project at a level beyond basic professional standards.",
            "offering": false
        },
        {
            "course_id": "DM-GY 7013",
            "course_name": "PRODUCTION STUDIO SEMINAR II",
            "description": "DM-GY 7013 PRODUCTION STUDIO SEMINAR II",
            "offering": false
        },
        {
            "course_id": "DM-GY 7023",
            "course_name": "INTERACTIVE STUDIO SEMINAR II",
            "description": "DM-GY 7023 INTERACTIVE STUDIO SEMINAR II",
            "offering": false
        },
        {
            "course_id": "DM-GY 7033",
            "course_name": "Media Law",
            "description": "DM-GY 7033 Media Law \nThis advanced seminar explores in depth the theoretical and practical aspects of media-communications principles and regulations. Knowledge of media law is crucial for professionals. A full range of models will be explored, from Open Source public license to Digital Rights Management, as well as working definitions of Fair Use and the practical limits of sampling/mixing in different idioms and economic sectors.",
            "offering": false
        },
        {
            "course_id": "DM-GY 7043",
            "course_name": "GRADUATE MEDIA STUDIES II",
            "description": "DM-GY 7043 GRADUATE MEDIA STUDIES II",
            "offering": false
        },
        {
            "course_id": "DM-GY 7143",
            "course_name": "INTERACTION DESIGN STUDIO SEMINAR II",
            "description": "DM-GY 7143 INTERACTION DESIGN STUDIO SEMINAR II",
            "offering": false
        },
        {
            "course_id": "DM-GY 8013",
            "course_name": "PRODUCTION STUDIO SEMINAR III",
            "description": "DM-GY 8013 PRODUCTION STUDIO SEMINAR III",
            "offering": false
        },
        {
            "course_id": "DM-GY 8023",
            "course_name": "INTERACTIVE STUDIO SEMINAR III",
            "description": "DM-GY 8023 INTERACTIVE STUDIO SEMINAR III",
            "offering": false
        },
        {
            "course_id": "DM-GY 9101",
            "classes": [
                {}
            ],
            "course_name": "Special Topics in Digital MediaINDEPENDENT STUDY",
            "description": "DM-GY 9101 Special Topics in Digital MediaINDEPENDENT STUDY \nOffered by special arrangement with faculty, visiting scholars and professionals in the field, this course may be repeated for credit with different topics. | Prerequisite: permission of instructor.",
            "offering": true
        },
        {
            "course_id": "DM-GY 9102",
            "course_name": "Special Topics in Digital Media",
            "description": "DM-GY 9102 Special Topics in Digital Media \nOffered by special arrangement with faculty, visiting scholars and professionals in the field, this course may be repeated for credit with different topics. | Prerequisite: permission of instructor.",
            "offering": false
        },
        {
            "course_id": "DM-GY 9103",
            "classes": [
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {},
                {}
            ],
            "course_name": "SPECIAL TOPICS IN DIGITAL MEDIADATA VISUALIZATION FROM 2D-4D: SCREEN GRAPHICS TODEVELOPING ASSISTIVE TECHNOLOGYDIFFERENT LEARNING: CONNECTED TEACHING DIGITAL AGEINDEPENDENT STUDYINTERNSHIPSOUND FOR GAMESUSER EXPERIENCE DESIGN",
            "description": "DM-GY 9103 SPECIAL TOPICS IN DIGITAL MEDIADATA VISUALIZATION FROM 2D-4D: SCREEN GRAPHICS TODEVELOPING ASSISTIVE TECHNOLOGYDIFFERENT LEARNING: CONNECTED TEACHING DIGITAL AGEINDEPENDENT STUDYINTERNSHIPSOUND FOR GAMESUSER EXPERIENCE DESIGN \nOffered by special arrangement with faculty, visiting scholars and professionals in the field, this course may be repeated for credit with different topics. | Prerequisite: permission of instructor.",
            "offering": true
        },
        {
            "course_id": "DM-GY 9104",
            "course_name": "DIGITAL MEDIA SPECIAL TOPICS",
            "description": "DM-GY 9104 DIGITAL MEDIA SPECIAL TOPICS",
            "offering": false
        },
        {
            "course_id": "DM-GY 9901",
            "course_name": "THESIS/PROJECT",
            "description": "DM-GY 9901 THESIS/PROJECT",
            "offering": false
        },
        {
            "course_id": "DM-GY 9902",
            "course_name": "THESIS/PROJECT",
            "description": "DM-GY 9902 THESIS/PROJECT",
            "offering": false
        },
        {
            "course_id": "DM-GY 9904",
            "course_name": "THESIS/PROJECT",
            "description": "DM-GY 9904 THESIS/PROJECT",
            "offering": false
        },
        {
            "course_id": "DM-GY 9963",
            "classes": [
                {}
            ],
            "course_name": "MS Pre-Thesis in Digital Media: Research Methods",
            "description": "DM-GY 9963 MS Pre-Thesis in Digital Media: Research Methods \nThis course is the research portion of the MS Thesis in Integrated Digital Media. Each student, guided by a thesis adviser and other faculty support, completes the research and process documentation for their MS thesis.",
            "offering": true
        },
        {
            "course_id": "DM-GY 9990",
            "classes": [
                {}
            ],
            "course_name": "Graduate Colloquium",
            "description": "DM-GY 9990 Graduate Colloquium \nIn a weekly one-hour colloquium, graduate students meet together for open critiques and lecture series / discussions, organized by students and faculty.",
            "offering": true
        }
    ]
}