{
    "major_id": "LITC-GE",
    "file": "./2015-2016/Literacy_Education_(LITC-GE).html",
    "courses": [
        {
            "course_id": "LITC-GE 2001",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3400",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 406",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Stahl, Katherine"
                }
            ],
            "course_name": "",
            "description": "LITC-GE 2001\n\n   Language and Literacy in The Early Years\n\nExamination of issues, theories, processes and contexts involved in oral language and early literacy development, and the implications for curriculum and instruction in early childhood settings, birth through grade two. Integrated approaches to teaching methods and materials for literacy curriculum for the diverse language and learning needs of young children in a variety of early childhood settings and communities with special emphasis on 1) the relationship between oral language and literacy development in home, school, and community including strategies to support a language rich environmen...\n\n      more description for LITC-GE 2001 »\n\n      \n\n\n\nExamination of issues, theories, processes and contexts involved in oral language and early literacy development, and the implications for curriculum and instruction in early childhood settings, birth through grade two. Integrated approaches to teaching methods and materials for literacy curriculum for the diverse language and learning needs of young children in a variety of early childhood settings and communities with special emphasis on 1) the relationship between oral language and literacy development in home, school, and community including strategies to support a language rich environment; 2) the reciprocity between reading and writing development in one language and in multiple languages; and 3) ongoing assessment of student progress.\n\n      less description for LITC-GE 2001 «",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2002",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3401",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 384",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Levy, Natalie"
                }
            ],
            "course_name": "",
            "description": "LITC-GE 2002\n\n   Language and Literacy in The Upper Grades\n\nThis course offers an experience-based exploration of literacy education practices. It offers a survey of multiple forms of literacy, including non-print literacy and their integration in the curriculum. Surveys of strategies to support reading and writing instruction and study skills across the curriculum, with an understanding of the various purposes of reading and writing. Examination of writing development and related instruction and assessment methods. Focus on creating classroom environments in which learners collaborate and inquire together. Students will gain proficiently in providing ...\n\n      more description for LITC-GE 2002 »\n\n      \n\n\n\nThis course offers an experience-based exploration of literacy education practices. It offers a survey of multiple forms of literacy, including non-print literacy and their integration in the curriculum. Surveys of strategies to support reading and writing instruction and study skills across the curriculum, with an understanding of the various purposes of reading and writing. Examination of writing development and related instruction and assessment methods. Focus on creating classroom environments in which learners collaborate and inquire together. Students will gain proficiently in providing develop mentally-appropriate instruction based on assessments during teacher-pupil interactions and assessment in reading, writing, listening and speaking. Focus on individual differences and potential difficulties in the continued development of literacy. Students in the field as student teachers throughout the course.\n\n      less description for LITC-GE 2002 «",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2003",
            "course_name": "International Literature for Children",
            "description": "LITC-GE 2003 International Literature for Children \nDesigned to acquaint students with multicultural characteristics and values from a wide variety of ethnic backgrounds as they are expressed in children's literature.  Special considerations given to the selection and examination of books whose expressed values are of international significance and to the use of these books with elementary school children.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2004",
            "course_name": "Creative Writing for Children",
            "description": "LITC-GE 2004 Creative Writing for Children \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2005",
            "course_name": "Critical Reading and Response to Literature",
            "description": "LITC-GE 2005 Critical Reading and Response to Literature \nDevelopment of processes and skills for teaching critical evaluation of fiction and nonfiction to elementary school children.  Ways to stimulate and evaluate response to literature are examined as means of developing appreciation of quality in literature and lifetime habit of reading.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2006",
            "course_name": "Literature for Younger Children",
            "description": "LITC-GE 2006 Literature for Younger Children \nConsideration of literature and literacy materials especially suitable for children in nursery school, kindergarten, and grades one, two, and three.  Special attention is given to the storytelling arts and to the use of literature in the classroom.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2007",
            "course_name": "Literature for Older Children",
            "description": "LITC-GE 2007 Literature for Older Children \nConsideration of literature and literacy materials especially suitable for children and youths in the upper elementary school years and junior high school.  Special attention is given to the storytelling arts and to the use of literature in the classroom.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2008",
            "course_name": "Language as a Basis for Teaching Read & Writing",
            "description": "LITC-GE 2008 Language as a Basis for Teaching Read & Writing \nConsideration of literature and literacy materials especially suitable for children in nursery school, kindergarten, and grades one, two, and three.  Special attention is given to the storytelling arts and to the use of literature in the classroom.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3402",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 435",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Kieffer, Michael J"
                }
            ],
            "course_name": "First & Second Language Development",
            "description": "LITC-GE 2010 First & Second Language Development \nSurvey of theories of oral language acquisition and development in first and second languages and the role of language as a foundation for classroom discourse and early literacy. Attention to the role of talk across the curriculum and a survey of principles, observation, and instructional practices for supporting a language and literacy rich curriculum. Study of linguistic diversity including English as a second language, varieties of English, and language delay and difference, as it impacts school-based language and literacy learning and academic achievement will be explored.",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2011",
            "course_name": "Literacy Assessment",
            "description": "LITC-GE 2011 Literacy Assessment \nSurvey of principles and practices of formal and informal literacy assessment. Critical examination of test types, methods of test construction and interpretation, and large-scale literacy evaluation. Review of measurement concepts and psychometric principles. Use of dynamic assessment to inform the design, monitoring, and evaluation of literacy instruction. The social implications of testing are explored with a focus on the politics of testing and the relationship between testing practices, learner diversity, and system decision making.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2012",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3403",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 379",
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Stahl, Katherine"
                }
            ],
            "course_name": "Reading Theory/Practice in Early Childhood/Childhood",
            "description": "LITC-GE 2012 Reading Theory/Practice in Early Childhood/Childhood \nSurvey of reading process theory and related reading assessment and instruction practices. Study of reading development in early childhood and childhood.  Focus on teaching comprehension, study skills, word identification, vocabulary development, phonemic awareness, and phonics skills. Special emphasis on individual differences and potential difficulties in reading development and methods for planning reading instruction for struggling or reluctant readers.",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2013",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3404",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL146",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Sullivan, Beth A"
                }
            ],
            "course_name": "Literacy Ed Early Chldhd Chldhd II",
            "description": "LITC-GE 2013 Literacy Ed Early Chldhd Chldhd II \nSurvey of writing process theory and related assessment and instruction practices with a focus on standards-base curriculum planning. Students plan and take part in writing activities in order to acquire pedagogical knowledge in writing. Special emphasis on writing development through early childhood and childhood. Exploration of the relationship between reading, writing, and literacy development.",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2014",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3405",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 379",
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Stahl, Katherine"
                }
            ],
            "course_name": "Reading Theory/Practice in Middle Childhood/Adolescence",
            "description": "LITC-GE 2014 Reading Theory/Practice in Middle Childhood/Adolescence \nSurvey of reading process theory and related reading assessment and instruction practices. Study of reading development in middle childhood and adolescence. Focus on teaching comprehension, study skills, word identification, vocabulary development, phonemic awareness, &, when necessary, phonemic awareness and phonics skills. Special emphasis on individual differences and potential difficulties in reading development and methods for planning reading instruction for struggling or reluctant readers.",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2015",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3406",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL146",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Sullivan, Beth A"
                }
            ],
            "course_name": "Literacy Ed Mc/Adol II",
            "description": "LITC-GE 2015 Literacy Ed Mc/Adol II \nSurvey of writing process theory and related assessment and instruction practices with a focus on standards-based curriculum planning. Students focus on and take part in writing activities in order to acquire pedagogical knowledge in writing. Special emphasis on writing development through middle childhood and adolescence. Exploration of the relationship between reading, writing, and literacy development.",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2016",
            "course_name": "Politics and Policies of Literacy",
            "description": "LITC-GE 2016 Politics and Policies of Literacy \nAn examination and critical evaluation of the theories of the reading and writing process as well as related methods of assessment and instruction. Theoretical frameworks are used to identify and respond to individual differences and potential difficulties in developing reading and writing skills and strategies in diverse student populations in the areas of phonemic awareness, phonics, spelling, fluency, vocabulary development, comprehension, study skills, and composing.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2017",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3407",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC1",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Neuman, Susan B; Cirelli, Michael"
                }
            ],
            "course_name": "Text, Tools and Culture",
            "description": "LITC-GE 2017 Text, Tools and Culture \nChildren's and adolescent literature as primary tools in the teaching of reaching comprehension from a critical perspective. Strategies for locating, selecting, and evaluating resources and materials for use in classroom literacy programs, and selecting  texts that appeal to reluctant readers and students with special needs. Emphasis is placed on teaching children's literature multiculturally.",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2029",
            "course_name": "Superv Lit Pract: Early Childhood",
            "description": "LITC-GE 2029 Superv Lit Pract: Early Childhood \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2032",
            "course_name": "Superv Lit Pract:Adoles",
            "description": "LITC-GE 2032 Superv Lit Pract:Adoles \nNo Course Description Available",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2040",
            "course_name": "Wilson Intro to Multisensory Structured Language Instruction",
            "description": "LITC-GE 2040 Wilson Intro to Multisensory Structured Language Instruction \nThis course provides an introduction to multisensory structured language instruction with the Wilson Reading System ® (WRS). There are eight sessions in this course examining reading research & the five areas of reading in relation to students beyond grade two with persistent phonological coding deficits. This course addresses WRS, including student identification & placement, WRS program implementation, WRS lesson planning, progress monitoring scheduling, creating a successful classroom environment, principles of language structure, & how to teach language with direct, multisensory methods.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2041",
            "course_name": "",
            "description": "LITC-GE 2041\n\n   Wilson Reading System Basic Word Study Steps 1-3\n\nPresents the details of multisensory structured language instruction required for teaching students beyond grade two with word-level deficits who haven’t responded to previous phonics instruction. This on-line course provides practical application of reading research, with particular emphasis on phonological awareness, phonics & spelling at beginning levels.  Provides specific procedures to teach concepts presented in Wilson Reading System (WRS) Steps 1-3. Additional topics include accuracy & automaticity of word recognition, reading fluency, vocabulary & listening/reading comprehension at the...\n\n      more description for LITC-GE 2041 »\n\n      \n\n\n\nPresents the details of multisensory structured language instruction required for teaching students beyond grade two with word-level deficits who haven’t responded to previous phonics instruction. This on-line course provides practical application of reading research, with particular emphasis on phonological awareness, phonics & spelling at beginning levels.  Provides specific procedures to teach concepts presented in Wilson Reading System (WRS) Steps 1-3. Additional topics include accuracy & automaticity of word recognition, reading fluency, vocabulary & listening/reading comprehension at the beginning stages of reading.\n\n      less description for LITC-GE 2041 «",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2042",
            "course_name": "",
            "description": "LITC-GE 2042\n\n   Wilson Reading System Level 1 Certification Practicum\n\nThe practicum entails successful delivery of a minimum of 60 Wilson Reading System (WRS) lessons & demonstrations of teaching mastery of the WRS. A Wilson trainer observes the participant working with his/her student 5 times during the practicum via teleconferencing. Must demonstrate that the teaching plan is based on continuous assessment. Supervised practicum requires identifying & securing a practicum student in grades 4-12 with significant word level deficits. Selected according to WRS practicum student selection criteria. *This course may be completed over two semesters or during a summer...\n\n      more description for LITC-GE 2042 »\n\n      \n\n\n\nThe practicum entails successful delivery of a minimum of 60 Wilson Reading System (WRS) lessons & demonstrations of teaching mastery of the WRS. A Wilson trainer observes the participant working with his/her student 5 times during the practicum via teleconferencing. Must demonstrate that the teaching plan is based on continuous assessment. Supervised practicum requires identifying & securing a practicum student in grades 4-12 with significant word level deficits. Selected according to WRS practicum student selection criteria. *This course may be completed over two semesters or during a summer fast track program.\n\n      less description for LITC-GE 2042 «",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2043",
            "course_name": "",
            "description": "LITC-GE 2043\n\n   Wilson Reading System Basic Word Study Steps 4-6\n\nPresents the details of multisensory structured language instruction required for teaching students beyond grade two with word-level deficits who haven’t responded to previous phonics instruction. This on-line course provides practical application of reading research, with particular emphasis on phonological awareness, phonics & spelling at beginning levels.  There is emphasis on teaching long vowels & consonant-le patterns. Provides specific procedures to teach concepts presented in Wilson Reading System (WRS) Steps 4-6. Additional topics include the ten critical points of the Wilson Reading ...\n\n      more description for LITC-GE 2043 »\n\n      \n\n\n\nPresents the details of multisensory structured language instruction required for teaching students beyond grade two with word-level deficits who haven’t responded to previous phonics instruction. This on-line course provides practical application of reading research, with particular emphasis on phonological awareness, phonics & spelling at beginning levels.  There is emphasis on teaching long vowels & consonant-le patterns. Provides specific procedures to teach concepts presented in Wilson Reading System (WRS) Steps 4-6. Additional topics include the ten critical points of the Wilson Reading System, dyslexia, naturalistic text and handwriting.\n\n      less description for LITC-GE 2043 «",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2048",
            "course_name": "Psych Found Literacy",
            "description": "LITC-GE 2048 Psych Found Literacy \nDevelopment of an understanding of the reading process in a psychological framework.  Provides a survey of the theories underlying the assessment of reading disabilities and related learning areas.  Emphasizes the importance of understanding diagnostic data for effective intervention.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2050",
            "course_name": "Found Literacy Instruct Exceptional Children",
            "description": "LITC-GE 2050 Found Literacy Instruct Exceptional Children \nFocuses on the theoretical aspects of language and reading.  Emphasizes the teaching of reading comprehension in relation to special education populations.  Current reading materials are analyzed from a psycho-linguistic perspective.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2051",
            "course_name": "Pract Assessmnat Oral and Written Lang",
            "description": "LITC-GE 2051 Pract Assessmnat Oral and Written Lang \nDiagnosis of reading disability cases of children under supervision: interview procedures, individual informal assessment techniques, interpretation of data, recommendations for intervention both in school and at home.  Practicum work is supplemented by demonstrations, observations, lectures, and discussions of the diagnosis of reading problems affecting children.  Students reflect on their use of diagnostic techniques by viewing videos made during their interaction with their children.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2052",
            "course_name": "Pract Literacy Intervent Strategies",
            "description": "LITC-GE 2052 Pract Literacy Intervent Strategies \nIntervention with individual reading disability cases of children under supervision, including teaching strategies, lesson planning, instructional materials, and recommendations for follow-up work.  Practicum experience is supplemented by observations, lectures, and demonstrations of techniques for use with children with reading disabilities.  Students reflect on their use of intervention strategies by viewing videos made during their interaction with their children.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2054",
            "course_name": "Cli Fldwk Pract Literacy",
            "description": "LITC-GE 2054 Cli Fldwk Pract Literacy \nObservation and participation in reading clinics, schools, and public and voluntary agencies serving children and young adults with reading and learning problems.  Students are supervised by licensed reading specialists.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2056",
            "course_name": "Prep-Eval Rdng Material",
            "description": "LITC-GE 2056 Prep-Eval Rdng Material \nSelecting and critiquing specific reading and writing materials for individual children and groups.  Materials may be used in conjunction with E63.2052.  Class discussion, individual and small group work, including conferences for evaluation of narrative and expository texts as well as computer software.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2057",
            "course_name": "Content Area Rdng Wrtng",
            "description": "LITC-GE 2057 Content Area Rdng Wrtng \nFocuses on reading theories as they relate to methods and materials used with students in elementary and secondary schools and colleges.  Reading strategies needed for effective comprehension and study are stressed across the curriculum.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2060",
            "course_name": "Literacy Assessmnt/Intrv Strat Exceptional Child",
            "description": "LITC-GE 2060 Literacy Assessmnt/Intrv Strat Exceptional Child \nDiagnosis and intervention of reading disability cases of exceptional children under supervision; interview procedures, individual informal assessment techniques, interpretation of data, lesson planning, and recommendations for intervention.  Practicum work is supplemented by demonstrations and viewing videos made during students' interactions with their children.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2065",
            "course_name": "Admin/Supv Literacy Prog",
            "description": "LITC-GE 2065 Admin/Supv Literacy Prog \nExploration of the role of the literacy specialist within the school community with special attention to professional development, literacy program implementation and supervision, and student assessment responsibilities. The range of functions of the literacy specialist will be considered in light of how these are impacted by the changing needs of the school community and political exigencies. Field participation is required.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3408",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "McCallister, Cynthia",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4352",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Stahl, Katherine",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "LITC-GE 2300 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "LITC-GE 2991",
            "course_name": "Clinical Literacy Practicm-Early Childhood/Childhood",
            "description": "LITC-GE 2991 Clinical Literacy Practicm-Early Childhood/Childhood \nOne semester supervised practicum in early childhood and childhood classroom. Practicum experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": false
        },
        {
            "course_id": "LITC-GE 2992",
            "course_name": "Clinical Literacy Practicum Middle Childhood/Adolescene",
            "description": "LITC-GE 2992 Clinical Literacy Practicum Middle Childhood/Adolescene \nOne semester supervised practicum in middle childhood/adolescent classroom. Practicum experiences will be used to support theoretical and practical applications of the planning and implementation of the curriculum.",
            "offering": false
        }
    ]
}