{
    "major_id": "LIT-SHU",
    "file": "./2015-2016/Literature_(LIT-SHU).html",
    "courses": [
        {
            "course_id": "LIT-SHU 150",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19359",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "LIT-SHU  150\n\n   World Drama: Classical Conceptions\n\nThis course attempts to infuse global content and employ global perspectives in studying the classics from great theatrical traditions of the world. To examine the classics from ancient Greece through Renaissance Europe to Restoration England along with those from classical China, India and Japan is to transform how they are understood; also transformed is one’s understanding of drama when studying Sophocles, Kalidassa, Shakespeare, Tang Xianzu, Chikamatsu and Molière in the same sequence. The objective is to deepen our understanding of the diverse aesthetic principles and cultural values that...\n\n      more description for LIT-SHU  150 »\n\n      \n\n\n\nThis course attempts to infuse global content and employ global perspectives in studying the classics from great theatrical traditions of the world. To examine the classics from ancient Greece through Renaissance Europe to Restoration England along with those from classical China, India and Japan is to transform how they are understood; also transformed is one’s understanding of drama when studying Sophocles, Kalidassa, Shakespeare, Tang Xianzu, Chikamatsu and Molière in the same sequence. The objective is to deepen our understanding of the diverse aesthetic principles and cultural values that continue to impact today's theatre and drama around the world.\nThis course is an upper level elective for NYU Shanghai Humanities majors and NYU New York English majors.\n\n      less description for LIT-SHU  150 «",
            "offering": true
        },
        {
            "course_id": "LIT-SHU 220",
            "course_name": "",
            "description": "LIT-SHU  220\n\n   Shakespeare I: tragical comedies\n\nMidsummer Night’s Dream\nThe Merchant of Venice\nThe Tempest\n\n“Comedies, Histories, Tragedies”—these categories originate with the First Folio of 1623.  They are, arguably, not those of Shakespeare, who had been dead for seven years when Heminges and Condell, two actors in the playwright’s company, put the volume together.  On the evidence of the plays themselves the scheme is far too rigid.  For example, The Merchant of Venice is billed as a comedy, but its humor is of the darkest and most troubling kind. The court impresario in A Midsummer Night’s Dream introduces the play within the play (a h...\n\n      more description for LIT-SHU  220 »\n\n      \n\n\n\nMidsummer Night’s Dream\nThe Merchant of Venice\nThe Tempest\n\n“Comedies, Histories, Tragedies”—these categories originate with the First Folio of 1623.  They are, arguably, not those of Shakespeare, who had been dead for seven years when Heminges and Condell, two actors in the playwright’s company, put the volume together.  On the evidence of the plays themselves the scheme is far too rigid.  For example, The Merchant of Venice is billed as a comedy, but its humor is of the darkest and most troubling kind. The court impresario in A Midsummer Night’s Dream introduces the play within the play (a hilarious farce in which two characters die) as promising “very tragical mirth.” Titus Andronicus is a tragedy; yet at the moment of his most profound suffering, Titus bursts into laughter.  His brother asks, “Why dost thou laugh? it fits not with this hour,” to which Shakespeare’s tragic hero replies: “Why, I have not another tear to shed.” \nThrough close reading, with attention to their historical and critical context, and by means of film adaptations of the plays, these two courses will explore the “fit” between laughter and tears in Shakespearean theater.\n\n      less description for LIT-SHU  220 «",
            "offering": false
        },
        {
            "course_id": "LIT-SHU 221",
            "course_name": "",
            "description": "LIT-SHU  221\n\n   Shakespeare II:Comical Tragedies\n\nTitus Andronicus\nThe First Part of King Henry the Fourth\nAnthony and Cleopater\n\n “Comedies, Histories, Tragedies”—these categories originate with the First Folio of 1623.  They are, arguably, not those of Shakespeare, who had been dead for seven years when Heminges and Condell, two actors in the playwright’s company, put the volume together.  On the evidence of the plays themselves the scheme is far too rigid.  For example, The Merchant of Venice is billed as a comedy, but its humor is of the darkest and most troubling kind. The court impresario in A Midsummer Night’s Dream introduces the play...\n\n      more description for LIT-SHU  221 »\n\n      \n\n\n\nTitus Andronicus\nThe First Part of King Henry the Fourth\nAnthony and Cleopater\n\n “Comedies, Histories, Tragedies”—these categories originate with the First Folio of 1623.  They are, arguably, not those of Shakespeare, who had been dead for seven years when Heminges and Condell, two actors in the playwright’s company, put the volume together.  On the evidence of the plays themselves the scheme is far too rigid.  For example, The Merchant of Venice is billed as a comedy, but its humor is of the darkest and most troubling kind. The court impresario in A Midsummer Night’s Dream introduces the play within the play (a hilarious farce in which two characters die) as promising “very tragical mirth.” Titus Andronicus is a tragedy; yet at the moment of his most profound suffering, Titus bursts into laughter.  His brother asks, “Why dost thou laugh? it fits not with this hour,” to which Shakespeare’s tragic hero replies: “Why, I have not another tear to shed.” \nThrough close reading, with attention to their historical and critical context, and by means of film adaptations of the plays, these two courses will explore the “fit” between laughter and tears in Shakespearean theater.\n\n      less description for LIT-SHU  221 «",
            "offering": false
        },
        {
            "course_id": "LIT-SHU 222",
            "course_name": "",
            "description": "LIT-SHU  222\n\n   Chinese Poetry (in Translation)\n\nChina's rich record of profoundly beautiful poetry is integral to its identity as a civilization, a nation, a people. English-language translations of that poetry are attempts--also often profoundly beautiful in their own right--to translate something essential about that very identity. Yet, as we know, much is always \"lost in translation,\" and different versions of different classic texts vary greatly in what is shown, what is hidden, what is distorted, and what is invented. For those with little knowledge of Chinese poetry, this class will serve as an introduction by way of English translati...\n\n      more description for LIT-SHU  222 »\n\n      \n\n\n\nChina's rich record of profoundly beautiful poetry is integral to its identity as a civilization, a nation, a people. English-language translations of that poetry are attempts--also often profoundly beautiful in their own right--to translate something essential about that very identity. Yet, as we know, much is always \"lost in translation,\" and different versions of different classic texts vary greatly in what is shown, what is hidden, what is distorted, and what is invented. For those with little knowledge of Chinese poetry, this class will serve as an introduction by way of English translations; for those with a strong knowledge of the original Chinese classics, the class will re-present poets from Li Bai and Du Fu to Bei Dao and Gu Cheng as they have variously appeared globally to Anglophone readers the world over. All students will deepen their engagements not only with poetry and challenges of Chinese-English literary translation, but also with compelling questions arising from the philosophy of language, translation theory and literary criticism that ask us to radically reconsider how culture is represented, transmitted, and transformed by the act translation.  (satisfies Core Curriculum: China Arts)\n\n      less description for LIT-SHU  222 «",
            "offering": false
        },
        {
            "course_id": "LIT-SHU 223",
            "course_name": "",
            "description": "LIT-SHU  223\n\n   Magic and Realism in Chinese Literature\n\nMagic realism is a term that was originally coined by Franz Roh in 1925 to describe Post-expressionist visual art in Europe; however, since that time it has become synonymous with a literary genre in which marvelous elements touch and merge into an otherwise normal reality. Traditionally this genre has been associated with Latin American literature and writers, most famously Gabriel Garcia Marquez and Jorge Luis Borges. Yet, the global spread of this genre indicates that it is not exclusively the creative voice of a post-colonial mind, seeking to reconcile its new present with the traditions (...\n\n      more description for LIT-SHU  223 »\n\n      \n\n\n\nMagic realism is a term that was originally coined by Franz Roh in 1925 to describe Post-expressionist visual art in Europe; however, since that time it has become synonymous with a literary genre in which marvelous elements touch and merge into an otherwise normal reality. Traditionally this genre has been associated with Latin American literature and writers, most famously Gabriel Garcia Marquez and Jorge Luis Borges. Yet, the global spread of this genre indicates that it is not exclusively the creative voice of a post-colonial mind, seeking to reconcile its new present with the traditions (and often superstitions) of a colonial and pre-colonial past. Today, the political criteria for inclusion in the genre is as subject to question, as are the very terms post-colonial and post-modern and their allocation. As the magic realist novel is taken up by author’s whose cultural history would seem to exclude them from this category, it has revealed its import in the critical landscape as a form with a “capacity to link many different literatures” (206).\nIn this class we will be reading several magic realist novels and short stories from authors born in different countries, including Columbia, India, and the USA as we build up to a consideration of the genre as found in modern Chinese literature. We will examine how each of these authors uses the magic realist voice to speak to his or her cultural history, national future and personal sense of identity. Since classes will involve analyzing the texts from a variety of theoretical stances, and discussing our responses to their ideas and content, students should be prepared to keep up with the reading and contribute in class. \nWorks Cited:\nDe La Campa, Roman. “Magic Realism and World Literature: A Genre for the Times?” Revista Canadiense di Estudios Hispanicos.  23:2 (Invierno 1999): 205-19.\n(satisfies Core Curriculum: China Arts)\n\n      less description for LIT-SHU  223 «",
            "offering": false
        },
        {
            "course_id": "LIT-SHU 224",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19360",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "LIT-SHU  224\n\n   Hispanic Cities in Translation\n\nThis course introduces twentieth century narratives of urban life from Spain and Latin America. Through artistic and cultural depictions, the urban hubs of Barcelona, Madrid, Buenos Aires, Mexico City, Havana and New York can be read as archaeological sites of history and memory. We will read and discuss the novels, short stories and poetry of diverse authors including Federico García Lorca, Jorge Luis Borges, Roberto Bolaño, Alejo Carpentier and Octavio Paz, working with translations of their work in English. Using images, newspaper accounts, filmic and documentary representations, students w...\n\n      more description for LIT-SHU  224 »\n\n      \n\n\n\nThis course introduces twentieth century narratives of urban life from Spain and Latin America. Through artistic and cultural depictions, the urban hubs of Barcelona, Madrid, Buenos Aires, Mexico City, Havana and New York can be read as archaeological sites of history and memory. We will read and discuss the novels, short stories and poetry of diverse authors including Federico García Lorca, Jorge Luis Borges, Roberto Bolaño, Alejo Carpentier and Octavio Paz, working with translations of their work in English. Using images, newspaper accounts, filmic and documentary representations, students will analyze and distinguish specific national, regional and linguistic contexts, while grappling with larger thematic notions of intellectual, literary, and artistic migration across national borders.\n\n      less description for LIT-SHU  224 «",
            "offering": true
        }
    ]
}