{
    "major_id": "MGMT-SHU",
    "file": "./2015-2016/Management_(MGMT-SHU).html",
    "courses": [
        {
            "course_id": "MGMT-SHU 21",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19571",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Hanssen, Brian",
                    "time": "Mon,Wed 4.15 PM - 5.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MGMT-SHU   21\n\n   Managerial Skills\n\nMany companies bestow a management title on key talent and expect appropriate behavior to follow. That is not the most effective way to develop future business leaders. Your expertise will take you just so far. Increasing self-awareness and being open to feedback are important first steps in leading today's business for tomorrow's results. DEVELOPING MANAGEMENT SKILLS is a course that focuses primarily on the practical aspects of managing. This course is highly interactive and, while based on solid research, it stresses a hands-on approach to improving your management skills. The focus is on d...\n\n      more description for MGMT-SHU   21 »\n\n      \n\n\n\nMany companies bestow a management title on key talent and expect appropriate behavior to follow. That is not the most effective way to develop future business leaders. Your expertise will take you just so far. Increasing self-awareness and being open to feedback are important first steps in leading today's business for tomorrow's results. DEVELOPING MANAGEMENT SKILLS is a course that focuses primarily on the practical aspects of managing. This course is highly interactive and, while based on solid research, it stresses a hands-on approach to improving your management skills. The focus is on developing:\n\nYour Personal Skills: self-awareness; managing stress; solving problems & creativity\nWhat behaviors help or get in your way as you strive for personal/professional success?\nHow do your values influence your decisions and problem-solving approaches?\nHow do your learning styles help or hinder how you handle ethical dilemmas?, etc.)\nYour Interpersonal Skills: coaching; counseling; supportive communication; gaining power & influence; motivating self & others; managing conflict\nYour Group Skills: empowering & delegating; building teams, leading change, running meetings.\nEach session will give you an opportunity to “assess”, “analyze”, “practice”, “learn”, “teach”, and “apply” the above skills to your own work or life situation so that you can turn good ideas into effective practice. You will not only learn about management skills but you will begin to apply those skills in class, at work, at home, etc., to help you become a more effective business leader. This is not the course for you, if you prefer classes where you can sit passively by and be an \"academic tourist\".\n\nIn the self-assessment step you assess your own skills in the topic under discussion. Usually, these will be at the beginning of each chapter. Class lectures and discussions will involve such topics as: self-awareness, creative problem-solving, communication, stress management, gaining power, motivating others, managing conflict, empowering others, giving and receiving feedback, delegating, and team building, etc...not necessarily in that order. You will analyze, write about, practice and apply these topics through case studies, group exercises, and being responsible to teach some topics to the class.\n\nNOTE: We will NOT be reading each chapter in class. The text is YOUR resource to use as we go along as a starting point. Use it. We will seldom refer to it during class. It can serve as the basis for class discussion and reflection. However, it is not to be considered the only resource available to you. This is your opportunity to explore these topics through outside sources, including but not limited to professional and popular journals/books/organizations, Human Resources professionals, web sites, etc. Your chance to network beyond your comfort zone!\n\nYou will be required to keep a journal/log from day one. A self-awareness journal allows you to keep track of the issues that help or get in the way of your career/management goals and the action-steps you take to achieve them. This will be especially important for your final project. You will be required to hand in a one-page summary of highlights about ¾ of the way through the course.\nA secondary goal is to provide you an opportunity to develop your skills in critical thinking, oral and written communication, and your ability to influence others through rational and creative approaches. Therefore, at the end of this course you will be able to:\n\nDemonstrate your understanding and competence with respect to fundamental managerial skills: Self-awareness, stress management, creative problem solving, supportive communication, gaining power and influence, motivating others, managing conflict, building effective teams, etc.\nAnalyze, develop, practice, and demonstrate your ability to use these fundamental personal, interpersonal and team building skills through self-assessments, textbook learning, cases, experiential exercises, written application exercises and a final paper.\n\n      less description for MGMT-SHU   21 «",
            "offering": true
        }
    ]
}