{
    "major_id": "MGMT-UB",
    "file": "./2015-2016/Management_(MGMT-UB).html",
    "courses": [
        {
            "course_id": "MGMT-UB 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9355",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Mon,Wed 8.00 AM - 9.15 AM",
                    "open": true,
                    "professor": "Schaumberg, Rebecca"
                },
                {
                    "format": "Lecture",
                    "class_id": "9356",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Schaumberg, Rebecca"
                },
                {
                    "format": "Lecture",
                    "class_id": "9357",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "TISC UC24"
                },
                {
                    "format": "Lecture",
                    "class_id": "9358",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Schaumberg, Rebecca"
                },
                {
                    "format": "Lecture",
                    "class_id": "9359",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC UC24",
                    "time": "Mon,Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Howard, Elizabeth"
                },
                {
                    "format": "Lecture",
                    "class_id": "9360",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue,Thu 8.00 AM - 9.15 AM",
                    "open": true,
                    "professor": "TISC UC21"
                },
                {
                    "format": "Lecture",
                    "class_id": "9538",
                    "section": "007",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "TISC UC21"
                },
                {
                    "format": "Lecture",
                    "class_id": "17659",
                    "section": "008",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "TISC UC21"
                }
            ],
            "course_name": "",
            "description": "MGMT-UB    1\n\n   Management and Organizations\n\nIn this course you will attain an understanding of the key factors that contribute to organizational success and the role that managers play in helping their organizations become more successful.  The better that you understand these issues, the more effective you will be in your future careers. More specifically, the course will explore how organizational leaders develop winning strategies, and then design their organization in a way that aligns structures, social relationships, tasks, human resource practices, and people to achieve those strategies. In exploring these issues, you will identi...\n\n      more description for MGMT-UB    1 »\n\n      \n\n\n\nIn this course you will attain an understanding of the key factors that contribute to organizational success and the role that managers play in helping their organizations become more successful.  The better that you understand these issues, the more effective you will be in your future careers. More specifically, the course will explore how organizational leaders develop winning strategies, and then design their organization in a way that aligns structures, social relationships, tasks, human resource practices, and people to achieve those strategies. In exploring these issues, you will identify the challenges that organizational leaders and managers face as they try to make good decisions in the face of a constantly evolving industry environment, competing goals and agendas, and an increasingly diverse and global workforce.\n\n      less description for MGMT-UB    1 «",
            "offering": true
        },
        {
            "course_id": "MGMT-UB 4",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9685",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC21",
                    "time": "Mon,Wed 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Salomon, Robert"
                }
            ],
            "course_name": "Int'L Business Mgmt",
            "description": "MGMT-UB    4 Int'L Business Mgmt \nThis course focuses on the strategic and organizational challenges facing the multinational firm. Types of questions addressed in the course include: (1) What are the sources of competitive advantage in a global context?  (2) What differentiates a global from a domestic industry? (3) How does/should a multinational operate in these different environments?",
            "offering": true
        },
        {
            "course_id": "MGMT-UB 7",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9514",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KMEC 5-80",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Bechky, Beth"
                }
            ],
            "course_name": "Managing People & Teams at Work",
            "description": "MGMT-UB    7 Managing People & Teams at Work \nThis course combines skill building though experiential exercises and an understanding of the underlying theory to help you learn how to be an effective manager and team member in today’s technology-enabled team context. Topics include issues such as managing collaboration in and across teams, motivating effort, performance, social judgment, and cross-cultural issues. Students learn how organizations can improve their effectiveness through better management of people and how individual managers can be more effective in working with and leading others.",
            "offering": true
        },
        {
            "course_id": "MGMT-UB 8",
            "course_name": "",
            "description": "MGMT-UB    8\n\n   Managing Innovation\n\nThe success of firms, managers and individual contributors depends on their ability to identify innovative products, processes, or both. Research has shown that managing innovation requires a learning mindset attuned to new experiences, entrepreneurial thinking and pragmatic leadership. Some of the specific questions we will consider are: How is design thinking impacting our understanding of strategy and organization design? What roles do the project, middle and senior management play in the innovation process?  How do you decide which ideas are worth pursuing? How do firms choose among multip...\n\n      more description for MGMT-UB    8 »\n\n      \n\n\n\nThe success of firms, managers and individual contributors depends on their ability to identify innovative products, processes, or both. Research has shown that managing innovation requires a learning mindset attuned to new experiences, entrepreneurial thinking and pragmatic leadership. Some of the specific questions we will consider are: How is design thinking impacting our understanding of strategy and organization design? What roles do the project, middle and senior management play in the innovation process?  How do you decide which ideas are worth pursuing? How do firms choose among multiple attractive innovation projects? What are the best ways to protect a firm’s intellectual property?\n\n      less description for MGMT-UB    8 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 9",
            "course_name": "",
            "description": "MGMT-UB    9\n\n   Managing in Creative Industries\n\nThe purpose of the course is to expose students to the dynamics of cultural industries (e.g., art, theatre, music, film, photography, architecture, and so on), and to train students to think strategically about the nature of cultural products, what drives their supply and demand, the factors that affect the value of cultural products and how firms can profit from them. In order to address these issues, it is important to understand that a key feature of these industries is that symbolic and aesthetic attributes are at the very core of value creation. This implies that the value of cultural pro...\n\n      more description for MGMT-UB    9 »\n\n      \n\n\n\nThe purpose of the course is to expose students to the dynamics of cultural industries (e.g., art, theatre, music, film, photography, architecture, and so on), and to train students to think strategically about the nature of cultural products, what drives their supply and demand, the factors that affect the value of cultural products and how firms can profit from them. In order to address these issues, it is important to understand that a key feature of these industries is that symbolic and aesthetic attributes are at the very core of value creation. This implies that the value of cultural products depends largely on third parties, e.g., critics, dealers, foundations, users, etc. Some of these parties act as powerful intermediaries or gatekeepers as they control critical material and symbolic resources firms need in order to (continue to) produce cultural products.\n\n      less description for MGMT-UB    9 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 11",
            "course_name": "",
            "description": "MGMT-UB   11\n\n   International Studies Program:\n\nThe International Studies Program (ISP) builds on the historical and cultural courses of the first two years of undergraduate study and on Economics of Global Business (ECON-UB 11). Students develop frameworks and techniques for analyzing how countries differ and the impact of those differences on opportunities for the growth and profitability of multinational firms headquartered or investing in different countries. Students also develop concepts and tools useful in formulating competitive strategy for multinational firms competing in global industries. Working in teams, students carry out an ...\n\n      more description for MGMT-UB   11 »\n\n      \n\n\n\nThe International Studies Program (ISP) builds on the historical and cultural courses of the first two years of undergraduate study and on Economics of Global Business (ECON-UB 11). Students develop frameworks and techniques for analyzing how countries differ and the impact of those differences on opportunities for the growth and profitability of multinational firms headquartered or investing in different countries. Students also develop concepts and tools useful in formulating competitive strategy for multinational firms competing in global industries. Working in teams, students carry out an in-depth study of a company located in a foreign country. This study consists of three parts: (1) a written proposal; (2) research and data collection from secondary sources, augmented by primary research on-site in the foreign country during spring semester break; and (3) preparation of a final report and oral presentation of findings.  Teamwork and oral and written presentation skills are an integral part of ISP. This course cannot be taken to meet any elective requirements for the management concentration.\n\n      less description for MGMT-UB   11 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 16",
            "course_name": "",
            "description": "MGMT-UB   16\n\n   Strategic Analysis for Success in Digital Age\n\nThe emphasis of this course is on using the tools of organizational and strategic analysis to understand the competitive vortex that has been caused by digital convergence in entertainment, media, and technology firms. The course takes a managerial point of view?emphasizing the framing and resolution of large, multidimensional problems. As such, the course asks students to act as advisers to general managers or as general managers themselves. The course involves case analyses that require application of the conceptual materials read for each class. The structure of the class is based on the pr...\n\n      more description for MGMT-UB   16 »\n\n      \n\n\n\nThe emphasis of this course is on using the tools of organizational and strategic analysis to understand the competitive vortex that has been caused by digital convergence in entertainment, media, and technology firms. The course takes a managerial point of view?emphasizing the framing and resolution of large, multidimensional problems. As such, the course asks students to act as advisers to general managers or as general managers themselves. The course involves case analyses that require application of the conceptual materials read for each class. The structure of the class is based on the premise that effective firm performance in these conditions requires coordination of people and groups of people.\n\n      less description for MGMT-UB   16 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 18",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9673",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC 200",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Gartenberg, Claudine D"
                },
                {
                    "format": "Lecture",
                    "class_id": "9693",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC 200",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Gartenberg, Claudine D"
                }
            ],
            "course_name": "",
            "description": "MGMT-UB   18\n\n   Strategic Analysis\n\nThis course emphasizes the need to look outward to the environment and inward to a firm’s resources and capabilities and operating policies. It describes a firm’s strategy as the formulation of “competitive strategy”, “corporate strategy,” and “organizational strategy.” Competitive strategy involves identifying structurally attractive industries and developing the most attractive position within that industry - where attractiveness is driven by absolute conditions combined with the resources and capabilities the firm brings to that position. Businesses create value by operating in positions wi...\n\n      more description for MGMT-UB   18 »\n\n      \n\n\n\nThis course emphasizes the need to look outward to the environment and inward to a firm’s resources and capabilities and operating policies. It describes a firm’s strategy as the formulation of “competitive strategy”, “corporate strategy,” and “organizational strategy.” Competitive strategy involves identifying structurally attractive industries and developing the most attractive position within that industry - where attractiveness is driven by absolute conditions combined with the resources and capabilities the firm brings to that position. Businesses create value by operating in positions within industries that, by virtue of the characteristics of industry, the position, and the firm, are defensible from the encroachment of competitors and deterioration of the environment as a whole. Corporate strategy focuses on the management and understanding of multi-product, multi-location, and multi-business firms. Organizational strategy involves developing policies within each functional area of the business unit that are integrative and consistent with the firm’s plan for creating value.\n\n      less description for MGMT-UB   18 «",
            "offering": true
        },
        {
            "course_id": "MGMT-UB 20",
            "course_name": "",
            "description": "MGMT-UB   20\n\n   Strategic Analysis for Leaders,Analysts&Consult\n\nThis course focuses on the competitive strategy of the firm, examining issues central to its short- and long-term competitive position. Students are asked to put themselves in the role of key decision maker and to develop or maintain the competitive advantage of the firm in a given industry or industry segment. This course emphasizes the need to look outward to the environment and inward to the firm?s resources and capabilities and operating policies. Students learn concepts and tools for analyzing the competitive environment, strategic position, and firm-specific capabilities in order to unde...\n\n      more description for MGMT-UB   20 »\n\n      \n\n\n\nThis course focuses on the competitive strategy of the firm, examining issues central to its short- and long-term competitive position. Students are asked to put themselves in the role of key decision maker and to develop or maintain the competitive advantage of the firm in a given industry or industry segment. This course emphasizes the need to look outward to the environment and inward to the firm?s resources and capabilities and operating policies. Students learn concepts and tools for analyzing the competitive environment, strategic position, and firm-specific capabilities in order to understand the sources of a firm?s advantage. Businesses create value by operating in positions within industries that, by virtue of the characteristics of the industry, the position, and the firm, are defensible from the encroachment of competitors and deterioration of the environment as a whole. Additionally, students address corporate strategy issues. Corporate strategy focuses on the management and understanding of multiproduct, multilocation, and multibusiness firms. This portion of the course investigates the economic logic and organizational constraints associated with diversification and horizontal and vertical integration.\n\n      less description for MGMT-UB   20 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 21",
            "course_name": "",
            "description": "MGMT-UB   21\n\n   Managerial Skills\n\nIncreasing self-awareness and openness to feedback are important first steps in leading today’s business for tomorrow’s results. Many companies bestow a management title on key talent and expect appropriate behavior to follow, but that is not the most effective way to develop future business leaders. In this course you will focus primarily on the practical aspects of managing. While based on solid research, the course stresses a hands-on approach to improving students’ management skills. Each session focuses on developing (1)  personal skills: self-awareness, managing stress, solving problems,...\n\n      more description for MGMT-UB   21 »\n\n      \n\n\n\nIncreasing self-awareness and openness to feedback are important first steps in leading today’s business for tomorrow’s results. Many companies bestow a management title on key talent and expect appropriate behavior to follow, but that is not the most effective way to develop future business leaders. In this course you will focus primarily on the practical aspects of managing. While based on solid research, the course stresses a hands-on approach to improving students’ management skills. Each session focuses on developing (1)  personal skills: self-awareness, managing stress, solving problems, and creativity; (2) interpersonal skills: coaching, counseling, supportive communication, gaining power and influence, motivating self and others, and managing conflict; and (3) group skills: empowering, delegating, and building effective teams.\n\n      less description for MGMT-UB   21 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 23",
            "course_name": "",
            "description": "MGMT-UB   23\n\n   Women in Business Leadership\n\nIn the past half century, women have played increasingly prominent roles in the U.S. labor force, as workers, managers, and executives. This phenomenon, arguably one of the most significant in contemporary demography, has vast implications for organizations, individuals?both female and male?and the economy as a whole. In addition to the societal issues raised by women?s increased labor force participation, practical, day-to-day issues have arisen that must be addressed by individuals and the organizations in which they work. The goal of this course is to assist students in developing an inform...\n\n      more description for MGMT-UB   23 »\n\n      \n\n\n\nIn the past half century, women have played increasingly prominent roles in the U.S. labor force, as workers, managers, and executives. This phenomenon, arguably one of the most significant in contemporary demography, has vast implications for organizations, individuals?both female and male?and the economy as a whole. In addition to the societal issues raised by women?s increased labor force participation, practical, day-to-day issues have arisen that must be addressed by individuals and the organizations in which they work. The goal of this course is to assist students in developing an informed perspective on the organizational dynamics businesses will face during the next decade; to recognize how business organizations can capitalize on the talent pool that has been created; and to provide insight into the opportunities and obstacles students may encounter because of the changes described.\n\n      less description for MGMT-UB   23 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 25",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9626",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC21",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Lechner, Anat"
                }
            ],
            "course_name": "Managing Change",
            "description": "MGMT-UB   25 Managing Change \nManaging change is a central concern for today’s managers. Managing change is also the primary focus of the management consulting industry. To effectively manage change you will need a  solid understanding of what change is about, what are its critical aspects, and how one can lead change initiatives in a disciplined and successful way. Case analysis and applied projects are the major vehicles for learning in this course. Note: This course is particularly relevant for students who plan to pursue careers as general managers or management consultants",
            "offering": true
        },
        {
            "course_id": "MGMT-UB 28",
            "course_name": "",
            "description": "MGMT-UB   28\n\n   Managing Family Business and Privately Held Firms\n\nIn this course you will develop an understanding of how privately held firms and family businesses differ from their for-profit competitors. The course consists of four modules, which address the following questions: (1) How does family control affect strategy and management decisions such as diversification, M&As, or financial policies? (2) How can growth in family businesses be managed and financed? (3) What structures and mechanisms can be put in place to manage family dynamics in a productive way? (4) How can succession be managed to ensure continuity in family business systems? (5) How ca...\n\n      more description for MGMT-UB   28 »\n\n      \n\n\n\nIn this course you will develop an understanding of how privately held firms and family businesses differ from their for-profit competitors. The course consists of four modules, which address the following questions: (1) How does family control affect strategy and management decisions such as diversification, M&As, or financial policies? (2) How can growth in family businesses be managed and financed? (3) What structures and mechanisms can be put in place to manage family dynamics in a productive way? (4) How can succession be managed to ensure continuity in family business systems? (5) How can family ownership and control be transferred from one generation to another? Students who want to pursue a general management, consulting, or finance career have a high probability of working at or with a family-controlled business. Whatever their future role, students will find it useful to understand the uniqueness of these companies, and why they may or may not want to be involved with them.\n\n      less description for MGMT-UB   28 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 30",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9361",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "TISC LC21"
                },
                {
                    "format": "Lecture",
                    "class_id": "9664",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon,Wed 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "TISC LC21"
                }
            ],
            "course_name": "Negotiation & Consensus Building",
            "description": "MGMT-UB   30 Negotiation & Consensus Building \nEffective negotiation and consensus-building skills are essential for success in almost any work life domain—whether your goal is to be an entrepreneur, film producer, business manager, or political leader. In this course, students study how people reach agreement and develop an analytical approach for reaching more effective agreements in organizational settings. The course draws from research in psychology and economics to provide academic content, while making use of role-playing exercises and experiential learning to emphasize key applied lessons.",
            "offering": true
        },
        {
            "course_id": "MGMT-UB 35",
            "course_name": "Growth, Strategy & Mgmt",
            "description": "MGMT-UB   35 Growth, Strategy & Mgmt \nIn this course you will learn how to devise and implement strategies that enable businesses to make the leap from entrepreneurial ventures to successful, professionally managed Small and Medium Size Enterprises. The course addresses (1) Why do some entrepreneurial ventures successfully transition to small, medium, and large-scale enterprises while others do not? (2) What are the challenges and opportunities of each growth stage? (3) How do firms successfully make the transition from each growth stage to the next?",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 36",
            "course_name": "The Globalization of Business Enterprise",
            "description": "MGMT-UB   36 The Globalization of Business Enterprise \nThe Globalization of Business Enterprise (GLOBE) will focus on globalization and what it means for business enterprises. The emphasis will be on going beyond the “just-do-it” approach to globalization to thinking about globalization moves in a way that is anchored in the realities of the global business environment and looks at their personal as well as business implications. From a business perspective, the implications for a range of key functional areas will be discussed, not just the implications for business strategy—although the latter will be a key focus.",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 61",
            "course_name": "Human Resources Mgmt",
            "description": "MGMT-UB   61 Human Resources Mgmt",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 66",
            "course_name": "",
            "description": "MGMT-UB   66\n\n   Power & Politics\n\nPolitics is not a dirty word! You just need to learn how to play good politics and keep out bad politics. By the same logic, power by itself does not necessarily corrupt though absolute power may corrupt absolutely. In other words, this course is about how to conquer the world, or at least survive the corporate jungle, without losing your soul. Even if you don’t want to play politics, good or bad, you need the skills from this course to ensure that you don’t become a victim of politics. By the end of this course you will (1) be able to have not only a conceptual understanding of what power is ...\n\n      more description for MGMT-UB   66 »\n\n      \n\n\n\nPolitics is not a dirty word! You just need to learn how to play good politics and keep out bad politics. By the same logic, power by itself does not necessarily corrupt though absolute power may corrupt absolutely. In other words, this course is about how to conquer the world, or at least survive the corporate jungle, without losing your soul. Even if you don’t want to play politics, good or bad, you need the skills from this course to ensure that you don’t become a victim of politics. By the end of this course you will (1) be able to have not only a conceptual understanding of what power is within an organizational context but a practical grasp of what the actual sources of power are; and (2) will have gained substantial insight into how best to harness your political skills for effective management of your career path.\n\n      less description for MGMT-UB   66 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 85",
            "course_name": "Patterns of Entrepreneurship",
            "description": "MGMT-UB   85 Patterns of Entrepreneurship \nThis course offers a framework for understanding the entrepreneurial process and exposes students to challenges, problems, and issues faced by entrepreneurs who start new businesses. Case studies are the principal teaching method, supplemented by lectures, business cases, and guest speakers. Students learn to identify and evaluate business opportunities, develop a business concept and assess and obtain the required resources, and manage the growth of new ventures.",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 94",
            "course_name": "Ind Sty Mgt/Org Behavior",
            "description": "MGMT-UB   94 Ind Sty Mgt/Org Behavior",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 95",
            "course_name": "Sel Top Mgt/Org Behavior",
            "description": "MGMT-UB   95 Sel Top Mgt/Org Behavior",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 96",
            "course_name": "Indep Study in Mgmt",
            "description": "MGMT-UB   96 Indep Study in Mgmt",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 97",
            "course_name": "Ind Study in Mgmt",
            "description": "MGMT-UB   97 Ind Study in Mgmt",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 98",
            "course_name": "Ind Sty Mgt/Org Behavior",
            "description": "MGMT-UB   98 Ind Sty Mgt/Org Behavior",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 99",
            "course_name": "Ind Sty Mgt/Org Behavior",
            "description": "MGMT-UB   99 Ind Sty Mgt/Org Behavior",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 100",
            "course_name": "Competitive & Corporate Strategy",
            "description": "MGMT-UB  100 Competitive & Corporate Strategy",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 300",
            "course_name": "Senior Seminar: Organizational Design",
            "description": "MGMT-UB  300 Senior Seminar: Organizational Design \nThis seminar introduces students to concepts of organization design and how they have developed and changed, moving from static notions based on unchanging, objective worlds, to dynamic notions based on changing subjective worlds that designers construct and influence. The emphasis in discussions and projects is on exploring how organization designs adapt and evolve over time, generating not only anticipated but also unanticipated outcomes. Students learn how in their evolution, organization designs affect not only organizational performance but also the quality of organizational life.",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 8001",
            "course_name": "Management & Organiz Analysis",
            "description": "MGMT-UB 8001 Management & Organiz Analysis",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 9001",
            "course_name": "",
            "description": "MGMT-UB 9001\n\n   Management & Organizations\n\nIn this course you will attain an understanding of the key factors that contribute to organizational success and the role that managers play in helping their organizations become more successful.  The better that you understand these issues, the more effective you will be in your future careers. More specifically, the course will explore how organizational leaders develop winning strategies, and then design their organization in a way that aligns structures, social relationships, tasks, human resource practices, and people to achieve those strategies. In exploring these issues, you will identi...\n\n      more description for MGMT-UB 9001 »\n\n      \n\n\n\nIn this course you will attain an understanding of the key factors that contribute to organizational success and the role that managers play in helping their organizations become more successful.  The better that you understand these issues, the more effective you will be in your future careers. More specifically, the course will explore how organizational leaders develop winning strategies, and then design their organization in a way that aligns structures, social relationships, tasks, human resource practices, and people to achieve those strategies. In exploring these issues, you will identify the challenges that organizational leaders and managers face as they try to make good decisions in the face of a constantly evolving industry environment, competing goals and agendas, and an increasingly diverse and global workforce.\n\n      less description for MGMT-UB 9001 «",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 9002",
            "course_name": "Intro to Global Negotiations",
            "description": "MGMT-UB 9002 Intro to Global Negotiations",
            "offering": false
        },
        {
            "course_id": "MGMT-UB 9087",
            "course_name": "",
            "description": "MGMT-UB 9087\n\n   Innovation and Entrepreneurship in Israel\n\nCourse Description: The course explores the origins for the emerging of a\nvibrant technological entrepreneurial ecosystem in Israel. The course\nadopts five type of lenses to explain the remarkable burst in Hi-Tech\nstartups in Israel during the last 25 years. These five lenses are: 1) The\navailability of suitable factors of production through the Israeli Defense\nForces, the Israeli Academia and immigration; 2) The emergence of related\nand supporting industries often located in designated geographical\nclusters; 3) Adverse local demand conditions; 4) Specific strategies,\nstructures and corporate ...\n\n      more description for MGMT-UB 9087 »\n\n      \n\n\n\nCourse Description: The course explores the origins for the emerging of a\nvibrant technological entrepreneurial ecosystem in Israel. The course\nadopts five type of lenses to explain the remarkable burst in Hi-Tech\nstartups in Israel during the last 25 years. These five lenses are: 1) The\navailability of suitable factors of production through the Israeli Defense\nForces, the Israeli Academia and immigration; 2) The emergence of related\nand supporting industries often located in designated geographical\nclusters; 3) Adverse local demand conditions; 4) Specific strategies,\nstructures and corporate cultures; and 5) the role of the Israeli\ngovernment in seeding the conditions for the emergence of complementary\nfinancial sources, as well as creating supportive tax and intellectual\nproperty rights systems. The course will go on to explore recent trends in\nthe development of the Israeli Hi-tech industry, highlight possible\nconstraints for its continued growth. Finally, the course draws wider\nconclusions as to the required conditions for seeding and nurturing similar\ntechnological entrepreneurial ecosystems in other countries around the\nworld.\n\n      less description for MGMT-UB 9087 «",
            "offering": false
        }
    ]
}