{
    "major_id": "MEST1-UC",
    "file": "./2015-2016/Media_Studies_(MEST1-UC).html",
    "courses": [
        {
            "course_id": "MEST1-UC 6001",
            "course_name": "Hip Hop Culture",
            "description": "MEST1-UC 6001 Hip Hop Culture \nThis course acquaints students with semiotics, human-created sign systems within specific historical and cultural systems. These sign systems can range from clothing to architecture, from language to cinema, and advertisement to hypertext. Students examine how specific systems of meaning function within their historical, cultural, and ideological contexts. Students read semiotic theory in its original context, while preparing their analyses of particular semiotic systems.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6002",
            "course_name": "Media and Literary Genres I",
            "description": "MEST1-UC 6002 Media and Literary Genres I \nThis course investigates the historical and formal relationship between evolving media and the literatures that are born in relation to those technologies. Beginning with oral media and continuing through the birth of writing, the alphabet, the printing press, up through early photography and early film, students examine how writers have historically responded to the cultural and literary changes effected by each medium.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6003",
            "course_name": "Media and Literary Genres II:",
            "description": "MEST1-UC 6003 Media and Literary Genres II: \nThis course continues the examination of the interaction between media, culture, and literature. We will focus on 20th century media, beginning with photography, film, radio, and television, ending with the explosion of genres on the Internet, including the effects of games, graphics, and the structure of the Internet itself.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6004",
            "course_name": "",
            "description": "MEST1-UC 6004\n\n   Race, Ethnicity, Class & The Media\n\nThis course examines the news media's coverage of blacks, Latinos, gays and lesbians, and other groups. Topics of study include the impact of prejudice on media coverage and the impact of media coverage on prejudice, the perpetuation of stereotypes, us versus them reporting, segregation in the news, the influence of activists, and the presence of minority reporters. Case studies focus on crime coverage, welfare stories, immigration issues, the gay and lesbian marriage debate, and HIV/AIDS. Through guided exercises students interview and report on issues relevant to one group other than their o...\n\n      more description for MEST1-UC 6004 »\n\n      \n\n\n\nThis course examines the news media's coverage of blacks, Latinos, gays and lesbians, and other groups. Topics of study include the impact of prejudice on media coverage and the impact of media coverage on prejudice, the perpetuation of stereotypes, us versus them reporting, segregation in the news, the influence of activists, and the presence of minority reporters. Case studies focus on crime coverage, welfare stories, immigration issues, the gay and lesbian marriage debate, and HIV/AIDS. Through guided exercises students interview and report on issues relevant to one group other than their own.\n\n      less description for MEST1-UC 6004 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6005",
            "course_name": "",
            "description": "MEST1-UC 6005\n\n   Global Perspectives in Media\n\nThe aim of this course is twofold: to examine and seek to understand the impact of globalization on the media, and to explore the role of the media in the process of globalization. Students discuss and analyze key issues within the globalization debate: in various theoretical perspectives, and as they occur in social practice around the globe. The course covers such concepts as media systems in the global society; media, public sphere(s), and national identity; transnational media; globalization, homogenization, and hybridization; media and cultural imperialism; the impact of mass media on dem...\n\n      more description for MEST1-UC 6005 »\n\n      \n\n\n\nThe aim of this course is twofold: to examine and seek to understand the impact of globalization on the media, and to explore the role of the media in the process of globalization. Students discuss and analyze key issues within the globalization debate: in various theoretical perspectives, and as they occur in social practice around the globe. The course covers such concepts as media systems in the global society; media, public sphere(s), and national identity; transnational media; globalization, homogenization, and hybridization; media and cultural imperialism; the impact of mass media on democratic development around the world; media control, regulation, and ownership; global, national, and local audiences; alternative media in the global context; and communications, public relations, and diplomacy.\n\n      less description for MEST1-UC 6005 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6006",
            "course_name": "",
            "description": "MEST1-UC 6006\n\n   Cultural Identities in The Media\n\nThis course explores the concepts of identity from multiple disciplines, such as psychology, sociology, gender studies, and critical race theories, and then focuses on the role mass media plays in the construction of cultural identity. Students will investigate both the macro and micro levels of the interaction of media and identities. At the macro level, we will look at how media reflect, perpetuate, and reinforce (but also challenge) social forces such as economics, politics, and laws concerning the social categories (such as race, gender, class, and sexuality) that affect individuals. Using...\n\n      more description for MEST1-UC 6006 »\n\n      \n\n\n\nThis course explores the concepts of identity from multiple disciplines, such as psychology, sociology, gender studies, and critical race theories, and then focuses on the role mass media plays in the construction of cultural identity. Students will investigate both the macro and micro levels of the interaction of media and identities. At the macro level, we will look at how media reflect, perpetuate, and reinforce (but also challenge) social forces such as economics, politics, and laws concerning the social categories (such as race, gender, class, and sexuality) that affect individuals. Using theories and empirical research from audience reception, we will also examine, at the micro level, how audiences interpret, appropriate, and incorporate media representations in their construction of self. Students will study key notions and theories of cultural identities and develop a nuanced understanding of media influence, particularly the tension between media hegemony and personal agency.\n\n      less description for MEST1-UC 6006 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6007",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17120",
                    "section": "001",
                    "period": "09/14/2015 - 12/21/2015",
                    "location": "194M 210",
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Sun, Chyng-Feng"
                }
            ],
            "course_name": "",
            "description": "MEST1-UC 6007\n\n   Gender, Sexualities & The Media\n\nThis course examines the relationships among media, sexuality, and gender politics. Students analyze theories of the construction of sexuality, femininity, masculinity, and male violence from multidisciplinary perspectives - biological, cultural, psychological, and anthropological. Applying feminist theories, queer theories, film theories, and theories of sexual scripts to the text of popular media and sexually explicit materials (such as pornography), students engage in a discussion of eroticism, sexual fantasy, desire, and the eroticization of violence. Students learn to demonstrate a critic...\n\n      more description for MEST1-UC 6007 »\n\n      \n\n\n\nThis course examines the relationships among media, sexuality, and gender politics. Students analyze theories of the construction of sexuality, femininity, masculinity, and male violence from multidisciplinary perspectives - biological, cultural, psychological, and anthropological. Applying feminist theories, queer theories, film theories, and theories of sexual scripts to the text of popular media and sexually explicit materials (such as pornography), students engage in a discussion of eroticism, sexual fantasy, desire, and the eroticization of violence. Students learn to demonstrate a critical understanding of the key theories of gender and sexuality from multiple disciplines, and to apply these theories in their analyses of the media text.\n\n      less description for MEST1-UC 6007 «",
            "offering": true
        },
        {
            "course_id": "MEST1-UC 6008",
            "course_name": "Advertising & Media Audiences",
            "description": "MEST1-UC 6008 Advertising & Media Audiences",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6009",
            "course_name": "Global Television",
            "description": "MEST1-UC 6009 Global Television \nFamiliarizes students with the political-economic and technological forces that have driven the globalization of television. Looks at the organization of the international television market, the key players in the global exchange of television programming, and the ways in which television and the new media technologies have contributed to the creation of the \"global village.\" Addresses the role of media globalization in redefining cultural boundaries and assesses the fears and hopes of nation-states and cultural minorities as they face changing local and global media landscapes.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6010",
            "course_name": "Children's Culture and Media",
            "description": "MEST1-UC 6010 Children's Culture and Media \nThrough examination of children's classics and fairy tales, as well as empirical research on gender development in early childhood, this course analyzes media corporations' role in shaping children's imaginations and in commercializing children's culture. Students explore media literacy and cultural policies that can promote a healthy cultural environment for children; analyze the content of children's media; and develop research skills to investigate the production of children's media, media effects on children, media literacy, and cultural policies.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6011",
            "course_name": "The Roots of Hip Hop",
            "description": "MEST1-UC 6011 The Roots of Hip Hop \nThis course is based on the premise that many forms of popular music indigenous to American soil have been linked to African tradition and the experiences of African-Americans. The course will examine how the earliest musical forms remained largely inaccessible to whites, but over time mixed with European musical elements became the backbone to American popular entertainment. Hip Hop music is the continuation of that tradition in that it began as a genre exclusive to African Americans and then became a part of American Pop music.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6012",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9967",
                    "section": "200",
                    "period": "09/02/2015 - 10/25/2015 ",
                    "location": "Hsiao, Aron",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MEST1-UC 6012\n\n   Social Media\n\nSocial media is calling into question traditional media models and providing new ways to facilitate meaningful exchanges and value creation in both the commercial and public spheres. It requires new ways to conceptualize communication flows and strategies and to understand how they influence cultures, economies, and society as a whole. Social media also requires new skills t conduct successful commercial and grassroots operations and campaigns. This course introduces the student to new developments in social media technologies and techniques; discusses the key communication and economic attrib...\n\n      more description for MEST1-UC 6012 »\n\n      \n\n\n\nSocial media is calling into question traditional media models and providing new ways to facilitate meaningful exchanges and value creation in both the commercial and public spheres. It requires new ways to conceptualize communication flows and strategies and to understand how they influence cultures, economies, and society as a whole. Social media also requires new skills t conduct successful commercial and grassroots operations and campaigns. This course introduces the student to new developments in social media technologies and techniques; discusses the key communication and economic attributes that power this medium; helps them understand how social media can be used as part of an organization’s communications strategy; identifies key skill sets and knowledge students can acquire for entrepreneurial innovation and employment in this area, and lastly; exposes them to some of the legal, privacy, and other unfolding social concerns that accompany this dynamic new medium.\n\n      less description for MEST1-UC 6012 «",
            "offering": true
        },
        {
            "course_id": "MEST1-UC 6013",
            "course_name": "Writing for Media and Communication",
            "description": "MEST1-UC 6013 Writing for Media and Communication \nTo say the media landscape is changing would be a gross understatement. Journalism, marketing, advertising, and PR have always been evolving, but never so dramatically as in the past 10-15 years. Indeed, new technologies and digital platforms have impacted these industries and the way we live to such an extent that the whole concept of a “media landscape” is under review. It has evolved into a pixilated question mark.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6016",
            "course_name": "Mass Media & American Popular Culture",
            "description": "MEST1-UC 6016 Mass Media & American Popular Culture \nThis course examines modern American popular culture as a diverse association and grouping of texts, images, genres, and representations across a spectrum of different media. Students explore definitions of popular culture and their theoretical contexts from a humanities perspective and are introduced to the interpretations, constructions, and uses of popular culture by various groups within discursive social spaces. We discuss issues of power and knowledge, violence, race, gender, taste and style, consumption and production, and audience.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6017",
            "course_name": "History of Film",
            "description": "MEST1-UC 6017 History of Film \nThis course follows the history of moving images from their earliest cultural contexts in Egyptian experiments with light. As the moving image has evolved, so too has the practice and theory of its making, along with awareness of its impact on culture. In this course, students trace the beginnings of film with early still cameras, through to the effects of contemporary digitized extravaganzas. Students examine the evolution of specific genres, such as the Western, women's film, documentary, action pictures, science fiction, and film noir.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6018",
            "course_name": "Media & Religion",
            "description": "MEST1-UC 6018 Media & Religion \nIn this course students examine the historical relationship between media and religion. How does mediated religion drive the political, cultural, and legislative agenda? How are Internet and satellite television technology used by various religious groups? Is it ethical to use modern media techniques and technologies to proselytize? Along with observing specific practices on television and computer, we read from a wide selection of texts from media theory to theology and philosophy.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6019",
            "course_name": "",
            "description": "MEST1-UC 6019\n\n   Mind, Body, Media\n\nThroughout history and across cultures, notions of the interaction of mind and body have been mediated and transformed by technological and scientific discoveries. In this course, students explore the effects of language, technology, and media on our conceptions of mind and matter. How have scientific theories and inventions in\ncommunications interacted with institutions of religion, literature, education, and law to construct and validate as “real” specific notions of nature, crime and punishment, beauty, sexuality, or disease and health? Students read the primary work of germinal thinkers s...\n\n      more description for MEST1-UC 6019 »\n\n      \n\n\n\nThroughout history and across cultures, notions of the interaction of mind and body have been mediated and transformed by technological and scientific discoveries. In this course, students explore the effects of language, technology, and media on our conceptions of mind and matter. How have scientific theories and inventions in\ncommunications interacted with institutions of religion, literature, education, and law to construct and validate as “real” specific notions of nature, crime and punishment, beauty, sexuality, or disease and health? Students read the primary work of germinal thinkers such as Plato, Descartes, Bacon, Newton, and Kuhn, and theorists such as Foucault, Scarry, Fox Keller, and Haraway.\n\n      less description for MEST1-UC 6019 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6020",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17121",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": "25W4 C-10",
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Tahara, Reiko"
                }
            ],
            "course_name": "",
            "description": "MEST1-UC 6020\n\n   World Cinema\n\nThis course surveys the history, theory, aesthetics, and development of the cinemas of the so-called \"Third World.\" Through film screenings and a wide range of theoretical and critical readings, students problematize the term \"Third World\" over three continents to explore several schools of cinema and narrative styles developed by selected filmmakers from Africa, Asia, Latin America, and the Middle East. Students familiarize themselves with theories that address the struggle for independence, colonialism, and revolution that are pertinent for the development of the cinemas of these regions. Th...\n\n      more description for MEST1-UC 6020 »\n\n      \n\n\n\nThis course surveys the history, theory, aesthetics, and development of the cinemas of the so-called \"Third World.\" Through film screenings and a wide range of theoretical and critical readings, students problematize the term \"Third World\" over three continents to explore several schools of cinema and narrative styles developed by selected filmmakers from Africa, Asia, Latin America, and the Middle East. Students familiarize themselves with theories that address the struggle for independence, colonialism, and revolution that are pertinent for the development of the cinemas of these regions. The goal of this course is to help students develop the analytical tools needed to understand the various forces that have shaped the \"Third World\" cinematic movements of the past four decades.\n\n      less description for MEST1-UC 6020 «",
            "offering": true
        },
        {
            "course_id": "MEST1-UC 6026",
            "course_name": "Comparative Journalism",
            "description": "MEST1-UC 6026 Comparative Journalism",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6027",
            "course_name": "History of Broadcasting",
            "description": "MEST1-UC 6027 History of Broadcasting",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6028",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9968",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "194M 205",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Sun, Chyng-Feng"
                }
            ],
            "course_name": "",
            "description": "MEST1-UC 6028\n\n   Understanding Media\n\nThis course introduces key concepts and theories in media studies and analyzes a wide range of contemporary popular media genres, such as movies, talk shows, news programs, soap operas, children's programs, and advertisements. Students develop a holistic understanding of how U.S. media systems work; how media messages are encoded with ideological assumptions; and how audiences generate hegemonic and counter-hegemonic readings of media text. Students learn to apply media theories to everyday media experiences and develop the competency to research, write academically, and gather information thr...\n\n      more description for MEST1-UC 6028 »\n\n      \n\n\n\nThis course introduces key concepts and theories in media studies and analyzes a wide range of contemporary popular media genres, such as movies, talk shows, news programs, soap operas, children's programs, and advertisements. Students develop a holistic understanding of how U.S. media systems work; how media messages are encoded with ideological assumptions; and how audiences generate hegemonic and counter-hegemonic readings of media text. Students learn to apply media theories to everyday media experiences and develop the competency to research, write academically, and gather information through alternative media sources.\n\n      less description for MEST1-UC 6028 «",
            "offering": true
        },
        {
            "course_id": "MEST1-UC 6030",
            "course_name": "Documentary Cinema",
            "description": "MEST1-UC 6030 Documentary Cinema \nThis course provides students with an understanding of the historical and social context that gave rise to documentary films of various styles and traditions in the United States as well as other Western and non-Western countries. Students learn the analytical and critical tools to examine different styles and genres of nonfiction film by exploring questions of \"reality,\" the author's voice, political persuasion, and means of representation.  Students watch films and analyze the way \"reality\" is represented.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6032",
            "course_name": "",
            "description": "MEST1-UC 6032\n\n   Reality TV\n\nThe basis for the appeal of both talk shows and reality TV may lie mainly in the “uncensored,” “unscripted,” and “spontaneous” nature of these human dramas. Real World, which premiered on MTV in 1991, has been credited with helping to establish many of the textual characteristics that define the genre of “Reality TV,” a form that in less than 20 years has come to dominate the American television landscape. From its inception, Reality TV has ballooned, mushroomed, and mutated into endless hybrids and sub-genres. This course aims to explore questions such as: What are the political and economic ...\n\n      more description for MEST1-UC 6032 »\n\n      \n\n\n\nThe basis for the appeal of both talk shows and reality TV may lie mainly in the “uncensored,” “unscripted,” and “spontaneous” nature of these human dramas. Real World, which premiered on MTV in 1991, has been credited with helping to establish many of the textual characteristics that define the genre of “Reality TV,” a form that in less than 20 years has come to dominate the American television landscape. From its inception, Reality TV has ballooned, mushroomed, and mutated into endless hybrids and sub-genres. This course aims to explore questions such as: What are the political and economic environments and ideologies that facilitate not only why and how the programs are produced, but also the audiences’ reactions? How may this fascination or even obsession with the “real” impact the styles and productions of other cultural products? How are the factors of race, class, gender, and sexuality systematically represented in the programs, and what is Realty TV’s social impact?\n\n      less description for MEST1-UC 6032 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6033",
            "course_name": "The Language of Contemporary Images",
            "description": "MEST1-UC 6033 The Language of Contemporary Images \nThis course examines how contemporary images in photography, film, television, and the many forms of digital imagery construct narratives of identity, culture, and meaning. This course explores that question by approaching visual images as a language with a particular syntax, grammar, and set of articulations which enable an almost infinite variety of signifying practices. Topics include the shot as the basic unit of film structure; the effects of lighting and composition; editing; mise-en-scene and montage; sound; and overall practices in photography, digital design, and film.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6040",
            "course_name": "",
            "description": "MEST1-UC 6040\n\n   Mass Media & The Public Sphere\n\nThis course examines the relation between the role of mass media and the formation and evolution of the public sphere within both historical and contemporary contexts and national and transnational domains. The class will focus on capitalist development and the evolution of the public sphere, the impact of mass and participatory media on political discourse and civil mobilization, the development of online media in shaping cyber-democracy and social reform, and the emergence of counter-public spheres through oppositional online and offline multiple-voiced texts and discussion. The course has t...\n\n      more description for MEST1-UC 6040 »\n\n      \n\n\n\nThis course examines the relation between the role of mass media and the formation and evolution of the public sphere within both historical and contemporary contexts and national and transnational domains. The class will focus on capitalist development and the evolution of the public sphere, the impact of mass and participatory media on political discourse and civil mobilization, the development of online media in shaping cyber-democracy and social reform, and the emergence of counter-public spheres through oppositional online and offline multiple-voiced texts and discussion. The course has the following objectives: to help students understand the relation among mass media, political discourse, and democracy;  to deepen student knowledge of the impact of technology on public debate and institutions;  to enhance student thinking about the formation, evolution, and state of the public sphere within a national and international perspective; and to develop students' oral and written skills and abilities.\n\n      less description for MEST1-UC 6040 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6042",
            "course_name": "",
            "description": "MEST1-UC 6042\n\n   Theory of Media & Cultural Studies\n\nThis is a course designed to help students develop a critical understanding of the role that media has played in both the production of culture and as a cultural artifact in itself. The course begins by mapping some of the most critical cultural studies concepts, and proceeds to examine key theories from the defining periods within cultural and media studies, including the Frankfurt School, the Birmingham School, postmodernism, and cyberculture discourses. Readings include works by authors such as Adorno, Williams, Hall, Hooks, Gilroy, Kellner, Butler, Lacan, Baudrillard, and Bourdieu. Student...\n\n      more description for MEST1-UC 6042 »\n\n      \n\n\n\nThis is a course designed to help students develop a critical understanding of the role that media has played in both the production of culture and as a cultural artifact in itself. The course begins by mapping some of the most critical cultural studies concepts, and proceeds to examine key theories from the defining periods within cultural and media studies, including the Frankfurt School, the Birmingham School, postmodernism, and cyberculture discourses. Readings include works by authors such as Adorno, Williams, Hall, Hooks, Gilroy, Kellner, Butler, Lacan, Baudrillard, and Bourdieu. Students encounter the emergence and impact of the burgeoning culture industry on society; the intervention of cultural studies in how we create \"meaning\" from the cultural artifacts produced and revered within our societies; and look at the role of the media in that production process.\n\n      less description for MEST1-UC 6042 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6046",
            "course_name": "The Social Impact of Advertising & Pr",
            "description": "MEST1-UC 6046 The Social Impact of Advertising & Pr",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6047",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17122",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": "194M 205",
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Lum, Man"
                }
            ],
            "course_name": "",
            "description": "MEST1-UC 6047\n\n   Media & Community\n\nAn analysis of the roles of culture, technology, and communication in defining, sustaining, and transforming community. We begin with a series of theoretical discussions on the relationship between communication and community, media ecology and human ecology, media technology, transportation, and human communication patterns in the urban and suburban environments, as well as place-bound community and virtual community. We will offer case studies of communities that have been created, sustained, and shaped by traditional mass media and new media technologies such as mobile communication, the In...\n\n      more description for MEST1-UC 6047 »\n\n      \n\n\n\nAn analysis of the roles of culture, technology, and communication in defining, sustaining, and transforming community. We begin with a series of theoretical discussions on the relationship between communication and community, media ecology and human ecology, media technology, transportation, and human communication patterns in the urban and suburban environments, as well as place-bound community and virtual community. We will offer case studies of communities that have been created, sustained, and shaped by traditional mass media and new media technologies such as mobile communication, the Internet, and social networking. We will also consider the social, economic, political, and legal/regulatory dimensions of these communities. This course aims to foster students' ability to articulate, discuss, and analyze theories in community studies as well as issues relating to the social, economic, political, cultural, ethical, and legal/regulatory ramifications of communication media's impact on communities of various kinds.\n\n      less description for MEST1-UC 6047 «",
            "offering": true
        },
        {
            "course_id": "MEST1-UC 6060",
            "course_name": "",
            "description": "MEST1-UC 6060\n\n   Video Games and Culture\n\nAfter a half-century of rapid development, the video game industry has become mainstream entertainment and video games have become integrated into the cultural and social fabric. The creation of multi-player online games allows gamers to interact socially across cultural and geographic boundaries. However, the game world often reflects the creators’ and gamers’ troubling world views and games with extreme graphic violence and misogyny have millions of fans worldwide. In this class, students are introduced to the development of “game studies” and learn to examine critically the various aspects ...\n\n      more description for MEST1-UC 6060 »\n\n      \n\n\n\nAfter a half-century of rapid development, the video game industry has become mainstream entertainment and video games have become integrated into the cultural and social fabric. The creation of multi-player online games allows gamers to interact socially across cultural and geographic boundaries. However, the game world often reflects the creators’ and gamers’ troubling world views and games with extreme graphic violence and misogyny have millions of fans worldwide. In this class, students are introduced to the development of “game studies” and learn to examine critically the various aspects of video games: their history and technology; popular genres; their cultural and social impact; and alternative gaming programming, playing, and art.\n\n      less description for MEST1-UC 6060 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6074",
            "course_name": "",
            "description": "MEST1-UC 6074\n\n   History of Communication Innovations\n\nThis course is an historical analysis of the social, economic, political, and cultural ramifications of major communication innovations in human civilization. Students consider the genesis, development, diffusion, applications, and impact of writing systems, the printing press, and electronic communications such as telegraphy, television, personal telecommunications, portable music devices, and the Internet. Students develop the ability to understand and articulate the conception, development, and diffusion of major innovations in human communication; to examine issues relating to social, econ...\n\n      more description for MEST1-UC 6074 »\n\n      \n\n\n\nThis course is an historical analysis of the social, economic, political, and cultural ramifications of major communication innovations in human civilization. Students consider the genesis, development, diffusion, applications, and impact of writing systems, the printing press, and electronic communications such as telegraphy, television, personal telecommunications, portable music devices, and the Internet. Students develop the ability to understand and articulate the conception, development, and diffusion of major innovations in human communication; to examine issues relating to social, economic, political, cultural, and ethical issues or implications relating to these communication innovations through history; and to engage in informed analysis.\n\n      less description for MEST1-UC 6074 «",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6076",
            "course_name": "Mass Media & The Law",
            "description": "MEST1-UC 6076 Mass Media & The Law \nThe First Amendment protection of the freedoms of speech and the press is constantly under review. This course examines the constitutionally guaranteed freedoms, the exceptions to these guarantees, and the nature of attacks on the media. Current issues such as the legal battle over the protection of sources, copyright issues, privacy in cyberspace, and censorship on the Internet are critically addressed.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6080",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17123",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "194M 206"
                }
            ],
            "course_name": "Media & Communications Research Methods",
            "description": "MEST1-UC 6080 Media & Communications Research Methods \nThis course teaches students the qualitative and quantitative research methods used in academic media studies as well as advertising, media audience, consumer, and voter research. Students learn to analyze the strengths and limitations of various research methods and to evaluate their validity, reliability, applicability, and ethical bases. Students also learn how to design and conduct their own studies, how to formulate research questions, apply appropriate research methods, and conduct research.",
            "offering": true
        },
        {
            "course_id": "MEST1-UC 6084",
            "course_name": "Gender & Technology",
            "description": "MEST1-UC 6084 Gender & Technology \nWhy do boys play with different toys than girls do? Does this vary by culture? Why are some toys, games, and technologies considered boys' toys and others girls' toys? Students study the relationships among toys, technology, and gender in the literatures of social science, computer science, and gender studies, using an interdisciplinary approach.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6090",
            "course_name": "Sp Tpcs in Media Stud:",
            "description": "MEST1-UC 6090 Sp Tpcs in Media Stud: \nThis course provides an opportunity for intensive study of specific topics in Media Studies. It focuses on a different theme each time it is offered. The course schedule for the semester indicates the particular topic of study.",
            "offering": false
        },
        {
            "course_id": "MEST1-UC 6666",
            "course_name": "Media, News & Politics",
            "description": "MEST1-UC 6666 Media, News & Politics \nThis course focuses on how journalism and political systems operate in the United States, looking at forms of media such as newspapers, radio, and television, and assessing the potential of \"new media\" in a globalized and meditated world. Students develop a facility with critical questions relating to democratic institutions and the press and will learn to read news media texts from a variety of vantage points, critically engaging the institutional, commercial, political, and cultural demands within media texts.",
            "offering": false
        }
    ]
}