{
    "major_id": "MDURB-AD",
    "file": "./2015-2016/Multidisciplinary:_Urbanization(MDURB-AD).html",
    "courses": [
        {
            "course_id": "MDURB-AD 114",
            "course_name": "J",
            "description": "MDURB-AD  114J\n\n   Planning Abu Dhabi\n\nAs Abu Dhabi strives to position itself as a global capital city, it has embarked on ambitious plans for urban, economic and social development. Since 2007, Plan Capital 2030 laid the foundation for a progressive and comprehensive approach with sustainability as an overarching principle. The course will introduce a full understanding of the evolution of the city, examine plans for Abu Dhabi, and learn about the main urban actors and the forces shaping its growth. Through reading key texts in urban theories, site visits, guest speakers, presentations and debates, students will be able to think ...\n\n      more description for MDURB-AD  114J »\n\n      \n\n\n\nAs Abu Dhabi strives to position itself as a global capital city, it has embarked on ambitious plans for urban, economic and social development. Since 2007, Plan Capital 2030 laid the foundation for a progressive and comprehensive approach with sustainability as an overarching principle. The course will introduce a full understanding of the evolution of the city, examine plans for Abu Dhabi, and learn about the main urban actors and the forces shaping its growth. Through reading key texts in urban theories, site visits, guest speakers, presentations and debates, students will be able to think critically about city planning and development in rapidly developing cities and key challenges in comparison to other regional and global examples.\n\n      less description for MDURB-AD  114J «",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 115",
            "course_name": "J New York and Modernity",
            "description": "MDURB-AD  115J New York and Modernity \nModernism was a broad movement in literature, arts, music, and architecture that flourished first in Europe and then the United States between from the turn into the twentieth century until just after the Second World War. This course examines the ways in which New Yorkers reshaped European modernism and created a distinctive legacy that marks the city to this day. Exploring the reciprocal relationship between modernism and the city, the course investigates how modernism was shaped by urban experience and how, in turn, modernism helped to mold our conception of the modern city.",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 116",
            "course_name": "J Metropolis: Culture and Politics in the 21st Century City",
            "description": "MDURB-AD  116J Metropolis: Culture and Politics in the 21st Century City \nThis course provides an overview of key issues in the culture and politics of urban life, with a focus on modern Buenos Aires. We engage class and contemporary urban questions such as: How does city-living shape our minds and shift our patterns of social interaction? How does the built environment\nrelate to the local ecology and our experience of everyday life? How are civic and political institutions addressing emerging problems related to massive population growth, sprawl, pollution, and polarization? Students should be prepared for rigorous critical thinking and vigorous participation.",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 117",
            "course_name": "J",
            "description": "MDURB-AD  117J\n\n   Post-Catastrophe Reconstruction\n\nEmergency response situations, such as natural disasters and terrorist attacks, are unfortunate but recurring events that have a major impact on today’s global society. This course explores the variety of complex issues surrounding postcatastrophe reconstruction (PCR) and provides an understanding of the process and players in emergency response situations as well as a critical historical analysis of previous reconstruction efforts. We compare the unique characteristics of various PCR situations, such as natural disaster vs. terrorism, urban vs. rural, developing vs. developed nations; discuss...\n\n      more description for MDURB-AD  117J »\n\n      \n\n\n\nEmergency response situations, such as natural disasters and terrorist attacks, are unfortunate but recurring events that have a major impact on today’s global society. This course explores the variety of complex issues surrounding postcatastrophe reconstruction (PCR) and provides an understanding of the process and players in emergency response situations as well as a critical historical analysis of previous reconstruction efforts. We compare the unique characteristics of various PCR situations, such as natural disaster vs. terrorism, urban vs. rural, developing vs. developed nations; discuss issues surrounding immediate rapid response and long-term reconstruction; and evaluate pre-event preparedness plans and development aimed at lessening the occurrence and effects of emergency events. The class includes a field trip to Sri Lanka where students have an opportunity to experience first-hand and gain an understanding of the realities on the ground in a post-catastrophe area. In addition, students have the opportunity to meet with NGOs and government officials involved in the humanitarian as well as reconstruction effort. This course will include a field trip to Sri Lanka.\n\n      less description for MDURB-AD  117J «",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 118",
            "course_name": "Middle Eastern Cities: Urbanization and Society",
            "description": "MDURB-AD  118 Middle Eastern Cities: Urbanization and Society \nThis course investigates urbanization in the Middle East from early Islam to the modern period. It examines medieval and premodern cities as centers of religious and political authority and crucibles of commercial and cultural exchange, and investigates the challenges of modernity and westernization on these cities and their current adaptation to globalism. The course emphasizes Baghdad, Cairo, Damascus, Isfahan, and Istanbul.",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 119",
            "course_name": "Sustainable Cities in a Comparative Perspective",
            "description": "MDURB-AD  119 Sustainable Cities in a Comparative Perspective \nThis course examines the social, economic, and environmental dimensions of sustainability in cities—in the current context of development and environmental challenges. Policies and programs that try to address the challenges of sustainability (from both developed and developing countries) are studied and compared.",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 120",
            "course_name": "",
            "description": "MDURB-AD  120\n\n   Urban Infrastructure in the 19th & 20th Century\n\nThe world’s urban population is anticipated to reach 5 billion by 2030. The rise of mega-cities has captured much attention, however most of the world’s urban growth will take place in small to mid-size cities. To some extent, this is a desirable trend as smaller urban environments and utopian models of urban development. This course is a comparative study of the evolution of 19th and 20th century urban infrastructure. It examines the designs of complex infrastructure networks for moving people, goods, water, waste, energy, and information: from pipelines to the telecommunication network, from...\n\n      more description for MDURB-AD  120 »\n\n      \n\n\n\nThe world’s urban population is anticipated to reach 5 billion by 2030. The rise of mega-cities has captured much attention, however most of the world’s urban growth will take place in small to mid-size cities. To some extent, this is a desirable trend as smaller urban environments and utopian models of urban development. This course is a comparative study of the evolution of 19th and 20th century urban infrastructure. It examines the designs of complex infrastructure networks for moving people, goods, water, waste, energy, and information: from pipelines to the telecommunication network, from sidewalks to freeways and ports, and from personal carriers to mass transit.  In this course students develop a perspective on how the growth of urban population in first half of 19th century led to innovations in the second half of the century that sustained the tremendous growth of 19th century urban population; and how this trend continued to support that growth in the 20th century urban population. Each student will select a city and research the evolution of the various layers of that city’s infrastructure. The student “Cities Project” will be presented in the form of maps, photos, videos, interviews, stories.\n\n      less description for MDURB-AD  120 «",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 121",
            "course_name": "Urban Life and Cities in a Global Context",
            "description": "MDURB-AD  121 Urban Life and Cities in a Global Context \nThis course introduces students to the life of cities, their creation and development over time, and the effect of cities on the lives of people. Drawing on diverse disciplines, such as sociology, history, geography, and political science, it explores the process of urbanization, focusing on major theories of urbanization, the urban way of life, and problems related to the urbanization process. It also places these urban processes within a transnational and global context.",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 122",
            "course_name": "J Cities and Consumption",
            "description": "MDURB-AD  122J Cities and Consumption \nCities are our most powerful engines of growth and increasingly the economic organizing units of our time. More than half the world's population lives in cities and urban areas, a figure that will grow to 70 percent by 2050. We look in detail at great global cities across the world, giving students the concepts and tools to understand their evolution and the critical roles they play in economic, social, cultural and human development. The course also helps students better understand how their choice of a city to live in can have an indelible impact on their lives and careers.",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 123",
            "course_name": "J",
            "description": "MDURB-AD  123J\n\n   Nature of Urban Design: a New York Perspective on Resilience\n\nThis course is an introduction to the role of urban design in global sustainability. The first step is to understand how cities affect climate and how climate affects cities by examining New York as a model.  New York is a coastal city faced with the simultaneous requirement to grow its population by a million people yet to improve the quality of its civic life when climate events threaten both its urban fabric and critical infrastructure.  How New York uses urban design not just to survive but to thrive is the subject of this course, introducing the people, products and processes of urban des...\n\n      more description for MDURB-AD  123J »\n\n      \n\n\n\nThis course is an introduction to the role of urban design in global sustainability. The first step is to understand how cities affect climate and how climate affects cities by examining New York as a model.  New York is a coastal city faced with the simultaneous requirement to grow its population by a million people yet to improve the quality of its civic life when climate events threaten both its urban fabric and critical infrastructure.  How New York uses urban design not just to survive but to thrive is the subject of this course, introducing the people, products and processes of urban design. The city itself will frequently serve as classroom, with students exploring and recording examples of urban design through the neighborhoods they transform.\n\n      less description for MDURB-AD  123J «",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 124",
            "course_name": "J",
            "description": "MDURB-AD  124J\n\n   Urban Form of Shanghai\n\nShanghai has evolved markedly through key stages in the history of urban form, vestiges of which are found within the city today: an old walled “Chinese city”; tree-lined boulevards and commercial avenues of 19th and 20th century foreign settlements; and suburban development in Pudong.  This class examines each key stage, combining readings with in situ urban inquiry.  Readings cover Chinese reflections on the city in general and Shanghai in particular, as well as urban studies classics like Lewis Mumford’s The Culture of Cities.  Trips take students to historically significant cultural spaces...\n\n      more description for MDURB-AD  124J »\n\n      \n\n\n\nShanghai has evolved markedly through key stages in the history of urban form, vestiges of which are found within the city today: an old walled “Chinese city”; tree-lined boulevards and commercial avenues of 19th and 20th century foreign settlements; and suburban development in Pudong.  This class examines each key stage, combining readings with in situ urban inquiry.  Readings cover Chinese reflections on the city in general and Shanghai in particular, as well as urban studies classics like Lewis Mumford’s The Culture of Cities.  Trips take students to historically significant cultural spaces, including the old City God Temple, Fuzhou Road Bookshops, alleyway houses, The Peace Hotel, the Great World amusement park, People’s Park, the Moganshan Road contemporary art complex, as well as nearby waterway towns that illustrate aspects of Shanghai’s history before urbanization.\n\n      less description for MDURB-AD  124J «",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 125",
            "course_name": "J Global City",
            "description": "MDURB-AD  125J Global City \nCities are our most powerful engines of growth and increasingly the economic organizing units of our time. More than half the world’s population lives in cities and urban areas, a figure that will grow to 70 percent by 2050.  \n\nWe will look in detail at great global cities across the world, giving students the concepts and tools to understand their evolution and the critical roles they play in economic, social, cultural and human development.  The course will also help students better understand how their choice of a city to live in can have an indelible impact on their lives and careers.",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 126",
            "course_name": "J",
            "description": "MDURB-AD  126J\n\n   Cities, Nations, and Globalization\n\nWhat is globalization and when did it begin? What is the difference between an imperial city and a global capital? Imperial London provides a way to explore this question, and New York, which was not capital of a vast colonial empire, provides a useful comparison case. There is also the question of globalization’s impact on the relation between cities and nations?  More directly, have global cities outgrown their host nations? Is globalization a new iteration of the world economy, or is it more multi-faceted, with social, political, and cultural implications, including new dimensions of citize...\n\n      more description for MDURB-AD  126J »\n\n      \n\n\n\nWhat is globalization and when did it begin? What is the difference between an imperial city and a global capital? Imperial London provides a way to explore this question, and New York, which was not capital of a vast colonial empire, provides a useful comparison case. There is also the question of globalization’s impact on the relation between cities and nations?  More directly, have global cities outgrown their host nations? Is globalization a new iteration of the world economy, or is it more multi-faceted, with social, political, and cultural implications, including new dimensions of citizenship and social movements? Can one “read” shift from the age of empire to that of globalization in the built environment of the city of London, New York, Jakarta or Ho Chi Minh City? Assignments will include literary sources and visual analysis as well as social science and humanistic scholarship.\n\n      less description for MDURB-AD  126J «",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 127",
            "course_name": "J",
            "description": "MDURB-AD  127J\n\n   Public Space and the Life of Cities\n\nPublic spaces play an essential role in the life of cities and their residents. Public squares and parks, streets and esplanades—these are often the signature spaces that constitute a city’s distinctive identity. They are also the settings of everyday life, mixing bowls where a city’s diverse communities interact, forums for individual as well as collective action and expression. This course explores the nature of public space in cities around the world, with attention to their physical character and design, their history, their pictorial and literary representation, and the political and soci...\n\n      more description for MDURB-AD  127J »\n\n      \n\n\n\nPublic spaces play an essential role in the life of cities and their residents. Public squares and parks, streets and esplanades—these are often the signature spaces that constitute a city’s distinctive identity. They are also the settings of everyday life, mixing bowls where a city’s diverse communities interact, forums for individual as well as collective action and expression. This course explores the nature of public space in cities around the world, with attention to their physical character and design, their history, their pictorial and literary representation, and the political and social practices that activate public space. We will explore three overarching questions. What do we mean by “public” and “public space”? What are common characteristics of public spaces and how do people use them? And why are public spaces important to city life? In addition to historical and contemporary squares and streetscapes of Europe and the Middle East, we will draw upon case studies in Sydney as well as the hometowns of our students.\n\n      less description for MDURB-AD  127J «",
            "offering": false
        },
        {
            "course_id": "MDURB-AD 198",
            "course_name": "Directed Study:",
            "description": "MDURB-AD  198 Directed Study: \nThis Directed Study in Urbanization is a Topics Course which will have multiple sections and different titles.",
            "offering": false
        }
    ]
}