{
    "major_id": "MDANC-AD",
    "file": "./2015-2016/Multidisciplinary:_The_AncientWorld_(MDANC-AD).html",
    "courses": [
        {
            "course_id": "MDANC-AD 110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12928",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "EAST_ADMIN 001"
                }
            ],
            "course_name": "Ancient Empires",
            "description": "MDANC-AD  110 Ancient Empires \nThis global history course presents the emergence of large territorial states in the ancient world. Starting from the earliest Eurasian civilizations in Egypt, Mesopotamia, the Indus Valley, and China, it aims to provide a thematic and comparative introduction to the major empires of the ancient world, including Qin and Han China, the Assyrian and Persian Empires, and the Roman Empire, as well as their successors. Topics include kingship, warfare, economy, law, ethnic identity, coreperiphery relations, and imperial ideologies.",
            "offering": true
        },
        {
            "course_id": "MDANC-AD 111",
            "course_name": "Archaeological Field Work",
            "description": "MDANC-AD  111 Archaeological Field Work \nFieldwork options at present include NYU’s excavations in the Dakhla Oasis of Egypt and may also include Aphrodisias, the ancient Greek City in Turkey. This program, which takes place from January to March each year, is offered either as\na full semester program or as a 7-week module. Admission is competitive, and application is required in the previous spring.",
            "offering": false
        },
        {
            "course_id": "MDANC-AD 112",
            "course_name": "",
            "description": "MDANC-AD  112\n\n   Archaeology of the Near East from the Origins of Agriculture to Alexander the Great\n\nThis course offers an interdisciplinary approach to the material culture of the ancient Near East, from the rise of agriculture to the destruction of the Persian Achaemenid Empire by Alexander the Great – from the Neolithic to the Late Iron Age.  Geographically the course covers the territory from the Levantine coast of Syria and Lebanon, through Iraq, to Iran. The course surveys major archaeological sites and monuments from the perspectives of archaeology, anthropology and art-history; it covers wide-ranging topics in a chronological framework, including the development of complex societies, ...\n\n      more description for MDANC-AD  112 »\n\n      \n\n\n\nThis course offers an interdisciplinary approach to the material culture of the ancient Near East, from the rise of agriculture to the destruction of the Persian Achaemenid Empire by Alexander the Great – from the Neolithic to the Late Iron Age.  Geographically the course covers the territory from the Levantine coast of Syria and Lebanon, through Iraq, to Iran. The course surveys major archaeological sites and monuments from the perspectives of archaeology, anthropology and art-history; it covers wide-ranging topics in a chronological framework, including the development of complex societies, urbanism, state formation, technology, landscapes and settlements, and art and architecture.\n\n      less description for MDANC-AD  112 «",
            "offering": false
        },
        {
            "course_id": "MDANC-AD 113",
            "course_name": "Intellectual History of the Ancient World",
            "description": "MDANC-AD  113 Intellectual History of the Ancient World \nThis course examines foundational texts in the intellectual life of ancient Greece and Rome in their historical context. Topics include political thought (democracy, republicanism, cosmopolitanism), religion (ritual and theology), and science (medicine, mathematics, astronomy).",
            "offering": false
        },
        {
            "course_id": "MDANC-AD 114",
            "course_name": "",
            "description": "MDANC-AD  114\n\n   Alexander and the East: Central Asia and the Mediterranean from the Achaemenid Period\n\nThe course explores relations between the various steppe and oasis cultures in Central Asia and the Mediterranean world from the Achaemenid period up to the early Middle Ages.  These relations are characterized by a broad spectrum of different forms of contact and exchange.  Direct contacts were established, for example, by military campaigns, diplomatic exchanges, migrations or colonization.  Less direct forms of cultural transmission resulted from complex transcontinental trade flows.  The course will focus on the consequences which different forms of communication with the Mediterranean had...\n\n      more description for MDANC-AD  114 »\n\n      \n\n\n\nThe course explores relations between the various steppe and oasis cultures in Central Asia and the Mediterranean world from the Achaemenid period up to the early Middle Ages.  These relations are characterized by a broad spectrum of different forms of contact and exchange.  Direct contacts were established, for example, by military campaigns, diplomatic exchanges, migrations or colonization.  Less direct forms of cultural transmission resulted from complex transcontinental trade flows.  The course will focus on the consequences which different forms of communication with the Mediterranean had on Central Asian art and material culture.  We will consider topics such as urbanism, architecture, iconography, and historiography as well as specific aspects of material culture including ceramics, arms and costume.\n\n      less description for MDANC-AD  114 «",
            "offering": false
        },
        {
            "course_id": "MDANC-AD 198",
            "course_name": "Directed Study",
            "description": "MDANC-AD  198 Directed Study \nClosely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        }
    ]
}