{
    "major_id": "MDENV-AD",
    "file": "./2015-2016/Multidisciplinary:_The_Environment(MDENV-AD).html",
    "courses": [
        {
            "course_id": "MDENV-AD 110",
            "course_name": "",
            "description": "MDENV-AD  110\n\n   The Biosphere\n\nThis course introduces students to the fundamental dynamics of Earth’s atmosphere and its oceans. These two systems are then integrated into a global picture of the biosphere. Topics include: the carbon cycle, climate feedbacks and anthropogenic influences; global ecology, energy transport, the paleoclimate record, the coupled atmosphereoceanice- land system, and climate modeling. The course addresses local and global issues such as desertification, carbon production by fossil fuels, and green technology as exemplified in Abu Dhabi’s Masdar City, which is attempting to become the world’s first...\n\n      more description for MDENV-AD  110 »\n\n      \n\n\n\nThis course introduces students to the fundamental dynamics of Earth’s atmosphere and its oceans. These two systems are then integrated into a global picture of the biosphere. Topics include: the carbon cycle, climate feedbacks and anthropogenic influences; global ecology, energy transport, the paleoclimate record, the coupled atmosphereoceanice- land system, and climate modeling. The course addresses local and global issues such as desertification, carbon production by fossil fuels, and green technology as exemplified in Abu Dhabi’s Masdar City, which is attempting to become the world’s first carbon neutral, zero-waste city.\n\n      less description for MDENV-AD  110 «",
            "offering": false
        },
        {
            "course_id": "MDENV-AD 111",
            "course_name": "Global Climate Change",
            "description": "MDENV-AD  111 Global Climate Change \nIn this seminar students delve more deeply into the models and data that are the basis for our current understanding of Earth’s climate, and how it is changing. The course weaves quantitative analysis with human impacts, economics, and\npolicy-making.",
            "offering": false
        },
        {
            "course_id": "MDENV-AD 112",
            "course_name": "",
            "description": "MDENV-AD  112\n\n   Energy and the Environment\n\nEconomic analysis of major policy issues in energy and the environment, both domestic and international, is key for understanding the global impact of energy use. This course emphasizes market solutions to various problems and market limitations in the allocation of environmental resources. Energy issues focus on OPEC and world oil markets; taxation and regulation of production and consumption; conservation of natural resources; and the transition to alternative energy sources. Environmental issues include policies to reduce pollution. Substantial attention is paid to global warming caused by ...\n\n      more description for MDENV-AD  112 »\n\n      \n\n\n\nEconomic analysis of major policy issues in energy and the environment, both domestic and international, is key for understanding the global impact of energy use. This course emphasizes market solutions to various problems and market limitations in the allocation of environmental resources. Energy issues focus on OPEC and world oil markets; taxation and regulation of production and consumption; conservation of natural resources; and the transition to alternative energy sources. Environmental issues include policies to reduce pollution. Substantial attention is paid to global warming caused by consumption of fossil fuels.\n\n      less description for MDENV-AD  112 «",
            "offering": false
        },
        {
            "course_id": "MDENV-AD 113",
            "course_name": "Environment and Society",
            "description": "MDENV-AD  113 Environment and Society \nA systematic survey of central concepts and issues relating to environment and society including environmental history and concepts of nature and the environment; the rise of environmentalism; environmental skepticism; anthropogenic global change; population and consumption, ecological footprint analysis, and other environmental indicators; environmental justice; and regulatory regimes.",
            "offering": false
        },
        {
            "course_id": "MDENV-AD 115",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13007",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 003",
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Kalantzakos, Sophia"
                }
            ],
            "course_name": "",
            "description": "MDENV-AD  115\n\n   Global Debate on Green Growth\n\nIn March 2012, the OECD published its influential Environmental Outlook Report to  2050, confirming that the world is faced with an explosive new cocktail of geopolitical challenges: population explosion, environmental degradation, the failure  to stop climate change, and the increased competition over limited natural resources. In response, governments are increasingly turning to renewables and high tech to diversify their energy mix and to reduce reliance on fossil fuels in order to stimulate stagnant economies and create new jobs. Ironically, the transition to a low fossil fuel economy thro...\n\n      more description for MDENV-AD  115 »\n\n      \n\n\n\nIn March 2012, the OECD published its influential Environmental Outlook Report to  2050, confirming that the world is faced with an explosive new cocktail of geopolitical challenges: population explosion, environmental degradation, the failure  to stop climate change, and the increased competition over limited natural resources. In response, governments are increasingly turning to renewables and high tech to diversify their energy mix and to reduce reliance on fossil fuels in order to stimulate stagnant economies and create new jobs. Ironically, the transition to a low fossil fuel economy through the use of RES and high tech applications has led to the creation of new global race over limited resources, such as rare earths, and this competition has already given rise to a series of fresh global political and economic realities, tensions, and disputes. We will examine how major industrial powers are approaching  the asymmetric threat of climate change; the nature of contemporary resource competition; the way policy decisions are influenced by political rhetoric and public opinion; and the overall economic and political impact of climate change on international relations.\n\n      less description for MDENV-AD  115 «",
            "offering": true
        }
    ]
}