{
    "major_id": "MSMS-GA",
    "file": "./2015-2016/Museum_Studies_(MSMS-GA).html",
    "courses": [
        {
            "course_id": "MSMS-GA 1010",
            "classes": [
                {
                    "format": "Colloquium",
                    "class_id": "1904",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KJCC 607",
                    "time": "Mon 4.55 PM - 7.35 PM",
                    "open": true,
                    "professor": "Wosh, Peter"
                }
            ],
            "course_name": "Intro to Archives",
            "description": "MSMS-GA 1010 Intro to Archives",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 1015",
            "course_name": "Cultural Policy & Cultrl Patronage in The U.S.",
            "description": "MSMS-GA 1015 Cultural Policy & Cultrl Patronage in The U.S.",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 1041",
            "course_name": "Tourist Productions",
            "description": "MSMS-GA 1041 Tourist Productions",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 1441",
            "course_name": "Visualizing Migration: Irish in 19-20C Culture",
            "description": "MSMS-GA 1441 Visualizing Migration: Irish in 19-20C Culture",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 1500",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1454",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 208",
                    "time": "Tue 6.00 PM - 9.00 PM",
                    "open": true,
                    "professor": "VonBokel, Aimee"
                },
                {
                    "format": "Lecture",
                    "class_id": "1455",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 265",
                    "time": "Wed 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Thorner, Sabra"
                }
            ],
            "course_name": "",
            "description": "MSMS-GA 1500\n\n   History and Theory of Museums\n\nIntroduction to the social, cultural, and political history of museums. This course focuses on the formation of the modern museum with an emphasis on the U.S. context. Museums of natural history, anthropology, science, technology, history, and art are addressed from a variety of disciplinary approaches that explore the institution and its practices with respect to governance, colonialism, nationalism, class, gender, ethnicity, and community. FreqIntroduction to the social, cultural, and political history of museums. This course focuses on the formation of the modern museum with an emphasis on ...\n\n      more description for MSMS-GA 1500 »\n\n      \n\n\n\nIntroduction to the social, cultural, and political history of museums. This course focuses on the formation of the modern museum with an emphasis on the U.S. context. Museums of natural history, anthropology, science, technology, history, and art are addressed from a variety of disciplinary approaches that explore the institution and its practices with respect to governance, colonialism, nationalism, class, gender, ethnicity, and community. FreqIntroduction to the social, cultural, and political history of museums. This course focuses on the formation of the modern museum with an emphasis on the U.S. context. Museums of natural history, anthropology, science, technology, history, and art are addressed from a variety of disciplinary approaches that explore the institution and its practices with respect to governance, colonialism, nationalism, class, gender, ethnicity, and community. Frequent visits to New York museums are required, along with weekly writing assignments, and a final paper.\n\n      less description for MSMS-GA 1500 «",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 1501",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1456",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 508",
                    "time": "Thu 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Gear, Josephine"
                },
                {
                    "format": "Lecture",
                    "class_id": "1457",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 404",
                    "time": "Fri 11.00 AM - 2.00 PM",
                    "open": true,
                    "professor": "Gear, Josephine"
                }
            ],
            "course_name": "Museum Collections and Exhibitions",
            "description": "MSMS-GA 1501 Museum Collections and Exhibitions \nIntroduction to the care and management of objects and collections and to the process of organizing a temporary exhibition. Assignments consist of individual reports and working in small teams to prepare and present proposals on specific functions of collection management and to make an exhibition proposal. Museum professionals (registrars, conservators, curators) speak on issues specific to their practice. Museum visits are scheduled as part of regular classroom meetings. As far as possible, the course covers museums of all disciplines.",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 1502",
            "course_name": "Museum Management",
            "description": "MSMS-GA 1502 Museum Management \nOverview of management, finance, and administration for those aspiring to managerial and supervisory positions in museums. Topics covered include organizational structure and the roles and relationships of museum departments; operational issues, including security and disaster planning; museum accounting and finance, including operating and capital expense budgeting; leadership and strategic planning; and legal and ethical issues facing museums.",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 1750",
            "classes": [
                {
                    "format": "Colloquium",
                    "class_id": "1808",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KJCC 607",
                    "time": "Wed 4.55 PM - 7.35 PM",
                    "open": true,
                    "professor": "Wosh, Peter"
                }
            ],
            "course_name": "Intro to Public History",
            "description": "MSMS-GA 1750 Intro to Public History \nReviews the history of public history from the early twentieth century through the present, focusing on historians? relationships, dialogues, and collaborations with public audiences.  Considers issues involving memory, identity, heritage, commemoration, historic preservation, history museums, oral history, film, and digital history.",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 1757",
            "course_name": "Approaches to Public History",
            "description": "MSMS-GA 1757 Approaches to Public History",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2021",
            "course_name": "Historian & the Visual Record",
            "description": "MSMS-GA 2021 Historian & the Visual Record",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2053",
            "course_name": "Case Visual Arts Scene: Global Observ Vis Arts",
            "description": "MSMS-GA 2053 Case Visual Arts Scene: Global Observ Vis Arts",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2214",
            "course_name": "Media & Museums: Videotaping",
            "description": "MSMS-GA 2214 Media & Museums: Videotaping",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2215",
            "course_name": "Reading Course in Museum Studies",
            "description": "MSMS-GA 2215 Reading Course in Museum Studies",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2220",
            "course_name": "Museum Documentation",
            "description": "MSMS-GA 2220 Museum Documentation",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2221",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1458",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "240G 410",
                    "time": "Wed 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Warwick, Helen"
                }
            ],
            "course_name": "Develop/Fundrsg/Grntmnsp",
            "description": "MSMS-GA 2221 Develop/Fundrsg/Grntmnsp \nOverview of organizational development principles as they relate to the fund-raising and grantsmanship process. Topics include sources of funding, current trends, and fund-raising techniques; earned income; public relations; volunteers; and membership. Includes a practicum in proposal writing and work experience with an arts organization in program development and fund-raising.",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 2222",
            "course_name": "",
            "description": "MSMS-GA 2222\n\n   Conservation and Collections Management\n\nAs an introduction to museum conservation, this seminar combines class room discussion with museum laboratory visits to provide an understanding of how conservation functions in the context of contemporary culture. The seminar is divided into three broad topics: museum collections care, the history and philosophy of western conservation, and the conservation of modern and contemporary art. It provides technical information about how artifacts age in the museum environment while examining conflicts that arise between professional and non-professional stakeholders. The seminar addresses concerns...\n\n      more description for MSMS-GA 2222 »\n\n      \n\n\n\nAs an introduction to museum conservation, this seminar combines class room discussion with museum laboratory visits to provide an understanding of how conservation functions in the context of contemporary culture. The seminar is divided into three broad topics: museum collections care, the history and philosophy of western conservation, and the conservation of modern and contemporary art. It provides technical information about how artifacts age in the museum environment while examining conflicts that arise between professional and non-professional stakeholders. The seminar addresses concerns of living artists as well as indigenous groups and others with claims to the disposition and care of cultural materials. While enrollment is open to all NYU graduate students, priority will be given to Museum Studies students with research interests in exhibition and collections management.\n\n      less description for MSMS-GA 2222 «",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2223",
            "course_name": "",
            "description": "MSMS-GA 2223\n\n   Historic Sites,Cultural Landscapes,&Pols Preserv\n\nThis course will examine the cultural politics that influence reuse of historic spaces for museums and other public purposes. Through course readings, site visits and individual archival research, students will explore sites ranging from historic houses and period rooms presented as museum installations to restored villages and communities to dramatic reuse of historic space for cultural tourism. Students will pay particular attention to the social and political contexts in which original use and subsequent reuse took place, and analyze primary documents that illustrate both motivations and st...\n\n      more description for MSMS-GA 2223 »\n\n      \n\n\n\nThis course will examine the cultural politics that influence reuse of historic spaces for museums and other public purposes. Through course readings, site visits and individual archival research, students will explore sites ranging from historic houses and period rooms presented as museum installations to restored villages and communities to dramatic reuse of historic space for cultural tourism. Students will pay particular attention to the social and political contexts in which original use and subsequent reuse took place, and analyze primary documents that illustrate both motivations and strategies for interpretation.\n\n      less description for MSMS-GA 2223 «",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2224",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1459",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "240G 410",
                    "time": "Wed 6.00 PM - 9.00 PM",
                    "open": true,
                    "professor": "Crow, William"
                }
            ],
            "course_name": "Museum Education",
            "description": "MSMS-GA 2224 Museum Education \nThis seminar provides an overview of the field of museum education in the context of the institution?s relationship with constituent communities and with application to a broad range of audiences. Among the topics considered are teaching from objects, learning strategies, working with docents and volunteers, program planning, and the educational use of interactive technologies.",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 2225",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "1460",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 274",
                    "time": "Mon 6.00 PM - 9.00 PM",
                    "open": true,
                    "professor": "Flouty, Rosanna"
                }
            ],
            "course_name": "Museums & Interactive Technologies",
            "description": "MSMS-GA 2225 Museums & Interactive Technologies \nThis course presents a survey and analysis of museum use of interactive technologies. Among the topics discussed in detail are strategies and tools for collections management, exhibitions, educational resources and programs, Web site design, digitization projects, and legal issues arising from the use of these technologies. Each student develops an interactive project in an area of special interest.",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 2304",
            "course_name": "Theorizing Practices: Underground Archives",
            "description": "MSMS-GA 2304 Theorizing Practices: Underground Archives",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2320",
            "course_name": "Performing Culture: Museum Theatre",
            "description": "MSMS-GA 2320 Performing Culture: Museum Theatre",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2534",
            "course_name": "Collect & Display as Art History: Latin America",
            "description": "MSMS-GA 2534 Collect & Display as Art History: Latin America",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2709",
            "course_name": "Docum&Recreation of Perf:",
            "description": "MSMS-GA 2709 Docum&Recreation of Perf:",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2965",
            "course_name": "Special Topics:",
            "description": "MSMS-GA 2965 Special Topics:",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 2967",
            "course_name": "Sp Tpcs: Exhibiting Spain",
            "description": "MSMS-GA 2967 Sp Tpcs: Exhibiting Spain",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 3330",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1461",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS ",
                    "time": "Tue 10.00 AM - 1.00 PM",
                    "open": true,
                    "professor": "Wharton, Glenn"
                },
                {
                    "format": "Seminar",
                    "class_id": "2170",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "240G 410",
                    "time": "Thu 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": "Altshuler, Bruce"
                },
                {
                    "format": "Seminar",
                    "class_id": "2171",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "240G 410",
                    "time": "Tue 9.30 AM - 12.30 PM",
                    "open": true,
                    "professor": "Anderson, Jane"
                },
                {
                    "format": "Seminar",
                    "class_id": "2373",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "Topics in Museum StudiesArt Exhibitions After 1960Artist ArchivesHeritage, Memory and Negotiating TemporalitiesThe Museum Life of Contmpr Art",
            "description": "MSMS-GA 3330 Topics in Museum StudiesArt Exhibitions After 1960Artist ArchivesHeritage, Memory and Negotiating TemporalitiesThe Museum Life of Contmpr Art \nCurrent issues in the museum profession and the interdisciplinary study of museums. Outside museum scholars, specialists, and university faculty offer in-depth examination of topics",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 3332",
            "course_name": "",
            "description": "MSMS-GA 3332\n\n   Exhibition Planning & Design\n\nThis course focuses on the planning, development, and design of exhibitions, permanent, temporary, and traveling. It is a participatory class where students learn basic exhibition design techniques, including spatial layouts and the use of graphics, audiovisual aids, lighting, colors, materials, and fabrication methods. Students gain insight into exhibition planning and development and the roles played by various museum professionals. There are visits to designers to discuss their work and to museums and other venues to analyze exhibition design techniques. Individual student projects provide ...\n\n      more description for MSMS-GA 3332 »\n\n      \n\n\n\nThis course focuses on the planning, development, and design of exhibitions, permanent, temporary, and traveling. It is a participatory class where students learn basic exhibition design techniques, including spatial layouts and the use of graphics, audiovisual aids, lighting, colors, materials, and fabrication methods. Students gain insight into exhibition planning and development and the roles played by various museum professionals. There are visits to designers to discuss their work and to museums and other venues to analyze exhibition design techniques. Individual student projects provide hands-on experience.\n\n      less description for MSMS-GA 3332 «",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 3335",
            "course_name": "Museums & Contemporary Art",
            "description": "MSMS-GA 3335 Museums & Contemporary Art",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 3910",
            "course_name": "Museums, Art & The Law",
            "description": "MSMS-GA 3910 Museums, Art & The Law",
            "offering": false
        },
        {
            "course_id": "MSMS-GA 3915",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1462",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Altshuler, Bruce",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Museum Studies",
            "description": "MSMS-GA 3915 Research in Museum Studies \nIndependent research on a topic determined in consultation with the program director.",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 3990",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "1463",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "VonBokel, Aimee",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "MSMS-GA 3990\n\n   Internship\n\nStudents nearing completion of their master?s in museum studies, or their certificate and their academic degree, must apply in writing to the program internship coordinator. Placements are made on an individual basis and are project oriented. For one or more semesters, a minimum of 300 hours is spent as an intern at a museum or other suitable institution. A daily log, diary, and progress report are required. Students must earn a grade of B or better to rStudents nearing completion of their master?s in museum studies, or their certificate and their academic degree, must apply in writing to the ...\n\n      more description for MSMS-GA 3990 »\n\n      \n\n\n\nStudents nearing completion of their master?s in museum studies, or their certificate and their academic degree, must apply in writing to the program internship coordinator. Placements are made on an individual basis and are project oriented. For one or more semesters, a minimum of 300 hours is spent as an intern at a museum or other suitable institution. A daily log, diary, and progress report are required. Students must earn a grade of B or better to rStudents nearing completion of their master?s in museum studies, or their certificate and their academic degree, must apply in writing to the program internship coordinator. Placements are made on an individual basis and are project oriented. For one or more semesters, a minimum of 300 hours is spent as an intern at a museum or other suitable institution. A daily log, diary, and progress report are required. Students must earn a grade of B or better to receive the M.A. or advanced certificate.\n\n      less description for MSMS-GA 3990 «",
            "offering": true
        },
        {
            "course_id": "MSMS-GA 3991",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "1464",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 279",
                    "time": "Tue 2.00 PM - 4.30 PM",
                    "open": true,
                    "professor": "Basilio, Miriam"
                },
                {
                    "format": "Seminar",
                    "class_id": "1465",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 412",
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "Wharton, Glenn"
                }
            ],
            "course_name": "Research Seminar",
            "description": "MSMS-GA 3991 Research Seminar \nStudents conduct research combining their academic and professional interests, using appropriate methodology. They formulate a topic, prepare an annotated bibliography, and write the qualifying paper based on their research. M.A. students also develop their thesis proposal.",
            "offering": true
        }
    ]
}