{
    "major_id": "GMTW-UT",
    "file": "./2015-2016/Musical_Theatre_(GMTW-UT).html",
    "courses": [
        {
            "course_id": "GMTW-UT 50",
            "course_name": "Musical Theatre Writing for High School Students",
            "description": "GMTW-UT   50 Musical Theatre Writing for High School Students",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1002",
            "course_name": "The American Musical",
            "description": "GMTW-UT 1002 The American Musical",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1050",
            "course_name": "",
            "description": "GMTW-UT 1050\n\n   Musical Theatre Writing Workshop\n\nOpen to graduate and undergraduate students.  This intensive, team- taught workshop encourages composers, lyricists, and bookwriters to find their own voices and learn to merge their unique artistic visions with those of other collaborative artists to create exciting new songs in a theatrical context. Class participants work in rotating teams to write and present songs and scenes, exploring song form, dramatic structure, and the process of conceiving longer works.  Theatre songwriting craft, issues of communication between artists of different disciplines, and storytelling through music and te...\n\n      more description for GMTW-UT 1050 »\n\n      \n\n\n\nOpen to graduate and undergraduate students.  This intensive, team- taught workshop encourages composers, lyricists, and bookwriters to find their own voices and learn to merge their unique artistic visions with those of other collaborative artists to create exciting new songs in a theatrical context. Class participants work in rotating teams to write and present songs and scenes, exploring song form, dramatic structure, and the process of conceiving longer works.  Theatre songwriting craft, issues of communication between artists of different disciplines, and storytelling through music and text are emphasized. Great musical theatre works of the 20th century are considered to support the students’ examination of their own creative process. Writers and composers from around the world who wish to explore musical theatre collaboration are encouraged to apply and immerse themselves in an exciting workshop experience in New York City . Poets, playwrights, and writers from other genres, and composers based in any musical tradition (pop, classical, country, hip-hop, rap, rock, jazz, etc.) are welcome to apply. Composers should either be able to write their work down so that it can be performed by others or be prepared to perform their own work.  All class participants are expected to collaborate on assigned projects outside of class time.\n\n      less description for GMTW-UT 1050 «",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1055",
            "course_name": "",
            "description": "GMTW-UT 1055\n\n   Crafts of Musical Theatre: Music Writing\n\nOpen to graduate and undergraduate students.  This course is an introduction to the art and craft of composing for Musical Theatre. Participants should have essential musical skills in place (most importantly the ability to notate one's music, either by hand or using notation programs such as Finale/Sibelius). The emphasis is on the role of the composer as a musical dramatist. Musical theatre masterworks are analyzed as well as selected songs from the worlds of pop, jazz and blues.  Class exercises focus on the specific techniques needed to convey plot, character, and action through music.  Co...\n\n      more description for GMTW-UT 1055 »\n\n      \n\n\n\nOpen to graduate and undergraduate students.  This course is an introduction to the art and craft of composing for Musical Theatre. Participants should have essential musical skills in place (most importantly the ability to notate one's music, either by hand or using notation programs such as Finale/Sibelius). The emphasis is on the role of the composer as a musical dramatist. Musical theatre masterworks are analyzed as well as selected songs from the worlds of pop, jazz and blues.  Class exercises focus on the specific techniques needed to convey plot, character, and action through music.  Composers will be encouraged to develop and refine their individual compositional voice as well as explore other musical styles and genres.\n\n      less description for GMTW-UT 1055 «",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1060",
            "course_name": "Crafts of Musical Theatre: Lyric Writing",
            "description": "GMTW-UT 1060 Crafts of Musical Theatre: Lyric Writing \nOpen to graduate and undergraduate students.  This course is an introduction to the complex and demanding art of lyric writing for the theatre. Elements of basic lyric writing craft including rhyme, song structures, hooks, style, and scansion will be emphasized. The works of great theatre lyric writers are studied. Assigned exercises will explore a variety of song forms and confront such issues as writing for character and developing a lyric voice.",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1065",
            "course_name": "Craft of Musical Theatre: Bookwriting",
            "description": "GMTW-UT 1065 Craft of Musical Theatre: Bookwriting \nOpen to graduate and undergraduate students.   The musical theatre book is the essential foundation of the art form--the structure upon which the musical rises or falls. This course affords the student an opportunity to undertake an intensive study of the evolution, art, and craft of musical theatre bookwriting through the analysis of a set of widely varied masterworks of the past and present and through daily writing exercises which are critiqued in a workshop environment.",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1070",
            "course_name": "",
            "description": "GMTW-UT 1070\n\n   Crafts of Musical Thtr Writing for The Cabaret\n\nOpen to graduate and undergraduate students.  This course will include a survey of the history of Cabaret as an art form and a consideration of great cabaret entertainers past and present. Current venues for cabaret material will be identified. Students will analyze the great cabaret songs of the past and present day as they study the craft of creating cabaret material of their own.  Professional singers will be brought in to sing songs created to satisfy class assignments and an evening of these songs will be presented in our black box theatre at the end of the semester for the students' invi...\n\n      more description for GMTW-UT 1070 »\n\n      \n\n\n\nOpen to graduate and undergraduate students.  This course will include a survey of the history of Cabaret as an art form and a consideration of great cabaret entertainers past and present. Current venues for cabaret material will be identified. Students will analyze the great cabaret songs of the past and present day as they study the craft of creating cabaret material of their own.  Professional singers will be brought in to sing songs created to satisfy class assignments and an evening of these songs will be presented in our black box theatre at the end of the semester for the students' invited guests.\n\n      less description for GMTW-UT 1070 «",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1075",
            "course_name": "The American Musical and Formation of American Id",
            "description": "GMTW-UT 1075 The American Musical and Formation of American Id \nThis course seeks to answer the question as to how the American Identity has been defined and popularized in the American Musical.  Several major works of the 20th and 21st century are surveyed in order to illuminate issues of American Identity such as the American Dream, the American woman, and attitudes on war and race.  Works examined will range from “South Pacific” to “Ragtime” and beyond.",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1085",
            "course_name": "",
            "description": "GMTW-UT 1085\n\n   Making New Musicals: A Workshop for Performers\n\nThis intensive, team taught class prepares musical theatre actors for the unique experience of working on new musicals. From sight singing, character creation and script analysis to collaborating with writers, directors and music directors, students will have the full experience of working on a new musical using the 29 hour equity reading model.  The four week class will first focus on skill building and exploration of sections of new shows from the Graduate Musical Theatre Writing Program.   The course culminates in a complete 29 hour reading presented by student performers in collaboration w...\n\n      more description for GMTW-UT 1085 »\n\n      \n\n\n\nThis intensive, team taught class prepares musical theatre actors for the unique experience of working on new musicals. From sight singing, character creation and script analysis to collaborating with writers, directors and music directors, students will have the full experience of working on a new musical using the 29 hour equity reading model.  The four week class will first focus on skill building and exploration of sections of new shows from the Graduate Musical Theatre Writing Program.   The course culminates in a complete 29 hour reading presented by student performers in collaboration with a creative team to bring a new musical to life.\n\n      less description for GMTW-UT 1085 «",
            "offering": false
        },
        {
            "course_id": "GMTW-UT 1090",
            "course_name": "",
            "description": "GMTW-UT 1090\n\n   Songwriting\n\nSongwriting is the art of minimalism. How can you condense a life into three-and-a-half minutes? How can you create a powerful emotion or a hilarious experience in 250 words or less? How do structure, genre, and even rhyme inform your listener’s subconscious experience? Carner and Gregor, an award-winning songwriting team known for their stylistic versatility, whose work is performed in hundreds of venues around the world by some of Broadway’s biggest stars, will teach you how to translate your thoughts and experiences into words and music. This course is for all levels of musicians, singers, ...\n\n      more description for GMTW-UT 1090 »\n\n      \n\n\n\nSongwriting is the art of minimalism. How can you condense a life into three-and-a-half minutes? How can you create a powerful emotion or a hilarious experience in 250 words or less? How do structure, genre, and even rhyme inform your listener’s subconscious experience? Carner and Gregor, an award-winning songwriting team known for their stylistic versatility, whose work is performed in hundreds of venues around the world by some of Broadway’s biggest stars, will teach you how to translate your thoughts and experiences into words and music. This course is for all levels of musicians, singers, and lyricists, as well as for those who are simply interested in learning more about songwriting. Through close analysis of a wide variety of classic and contemporary songs--as well as detailed discussion of your own material--you will learn how to adapt your ideas to different musical genres, the art of revision, writing for specific singers, writing for character, and connecting with an audience. The focus will be on the songwriting building blocks of melody, harmony, rhyme, structure, driving home a “hook,” and overall conceit or strategy. Other topics covered will include demoing your work and putting together live performances. Come away with at least one finished song and a public performance of your work.\n\n      less description for GMTW-UT 1090 «",
            "offering": false
        }
    ]
}