{
    "major_id": "NCRD-GT",
    "file": "./2015-2016/Non-Credit_TSOA_Courses_(NCRD-GT).html",
    "courses": [
        {
            "course_id": "NCRD-GT 1212",
            "course_name": "",
            "description": "NCRD-GT 1212\n\n   Neo Noir\n\n“Neo Noir” explores the multiple ways that films made beyond the classic period reference, appropriate, extend, pay homage to, and even define that amorphous category called “film noir”:  from nostalgia to escalation, from remakes to meta discourse retroactively constructing a “genre,” from (further) genre hybridization to the dispersion of disconnected noir elements (crime, paranoia, the femme fatale, subjective flashback, existentialism), from realist-expressionist black and white to blatant and stylized color, from censorship’s dark sexuality to hyperreal violence, from national to internat...\n\n      more description for NCRD-GT 1212 »\n\n      \n\n\n\n“Neo Noir” explores the multiple ways that films made beyond the classic period reference, appropriate, extend, pay homage to, and even define that amorphous category called “film noir”:  from nostalgia to escalation, from remakes to meta discourse retroactively constructing a “genre,” from (further) genre hybridization to the dispersion of disconnected noir elements (crime, paranoia, the femme fatale, subjective flashback, existentialism), from realist-expressionist black and white to blatant and stylized color, from censorship’s dark sexuality to hyperreal violence, from national to international. A tentative list of films includes Body Heat, Taxi Driver, Blood Simple, Exotica, Coup de Torchon, High and Low, One False Move, The Grifters, Memento, Usual Suspects, The Last Seduction, Kill Bill, Chungking Express, Mulholland Drive, The Thin Blue Line, and Funny Games. Rather than attempting to rein in film noir, the course celebrates Neo Noir’s exponential extrapolations. Students are encouraged to pursue their cinephilic aptitude in outside screenings. Key literary texts will also be examined. Hence, although critical readings are crucial, a large component of the course assignments will include creative works.\n\n      less description for NCRD-GT 1212 «",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 1225",
            "course_name": "",
            "description": "NCRD-GT 1225\n\n   Hitchcock & his Influence\n\nHitchcock is the most recognized and imitated film director in the history of movies. The course will seek to examine and explain Hitchcock's influence and seek to understand, through the case of Hitchcock, the very idea of cinematic influence. The class will begin by closely examining key works of Hitchcock (Rear Window, Vertigo, Psycho, and The Birds) in order to understand the elements that make up Hitchcock's universe, in particular, the complex role and function of suspense. We shall then examine the nature and scope of Hitchcock's influence upon American and European Cinema in the work o...\n\n      more description for NCRD-GT 1225 »\n\n      \n\n\n\nHitchcock is the most recognized and imitated film director in the history of movies. The course will seek to examine and explain Hitchcock's influence and seek to understand, through the case of Hitchcock, the very idea of cinematic influence. The class will begin by closely examining key works of Hitchcock (Rear Window, Vertigo, Psycho, and The Birds) in order to understand the elements that make up Hitchcock's universe, in particular, the complex role and function of suspense. We shall then examine the nature and scope of Hitchcock's influence upon American and European Cinema in the work of directors such as Chabrol, Truffaut, Almodóvar, Argento, Verhoeven, Spielberg, Scorcese, Lynch, Antonioni, Fincher, and de Palma.\n\n      less description for NCRD-GT 1225 «",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 1230",
            "course_name": "Scorsese's New York",
            "description": "NCRD-GT 1230 Scorsese's New York \nThis course will focus on the New York City films of Martin Scorsese.  We shall approach several of the films (e.g. Gangs of New York, The Age of Innocence) as filmic examples of historical fiction and most of the other films in terms of their socio-cultural representation of New York City phenomena (e.g. immigration, crime, Wall Street, the art and entertainment industries).  As well, we will be concerned with exploring Scorsese’s “narrative method” – his usages of film form and style – in relation to the above issues.",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 2090",
            "course_name": "Musical Thea",
            "description": "NCRD-GT 2090 Musical Thea",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 2102",
            "course_name": "Writin Fo Television",
            "description": "NCRD-GT 2102 Writin Fo Television",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 2201",
            "course_name": "Drawing for Theatre and Film",
            "description": "NCRD-GT 2201 Drawing for Theatre and Film",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 2202",
            "course_name": "Period Style/Period Reality",
            "description": "NCRD-GT 2202 Period Style/Period Reality",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 2203",
            "course_name": "Intro Todesign for Stage and Film",
            "description": "NCRD-GT 2203 Intro Todesign for Stage and Film",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 2616",
            "course_name": "N/C Adv Act Tech Teacher",
            "description": "NCRD-GT 2616 N/C Adv Act Tech Teacher",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 4501",
            "course_name": "",
            "description": "NCRD-GT 4501\n\n   Pedro Almodovar\n\nPedro Almodóvar is the most notorious Spanish filmmaker since Luis Buñuel, and, like Buñuel, he rapidly gained international acclaim.  This course will attend to Almodóvar’s appealing body of work (What Have I Done to Deserve This, Matador, Law of Desire, Tie Me Up Tie Me Down, All About My Mother, Talk to Her, Bad Education, Volver, Women on the Verge of a Nervous Breakdown, The Skin I Live In, among others) in relation to: national political history; international film exhibition; intertextual popular culture; comedy-thriller-melodrama genre mixing; convoluted narrative structures; theatrica...\n\n      more description for NCRD-GT 4501 »\n\n      \n\n\n\nPedro Almodóvar is the most notorious Spanish filmmaker since Luis Buñuel, and, like Buñuel, he rapidly gained international acclaim.  This course will attend to Almodóvar’s appealing body of work (What Have I Done to Deserve This, Matador, Law of Desire, Tie Me Up Tie Me Down, All About My Mother, Talk to Her, Bad Education, Volver, Women on the Verge of a Nervous Breakdown, The Skin I Live In, among others) in relation to: national political history; international film exhibition; intertextual popular culture; comedy-thriller-melodrama genre mixing; convoluted narrative structures; theatrical uses of color, music, acting, and scale; interrelated themes of family, desire, and identity; and an aesthetics of excess. Finally we will consider the “outstanding” Almodóvar within a context of “influence.”\n\n      less description for NCRD-GT 4501 «",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 4502",
            "course_name": "Kubrick",
            "description": "NCRD-GT 4502 Kubrick \nThe films of Stanley Kubrick constitute one of the most innovative bodies of work in the commercial cinema.  This course investigates Kubrick’s films in detail with emphasis on their narrative conceptions and structures.  The course will explore the uses of irony and voiceover, the representation of the relationship between humans and technology, the centrality of the topic of war, and the relationship of his films to issues of genre.",
            "offering": false
        },
        {
            "course_id": "NCRD-GT 4503",
            "course_name": "",
            "description": "NCRD-GT 4503\n\n   Close Analysis of Film\n\nThis class examines a small number of films in great detail with the intention of enhancing student comprehension of the multiple levels at which films are made and received.  Among the films we will analyze are Touch of Evil (1958), Do the Right Thing (1989), In the Mood For Love (2000), Pan’s Labyrinth (2006), Run, Lola, Run (1998), and Gilda (1946). The course encourages the intensive, and comparative study of film, and concentrates on the formal analysis of the sound and image track, the segmentation of the scenario/narrative, techniques of stylistic analysis, and a consideration of a film...\n\n      more description for NCRD-GT 4503 »\n\n      \n\n\n\nThis class examines a small number of films in great detail with the intention of enhancing student comprehension of the multiple levels at which films are made and received.  Among the films we will analyze are Touch of Evil (1958), Do the Right Thing (1989), In the Mood For Love (2000), Pan’s Labyrinth (2006), Run, Lola, Run (1998), and Gilda (1946). The course encourages the intensive, and comparative study of film, and concentrates on the formal analysis of the sound and image track, the segmentation of the scenario/narrative, techniques of stylistic analysis, and a consideration of a film’s surrounding documents, such as studio papers, posters, and critical reviews.   Students will acquire vocabulary and tools through which to describe the textual patterns and forces by which a film produces its meanings and effects.  As a key part of the course, each student will closely analyze an individual film they have chosen, for a final presentation.\n\n      less description for NCRD-GT 4503 «",
            "offering": false
        }
    ]
}