{
    "major_id": "NONCR-GP",
    "file": "./2015-2016/Noncredit_course_(NONCR-GP).html",
    "courses": [
        {
            "course_id": "NONCR-GP 101",
            "course_name": "",
            "description": "NONCR-GP  101\n\n   Impact in The Classroom\n\nPreterm Workshop\n\nWant to make the best of your classroom experience?  Share your experiences in the service of peer/group learning?  Utilize the skills and knowledge of professors and peers to increase your knowledge?  Have the ability to listen to all viewpoints?  This preterm course will give you a number of tips and ideas for increasing the learning that you and your peers have in the classroom.  Learn to ask effective questions, listen for meaning and make connections between your work experience and the topic being taught.  The course will assist you in repositioning yourself as an activ...\n\n      more description for NONCR-GP  101 »\n\n      \n\n\n\nPreterm Workshop\n\nWant to make the best of your classroom experience?  Share your experiences in the service of peer/group learning?  Utilize the skills and knowledge of professors and peers to increase your knowledge?  Have the ability to listen to all viewpoints?  This preterm course will give you a number of tips and ideas for increasing the learning that you and your peers have in the classroom.  Learn to ask effective questions, listen for meaning and make connections between your work experience and the topic being taught.  The course will assist you in repositioning yourself as an active learner.\n\n      less description for NONCR-GP  101 «",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 102",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "5048",
                    "section": "001",
                    "period": "08/18/2015 - 08/18/2015",
                    "location": "Battista, Andrew",
                    "time": "Tue 4.00 PM - 5.30 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Workshop",
                    "class_id": "5049",
                    "section": "002",
                    "period": "11/10/2015 - 11/10/2015",
                    "location": "Battista, Andrew",
                    "time": "Tue 7.00 PM - 8.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Library Research Methods",
            "description": "NONCR-GP  102 Library Research Methods \nPreterm Workshop\n\nThis workshop will provide students with helpful tips on how to use NYU's Bobst Library to conduct effective and appropriate research for course assignments.",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 103",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "5050",
                    "section": "001",
                    "period": "08/27/2015 - 08/31/2015",
                    "location": "BOBS 937",
                    "time": "Mon,Thu 5.30 PM - 8.30 PM",
                    "open": true,
                    "professor": "Beck, Diana"
                }
            ],
            "course_name": "",
            "description": "NONCR-GP  103\n\n   Presentation Skills\n\nPreterm Workshop\n\nThe presentation skills workshop will provide students with the opportunity to explore techniques for developing and delivering presentations. The workshop will focus on such topics as overcoming speaker anxiety, non-verbal communication, voice and expression, delivery style, and working with visual aids. Students will deliver a short presentation in the second session for which they will receive immediate feedback in a supportive environment. Additionally, the instructor will work with each participant on techniques to address issues identified during oral feedback. Partic...\n\n      more description for NONCR-GP  103 »\n\n      \n\n\n\nPreterm Workshop\n\nThe presentation skills workshop will provide students with the opportunity to explore techniques for developing and delivering presentations. The workshop will focus on such topics as overcoming speaker anxiety, non-verbal communication, voice and expression, delivery style, and working with visual aids. Students will deliver a short presentation in the second session for which they will receive immediate feedback in a supportive environment. Additionally, the instructor will work with each participant on techniques to address issues identified during oral feedback. Participants do not need to prepare anything for the first session.\n\n      less description for NONCR-GP  103 «",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 104",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "5051",
                    "section": "001",
                    "period": "08/20/2015 - 08/20/2015",
                    "location": "Battista, Andrew",
                    "time": "Thu 5.00 PM - 6.30 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Workshop",
                    "class_id": "5052",
                    "section": "002",
                    "period": "09/15/2015 - 09/15/2015",
                    "location": "Battista, Andrew",
                    "time": "Tue 7.00 PM - 8.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Citation Methods",
            "description": "NONCR-GP  104 Citation Methods \nPreterm Workshop\n\nThis workshop will provide students with the necessary information on appropriate citation. Students will learn how to use RefWorks, which is an online citation management database available for use.",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 105",
            "course_name": "How to Run Effective Meetings",
            "description": "NONCR-GP  105 How to Run Effective Meetings \nPreterm Workshop - This interactive workshop provides students with techniques for holding meetings that are streamlined and productive. Through small group work, exercises and discussions, students will explore the most effective ways to plan meetings, create dynamic agendas and encourage participation and follow-up on action steps.",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 106",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "5053",
                    "section": "001",
                    "period": "08/26/2015 - 08/26/2015",
                    "location": null,
                    "time": "Wed 12.00 PM - 2.00 PM",
                    "open": true,
                    "professor": "SILV 504"
                }
            ],
            "course_name": "Time/Project Management",
            "description": "NONCR-GP  106 Time/Project Management \nPreterm Workshop\n\nThis workshop will provide students with the opportunity to learn some of the tools and tips that can help to maximize their time so that they can fit in the endless list of to do's in life. Specific topics that will be addressed include making time for all of one's responsibilities as well as leisure and family activities, carving out time for studying, developing more efficient study habits, scheduling, meetings, and communicating with team project members, and applying project management tools to team projects.",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 107",
            "course_name": "Memo Writing",
            "description": "NONCR-GP  107 Memo Writing \nPreterm Workshop\n\nThis workshop will provide students with everything they need to know about public policy memos. They will learn the basic format, structure and style elements, will examine real-world policy memos and will create their own memo. Students should walk away from the workshop with the skills necessary to write concise and persuasive memos for classes and for future careers.",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 108",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "5054",
                    "section": "001",
                    "period": "09/10/2015 - 10/01/2015",
                    "location": "Schachter, David",
                    "time": "Thu 2.00 PM - 3.40 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Workshop",
                    "class_id": "5055",
                    "section": "002",
                    "period": "10/21/2015 - 11/11/2015",
                    "location": "Schachter, David",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Composing Your Career",
            "description": "NONCR-GP  108 Composing Your Career \nThroughout this four-session workshop, students will use their experiences and education as the context for a series of career-related analyses based on the following four lenses: Issue, System, Organization, and Role.  All discussions will be brought back to Composing Your Career (CYC), a framework for maximizing one?s time at Wagner based on the SEER strategy: Smart, Experienced, Engaged, and Reflective. All of this will lead to an action plan to maximize one?s time at Wagner in the pursuit of a successful public service career.",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 109",
            "course_name": "PowerPoint",
            "description": "NONCR-GP  109 PowerPoint \nThis hand-on workshop covers the basics of PowerPoint, including slide layouts, fonts and colors, inserting objects (images, charts, audio and video), and using presenter's notes and presentation mode. There is a strong emphasis on good presentation design: what to include and what to leave off, how to pace your presentation, and so on. Students should leave this workshop confident not just that they can create a PowerPoint presentation, but that they can create a presentation that will engage their audience effectively.",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 110",
            "course_name": "Running Effective Meetings",
            "description": "NONCR-GP  110 Running Effective Meetings",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 120",
            "course_name": "Excel Computer Module II",
            "description": "NONCR-GP  120 Excel Computer Module II \nThis workshop introduces students to Excel’s advanced tools for data analysis and modeling.\n\nTopics include shortcut keys, sorting and filtering, conditional formatting, macros, a variety of formulas (if, lookup, index, match, etc.), array formulas, graphing, pivot tables and charts, what-if analysis (scenario manager, goal seek, and data tables), and regression analysis.",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 160",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "5261",
                    "section": "001",
                    "period": "08/24/2015 - 08/27/2015",
                    "location": "WAVE 668",
                    "time": "Mon,Tue,Wed,Thu 9.00 AM - 1.00 PM",
                    "open": true,
                    "professor": "Stainbrook, Steven; Galipo, Eric"
                }
            ],
            "course_name": "Urban Planning Skills Workshop",
            "description": "NONCR-GP  160 Urban Planning Skills Workshop",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 250",
            "course_name": "Hunger and Food Security in a Global Perspective",
            "description": "NONCR-GP  250 Hunger and Food Security in a Global Perspective",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 906",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5076",
                    "section": "001",
                    "period": "08/24/2015 - 08/26/2015",
                    "location": "SILV 411",
                    "time": "Mon,Tue,Wed 5.00 PM - 7.45 PM",
                    "open": true,
                    "professor": "Beck, Diana"
                },
                {
                    "format": "Lecture",
                    "class_id": "17527",
                    "section": "002",
                    "period": "09/14/2015 - 10/12/2015",
                    "location": "SILV 411",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Beck, Diana"
                },
                {
                    "format": "Lecture",
                    "class_id": "17528",
                    "section": "003",
                    "period": "09/18/2015 - 10/16/2015",
                    "location": "GCASL 369",
                    "time": "Fri 12.00 PM - 1.40 PM",
                    "open": true,
                    "professor": "Beck, Diana"
                }
            ],
            "course_name": "Math Review Session",
            "description": "NONCR-GP  906 Math Review Session \nThis noncredit module focuses on those math skills that are essential to statistics, microeconomics, and financial management. Students taking quantitative courses are encouraged to take advantage of this review.",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 907",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5078",
                    "section": "001",
                    "period": "09/11/2015 - 10/16/2015",
                    "location": "SILV 520",
                    "time": "Fri 9.00 AM - 10.40 AM",
                    "open": true,
                    "professor": "Capps, Mary"
                },
                {
                    "format": "Lecture",
                    "class_id": "17397",
                    "section": "002",
                    "period": "10/30/2015 - 12/11/2015",
                    "location": "MEYR 157",
                    "time": "Fri 9.00 AM - 10.40 AM",
                    "open": true,
                    "professor": "Capps, Mary"
                }
            ],
            "course_name": "Professional Writing",
            "description": "NONCR-GP  907 Professional Writing \nThe first two sessions of this course cover basic principles of memo writing. The third and fourth sessions review grammar and punctuation rules such as subject/verb agreement, punctuation, and run-on sentences. The final two sessions will be devoted to a review of stylistic aspects of writing, such as writing concisely and clearly, avoiding cliches and redundancy, varying word choice, and outlining and organizing ideas. Students will bring in papers they have written and will be guided through the editing process.",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 909",
            "course_name": "",
            "description": "NONCR-GP  909\n\n   Debt Structuring Module\n\nA two-day Debt Structuring Module is for students interested in public finance or the financing areas of state or local governments. \n\nThis module provides a review of the basic municipal bond terminology and understand the bond mathematics needed to understand how to interpret widely used finance software (DBC Finance Software). Students will also use software to perform simple bond sizing calculations, illustrating different frequently encountered structures. \n\nThe module will also examine some of the IRS constraints on municipal bonds, especially those that relate to the refinancing of bond...\n\n      more description for NONCR-GP  909 »\n\n      \n\n\n\nA two-day Debt Structuring Module is for students interested in public finance or the financing areas of state or local governments. \n\nThis module provides a review of the basic municipal bond terminology and understand the bond mathematics needed to understand how to interpret widely used finance software (DBC Finance Software). Students will also use software to perform simple bond sizing calculations, illustrating different frequently encountered structures. \n\nThe module will also examine some of the IRS constraints on municipal bonds, especially those that relate to the refinancing of bonds. Finally, the class will use DBC to analyze refinancing scenarios. \n\nThis is a non-credit course.\n\n      less description for NONCR-GP  909 «",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 931",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5225",
                    "section": "001",
                    "period": "08/17/2015 - 08/19/2015",
                    "location": null,
                    "time": "Mon,Tue,Wed 4.30 PM - 6.10 PM",
                    "open": true,
                    "professor": "WAVE 668"
                },
                {
                    "format": "Lecture",
                    "class_id": "5264",
                    "section": "002",
                    "period": "10/30/2015 - 11/13/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.40 PM",
                    "open": true,
                    "professor": "WAVE 668"
                }
            ],
            "course_name": "",
            "description": "NONCR-GP  931\n\n   SPSS Computer Module\n\nThis non-credit, 3-session module teaches students who do not take Statistical Methods (CORE-GP 1011) how to use the SPSS statistical program to manipulate data and generate statistical output consisting of descriptive statistics, Hypothesis tests of Means, Chi-Square tests, correlation values, and regression models. (Instruction in the use of SPSS is also provided as part of the Statistical Methods course). The module is held in a computer lab and every student has a computer. Everything that students need to know about SPSS to successfully complete the SPSS Exam is covered in this module. Th...\n\n      more description for NONCR-GP  931 »\n\n      \n\n\n\nThis non-credit, 3-session module teaches students who do not take Statistical Methods (CORE-GP 1011) how to use the SPSS statistical program to manipulate data and generate statistical output consisting of descriptive statistics, Hypothesis tests of Means, Chi-Square tests, correlation values, and regression models. (Instruction in the use of SPSS is also provided as part of the Statistical Methods course). The module is held in a computer lab and every student has a computer. Everything that students need to know about SPSS to successfully complete the SPSS Exam is covered in this module. There are no pre-requisites. This non-credit, 3-session module teaches students who do not take Statistical Methods (P11.1011) how to use the SPSS statistical program to manipulate data and generate statistical output consisting of data listings, descriptive statistics, frequency tables, crosstabulation tables, T-Tests, correlation values, scatter-diagrams and regression models. (Instruction in the use of SPSS is also provided as part of the Statistical Methods course). The module is held in a computer lab and every student has a computer. Everything that students need to know about SPSS to successfully complete the SPSS Exam is covered in this module. There are no pre-requisites.\n\n      less description for NONCR-GP  931 «",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 932",
            "classes": [
                {
                    "format": "Laboratory",
                    "class_id": "5073",
                    "section": "001",
                    "period": "09/05/2015 - 09/12/2015",
                    "location": null,
                    "time": "Sat 9.30 AM - 11.30 AM",
                    "open": true,
                    "professor": "194M 30409/26/2015 - 09/26/2015 Sat 9.30 AM - 11.30 AM at 194M 304"
                }
            ],
            "course_name": "Excel Computer Module",
            "description": "NONCR-GP  932 Excel Computer Module \nThis non-credit, 3-session module teaches students how to use the Microsoft Excel spreadsheet program to enter, manipulate and analyze data. The module is held in a computer lab and every student has a computer. Everything that students need to know about Excel to successfully complete the Excel Exam is covered in this module. There are no pre-requisites.",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 933",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "17546",
                    "section": "001",
                    "period": "09/19/2015 - 09/19/2015",
                    "location": null,
                    "time": "Sat 9.30 AM - 11.30 AM",
                    "open": true,
                    "professor": "194M 30410/03/2015 - 10/10/2015 Sat 9.30 AM - 11.30 AM at 194M 304"
                }
            ],
            "course_name": "Excel Computer Module II",
            "description": "NONCR-GP  933 Excel Computer Module II \nThis workshop introduces students to Excel’s advanced tools for data analysis and modeling. Topics include shortcut keys, sorting and filtering, conditional formatting, macros, a variety of formulas (if, lookup, index, match, etc.), array formulas, graphing, pivot tables and charts, what-if analysis (scenario manager, goal seek, and data tables), and regression analysis. \n\nPrerequisites:CORE-GP.1021 or concurrently",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 934",
            "course_name": "",
            "description": "NONCR-GP  934\n\n   Introduction to Access\n\nThis workshop introduces students to the Microsoft Access database management system. Topics include tables and relationships, with a focus on limiting redundancy; queries using both the Access query design tool and SQL; creating a user interface with forms and reports; integrating Excel and Access; and macro building using both the Access macro builder and Visual Basic for Applications (VBA). At the conclusion of the workshop, students will be able to build a simple, minimally redundant database that implements one-to-one, one-to-many, and many-to-many relationships; build queries to retrieve...\n\n      more description for NONCR-GP  934 »\n\n      \n\n\n\nThis workshop introduces students to the Microsoft Access database management system. Topics include tables and relationships, with a focus on limiting redundancy; queries using both the Access query design tool and SQL; creating a user interface with forms and reports; integrating Excel and Access; and macro building using both the Access macro builder and Visual Basic for Applications (VBA). At the conclusion of the workshop, students will be able to build a simple, minimally redundant database that implements one-to-one, one-to-many, and many-to-many relationships; build queries to retrieve information; create user-friendly forms that implement queries and navigate the database; design reports that effectively display query results; and implement simple VBA scripts.\n\n      less description for NONCR-GP  934 «",
            "offering": false
        },
        {
            "course_id": "NONCR-GP 938",
            "classes": [
                {
                    "format": "Recitation",
                    "class_id": "5075",
                    "section": "001",
                    "period": "08/20/2015 - 08/20/2015",
                    "location": null,
                    "time": "Thu 6.00 PM - 7.00 PM",
                    "open": true,
                    "professor": "WAVE 668"
                },
                {
                    "format": "Recitation",
                    "class_id": "5074",
                    "section": "002",
                    "period": "11/20/2015 - 11/20/2015",
                    "location": null,
                    "time": "Fri 2.00 PM - 3.00 PM",
                    "open": true,
                    "professor": "194M 304"
                }
            ],
            "course_name": "",
            "description": "NONCR-GP  938\n\n   SPSS Proficiency Examination\n\nThe SPSS Exam is a closed-book exam which is done on the computer. Given a set of data with a limited number of variables, students must demonstrate how they would use SPSS to recode variables and generate various types of statistical output (frequency tables; crosstabulation tables; T-Tests; ANOVA tests; Chi-Square tests; correlation matrices; and regression results). Students must be able to recognize precisely what type of statistical analysis is required to answer each question and must write down the computer steps (what to click on, what to type) required to generate the specified type o...\n\n      more description for NONCR-GP  938 »\n\n      \n\n\n\nThe SPSS Exam is a closed-book exam which is done on the computer. Given a set of data with a limited number of variables, students must demonstrate how they would use SPSS to recode variables and generate various types of statistical output (frequency tables; crosstabulation tables; T-Tests; ANOVA tests; Chi-Square tests; correlation matrices; and regression results). Students must be able to recognize precisely what type of statistical analysis is required to answer each question and must write down the computer steps (what to click on, what to type) required to generate the specified type of statistical output.\n\n      less description for NONCR-GP  938 «",
            "offering": true
        },
        {
            "course_id": "NONCR-GP 989",
            "course_name": "Introduction to Governance",
            "description": "NONCR-GP  989 Introduction to Governance \nThis course is designed for students who lack the knowledge of the basic design and functions of governmental units in the United States. It is meant to provide students with a fundamental understanding of the most important features of national, state, and local governments. Included in the course is discussion of the executive, legislative, and judicial branches and the formation/evolution of American federal, state, and local governments.",
            "offering": false
        }
    ]
}