{
    "major_id": "NURSE-GN",
    "file": "./2015-2016/Nursing_-_Graduate_(NURSE-GN).html",
    "courses": [
        {
            "course_id": "NURSE-GN 1011",
            "course_name": "",
            "description": "NURSE-GN 1011\n\n   Hlth Issues Culturally Diverse Families\n\n45 hours: 3 credits. This course provides an overview of health issues of culturally diverse families. Awareness of the relationship between culture and health is an important component to mitigating disparities in health access and outcomes among minorities and underserved populations. The course will examine the influence of race, class, gender, sexual orientation, and culture on the health, health beliefs, health behavior, and health care utilization of culturally diverse families from a multidisciplinary perspective.  Family beliefs across the life span about health and illness, family hea...\n\n      more description for NURSE-GN 1011 »\n\n      \n\n\n\n45 hours: 3 credits. This course provides an overview of health issues of culturally diverse families. Awareness of the relationship between culture and health is an important component to mitigating disparities in health access and outcomes among minorities and underserved populations. The course will examine the influence of race, class, gender, sexual orientation, and culture on the health, health beliefs, health behavior, and health care utilization of culturally diverse families from a multidisciplinary perspective.  Family beliefs across the life span about health and illness, family health behaviors and culturally sensitive approaches for health care providers will be examined. Specific health topics such as developmental issues, aging, women?s health, HIV/AIDS, chronic disease, mental illness and substance use, along with contextual environmental factors will be examined through the lens of culture.\n\n      less description for NURSE-GN 1011 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 1013",
            "course_name": "Wound Care Essentials Hlth Care Professionals",
            "description": "NURSE-GN 1013 Wound Care Essentials Hlth Care Professionals \n45 hours: 3 credits. This multi-disciplinary course is designed for health care professionals who want to gain the essential knowledge necessary to care for clients with wounds. Prevention techniques as well as specific treatment modalities for several types of wounds commonly encountered in the clinical setting are included.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2003",
            "course_name": "Curric Devel in Nursing",
            "description": "NURSE-GN 2003 Curric Devel in Nursing",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2004",
            "course_name": "",
            "description": "NURSE-GN 2004\n\n   Legal & Ethical Issues in Nursing Practice\n\nLegal and ethical parameters of the nursing profession are addressed. Laws, statutes, and legal principles that underpin the profession of nursing and define the boundaries of nursing practice are examined. Nurses? professional relationships with patients, other health care colleagues, employers, and professional organizations are examined from a legal and ethical perspective. Topics discussed include patient confidentiality, nursing negligence, medical malpractice, autonomy, informed consent, termination of treatment, decision-making capacity, organ donation, assisted suicide, and documentati...\n\n      more description for NURSE-GN 2004 »\n\n      \n\n\n\nLegal and ethical parameters of the nursing profession are addressed. Laws, statutes, and legal principles that underpin the profession of nursing and define the boundaries of nursing practice are examined. Nurses? professional relationships with patients, other health care colleagues, employers, and professional organizations are examined from a legal and ethical perspective. Topics discussed include patient confidentiality, nursing negligence, medical malpractice, autonomy, informed consent, termination of treatment, decision-making capacity, organ donation, assisted suicide, and documentation.\n\n      less description for NURSE-GN 2004 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2005",
            "course_name": "Intro Stats Health Profs",
            "description": "NURSE-GN 2005 Intro Stats Health Profs \nThe syllabus for N41.2005 is intended for graduate students in nursing. The course provides the foundations necessary to understand elementary biostatistics and applications of biostatistics in the medical literature. It will concentrate on the interpretation and comprehension of graphical and statistical techniques that are essential components to medical research. The ability to understand basic arithmetic and high school algebra is required.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2009",
            "course_name": "Family Devel in Commun",
            "description": "NURSE-GN 2009 Family Devel in Commun",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2010",
            "course_name": "Dynamics in Community Health",
            "description": "NURSE-GN 2010 Dynamics in Community Health",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2011",
            "course_name": "Apn: Pop Focus Care",
            "description": "NURSE-GN 2011 Apn: Pop Focus Care \nThe Population-Focused Care course explores advanced practice nursing at community and population levels. Nursing contributions to core public health functions and essential public health services are considered in the context of theoretical frameworks for health communication and behavioral change to develop programs to improve the health of populations.  Data sources for community health assessment and epidemiologic analyses are examined.  Cultural and political competencies are also addressed.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2012",
            "course_name": "Advanced Physical Assessment Across the Lifespan",
            "description": "NURSE-GN 2012 Advanced Physical Assessment Across the Lifespan \nIn this course, the advanced practice student develops advanced comprehensive history taking and physical assessment competencies in the context of the nurse-client relationship. The outcomes are achieved via a case-based approach that is hypothesis driven and focuses on clinical decision making using the best available evidence to mutually address client goals using a culturally relevant approach. There is an introduction to laboratory and diagnostic tests and basic electrocardiogram interpretation as part of the decision making process.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2013",
            "course_name": "",
            "description": "NURSE-GN 2013\n\n   Contemp Clin Pract Roles\n\nThe role of the Advanced Practice Nurse, (APN) with a systematic introduction to direct client care and practice management is explored.  Introduction to the role of the advanced practice nurse, and the Nurse Practitioner (NP) as clinician, advocate educator, collaborator, and leader is initiated.  Autonomous and collaborative practice will be emphasized.  Concepts applicable to working with culturally diverse and underserved individuals and families through skills related to leadership, communication, change management, evidence based practice, and ethical decision making are addressed.  Sele...\n\n      more description for NURSE-GN 2013 »\n\n      \n\n\n\nThe role of the Advanced Practice Nurse, (APN) with a systematic introduction to direct client care and practice management is explored.  Introduction to the role of the advanced practice nurse, and the Nurse Practitioner (NP) as clinician, advocate educator, collaborator, and leader is initiated.  Autonomous and collaborative practice will be emphasized.  Concepts applicable to working with culturally diverse and underserved individuals and families through skills related to leadership, communication, change management, evidence based practice, and ethical decision making are addressed.  Selected nursing models will be used to support role implementation in a variety of settings including those for the delivery of primary care, acute care, ambulatory care and long term health care.\n\n      less description for NURSE-GN 2013 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2014",
            "course_name": "Nursing Therapy and The Family",
            "description": "NURSE-GN 2014 Nursing Therapy and The Family",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2015",
            "course_name": "Cont Roles & Assess",
            "description": "NURSE-GN 2015 Cont Roles & Assess",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2016",
            "course_name": "",
            "description": "NURSE-GN 2016\n\n   APN: Adult-Gerontology Primary Care II\n\nThis course prepares students to provide primary care to adolescents and adult clients across the life span. The course integrates advanced practice nursing competencies with holistic assessment, diagnostic reasoning, and analysis of differential diagnoses in primary care. Students apply critical thinking and evidence based clinical decision making skills to develop, implement, and evaluate management plans for adolescents and adults residing in the community with acute and chronic health problems. Client advocacy; health promotion; disease prevention; and physical, functional, and mental heal...\n\n      more description for NURSE-GN 2016 »\n\n      \n\n\n\nThis course prepares students to provide primary care to adolescents and adult clients across the life span. The course integrates advanced practice nursing competencies with holistic assessment, diagnostic reasoning, and analysis of differential diagnoses in primary care. Students apply critical thinking and evidence based clinical decision making skills to develop, implement, and evaluate management plans for adolescents and adults residing in the community with acute and chronic health problems. Client advocacy; health promotion; disease prevention; and physical, functional, and mental health assessment and management are emphasized. Caseload management, interdisciplinary collaboration, community resources, and consideration of learning needs of diverse populations, clients, family, and staff are addressed.\n\n      less description for NURSE-GN 2016 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2017",
            "course_name": "",
            "description": "NURSE-GN 2017\n\n   APN: Adult-Gerontology Primary Care Practicum II\n\nThe leadership role of the adult nurse practitioner (ANP) in the primary care setting is analyzed as a framework for managing the healthcare needs of adolescents and adult populations with complex health problems. Acute and chronic health care needs of individuals, families and communities are assessed, diagnosed, managed and evaluatedThe leadership role of the adult nurse practitioner (ANP) in the primary care setting is analyzed as a framework for managing the healthcare needs of adolescents and adult populations with complex health problems. Acute and chronic health care needs of individual...\n\n      more description for NURSE-GN 2017 »\n\n      \n\n\n\nThe leadership role of the adult nurse practitioner (ANP) in the primary care setting is analyzed as a framework for managing the healthcare needs of adolescents and adult populations with complex health problems. Acute and chronic health care needs of individuals, families and communities are assessed, diagnosed, managed and evaluatedThe leadership role of the adult nurse practitioner (ANP) in the primary care setting is analyzed as a framework for managing the healthcare needs of adolescents and adult populations with complex health problems. Acute and chronic health care needs of individuals, families and communities are assessed, diagnosed, managed and evaluated using evidence-based best practices. Emphasis is placed on the leadership role of the ANP in providing ethical, culturally competent and collaborative health care, yielding quality and cost-effective outcomes.\n\n      less description for NURSE-GN 2017 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2018",
            "course_name": "",
            "description": "NURSE-GN 2018\n\n   APN: Adult-Gerontology Primary Care III\n\nThis course focuses on the assessment, diagnosis, management and evaluation of complex health problems of the adolescents and adult clients in primary care settings.  Students apply critical thinking and evidence based clinical decision-making competencies to formulate comprehensive differential diagnoses and develop management plans with outcome criteria for adolescents and adult clients and their families.  Students combine the advanced practice roles of clinician, educator, advocate, and leader to design and evaluate therapeutic interventions that utilize a variety of treatment modalities. ...\n\n      more description for NURSE-GN 2018 »\n\n      \n\n\n\nThis course focuses on the assessment, diagnosis, management and evaluation of complex health problems of the adolescents and adult clients in primary care settings.  Students apply critical thinking and evidence based clinical decision-making competencies to formulate comprehensive differential diagnoses and develop management plans with outcome criteria for adolescents and adult clients and their families.  Students combine the advanced practice roles of clinician, educator, advocate, and leader to design and evaluate therapeutic interventions that utilize a variety of treatment modalities.  Concepts include health promotion, disease prevention, collaboration, cultural competency, health policy and ethical issues. Individual, family and community health needs are evaluated utilizing a population focused framework.\n\n      less description for NURSE-GN 2018 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2019",
            "course_name": "APN: Adult-Gerontology Primay Care Practicum III",
            "description": "NURSE-GN 2019 APN: Adult-Gerontology Primay Care Practicum III \nThe leadership role of the adult nurse practitioner (ANP) in the primary care setting is analyzed as a framework for managing the healthcare needs of adolescents and adult populations with complex health problems. Acute and chronic health care needs of individuals, families and communities are assessed, diagnosed, managed and evaluated using evidence-based best practices. Emphasis is placed on the leadership role of the ANP in providing ethical, culturally competent and collaborative health care, yielding quality and cost-effective outcomes.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2020",
            "course_name": "",
            "description": "NURSE-GN 2020\n\n   Advanced Pathophysiology Across the Lifespan I\n\nThis course expands advanced practice nursing knowledge of the pathogenesis of health problems throughout the life cycle. Pathophysiology is integrated with a developmental perspective to facilitate an in-depth understanding of functional and dysfunctional integration of organ systems in the human.  Clinical exemplars designed to illustThis course expands advanced practice nursing knowledge of the pathogenesis of health problems throughout the life cycle. Pathophysiology is integrated with a developmental perspective to facilitate an in-depth understanding of functional and dysfunctional integ...\n\n      more description for NURSE-GN 2020 »\n\n      \n\n\n\nThis course expands advanced practice nursing knowledge of the pathogenesis of health problems throughout the life cycle. Pathophysiology is integrated with a developmental perspective to facilitate an in-depth understanding of functional and dysfunctional integration of organ systems in the human.  Clinical exemplars designed to illustThis course expands advanced practice nursing knowledge of the pathogenesis of health problems throughout the life cycle. Pathophysiology is integrated with a developmental perspective to facilitate an in-depth understanding of functional and dysfunctional integration of organ systems in the human.  Clinical exemplars designed to illustrate specific concepts are presented during the lecture.  This course emphasizes content related to cellular aberrations, including cancer; disorders of fluid, electrolyte, acid-base balance, and immune function; and cardiovascular, pulmonary, renal, and musculoskeletal disorders.\n\n      less description for NURSE-GN 2020 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2021",
            "course_name": "",
            "description": "NURSE-GN 2021\n\n   Clinical Pharmacotherapeutics Across the Lifespan\n\nThe goal of this course is to prepare the advanced practice nurse to prescribe pharmacotherapies that improve patient care outcomes. .  The student will learn to integrate his/her knowledge of basic pharmacology and pathophysiology with advanced pharmacotherapeutic principles to enhance treatment decisions and prescribe medications for the prevention and treatment of disease.  Various methodologies will be used to allow the student practice in incorporating patient history, assessment, and diagnoses with consideration of the best, safest and most effective pharmacy The goal of this course is t...\n\n      more description for NURSE-GN 2021 »\n\n      \n\n\n\nThe goal of this course is to prepare the advanced practice nurse to prescribe pharmacotherapies that improve patient care outcomes. .  The student will learn to integrate his/her knowledge of basic pharmacology and pathophysiology with advanced pharmacotherapeutic principles to enhance treatment decisions and prescribe medications for the prevention and treatment of disease.  Various methodologies will be used to allow the student practice in incorporating patient history, assessment, and diagnoses with consideration of the best, safest and most effective pharmacy The goal of this course is to prepare the advanced practice nurse to prescribe pharmacotherapies that improve patient care outcomes. .  The student will learn to integrate his/her knowledge of basic pharmacology and pathophysiology with advanced pharmacotherapeutic principles to enhance treatment decisions and prescribe medications for the prevention and treatment of disease.  Various methodologies will be used to allow the student practice in incorporating patient history, assessment, and diagnoses with consideration of the best, safest and most effective pharmacy options.  An emphasis on critical analysis of the evidence according to evidence-based principles and subsequent application of the evidence into the medical and treatment plans will be fostered.  Critical decision analysis will assist the student to evaluate and revise treatment plans to improve patient care.\n\n      less description for NURSE-GN 2021 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2022",
            "course_name": "Advanced Pathophysiology Across the Lifespan II",
            "description": "NURSE-GN 2022 Advanced Pathophysiology Across the Lifespan II \nThis course expands advanced practice nursing knowledge of the pathogenesis of health problems throughout the life cycle. Pathophysiology is integrated with a developmental perspective to facilitate an in-depth understanding of functional and dysfunctional integration of organ systems in the human. Clinical situations designed to illustrate specific concepts are presented during the lecture. This course emphasizes content related to neurology, endocrinology, gastroenterology, reproductive disorders, and musculoskeletal disorders.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2023",
            "course_name": "Nursing Administration Practicum II",
            "description": "NURSE-GN 2023 Nursing Administration Practicum II \nIn this course, the student implements a strategic plan for change in the health care practicum setting that reflects organizational assessment and diagnosis of an area for improvement, supporting evidencebased research findings, analysis of financial implications, and evaluation criteria. Concomitantly, the student assists the preceptor in areas of nursing administration practice. In the seminar, students promote a culture of caring and team building as they collaborate in planning practicum initiatives related to the nurse administrator?s role.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2024",
            "course_name": "Adv Comp Hlth/Physical Assessment Pediatrics",
            "description": "NURSE-GN 2024 Adv Comp Hlth/Physical Assessment Pediatrics \nThis course provides the student the opportunity to develop advanced comprehensive history taking and physical assessment skills.  Selected nursing models and concepts will be used in the collection of an expanded clinical database through history taking and physical assessment.  The course contains lecture content, laboratory application and clinical hours in the outpatient setting.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2025",
            "course_name": "",
            "description": "NURSE-GN 2025\n\n   Apn:Adult-Geriatric Primary Care II\n\nThis course prepares students to provide care to all adults across the life span. It integrates advanced practice nursing competencies with holistic assessment, diagnostic reasoning, and analysis of differential diagnoses in primary care for adults across the life span. Students apply critical thinking and clinical decision-making skills to develop, implement, and evaluate management plans for adults and older adults residing in the community with common chronic and episodic health problems. Client advocacy, health promotion, and illness prevention and physical, functional, and mental health a...\n\n      more description for NURSE-GN 2025 »\n\n      \n\n\n\nThis course prepares students to provide care to all adults across the life span. It integrates advanced practice nursing competencies with holistic assessment, diagnostic reasoning, and analysis of differential diagnoses in primary care for adults across the life span. Students apply critical thinking and clinical decision-making skills to develop, implement, and evaluate management plans for adults and older adults residing in the community with common chronic and episodic health problems. Client advocacy, health promotion, and illness prevention and physical, functional, and mental health assessment and management are emphasized. Caseload management, interdisciplinary collaboration, community resources, and consideration of learning needs of diverse populations, clients, family, and staff are addressed.\n\n      less description for NURSE-GN 2025 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2026",
            "course_name": "",
            "description": "NURSE-GN 2026\n\n   Adv Practice Nursing: Geriatrics II\n\nThis course prepares students to provide care to older adults. It integrates advanced practice nursing competencies with holistic assessment, diagnostic reasoning, and analysis of differential diagnoses in primary care for adults across the life span. Students apply critical thinking and clinical decision-making skills to develop, implement, and evaluate management plans for older adults residing in the community with common chronic and episodic health problems. Client advocacy, health promotion, and illness prevention and physical, functional, and mental health assessment and management are e...\n\n      more description for NURSE-GN 2026 »\n\n      \n\n\n\nThis course prepares students to provide care to older adults. It integrates advanced practice nursing competencies with holistic assessment, diagnostic reasoning, and analysis of differential diagnoses in primary care for adults across the life span. Students apply critical thinking and clinical decision-making skills to develop, implement, and evaluate management plans for older adults residing in the community with common chronic and episodic health problems. Client advocacy, health promotion, and illness prevention and physical, functional, and mental health assessment and management are emphasized. Caseload management, interdisciplinary collaboration, community resources, and consideration of learning needs of diverse populations, clients, family, and staff are addressed.\n\n      less description for NURSE-GN 2026 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2027",
            "course_name": "",
            "description": "NURSE-GN 2027\n\n   Adv Practice Nursing: Geriatrics Practicum II\n\nThe role of the advanced practice gerontological nurse is applied using selected nursing models in primary care of the elderly with chronic and acute health problems living independently in the community, in ambulatory sites, and in acute care hospitals. Sites serving ethnically diverse and the underserved elderly are preferentially selected. Interdisciplinary experiences are pursued and collaborative practice is emphasized. Students are expected to provide primary care, incorporating health promotion and disease prevention. Students are also expected to perform comprehensive histories and phy...\n\n      more description for NURSE-GN 2027 »\n\n      \n\n\n\nThe role of the advanced practice gerontological nurse is applied using selected nursing models in primary care of the elderly with chronic and acute health problems living independently in the community, in ambulatory sites, and in acute care hospitals. Sites serving ethnically diverse and the underserved elderly are preferentially selected. Interdisciplinary experiences are pursued and collaborative practice is emphasized. Students are expected to provide primary care, incorporating health promotion and disease prevention. Students are also expected to perform comprehensive histories and physical assessments; formulate differential diagnoses and plans of care; and manage common health problems in consultation with appropriate providers and to act as a resource for patients, families, and staff.\n\n      less description for NURSE-GN 2027 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2028",
            "course_name": "",
            "description": "NURSE-GN 2028\n\n   Adv Practicum Nursing: Geriatrics III\n\nThis course focuses on the diagnosis and management of common health problems seen in older adults across acute care, long-term care, and primary- care settings. Health promotion; illness prevention; case finding; physical, functional, and mental health assessment; decision making; and management ofThis course focuses on the diagnosis and management of common health problems seen in older adults across acute care, long-term care, and primary- care settings. Health promotion; illness prevention; case finding; physical, functional, and mental health assessment; decision making; and management of...\n\n      more description for NURSE-GN 2028 »\n\n      \n\n\n\nThis course focuses on the diagnosis and management of common health problems seen in older adults across acute care, long-term care, and primary- care settings. Health promotion; illness prevention; case finding; physical, functional, and mental health assessment; decision making; and management ofThis course focuses on the diagnosis and management of common health problems seen in older adults across acute care, long-term care, and primary- care settings. Health promotion; illness prevention; case finding; physical, functional, and mental health assessment; decision making; and management of complex and multisystem health problems are emphasized. The focus is on rehabilitation and maintenance of quality of life. The leadership role of the advanced practice nurse; caseload management; interdisciplinary collaboration; regional and national resources; and consideration of learning needs and ethical concerns relative to working with debilitated clients, family, and staff are addressed.\n\n      less description for NURSE-GN 2028 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2029",
            "course_name": "",
            "description": "NURSE-GN 2029\n\n   Adv Prac Nurs:Geriatrics Practicum III\n\nThe role of the advanced practice gerontological nurse is applied using selected nursing models in interdisciplinary care of the elderly in a variety of settings. Community and institutional agencies serving ethnically diverse and the underserved elderly are preferentially selected. Interdisciplinary experiences are pursued and collaborative practice is emphasized. Students are expected to provide primary and long-term care, incorporating health promotion and disease prevention. Students are expected to perform comprehensive histories and physical assessments; formulate differential diagnoses ...\n\n      more description for NURSE-GN 2029 »\n\n      \n\n\n\nThe role of the advanced practice gerontological nurse is applied using selected nursing models in interdisciplinary care of the elderly in a variety of settings. Community and institutional agencies serving ethnically diverse and the underserved elderly are preferentially selected. Interdisciplinary experiences are pursued and collaborative practice is emphasized. Students are expected to provide primary and long-term care, incorporating health promotion and disease prevention. Students are expected to perform comprehensive histories and physical assessments; formulate differential diagnoses and plans of care; and manage common acute and chronic health problems in consultation with appropriate providers and to act as a leaderand resource for patients, families, and staff\n\n      less description for NURSE-GN 2029 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2030",
            "course_name": "Geriatric Syndromes",
            "description": "NURSE-GN 2030 Geriatric Syndromes",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2032",
            "course_name": "",
            "description": "NURSE-GN 2032\n\n   Nursing Strategy: Child & Adolescent\n\nThis course examines theoretical concepts, research evidence, and learning models related to growth and developmental patterns experienced by children and adolescents, as well as their application to primary care settings. Interventions by advanced practice nurses that promote optimal health and well-being are applied to commonly encountered issues of growth and development throughout infancy, childhood, and adolescence. Social, political, cultural, and legal-ethical issues that influence growth and development and health care are explored. A clinical component allows the student to apply theo...\n\n      more description for NURSE-GN 2032 »\n\n      \n\n\n\nThis course examines theoretical concepts, research evidence, and learning models related to growth and developmental patterns experienced by children and adolescents, as well as their application to primary care settings. Interventions by advanced practice nurses that promote optimal health and well-being are applied to commonly encountered issues of growth and development throughout infancy, childhood, and adolescence. Social, political, cultural, and legal-ethical issues that influence growth and development and health care are explored. A clinical component allows the student to apply theoretical foundations inclinical settings.\n\n      less description for NURSE-GN 2032 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2036",
            "course_name": "",
            "description": "NURSE-GN 2036\n\n   Health Promotion across the Adult-Older Adult Lifespan\n\nThis course provides an introduction to theoretical, developmental, and clinical issues relevant to advanced nursing practice in the care of adults and older adults.  It is designed to enable students to develop the necessary knowledge base and skills for evidence-based practice as advanced practice nurses.  Social, political, cultural, and ethical issues that influence access and utilization of health care are explored and health belief models are incorporated. Health promotion and disease prevention concepts and strategies will be emphasized.  Family theory aThis course provides an introduct...\n\n      more description for NURSE-GN 2036 »\n\n      \n\n\n\nThis course provides an introduction to theoretical, developmental, and clinical issues relevant to advanced nursing practice in the care of adults and older adults.  It is designed to enable students to develop the necessary knowledge base and skills for evidence-based practice as advanced practice nurses.  Social, political, cultural, and ethical issues that influence access and utilization of health care are explored and health belief models are incorporated. Health promotion and disease prevention concepts and strategies will be emphasized.  Family theory aThis course provides an introduction to theoretical, developmental, and clinical issues relevant to advanced nursing practice in the care of adults and older adults.  It is designed to enable students to develop the necessary knowledge base and skills for evidence-based practice as advanced practice nurses.  Social, political, cultural, and ethical issues that influence access and utilization of health care are explored and health belief models are incorporated. Health promotion and disease prevention concepts and strategies will be emphasized.  Family theory and adult development within the context of cultural diversity will also be addressed.\n\n      less description for NURSE-GN 2036 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2037",
            "course_name": "Common Health Problems of Adults and Older Adults & Seminar",
            "description": "NURSE-GN 2037 Common Health Problems of Adults and Older Adults & Seminar \nThis course is designed to enable students to develop the necessary knowledge base and problem-solving skills for practice as nurse practitioners.  Course content will focus on the methodologies used to diagnose and treat common health problems and the educational and counseling components of care.  Students are expected to critically appraise current research concerning diverse populations of adults and older adults to form the basis of assessment, intervention, and evaluation.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2038",
            "course_name": "",
            "description": "NURSE-GN 2038\n\n   Adv Pract Nurs: Mental Hlth/Subst Abuse Nurs I\n\nIn this advanced practice course, nurses from selected specialties (psych-mental health and primary care) explore attitudes about mental health, including substance use with a focus on nicotine addiction, and begin the study of mental health across the life span of targeted populations. Community and care delivery systems are analyzed for capacities to meet the needs of diverse and vulnerable groups for promotion of mental health, crisis intervention, and prevention of substance-related and psychiatric disorders. Theoretical models and research evidence are evaluated for use in practice. Stude...\n\n      more description for NURSE-GN 2038 »\n\n      \n\n\n\nIn this advanced practice course, nurses from selected specialties (psych-mental health and primary care) explore attitudes about mental health, including substance use with a focus on nicotine addiction, and begin the study of mental health across the life span of targeted populations. Community and care delivery systems are analyzed for capacities to meet the needs of diverse and vulnerable groups for promotion of mental health, crisis intervention, and prevention of substance-related and psychiatric disorders. Theoretical models and research evidence are evaluated for use in practice. Students learn nursing and interdisciplinary frameworks for culturally competent assessment and early intervention. Treatment models for prevention, brief interventions, psycho-education, and counseling are explored for their efficacy and cultural relevance for consumers of diverse backgrounds.\n\n      less description for NURSE-GN 2038 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2039",
            "course_name": "Common Health Problems Across the Adult Lifespan",
            "description": "NURSE-GN 2039 Common Health Problems Across the Adult Lifespan",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2041",
            "course_name": "Nursing Issues & Trends in Hlth Care Deliv Sys",
            "description": "NURSE-GN 2041 Nursing Issues & Trends in Hlth Care Deliv Sys \nThis course analyzes health care system issues and trends, such as capitation, managed care and health care reimbursement, from historical, political and developmental perspectives.  Factors that influence nursing practice will be analyzed, such as the corporatization of health care, and conflicts between economic and clinical priorities.  Strategies and mechanisms that enhance the delivery of high quality nursing care will be discussed.  The course will focus on these matters as they affect the scope, preparation and practice of advanced practice nurses and nurse-midwives.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2042",
            "course_name": "Nursing Informatics & Outcome Management",
            "description": "NURSE-GN 2042 Nursing Informatics & Outcome Management",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2043",
            "course_name": "Leadership Training: Nurse Manager",
            "description": "NURSE-GN 2043 Leadership Training: Nurse Manager",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2045",
            "course_name": "Hiv/Aids Pandemic:Strat for The Prom of Wellness",
            "description": "NURSE-GN 2045 Hiv/Aids Pandemic:Strat for The Prom of Wellness \nThe course provides a knowledge base for the nursing care of people in relation to HIV transmission and infection. Prevention and policy issues are analyzed as well as the response of nursing and health-related organizations. The care of people who are HIV positive and the process to assist them in promoting wellness are emphasized. The nursing needs of HIV-positive clients and those at risk are considered in the context of cultural, gender, and development issues.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2058",
            "course_name": "Theory of Nsg & Soc SCI",
            "description": "NURSE-GN 2058 Theory of Nsg & Soc SCI \nThis course focuses on nursing as a science and art and the development of knowledge relevant to the discipline.  A wide range of theories and related concepts from nursing and the social sciences are critically appraised. Nursing and social science theories will be integrated and applied within the context of Advanced Professional Practice to promote evidence-based, comprehensive, high quality health care.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2059",
            "course_name": "Patterns of Inq in Nsg",
            "description": "NURSE-GN 2059 Patterns of Inq in Nsg",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2060",
            "course_name": "Mental Health Across the Lifespan",
            "description": "NURSE-GN 2060 Mental Health Across the Lifespan",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2062",
            "course_name": "",
            "description": "NURSE-GN 2062\n\n   Advanced Practice Nursing:  Pediatrics Primary Care and Practicum I\n\nThis course emphasizes the normal patterns of health promotion and health maintenance. Assessment, diagnosis, and management of common pediatric problems are examined in the context of primary care provided to well infants and children. Theoretical concepts, research evidence, and clinical-practice- models-related issues encountered in the primary care of infants and children are examined as well as their application to primary care and advanced practice-nursing interventions. Interventions by advanced practice nurses that promote optimal health and wellbeing are applied to commonly encountere...\n\n      more description for NURSE-GN 2062 »\n\n      \n\n\n\nThis course emphasizes the normal patterns of health promotion and health maintenance. Assessment, diagnosis, and management of common pediatric problems are examined in the context of primary care provided to well infants and children. Theoretical concepts, research evidence, and clinical-practice- models-related issues encountered in the primary care of infants and children are examined as well as their application to primary care and advanced practice-nursing interventions. Interventions by advanced practice nurses that promote optimal health and wellbeing are applied to commonly encountered issues of growth and development throughout infancy, childhood, and adolescence. Social, political, cultural, and legal-ethical issues that influence primary pediatric health care are explored. Emphasis is on mutual clinical decision making using an evidence based, interdisciplinary care model for the well child in primary care settings. This course has a minimum of 145 hours of supervised clinical experiences in ambulatory care settings.\n\n      less description for NURSE-GN 2062 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2063",
            "course_name": "",
            "description": "NURSE-GN 2063\n\n   Pediatric Primary Care Practicum II\n\nThe nursing process and role of the advanced practice nurse is applied in the clinical setting as a framework for managing health care of children and adolescents and their families. Students participate in client care management, including advanced assessment, health promotion, developmental appraisal, disease prevention, and management of common problems using an evidence-based practice model. Case studies integrate the concepts of diagnostic reasoning, the acquisition of advanced practice skills, and appropriate use of technology and research application in the primary care setting. This co...\n\n      more description for NURSE-GN 2063 »\n\n      \n\n\n\nThe nursing process and role of the advanced practice nurse is applied in the clinical setting as a framework for managing health care of children and adolescents and their families. Students participate in client care management, including advanced assessment, health promotion, developmental appraisal, disease prevention, and management of common problems using an evidence-based practice model. Case studies integrate the concepts of diagnostic reasoning, the acquisition of advanced practice skills, and appropriate use of technology and research application in the primary care setting. This course has a minimum of 270 hours of supervised clinical experience in ambulatory care settings.\n\n      less description for NURSE-GN 2063 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2064",
            "course_name": "",
            "description": "NURSE-GN 2064\n\n   Apn:Children and Adolescents III\n\nThis course focuses on the diagnosis and management of episodic and acute health problems of children by the advanced practice in primary care settings. Focus is on applying critical thinking and clinical decision-making competencies to formulate differential diagnoses and develop management plans for children and their families. Students learn the role of clinician, educator, advocate, and interdisciplinary consumer of research to design and analyze therapeutic interventions that are aimed at decreasing health disparities and improving the overall health and well-being of underserved communit...\n\n      more description for NURSE-GN 2064 »\n\n      \n\n\n\nThis course focuses on the diagnosis and management of episodic and acute health problems of children by the advanced practice in primary care settings. Focus is on applying critical thinking and clinical decision-making competencies to formulate differential diagnoses and develop management plans for children and their families. Students learn the role of clinician, educator, advocate, and interdisciplinary consumer of research to design and analyze therapeutic interventions that are aimed at decreasing health disparities and improving the overall health and well-being of underserved communities. Students learn an evidence-based practice model of care to assure children and families the highest quality care, and they learn from an interdisciplinary model of care to promote their best practice model of care. Concepts include health promotion; health education; anticipatory guidance; cultural, legal, and ethical issues; family involvement in the client?s care; and leadership strategies.\n\n      less description for NURSE-GN 2064 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2065",
            "course_name": "",
            "description": "NURSE-GN 2065\n\n   Apn:Children and Adolescents III\n\nThis course focuses on comprehensive primary care of children and families in ambulatory settings. Students synthesize knowledge to develop and evaluate management plans for children with complex and chronic health problems. Combining advanced practice skills in health assessment and diagnosis, students develop treatment plans and facilitate the client?s entry into and utilization of the health care system. Students combine the roles of clinician, educator, advocate, and interdisciplinary consumer of research design, and they implement therapeutic interventions that are aimed at decreasing hea...\n\n      more description for NURSE-GN 2065 »\n\n      \n\n\n\nThis course focuses on comprehensive primary care of children and families in ambulatory settings. Students synthesize knowledge to develop and evaluate management plans for children with complex and chronic health problems. Combining advanced practice skills in health assessment and diagnosis, students develop treatment plans and facilitate the client?s entry into and utilization of the health care system. Students combine the roles of clinician, educator, advocate, and interdisciplinary consumer of research design, and they implement therapeutic interventions that are aimed at decreasing health disparities and improving the overall health and well-being of underserved communities. An evidence-based practice model of care is utilized to decrease health disparities among vulnerable populations and improve their health and wellbeing. The course also emphasizes the leadership role of the advanced practice nurse in the provision of primary care to children.\n\n      less description for NURSE-GN 2065 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2068",
            "course_name": "",
            "description": "NURSE-GN 2068\n\n   Apn: Sub Abuse Client Thry II\n\nIn this final practicum course, the student conducts all aspects of the nurse administrator role in the health care setting. The emphasis is on evaluating nursing administration based on criteria from ANA Scope and Standards for Nurse Administrators, Code of Ethics, and national health care agency accreditation; and the expected administrative nursing practice that advocates for the well-being of nurses, fosters interdisciplinary collaboration and team-building, conducts cost-benefit analysis of strategic initiatives, and addresses consumer health care needs within multicultural and diverse he...\n\n      more description for NURSE-GN 2068 »\n\n      \n\n\n\nIn this final practicum course, the student conducts all aspects of the nurse administrator role in the health care setting. The emphasis is on evaluating nursing administration based on criteria from ANA Scope and Standards for Nurse Administrators, Code of Ethics, and national health care agency accreditation; and the expected administrative nursing practice that advocates for the well-being of nurses, fosters interdisciplinary collaboration and team-building, conducts cost-benefit analysis of strategic initiatives, and addresses consumer health care needs within multicultural and diverse health care environments.\n\n      less description for NURSE-GN 2068 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2069",
            "course_name": "",
            "description": "NURSE-GN 2069\n\n   Apn: Sub Abuse Client Pract II\n\nThis supervised clinical practicum focuses on the care of populations with substance-related disorders and co-occurring psychiatric or medical disorders. Medically underserved, vulnerable, minority, and special populations are targeted for treatment. Clinical sites include social agencies and acute and ambulatory care facilities serving medically underserved, vulnerable, culturally, and ethnically diverse populations. Students apply theories in the assessment and differential diagnosis of substance-related disorders and develop population focused evidence-based, culturally competent interventi...\n\n      more description for NURSE-GN 2069 »\n\n      \n\n\n\nThis supervised clinical practicum focuses on the care of populations with substance-related disorders and co-occurring psychiatric or medical disorders. Medically underserved, vulnerable, minority, and special populations are targeted for treatment. Clinical sites include social agencies and acute and ambulatory care facilities serving medically underserved, vulnerable, culturally, and ethnically diverse populations. Students apply theories in the assessment and differential diagnosis of substance-related disorders and develop population focused evidence-based, culturally competent interventions\n\n      less description for NURSE-GN 2069 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2072",
            "course_name": "",
            "description": "NURSE-GN 2072\n\n   Apn:Mental Hlth Nrsg II\n\nThis course focuses on theories and research related to the etiology, assessment, diagnoses, treatment, and evaluation of client outcomes for diverse individuals experiencing mild to acute psychiatric disorders; emphasis is on mood disorders. The continuum of response from symptom manifestation to illness is explored with a focus on advanced practice assessment, diagnosis, and management, including prescribing and monitoring pharmacotherapy. Aspects of the advanced practice mental health nursing role are demonstrated within a framework of critical thinking, diagnostic reasoning, and clinical j...\n\n      more description for NURSE-GN 2072 »\n\n      \n\n\n\nThis course focuses on theories and research related to the etiology, assessment, diagnoses, treatment, and evaluation of client outcomes for diverse individuals experiencing mild to acute psychiatric disorders; emphasis is on mood disorders. The continuum of response from symptom manifestation to illness is explored with a focus on advanced practice assessment, diagnosis, and management, including prescribing and monitoring pharmacotherapy. Aspects of the advanced practice mental health nursing role are demonstrated within a framework of critical thinking, diagnostic reasoning, and clinical judgment to develop and evaluate comprehensive, interdisciplinary, and evidence- based diagnosis and treatment plans for adults with acute psychiatric disorders.\n\n      less description for NURSE-GN 2072 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2073",
            "course_name": "",
            "description": "NURSE-GN 2073\n\n   Apn:Mental Hlth Nursing Pract II\n\nThis supervised psychiatric nursing practicum focuses on advanced practice nursing care of diverse individuals, families, and groups with mild to acute mental health problems. Clinical sites include social agencies and acute and ambulatory care facilities where students apply theories in the assessment and differential diagnoses of psychiatric and related comorbidities disorders to develop culturally relevant evidence-based interventions. Credentialed preceptors model the advanced practice psychiatric nursing role through direct care, collaboration, and consultation. Faculty, preceptor, peer, ...\n\n      more description for NURSE-GN 2073 »\n\n      \n\n\n\nThis supervised psychiatric nursing practicum focuses on advanced practice nursing care of diverse individuals, families, and groups with mild to acute mental health problems. Clinical sites include social agencies and acute and ambulatory care facilities where students apply theories in the assessment and differential diagnoses of psychiatric and related comorbidities disorders to develop culturally relevant evidence-based interventions. Credentialed preceptors model the advanced practice psychiatric nursing role through direct care, collaboration, and consultation. Faculty, preceptor, peer, and tutorial reviews promote critical thinking and explore ethical issues in the development of clinical judgment.\n\n      less description for NURSE-GN 2073 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2074",
            "course_name": "Apn: Mental Health III",
            "description": "NURSE-GN 2074 Apn: Mental Health III \nThis course focuses on theories and research evidence related to the management of serious and persistent psychiatric and co-occurring disorders. Advanced practice nursing roles in the management of chronic conditions such as HIVAIDS, alcoholism, and drug dependence and geropsychiatric and psychophysiologic disorders are operationalized. Advanced practice roles of direct care provider, case manager, liaison-consultant, and interdisciplinary team member are explored in depth.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2075",
            "course_name": "",
            "description": "NURSE-GN 2075\n\n   Apn Mental Health Practicum III\n\nStudents develop advanced practice psychiatric mental health clinical competencies related to the nurse practitioner role. The clinical practicum focuses on assessment, diagnosis, and management of individuals experiencing serious and persistent psychiatric disorders and co-occurring conditions such as HIV-spectrum illness, substance abuse, and geropsychiatric disorders. Clinical competency is demonstrated in comprehensive primary mental health assessments; differential diagnoses for selected DSM-IV TR disorders; advanced practice nursing diagnoses for those individuals experiencing chronic, c...\n\n      more description for NURSE-GN 2075 »\n\n      \n\n\n\nStudents develop advanced practice psychiatric mental health clinical competencies related to the nurse practitioner role. The clinical practicum focuses on assessment, diagnosis, and management of individuals experiencing serious and persistent psychiatric disorders and co-occurring conditions such as HIV-spectrum illness, substance abuse, and geropsychiatric disorders. Clinical competency is demonstrated in comprehensive primary mental health assessments; differential diagnoses for selected DSM-IV TR disorders; advanced practice nursing diagnoses for those individuals experiencing chronic, complex, mental health problems; and developing and implementing treatment/management plans for identified populations. Students refine their leadership roles related to clinical competencies in case management, psychopharmacology, and individual and group psychotherapy, and they identify and explore a recovery model of long-term care for a target population.\n\n      less description for NURSE-GN 2075 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2080",
            "course_name": "Contemporary Practice Roles:Anp/Hpn",
            "description": "NURSE-GN 2080 Contemporary Practice Roles:Anp/Hpn",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2081",
            "course_name": "Home Health Care:Financ & Financial Management",
            "description": "NURSE-GN 2081 Home Health Care:Financ & Financial Management \nThe financing of home health care services such as nursing, occupational therapy, physical therapy, social work, and nonprofessional services is analyzed. Concepts such as insurance, reimbursement, and the government impact on financing home health care are discussed. The financial management of home health care organizations is analyzed. Financial management includes topics such as budgeting, budget variance, and assessing the cost of providing care.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2082",
            "course_name": "",
            "description": "NURSE-GN 2082\n\n   Managing Quality Outcome in Home Care\n\nPrerequisites: E10.1086 or E10.1995 and N41.2303 or their equivalent. Corequisite: N41.2081 or by permission of instructor.Introduction of advanced practice nurses to the concepts, issues, strategies, and analytic methods of measuring quality outcomes and their application to the delivery of home care services. The course is based on the principles of continuing quality improvement and provides students an opportunity to practice skills and use tools related to those principles. Students practice team-building skills through participation in a group project addressing a quality outcome problem...\n\n      more description for NURSE-GN 2082 »\n\n      \n\n\n\nPrerequisites: E10.1086 or E10.1995 and N41.2303 or their equivalent. Corequisite: N41.2081 or by permission of instructor.Introduction of advanced practice nurses to the concepts, issues, strategies, and analytic methods of measuring quality outcomes and their application to the delivery of home care services. The course is based on the principles of continuing quality improvement and provides students an opportunity to practice skills and use tools related to those principles. Students practice team-building skills through participation in a group project addressing a quality outcome problem related to advanced practice.\n\n      less description for NURSE-GN 2082 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2083",
            "course_name": "Adv Pract Nursing: Home Health Nursing",
            "description": "NURSE-GN 2083 Adv Pract Nursing: Home Health Nursing \nExamination of theoretical approaches and strategies that promote clinical effectiveness of the advanced practice nurse for the delivery of home health care services to culturally diverse and underserved individuals, families, and groups. The leadership role of the advanced practice home health care nurse as an expert direct-care provider, case manager, educator, researcher, and consultant is analyzed and developed.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2084",
            "course_name": "",
            "description": "NURSE-GN 2084\n\n   Adv Practicum Nursing: Home Health Nurs Pract\n\nPrerequisites: N41.2081, N41.2082; health examination and clearance; and New York State R.N. licensure. Corequisite: N41.2083.Delivery of comprehensive home health care services to culturally diverse and underserved individuals, families, and groups. Synthesis of knowledge about primary care, specialty care, and advanced practice home health nursing to develop and evaluate management plans for clients with complex, acute, and chronic health problems. Students combine advanced practice skills in assessment and diagnosis to develop treatment plans that promote optimal functional status and quali...\n\n      more description for NURSE-GN 2084 »\n\n      \n\n\n\nPrerequisites: N41.2081, N41.2082; health examination and clearance; and New York State R.N. licensure. Corequisite: N41.2083.Delivery of comprehensive home health care services to culturally diverse and underserved individuals, families, and groups. Synthesis of knowledge about primary care, specialty care, and advanced practice home health nursing to develop and evaluate management plans for clients with complex, acute, and chronic health problems. Students combine advanced practice skills in assessment and diagnosis to develop treatment plans that promote optimal functional status and quality of life. The leadership role of the advanced practice home health nurse is developed.\n\n      less description for NURSE-GN 2084 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2085",
            "course_name": "Human & Environmental Matrices Basic to Nrsg",
            "description": "NURSE-GN 2085 Human & Environmental Matrices Basic to Nrsg",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2086",
            "course_name": "Nurs Strategies:Holistic Primary Care of Adults",
            "description": "NURSE-GN 2086 Nurs Strategies:Holistic Primary Care of Adults",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2087",
            "course_name": "Apn:Adult/Holistic Primary Care I",
            "description": "NURSE-GN 2087 Apn:Adult/Holistic Primary Care I",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2088",
            "course_name": "Apn:Adult/Holistic Primary Care II",
            "description": "NURSE-GN 2088 Apn:Adult/Holistic Primary Care II",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2089",
            "course_name": "Apn:Adult/Holistic Primary Care Pract II",
            "description": "NURSE-GN 2089 Apn:Adult/Holistic Primary Care Pract II",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2090",
            "course_name": "Apn:Adult Holistic Primary Care III",
            "description": "NURSE-GN 2090 Apn:Adult Holistic Primary Care III",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2091",
            "course_name": "",
            "description": "NURSE-GN 2091\n\n   Assessment of Children With Special Need\n\nPrerequisites: N41.2024 or equivalent, N41.2032 or equivalent, health examination and clearance, and New York State R.N. licensure. Corequisite: N41.2063.The advanced practice nursing (APN) student is provided with the opportunity to expand and apply advanced health assessment skills (history taking, physical assessment, and development assessment) to children with special needs (CSN). Selected nursing and other models are used in the collection of an expanded clinical database specific to the early identification of children ?at risk? and those with special health care needs. Collaboration wi...\n\n      more description for NURSE-GN 2091 »\n\n      \n\n\n\nPrerequisites: N41.2024 or equivalent, N41.2032 or equivalent, health examination and clearance, and New York State R.N. licensure. Corequisite: N41.2063.The advanced practice nursing (APN) student is provided with the opportunity to expand and apply advanced health assessment skills (history taking, physical assessment, and development assessment) to children with special needs (CSN). Selected nursing and other models are used in the collection of an expanded clinical database specific to the early identification of children ?at risk? and those with special health care needs. Collaboration with other health team members and appropriate referrals are discussed.\n\n      less description for NURSE-GN 2091 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2092",
            "course_name": "",
            "description": "NURSE-GN 2092\n\n   Legal & Ethical Issues/ The Child/Special Needs\n\nLegal and ethical parameters of advanced practice nursing and care of children with disabilities are discussed and explored. The advanced practice nurse?s professional relationship with children and families, other health care professionals, employers, and professional organizations are examined from a legal and ethical perspective. Issues related to children with disabilities are examined and discussed related to promotion of quality of life, informed consent, confidentiality, truthfulness in the advanced practice nurse-patient relationship, and requests for treatment. Parental refusals of ca...\n\n      more description for NURSE-GN 2092 »\n\n      \n\n\n\nLegal and ethical parameters of advanced practice nursing and care of children with disabilities are discussed and explored. The advanced practice nurse?s professional relationship with children and families, other health care professionals, employers, and professional organizations are examined from a legal and ethical perspective. Issues related to children with disabilities are examined and discussed related to promotion of quality of life, informed consent, confidentiality, truthfulness in the advanced practice nurse-patient relationship, and requests for treatment. Parental refusals of care and reproduction issues are examined. Emphasis is placed on the rights of children and families with children with special needs.\n\n      less description for NURSE-GN 2092 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2093",
            "course_name": "",
            "description": "NURSE-GN 2093\n\n   Primary Hlth Care of The Child With Special Needs\n\nPrerequisites: N41.2062, N41.2063 or equivalent, N41.2091; health examination and clearance; and New York State R.N. licensure. Corequisites: N41.2063 or equivalent and N41.2091. Patterns of health promotion, health maintenance, and management of common pediatric problems and evidence-based practice in a child with special needs (CSN) are examined in the context of family and community systems. Primary care management, interdisciplinary collaboration, decision making, legislation, identification, and utilization of community resources to promote optimal development are emphasized. Issues of cu...\n\n      more description for NURSE-GN 2093 »\n\n      \n\n\n\nPrerequisites: N41.2062, N41.2063 or equivalent, N41.2091; health examination and clearance; and New York State R.N. licensure. Corequisites: N41.2063 or equivalent and N41.2091. Patterns of health promotion, health maintenance, and management of common pediatric problems and evidence-based practice in a child with special needs (CSN) are examined in the context of family and community systems. Primary care management, interdisciplinary collaboration, decision making, legislation, identification, and utilization of community resources to promote optimal development are emphasized. Issues of cultural diversity and their impact in relation to health maintenance and promotion with children and families with special needs are explored. The role of the APN as clinician, case manager, teacher, advocate, and leader are stressed.\n\n      less description for NURSE-GN 2093 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2094",
            "course_name": "",
            "description": "NURSE-GN 2094\n\n   Acute & Chronic Illness The Child/Spec Needs\n\nPrerequisites: N41.2093, health examination and clearance, and New York State R.N. licensure. Corequisites: N41.2064 or equivalent and N41.2065 or equivalent.Integration of concepts of common acute and chronic illnesses specific to children with disabilities. There is a continued expansion of theoretical frameworks for caring for children with special needs (CSN) and their families. Emphasis is on the role of the APN as a team member providing interdisciplinary care and engaging in clinical decision making about the acutely and chronically ill child with special needs and his or her family. Is...\n\n      more description for NURSE-GN 2094 »\n\n      \n\n\n\nPrerequisites: N41.2093, health examination and clearance, and New York State R.N. licensure. Corequisites: N41.2064 or equivalent and N41.2065 or equivalent.Integration of concepts of common acute and chronic illnesses specific to children with disabilities. There is a continued expansion of theoretical frameworks for caring for children with special needs (CSN) and their families. Emphasis is on the role of the APN as a team member providing interdisciplinary care and engaging in clinical decision making about the acutely and chronically ill child with special needs and his or her family. Issues of cultural diversity and their impact in the care of the child with disabilities are addressed.\n\n      less description for NURSE-GN 2094 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2095",
            "course_name": "Rsch Project: Terminal a Project Child/Spec Needs",
            "description": "NURSE-GN 2095 Rsch Project: Terminal a Project Child/Spec Needs \nPre- or corequisite: N41.2303 or equivalent. Capstone seminar for master?s and advanced certificate students enrolled in the children with special needs concentration. This course expands students? understanding of the research process and its application to interdisciplinary and outcome-based studies as they apply to the primary care needs of children with special needs.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2096",
            "course_name": "Adult/Holistic Primary Care Practicum III",
            "description": "NURSE-GN 2096 Adult/Holistic Primary Care Practicum III",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2097",
            "course_name": "Introduction to Palliative Care",
            "description": "NURSE-GN 2097 Introduction to Palliative Care",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2098",
            "course_name": "Adv Pall Care Theory",
            "description": "NURSE-GN 2098 Adv Pall Care Theory",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2099",
            "course_name": "Pall Care Adv Practicum",
            "description": "NURSE-GN 2099 Pall Care Adv Practicum",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2103",
            "course_name": "Practicum:Teaching in Nursing",
            "description": "NURSE-GN 2103 Practicum:Teaching in Nursing",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2105",
            "course_name": "Leadership for Adv Professional Practice",
            "description": "NURSE-GN 2105 Leadership for Adv Professional Practice \nThis course will focus on the role of the Advanced Practice Nurse as a system leader and change agent. Didactic and experiential course content will incorporate current theories of management, leadership and organizational change. The class will also discuss how advanced nursing knowledge and evidence shapes and informs the Advanced Practice Nurse's management and leadership practice.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2111",
            "course_name": "",
            "description": "NURSE-GN 2111\n\n   Palliative Care I:Loss, Grief,Death/Bereavement\n\nThis course assists students in addressing the personal, professional, societal, cultural, spiritual, and ethical/legal issues related to the care of patients and families experiencing progressive, lifethreatening illness and death. Theoretical perspectives related to palliative care are explored with a focus on evidenced-based interventions to promote quality of life and quality of dying for patients and families across the illness/dying trajectory. The role of the advanced practice nurse (APN) and interdisciplinary collaboration are discussed, as well as the APN?s role in influencing health ...\n\n      more description for NURSE-GN 2111 »\n\n      \n\n\n\nThis course assists students in addressing the personal, professional, societal, cultural, spiritual, and ethical/legal issues related to the care of patients and families experiencing progressive, lifethreatening illness and death. Theoretical perspectives related to palliative care are explored with a focus on evidenced-based interventions to promote quality of life and quality of dying for patients and families across the illness/dying trajectory. The role of the advanced practice nurse (APN) and interdisciplinary collaboration are discussed, as well as the APN?s role in influencing health care policies to decrease health disparities in palliative care. Assessment and interventions related to loss, grief, death, and bereavement throughout the life cycle are discussed within the context of theoretical and empirical literature.\n\n      less description for NURSE-GN 2111 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2112",
            "course_name": "",
            "description": "NURSE-GN 2112\n\n   Palliative Care II:Mgmnt of Pain and Suffering\n\nThis course focuses on improving the quality of life and quality of dying for individuals and families experiencing life-limiting, advanced illness through comprehensive assessment, diagnosis, and planning and implementation of evidence-based pharmacologic, nonpharmacologic, and complementary therapies to relieve pain and suffering, as well as evaluating the outcomes of such care. Theoretical bases related to the assessment and management of pain and suffering are considered with an emphasis on comprehensive care of patients with HIV/AIDS, dementia, and other neurodegenerative diseases. Barrie...\n\n      more description for NURSE-GN 2112 »\n\n      \n\n\n\nThis course focuses on improving the quality of life and quality of dying for individuals and families experiencing life-limiting, advanced illness through comprehensive assessment, diagnosis, and planning and implementation of evidence-based pharmacologic, nonpharmacologic, and complementary therapies to relieve pain and suffering, as well as evaluating the outcomes of such care. Theoretical bases related to the assessment and management of pain and suffering are considered with an emphasis on comprehensive care of patients with HIV/AIDS, dementia, and other neurodegenerative diseases. Barriers to effective palliative care, specifically pain management and related health care policy development, are discussed, including strategies to overcome barriers. Quality palliative care is considered within the context of patient, family and the interdisciplinary palliative care team in acute community, hospice, and home care settings. The role of advanced practice nurses in advocating for and promoting patients? rights for quality care, specifically the relief of pain and suffering, is explored.\n\n      less description for NURSE-GN 2112 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2113",
            "course_name": "",
            "description": "NURSE-GN 2113\n\n   Palliative Care Pract II End of Life Care\n\nThis course prepares students to assume the role of an advanced practice nurse in providing comprehensive, humanistic care to patients and families experiencing serious and eventually fatal disease (e.g., cancer, AIDS, and end-stage organ diseases). Based on the knowledge of theory and evidence-based interventions, students alleviate pain and suffering and improve the quality of life and dying for culturally diverse patients and family across health care settings. Students analyze ethical issues in palliative care, collaborate with interdisciplinary colleagues, and demonstrate effective commun...\n\n      more description for NURSE-GN 2113 »\n\n      \n\n\n\nThis course prepares students to assume the role of an advanced practice nurse in providing comprehensive, humanistic care to patients and families experiencing serious and eventually fatal disease (e.g., cancer, AIDS, and end-stage organ diseases). Based on the knowledge of theory and evidence-based interventions, students alleviate pain and suffering and improve the quality of life and dying for culturally diverse patients and family across health care settings. Students analyze ethical issues in palliative care, collaborate with interdisciplinary colleagues, and demonstrate effective communication skills, as well as effectively educate patients, families, and colleagues regarding palliative care issues, including pain management.\n\n      less description for NURSE-GN 2113 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2114",
            "course_name": "",
            "description": "NURSE-GN 2114\n\n   Pallia Care III:Symptom Mgmnt Nurs Leadership\n\nThis course assists students in developing advanced knowledge and skills to assess and manage advanced diseases and alleviate complex symptoms and needs of patients and families (e.g., those with cancer, AIDS, end-stageorgan diseases). Students analyze the impact of such illness on family, community, and health care systems, including the availability of resources and barriers to resources. A focus is on the leadership role of nurses in palliative care as it relates to symptom management, including the analysis and development of health care policies, protocols, standards of care, health care ...\n\n      more description for NURSE-GN 2114 »\n\n      \n\n\n\nThis course assists students in developing advanced knowledge and skills to assess and manage advanced diseases and alleviate complex symptoms and needs of patients and families (e.g., those with cancer, AIDS, end-stageorgan diseases). Students analyze the impact of such illness on family, community, and health care systems, including the availability of resources and barriers to resources. A focus is on the leadership role of nurses in palliative care as it relates to symptom management, including the analysis and development of health care policies, protocols, standards of care, health care resources, and research utilization. Students critique clinical and research literature and available electronic information to support evidence based practice.\n\n      less description for NURSE-GN 2114 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2115",
            "course_name": "Palliative Care Prct III Ldrship in Palliat Care",
            "description": "NURSE-GN 2115 Palliative Care Prct III Ldrship in Palliat Care \nThis course prepares students to utilize advanced clinical knowledge and skill in addressing the complex physical, psychological, ethical, social, cultural, spiritual, and grief issues and needs experienced by patients and families with advanced disease and symptoms across diverse health care settings. An additional focus is the leadership role of nurses in palliative care, including roles in practice, education, and research, influencing health care policy and advancing development of the specialty.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2116",
            "course_name": "",
            "description": "NURSE-GN 2116\n\n   Apn: Adult-Gerontology Acute Care II\n\nThis course builds on previous theoretical and clinical knowledge to prepare the student in the diagnosis and management of culturally diverse patients with a variety of acute, chronic, and critical illnesses. Diagnostic reasoning, differential diagnosis, and diagnosis are emphasized as the students analyze patients with complex health problems. The student assesses clinical data along with leadership, and communication and change theories, students analyze a health care organization and then create and formally present the consultant?s summary of findings and strategic interdisciplinary recom...\n\n      more description for NURSE-GN 2116 »\n\n      \n\n\n\nThis course builds on previous theoretical and clinical knowledge to prepare the student in the diagnosis and management of culturally diverse patients with a variety of acute, chronic, and critical illnesses. Diagnostic reasoning, differential diagnosis, and diagnosis are emphasized as the students analyze patients with complex health problems. The student assesses clinical data along with leadership, and communication and change theories, students analyze a health care organization and then create and formally present the consultant?s summary of findings and strategic interdisciplinary recommendations.\n\n      less description for NURSE-GN 2116 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2117",
            "course_name": "",
            "description": "NURSE-GN 2117\n\n   APN: Adult-Gerontology Acute Care Practicum II\n\nThis course focuses on evaluation, diagnosis, and management of culturally diverse patients with an acute, critical, and/or chronic illness. The student assesses patients by performing a history and physical, incorporating knowledge of advanced pathophysiologic concepts along with clinical data to formulate differential diagnoses. Management of patient data including ordering, performing, and interpretation of a variety of diagnostic tests is emphasized. Students synthesize both clinical and diagnostic data to search for the best available evidence on which to base treatment choices and develo...\n\n      more description for NURSE-GN 2117 »\n\n      \n\n\n\nThis course focuses on evaluation, diagnosis, and management of culturally diverse patients with an acute, critical, and/or chronic illness. The student assesses patients by performing a history and physical, incorporating knowledge of advanced pathophysiologic concepts along with clinical data to formulate differential diagnoses. Management of patient data including ordering, performing, and interpretation of a variety of diagnostic tests is emphasized. Students synthesize both clinical and diagnostic data to search for the best available evidence on which to base treatment choices and develop evidence-based treatment plans in conjunction with the interdisciplinary team.\n\n      less description for NURSE-GN 2117 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2118",
            "course_name": "",
            "description": "NURSE-GN 2118\n\n   APN: Adult-Gerontology Acute Care III\n\nUtilizing a holistic, nursing, and evidence-based framework and incorporating a health disparities model, the course builds on prior clinical and theoretical courses to enable the acute care advanced practice nurse to analyze complex health problems of diverse patients who present to the acute care setting as well as home, rehabilitative and ambulatory care settings. Acute care nurse practitioner students engage in the comprehensive management of patients with a variety of complex critical illnesses and/or chronic disease. Students develop and refine hypothetic deductive reasoning and knowledg...\n\n      more description for NURSE-GN 2118 »\n\n      \n\n\n\nUtilizing a holistic, nursing, and evidence-based framework and incorporating a health disparities model, the course builds on prior clinical and theoretical courses to enable the acute care advanced practice nurse to analyze complex health problems of diverse patients who present to the acute care setting as well as home, rehabilitative and ambulatory care settings. Acute care nurse practitioner students engage in the comprehensive management of patients with a variety of complex critical illnesses and/or chronic disease. Students develop and refine hypothetic deductive reasoning and knowledge of advanced Pathophysiology to plan, monitor, and implement therapeutic interventions for a variety of acute and chronic conditions. Selection of the best nursing and medical interventions emphasizes a thorough review of the literature, incorporating advanced search strategies, analysis of methodologies, and critical appraisal of the literature. Research, patient preferences, and nursing experience are integrated in clinical decision making, management, and evaluation of patient-focused clinical outcomes.\n\n      less description for NURSE-GN 2118 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2119",
            "course_name": "",
            "description": "NURSE-GN 2119\n\n   APN: Adult-Gerontology Acute Care Practicum III\n\nStudents incorporate nursing, medical, and psychosocial concepts into assessment, diagnostic evaluation, treatment, and management of culturally diverse patient populations with acute, critical, and/or chronic illnesses. Students refine their diagnostic reasoning skills and diagnostic evaluation abilities. Utilizing principles of evidence based practice; students formulate a treatment plan that reflects the best evidence, individual patient preferences, and clinical judgment to promote achievement of clinical outcomes. As students complete this last clinical course, an emphasis is placed on th...\n\n      more description for NURSE-GN 2119 »\n\n      \n\n\n\nStudents incorporate nursing, medical, and psychosocial concepts into assessment, diagnostic evaluation, treatment, and management of culturally diverse patient populations with acute, critical, and/or chronic illnesses. Students refine their diagnostic reasoning skills and diagnostic evaluation abilities. Utilizing principles of evidence based practice; students formulate a treatment plan that reflects the best evidence, individual patient preferences, and clinical judgment to promote achievement of clinical outcomes. As students complete this last clinical course, an emphasis is placed on the comprehensive management of a variety of complex and concomitant health problems, both acute and chronic. The leadership role of the acute care nurse practitioner is fostered along with best treatStudents incorporate nursing, medical, and psychosocial concepts into assessment, diagnostic evaluation, treatment, and management of culturally diverse patient populations with acute, critical, and/or chronic illnesses. Students refine their diagnostic reasoning skills and diagnostic evaluation abilities. Utilizing principles of evidence based practice; students formulate a treatment plan that reflects the best evidence, individual patient preferences, and clinical judgment to promote achievement of clinical outcomes. As students complete this last clinical course, an emphasis is placed on the comprehensive management of a variety of complex and concomitant health problems, both acute and chronic. The leadership role of the acute care nurse practitioner is fostered along with best treatment practices in collaboration and conjunction with the interdisciplinary team.\n\n      less description for NURSE-GN 2119 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2121",
            "course_name": "Consulting Role for Nurse Mgr & Executive",
            "description": "NURSE-GN 2121 Consulting Role for Nurse Mgr & Executive \nThis course examines evidence based research that impacts health organizations and the role of the nurse consultant as a change agent in multicultural and diverse health care settings. Employing concepts from organizational behavior, legal and ethical frameworks, systems, leadership, and communication and change theories, students analyze a health care organization and then create and formally present the consultant?s summary of findings and strategic interdisciplinary recommendations",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2122",
            "course_name": "Nursing Administration Theory II",
            "description": "NURSE-GN 2122 Nursing Administration Theory II \nThis course examines the impact of health care legislation, policy, economics, financing, and reimbursement structures on the role of the nurse administrator. Employing principles of organizational behavior, leadership, change, communication, and cultural competence, students analyze finance and reimbursement models, financial reports, management processes, budgeting, and the strategic planning process in diverse and multicultural health care settings.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2130",
            "course_name": "",
            "description": "NURSE-GN 2130\n\n   Midwifery Management & Pracaticum I\n\nThis course introduces the student to the discipline and practice of midwifery beginning with the acquisition of essential history taking and physical examination knowledge and skills and applying them to the broad topic of women?s health. The midwifery management process is presented, and students master the integration of assessment, diagnosis, management, intervention, evaluation, collaboration, and referral components in the provision of culturally competent, evidenced-based practice. Female life-cycle events that are both normal life functions as well as common gynecological diseases are ...\n\n      more description for NURSE-GN 2130 »\n\n      \n\n\n\nThis course introduces the student to the discipline and practice of midwifery beginning with the acquisition of essential history taking and physical examination knowledge and skills and applying them to the broad topic of women?s health. The midwifery management process is presented, and students master the integration of assessment, diagnosis, management, intervention, evaluation, collaboration, and referral components in the provision of culturally competent, evidenced-based practice. Female life-cycle events that are both normal life functions as well as common gynecological diseases are presented. Clinical experience includes consideration of the health needs of women from culturally diverse populations in a variety of clinical settings.\n\n      less description for NURSE-GN 2130 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2131",
            "course_name": "",
            "description": "NURSE-GN 2131\n\n   Prof Issues & Role Dev in Nurse Midwifery\n\nThis course explores the current state of both women?s health care and midwifery. Critical concepts include ?power? and ?empowerment? of both women and midwives to influence women?s health care; the development of strategies to exercise these critical concepts to reduce health disparities; and the application of crucial cultural competence knowledge and skills. The multiple roles of midwives are explored, including those of provider, collaborator, consultant, educator, administrator, researcher, and advocate. Legal and ethical dimensions of professional midwifery are discussed. In addition, po...\n\n      more description for NURSE-GN 2131 »\n\n      \n\n\n\nThis course explores the current state of both women?s health care and midwifery. Critical concepts include ?power? and ?empowerment? of both women and midwives to influence women?s health care; the development of strategies to exercise these critical concepts to reduce health disparities; and the application of crucial cultural competence knowledge and skills. The multiple roles of midwives are explored, including those of provider, collaborator, consultant, educator, administrator, researcher, and advocate. Legal and ethical dimensions of professional midwifery are discussed. In addition, policy, politics, and health care financing for midwifery practice are investigated and critiqued.\n\n      less description for NURSE-GN 2131 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2132",
            "course_name": "",
            "description": "NURSE-GN 2132\n\n   Midwife Mgmt Pract II\n\nThis course prepares the student to provide comprehensive midwifery care to normal pregnant women. Using the midwifery model of care, the student accesses and integrates several disciplines, including nursing, midwifery, and obstetrics in order to provide comprehensive, evidence-based, culturally competent, and family-centered maternity care. The focus is on pregnancy as a normal process, which is enhanced through midwifery care. Emphasis is placed on empowering women, a strategy that helps reduce health disparities through partnership in antepartum care. The evaluation of normal processes, sc...\n\n      more description for NURSE-GN 2132 »\n\n      \n\n\n\nThis course prepares the student to provide comprehensive midwifery care to normal pregnant women. Using the midwifery model of care, the student accesses and integrates several disciplines, including nursing, midwifery, and obstetrics in order to provide comprehensive, evidence-based, culturally competent, and family-centered maternity care. The focus is on pregnancy as a normal process, which is enhanced through midwifery care. Emphasis is placed on empowering women, a strategy that helps reduce health disparities through partnership in antepartum care. The evaluation of normal processes, screening for deviations from the normal, as well as providing anticipatory guidance and emotional support to the mother and family are hallmarks of midwifery care. Clinical practice is in antepartum settings in midwifery practices.\n\n      less description for NURSE-GN 2132 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2133",
            "course_name": "Primary Care of Women",
            "description": "NURSE-GN 2133 Primary Care of Women \nBuilding on the strategies presented in the core courses, advanced physical assessment, pathophysiology, and pharmacotherapeutics, this course extends midwifery skills to provide primary care to women, This includes health promotion and disease prevention within the context of culture and family as well as the screening, diagnosis, and management of common acute and episodic illnesses and the exacerbation of chronic disease within the context of evidence-based practice.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2134",
            "course_name": "",
            "description": "NURSE-GN 2134\n\n   Midwife Management Practicum III\n\n?Every family has a right to a safe, satisfying childbirth experience, with respect for cultural variations, human dignity, and the rights as consumers to freedom of choice and self determination? (American College of Nurse- Midwives, 1980). Culturally competent midwifery care during the birth and postpartum periods appropriately takes place in a variety of settings, including birth centers, homes, and hospitals. This course focuses on the care and management of the mother and baby through normal labor, delivery, and postpartum, elaborated through evidence-based practice (EBP). It provides the...\n\n      more description for NURSE-GN 2134 »\n\n      \n\n\n\n?Every family has a right to a safe, satisfying childbirth experience, with respect for cultural variations, human dignity, and the rights as consumers to freedom of choice and self determination? (American College of Nurse- Midwives, 1980). Culturally competent midwifery care during the birth and postpartum periods appropriately takes place in a variety of settings, including birth centers, homes, and hospitals. This course focuses on the care and management of the mother and baby through normal labor, delivery, and postpartum, elaborated through evidence-based practice (EBP). It provides the knowledge and skills to manage alterations and changes at any point during the process, including those of the newborn in the first hours and months of life.\n\n      less description for NURSE-GN 2134 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2135",
            "course_name": "",
            "description": "NURSE-GN 2135\n\n   Midwife Management Practicum IV\n\nThis is the final clinical course of the midwifery program. Students have the challenge and opportunity to integrate knowledge and clinical skills learned separately during the previous basic courses. They do this in a practice setting that encompasses the full scope of midwifery practice. This course also provides the opportunity to assure the acquisition of all core competencies, with emphasis on cultural competence, evidencebased practice, and reduction in health disparities in order to achieve beginner midwifery competence by graduation. In addition, professional role development behaviors...\n\n      more description for NURSE-GN 2135 »\n\n      \n\n\n\nThis is the final clinical course of the midwifery program. Students have the challenge and opportunity to integrate knowledge and clinical skills learned separately during the previous basic courses. They do this in a practice setting that encompasses the full scope of midwifery practice. This course also provides the opportunity to assure the acquisition of all core competencies, with emphasis on cultural competence, evidencebased practice, and reduction in health disparities in order to achieve beginner midwifery competence by graduation. In addition, professional role development behaviors deriving from leadership and entrepreneurial and change agent knowledge and skills are reinforced or made tangible in planning on practice as a new graduate.\n\n      less description for NURSE-GN 2135 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2136",
            "course_name": "Mental Health I: Individual Psychotherapy Across the Lifespan",
            "description": "NURSE-GN 2136 Mental Health I: Individual Psychotherapy Across the Lifespan",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2137",
            "course_name": "Mental Health II: Foundations of Psychiatric Adv Practice Nursing Across the Lifespan",
            "description": "NURSE-GN 2137 Mental Health II: Foundations of Psychiatric Adv Practice Nursing Across the Lifespan",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2138",
            "course_name": "Mental Health III: Group, Couple and Family Psychotherapy Across the Lifespan",
            "description": "NURSE-GN 2138 Mental Health III: Group, Couple and Family Psychotherapy Across the Lifespan",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2139",
            "course_name": "Mental Health IV: Child & Adolescent Psychiatric Advanced Practice Nursing Theory",
            "description": "NURSE-GN 2139 Mental Health IV: Child & Adolescent Psychiatric Advanced Practice Nursing Theory",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2140",
            "course_name": "Mental Hlth IV: Child & Adol Psych Adv Pract Nrsg Pract & Sup",
            "description": "NURSE-GN 2140 Mental Hlth IV: Child & Adol Psych Adv Pract Nrsg Pract & Sup",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2141",
            "course_name": "Mental Health V: Adult & Geriatric Psychiatric Advanced Nursing Theory",
            "description": "NURSE-GN 2141 Mental Health V: Adult & Geriatric Psychiatric Advanced Nursing Theory",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2142",
            "course_name": "Mental Health V: Adult & Geriatric Psychiatric Adv Practice Nursing Practicum & Suprv",
            "description": "NURSE-GN 2142 Mental Health V: Adult & Geriatric Psychiatric Adv Practice Nursing Practicum & Suprv",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2143",
            "course_name": "Advanced Holistic Nursing Foundations",
            "description": "NURSE-GN 2143 Advanced Holistic Nursing Foundations",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2144",
            "course_name": "Advanced Holistic Nursing: Strategies for Health Coaching and Behavior Change",
            "description": "NURSE-GN 2144 Advanced Holistic Nursing: Strategies for Health Coaching and Behavior Change",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2145",
            "course_name": "Advanced Holistic Nursing: Healing with Complementary and Alternative Modalities",
            "description": "NURSE-GN 2145 Advanced Holistic Nursing: Healing with Complementary and Alternative Modalities",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2150",
            "course_name": "Theoretical Foundations of Holistic Nursing",
            "description": "NURSE-GN 2150 Theoretical Foundations of Holistic Nursing \nFocuses on theoretical constructs and philosophical underpinnings of the holistic paradigm. A variety of perspectives on health and healing are explored, including Western and Eastern views and cultural and spiritual traditions. The evolutions of holism, theories of wholeness from nursing and other disciplines, and current research on holistic practices are investigated. Students begin to articulate their personal philosophy of holism.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2151",
            "course_name": "",
            "description": "NURSE-GN 2151\n\n   Contemp Practice Roles: The Nurse as Healer\n\nNurses themselves must go through an emerging process of self-assessment, self-responsibility, and self-healing in order to practice holistically. This course focuses on the student?s personal growth and development and the role of the advanced practice holistic nurse. Concepts of self, caring, connecting with the healing power, balance, and transforming one?s personal pattern of wholeness are explored. Additionally, emphasis is placed on the role of the advanced holistic nurse practitioner as practitioner, educator, counselor, partner, and facilitator of healing. Standards of advanced practic...\n\n      more description for NURSE-GN 2151 »\n\n      \n\n\n\nNurses themselves must go through an emerging process of self-assessment, self-responsibility, and self-healing in order to practice holistically. This course focuses on the student?s personal growth and development and the role of the advanced practice holistic nurse. Concepts of self, caring, connecting with the healing power, balance, and transforming one?s personal pattern of wholeness are explored. Additionally, emphasis is placed on the role of the advanced holistic nurse practitioner as practitioner, educator, counselor, partner, and facilitator of healing. Standards of advanced practice nursing and advanced holistic nursing practice are discussed\n\n      less description for NURSE-GN 2151 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2153",
            "course_name": "Ap:Holistic Modalities",
            "description": "NURSE-GN 2153 Ap:Holistic Modalities \nFocuses on the theory of natural healing and select integrative (conventional and complementary) modalities used in advanced practice holistic nursing. Concepts of subtle energy, modes of awareness, centering, presence, intentionality, relationship, and shared consciousness are explored and applied as the basis for healing. Current research that supports evidence based practice is emphasized.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2154",
            "course_name": "",
            "description": "NURSE-GN 2154\n\n   Ap:Holistic Practicum II\n\nFocuses on the practical application of theories, principles, and techniques for healing using conventional and complementary integrative approaches. Students begin to operationalize the advanced practice role of holistic nurse practitioner (HNP) under the direction of qualified preceptors, in a variety of health care settings with individual clients, families, or groups of clients. Emphasis is on holistically assessing, diagnosing, and treating clients; evaluating the effectiveness of the treatment plan; and revising care as indicated. Students implement plans of care mutually developed with ...\n\n      more description for NURSE-GN 2154 »\n\n      \n\n\n\nFocuses on the practical application of theories, principles, and techniques for healing using conventional and complementary integrative approaches. Students begin to operationalize the advanced practice role of holistic nurse practitioner (HNP) under the direction of qualified preceptors, in a variety of health care settings with individual clients, families, or groups of clients. Emphasis is on holistically assessing, diagnosing, and treating clients; evaluating the effectiveness of the treatment plan; and revising care as indicated. Students implement plans of care mutually developed with clients using evidence- based integrative (conventional and complementary) treatment modalities. Students model and teach self-care strategies and stress-reduction techniques. Consultation and referral as part of the HNP role are addressed. Seminars integrate concepts from the core and clinical theory courses in assisting the student to implement the advanced practice role of an HNP.\n\n      less description for NURSE-GN 2154 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2155",
            "course_name": "",
            "description": "NURSE-GN 2155\n\n   Holistic Nursing: Integration III\n\nIssues specific to the implementation of the advanced practice holistic nurse (holistic nurse practitioner) role are explored. Emphasis is on self-caring/healing practices; professional and leadership role development as an HNP; and the politics, economics, and reimbursement of holistic advanced practice nursing care. Also stressed are the collaboration/integration of HNPs with the conventional health care system; legal and ethical issues in advanced practice; grant writing; publication; organizational and community development; and the future of advanced practice holistic nursing nationally a...\n\n      more description for NURSE-GN 2155 »\n\n      \n\n\n\nIssues specific to the implementation of the advanced practice holistic nurse (holistic nurse practitioner) role are explored. Emphasis is on self-caring/healing practices; professional and leadership role development as an HNP; and the politics, economics, and reimbursement of holistic advanced practice nursing care. Also stressed are the collaboration/integration of HNPs with the conventional health care system; legal and ethical issues in advanced practice; grant writing; publication; organizational and community development; and the future of advanced practice holistic nursing nationally and internationally.\n\n      less description for NURSE-GN 2155 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2156",
            "course_name": "Holistic Nursing: Practicum III",
            "description": "NURSE-GN 2156 Holistic Nursing: Practicum III \nThis is the culminating experience for the advanced practice holistic nurse practitioner (HNP) program. Using a philosophical, theoretical, and caring framework, students under the direction of qualified preceptors operationalize the role of the HNP in a variety of health care settings with individual clients, families, or groups of clients. Emphasis is on integrating the art and science of advanced practice into care for self and others. A synthesis of concepts to implement the role of the advanced practice holistic nurse practitioner is emphasized",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2157",
            "course_name": "Psychoneuroimmunology",
            "description": "NURSE-GN 2157 Psychoneuroimmunology \nThis course explores the interactions between psychosocial factors, stress, the immune system, and the brain and their overall relation to both health and illness. The physiology and anatomy of the immune and neuroendocrine systems are studied. Several concepts of stress are introduced. The scientific and anecdotal evidence accumulating in the field of pyschoneuroimmunology is reviewed with an attempt at synthesis into a holistic framework that can serve as the basis for future research, as the rationale for therapeutic interventions, or as the motivator for a change in lifestyle.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2167",
            "course_name": "",
            "description": "NURSE-GN 2167\n\n   Nursing Administration Theory I\n\nEstablishing the foundation for competency-based nursing administration, this course examines past, current, and future issues and relevant research that impacts health organizations and the role of the nurse administrator in diverse settings. Topics include theory and research related to the folloEstablishing the foundation for competency-based nursing administration, this course examines past, current, and future issues and relevant research that impacts health organizations and the role of the nurse administrator in diverse settings. Topics include theory and research related to the followi...\n\n      more description for NURSE-GN 2167 »\n\n      \n\n\n\nEstablishing the foundation for competency-based nursing administration, this course examines past, current, and future issues and relevant research that impacts health organizations and the role of the nurse administrator in diverse settings. Topics include theory and research related to the folloEstablishing the foundation for competency-based nursing administration, this course examines past, current, and future issues and relevant research that impacts health organizations and the role of the nurse administrator in diverse settings. Topics include theory and research related to the following aspects of nursing administration: shaping organizational culture and creating caring environments; implementing and upholding standards of practice and professional performance; employing principles of ethical practice; organizational behavior; leadership; communication; cultural competence; conflict management; health economics; management processes; consumer health initiatives; health care evaluation; and outcome measures. Practicum experiences expose students to the role of the nurse administrator in different settings advanced physiologic concepts to begin diagnostic evaluation and a discussion of different pharmacotheraputic and treatment and management options. Clinical decision making based on the best available research, patient and family preferences, and clinical expertise is reinforced.\n\n      less description for NURSE-GN 2167 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2168",
            "course_name": "",
            "description": "NURSE-GN 2168\n\n   Nursing Administration Practicum III\n\nIn this final practicum course, the student conducts all aspects of the nurse administrator role in the health care setting. The emphasis is on evaluating nursing administration based on criteria from ANA Scope and Standards for Nurse Administrators, Code of Ethics, and national health care agency accreditation; and the expected administrative nursing practice that advocates for the well-being of nurses, fosters interdisciplinary collaboration and team-building, conducts cost-benefit analysis of strategic initiatives, and addresses consumer health care needs within multicultural and diverse he...\n\n      more description for NURSE-GN 2168 »\n\n      \n\n\n\nIn this final practicum course, the student conducts all aspects of the nurse administrator role in the health care setting. The emphasis is on evaluating nursing administration based on criteria from ANA Scope and Standards for Nurse Administrators, Code of Ethics, and national health care agency accreditation; and the expected administrative nursing practice that advocates for the well-being of nurses, fosters interdisciplinary collaboration and team-building, conducts cost-benefit analysis of strategic initiatives, and addresses consumer health care needs within multicultural and diverse health care environments.\n\n      less description for NURSE-GN 2168 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2169",
            "course_name": "Case Analysis Nrsg Educ",
            "description": "NURSE-GN 2169 Case Analysis Nrsg Educ",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2170",
            "course_name": "",
            "description": "NURSE-GN 2170\n\n   Nursing Education I\n\nEstablishing the foundation for competency-based nursing education, this course examines past, current, and future issues and research that impact the implementation of associate?s, baccalaureate, and master?s degree nursing programs, including the role of the nurse educator in academic and health care settings. Topics include theory and research related to the following aspects of nursing curricula: creating caring, culturally sensitive teaching/learning environments; principles of adult teaching/learning; problem-based learning; cultural competency; diverse and interdisciplinary learning nee...\n\n      more description for NURSE-GN 2170 »\n\n      \n\n\n\nEstablishing the foundation for competency-based nursing education, this course examines past, current, and future issues and research that impact the implementation of associate?s, baccalaureate, and master?s degree nursing programs, including the role of the nurse educator in academic and health care settings. Topics include theory and research related to the following aspects of nursing curricula: creating caring, culturally sensitive teaching/learning environments; principles of adult teaching/learning; problem-based learning; cultural competency; diverse and interdisciplinary learning needs of nursing students; classroom and clinical assessment techniques; information technology resources; distance education; finance; and accreditation process. Practicum experiences expose students to the administrative and scholarship role of the nurse educator, as well as student and faculty teaching issues.\n\n      less description for NURSE-GN 2170 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2172",
            "course_name": "",
            "description": "NURSE-GN 2172\n\n   Nurs Educ II Theory: Curr Develop Implement\n\nFundamental principles for developing and implementing competency- based and culturally competent nursing curriculum for associate?s, baccalaureate, and master?s degree programs and staff development departments of health care settings are examined. Students use Lenburg?s competency performance assessment (COPA) model and Purnell?s model for cultural competency to develop basic components of nursing curriculum that address vulnerable and medically underserved populations. Nurse educators? use of classroom assessment techniques, problem based learning, and technology strategies that create cari...\n\n      more description for NURSE-GN 2172 »\n\n      \n\n\n\nFundamental principles for developing and implementing competency- based and culturally competent nursing curriculum for associate?s, baccalaureate, and master?s degree programs and staff development departments of health care settings are examined. Students use Lenburg?s competency performance assessment (COPA) model and Purnell?s model for cultural competency to develop basic components of nursing curriculum that address vulnerable and medically underserved populations. Nurse educators? use of classroom assessment techniques, problem based learning, and technology strategies that create caring learning environments in the classroom, and clinical settings are discussed.\n\n      less description for NURSE-GN 2172 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2173",
            "course_name": "",
            "description": "NURSE-GN 2173\n\n   Nurs Educ II Practicum Curr Develop/Implement\n\nStudents implement developed lesson plans for the practicum site?s curriculum courses in classroom, college laboratory, and clinical teaching settings and assist preceptor teacher in other elements of curriculum implementation related to identified learners of accredited associate?s, baccalaureate, or master?s degree nursing programs and/or nursing staff development programs of health care settings. In the seminar, students discuss the practicum site?s curriculum in relation to the nurse-educator role, focusing on how it addresses vulnerable and medically underserved populations, use of classr...\n\n      more description for NURSE-GN 2173 »\n\n      \n\n\n\nStudents implement developed lesson plans for the practicum site?s curriculum courses in classroom, college laboratory, and clinical teaching settings and assist preceptor teacher in other elements of curriculum implementation related to identified learners of accredited associate?s, baccalaureate, or master?s degree nursing programs and/or nursing staff development programs of health care settings. In the seminar, students discuss the practicum site?s curriculum in relation to the nurse-educator role, focusing on how it addresses vulnerable and medically underserved populations, use of classroom assessment techniques, and problem- based learning strategies and the role of teaching for the nurse educator in academia and/or in a health care agency.\n\n      less description for NURSE-GN 2173 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2174",
            "course_name": "",
            "description": "NURSE-GN 2174\n\n   Nursing Educ III Theory Curriculum Evaluation\n\nThe emphasis of this course is on evaluating competency-based and culturally competent nursing curriculum based on national accreditation and professional organization criteria for associate?s, baccalaureate, and master?s degree nursing programs and nursing staff development programs of health care settings. Lenburg?s competency performance assessment (COPA) model and Purnell?s model for cultural competency areThe emphasis of this course is on evaluating competency-based and culturally competent nursing curriculum based on national accreditation and professional organization criteria for assoc...\n\n      more description for NURSE-GN 2174 »\n\n      \n\n\n\nThe emphasis of this course is on evaluating competency-based and culturally competent nursing curriculum based on national accreditation and professional organization criteria for associate?s, baccalaureate, and master?s degree nursing programs and nursing staff development programs of health care settings. Lenburg?s competency performance assessment (COPA) model and Purnell?s model for cultural competency areThe emphasis of this course is on evaluating competency-based and culturally competent nursing curriculum based on national accreditation and professional organization criteria for associate?s, baccalaureate, and master?s degree nursing programs and nursing staff development programs of health care settings. Lenburg?s competency performance assessment (COPA) model and Purnell?s model for cultural competency are evaluated for usefulness in addressing components of nursing curriculum that focus on vulnerable and medically underserved populations.\n\n      less description for NURSE-GN 2174 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2175",
            "course_name": "Nursing Education III Practicum",
            "description": "NURSE-GN 2175 Nursing Education III Practicum \nIn this final practicum course, students conduct all aspects of the nurse-educator role for academic and/or health care agency settings. The emphasis is on evaluating nursing curriculum based on the criteria of national educational and health care agency accreditation, standards of professional nursing educational organizations, and the expected legal registered nurse practice competencies that meet the health care needs of society, especially those of vulnerable and medically underserved populations.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2176",
            "course_name": "Advanced Pathophysiology, Pharmacotherapeutics, and Physical Assessment",
            "description": "NURSE-GN 2176 Advanced Pathophysiology, Pharmacotherapeutics, and Physical Assessment",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2177",
            "course_name": "Primary Care of the Older Adult with Multiple Chronic Conditions",
            "description": "NURSE-GN 2177 Primary Care of the Older Adult with Multiple Chronic Conditions",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2179",
            "course_name": "Introduction to Primary Care",
            "description": "NURSE-GN 2179 Introduction to Primary Care",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2180",
            "course_name": "Primary Care of Families:Child & Adolescent Health",
            "description": "NURSE-GN 2180 Primary Care of Families:Child & Adolescent Health",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2181",
            "course_name": "Primary Care of Families: Women's Health",
            "description": "NURSE-GN 2181 Primary Care of Families: Women's Health",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2182",
            "course_name": "Primary Care of Families: Adult & Geriatric Health",
            "description": "NURSE-GN 2182 Primary Care of Families: Adult & Geriatric Health",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2183",
            "course_name": "Primary Care of Families: Adult & Geriatric Health Practicum",
            "description": "NURSE-GN 2183 Primary Care of Families: Adult & Geriatric Health Practicum",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2184",
            "course_name": "Primary Care of Families Across the Lifespan",
            "description": "NURSE-GN 2184 Primary Care of Families Across the Lifespan",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2185",
            "course_name": "Primary Care of Families Across the Lifespan Praticum",
            "description": "NURSE-GN 2185 Primary Care of Families Across the Lifespan Praticum",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2186",
            "course_name": "Health Promotion Across the Life Span - FNP",
            "description": "NURSE-GN 2186 Health Promotion Across the Life Span - FNP",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2187",
            "course_name": "Clinical Intensive in Interprofessional Care of Older",
            "description": "NURSE-GN 2187 Clinical Intensive in Interprofessional Care of Older",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2188",
            "course_name": "Primary Care of the Frail Older Adult with Multiple Chronic Conditions",
            "description": "NURSE-GN 2188 Primary Care of the Frail Older Adult with Multiple Chronic Conditions",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2213",
            "course_name": "Palliative Care Practcm II:End of Life Care",
            "description": "NURSE-GN 2213 Palliative Care Practcm II:End of Life Care",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2231",
            "course_name": "Nursing Informatics: Introduction",
            "description": "NURSE-GN 2231 Nursing Informatics: Introduction \nThis course focuses on the theoretical basis of nursing and health care informatics. The model of data, information, and knowledge is used to explore the basis of nursing informatics within health care. Nursing classifications and taxonomies and the computerized patient record (CPR) are introduced. Strategies are examined for dissemination, access, retrieval, and evaluation of information for professionals and consumers of health care, with an emphasis on reducing health care disparities.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2232",
            "course_name": "Assessment & Analysis of Clin/Nurs/Informatics",
            "description": "NURSE-GN 2232 Assessment & Analysis of Clin/Nurs/Informatics \nThis course emphasizes principles of system analysis and information flow within an organization. Content emphasizes identification of organizational problems, establishment of user priorities, and the use of automated design to address patient care system requirements. Concepts of the longitudinal patient record, enterprise health care systems, and life cycle of systems are discussed within the structure of evolving and changing systems. Students are introduced to the concepts of project management, collaboration, system integration and data security, and regulatory issues.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2233",
            "course_name": "Database Design/Decision Support/Clin/Nurs/Systm",
            "description": "NURSE-GN 2233 Database Design/Decision Support/Clin/Nurs/Systm \nThis course focuses on theoretical and application aspects of decision modeling in health care. Quantitative reasoning, including probabilistic reasoning, decision analysis, knowledge representation, and rule-based systems are presented. Clinical decision analysis incorporating patient preferences to support decision making are examined within the framework of the system architecture. Nursing and medical domain standards of information systems are identified.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2234",
            "course_name": "",
            "description": "NURSE-GN 2234\n\n   Implemnt/Mngmt & Eval Clinical/Nurs Systems\n\nThis course focuses on the role of the nurse informaticist in the selection, implementation, management, and evaluation of nursing, clinical, and health care information systems. Strategies supporting system selection, change management, return on investment, value metrics, clinician buy-in, training, system security, monitoring, and evaluation criteria are presented reflective of a variety of clinical settings. The use of data in the provision of integrated information necessary for making critical business and or patient care delivery decision are also explored. In addition, regulatory and H...\n\n      more description for NURSE-GN 2234 »\n\n      \n\n\n\nThis course focuses on the role of the nurse informaticist in the selection, implementation, management, and evaluation of nursing, clinical, and health care information systems. Strategies supporting system selection, change management, return on investment, value metrics, clinician buy-in, training, system security, monitoring, and evaluation criteria are presented reflective of a variety of clinical settings. The use of data in the provision of integrated information necessary for making critical business and or patient care delivery decision are also explored. In addition, regulatory and HIPAA standards and their impact on system implementation, management, and evaluation are also discussed.\n\n      less description for NURSE-GN 2234 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2235",
            "course_name": "",
            "description": "NURSE-GN 2235\n\n   Terminal Practicum:Nrsng Informatics Integration\n\nThis course is the final informatics experience for the nursing informatics curriculum. Within a clinical situation, the student completes a final project?approved by the course instructor?that demonstrates the advanced application of theoretical and practical aspects of nursing informatics. The leadership role of the nurse informaticist within the health care informatics framework is stressed. A weekly seminar, combined with the informatics practicum, promotes the integration of theory, knowledge, evidence-based informatics principles, collaboration issues, and legal and ethical issues for th...\n\n      more description for NURSE-GN 2235 »\n\n      \n\n\n\nThis course is the final informatics experience for the nursing informatics curriculum. Within a clinical situation, the student completes a final project?approved by the course instructor?that demonstrates the advanced application of theoretical and practical aspects of nursing informatics. The leadership role of the nurse informaticist within the health care informatics framework is stressed. A weekly seminar, combined with the informatics practicum, promotes the integration of theory, knowledge, evidence-based informatics principles, collaboration issues, and legal and ethical issues for the nurse informaticist.\n\n      less description for NURSE-GN 2235 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2236",
            "course_name": "Consumers/Interact Hlth Care",
            "description": "NURSE-GN 2236 Consumers/Interact Hlth Care \nThis course prepares nurses to employ a variety of interactive strategies and technologies to enhance health care delivery to consumers, with an emphasis on increasing access to underserved populations through reducing health disparities. Strategies for the successful deployment of technologies, as well as policy, research, funding, and reimbursement issues are explored. Consumer and computer interaction is emphasized and exemplified through specific computer applications.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2300",
            "course_name": "Independent Study",
            "description": "NURSE-GN 2300 Independent Study",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2301",
            "course_name": "Research",
            "description": "NURSE-GN 2301 Research",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2303",
            "course_name": "Research in Nursing",
            "description": "NURSE-GN 2303 Research in Nursing \nThis graduate research course is designed to develop the role of the advanced practice nurse, midwife, educator, administrator, or informatics specialist as a competent research consumer.  An evidence-based practice paradigm is used to promote acquisition of information literacy and critical appraisal skills which, combined with clinical judgment and patient preferences, support evidence-based decision making.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2351",
            "course_name": "Global Ldrshp Prspt Adv Pract & Nurse Midwifery",
            "description": "NURSE-GN 2351 Global Ldrshp Prspt Adv Pract & Nurse Midwifery",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2353",
            "course_name": "Frontiers in Nursing",
            "description": "NURSE-GN 2353 Frontiers in Nursing",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2355",
            "course_name": "",
            "description": "NURSE-GN 2355\n\n   Nursing Administration Theory III\n\nThe emphasis of this course is on examining, conducting, and evaluating competency-based and culturally competent nursing administrative practices in the management of human resources. Based on criteria from ANA Scope and Standards for Nurse Administrators, Code of Ethics, and national health care agency accreditation, the student uses relevant theoretical and evidence-based research to address issues related to the restructuring of the health care environment, hiring, employment, labor relations, employee assistance, and problems of harassment, discrimination, workplace violence, nursing staf...\n\n      more description for NURSE-GN 2355 »\n\n      \n\n\n\nThe emphasis of this course is on examining, conducting, and evaluating competency-based and culturally competent nursing administrative practices in the management of human resources. Based on criteria from ANA Scope and Standards for Nurse Administrators, Code of Ethics, and national health care agency accreditation, the student uses relevant theoretical and evidence-based research to address issues related to the restructuring of the health care environment, hiring, employment, labor relations, employee assistance, and problems of harassment, discrimination, workplace violence, nursing staff turnover, and advocating for the well-being of nurses in multicultural and diverse health care settings.\n\n      less description for NURSE-GN 2355 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2357",
            "course_name": "Nursing Leadership in Groups",
            "description": "NURSE-GN 2357 Nursing Leadership in Groups",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2359",
            "course_name": "Nrsg Strat in Resonating Patterns of Human Behav",
            "description": "NURSE-GN 2359 Nrsg Strat in Resonating Patterns of Human Behav",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2361",
            "course_name": "Nurs Strat Emerg Evol",
            "description": "NURSE-GN 2361 Nurs Strat Emerg Evol",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2363",
            "course_name": "Frontiers in Nursing",
            "description": "NURSE-GN 2363 Frontiers in Nursing",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2401",
            "course_name": "Herbs Nutraceuticals and Supplements(Hns) I",
            "description": "NURSE-GN 2401 Herbs Nutraceuticals and Supplements(Hns) I",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2402",
            "course_name": "Herbs Nutraceuticals & Supplements",
            "description": "NURSE-GN 2402 Herbs Nutraceuticals & Supplements",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2403",
            "course_name": "Herbs Nutraceuticals and Supplements",
            "description": "NURSE-GN 2403 Herbs Nutraceuticals and Supplements",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2410",
            "course_name": "Humanbecomming School of Thought",
            "description": "NURSE-GN 2410 Humanbecomming School of Thought",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2500",
            "course_name": "",
            "description": "NURSE-GN 2500\n\n   Integrative Practicum\n\nPrerequisites: completion of all course work for the Dual Degree Program, health examination and clearance, and New York State R.N. licensure. This culminating course is a practicum and seminar designed to provide a field experience for the student that provides an opportunity to apply and integrate concepts and knowledge learned in the M.A. program in the College of Nursing and the M.S. program in management in the Robert F. Wagner Graduate School of Public Service. Management policy and financial issues that will be a focus of concern for health care leaders of the future are explored. An in...\n\n      more description for NURSE-GN 2500 »\n\n      \n\n\n\nPrerequisites: completion of all course work for the Dual Degree Program, health examination and clearance, and New York State R.N. licensure. This culminating course is a practicum and seminar designed to provide a field experience for the student that provides an opportunity to apply and integrate concepts and knowledge learned in the M.A. program in the College of Nursing and the M.S. program in management in the Robert F. Wagner Graduate School of Public Service. Management policy and financial issues that will be a focus of concern for health care leaders of the future are explored. An interdisciplinary/interprofessional perspective to management is emphasized. The student engages in a focus of study ending in a final project/paper.\n\n      less description for NURSE-GN 2500 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2901",
            "course_name": "Teaching Nursing Thru Multi Media",
            "description": "NURSE-GN 2901 Teaching Nursing Thru Multi Media",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2902",
            "course_name": "Philosophy of Death Module I",
            "description": "NURSE-GN 2902 Philosophy of Death Module I",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2903",
            "course_name": "Thry/Conc/Soc Signif-Nsg",
            "description": "NURSE-GN 2903 Thry/Conc/Soc Signif-Nsg",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2904",
            "course_name": "Nursing Strategies Death & Dying",
            "description": "NURSE-GN 2904 Nursing Strategies Death & Dying",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2905",
            "course_name": "Nrsg Strat Crises Theory Appl",
            "description": "NURSE-GN 2905 Nrsg Strat Crises Theory Appl \nThis course examines the historical development and theoretical formulations of crisis theory and intervention. Crisis is viewed from the perspective of overwhelming disruption and the processes of change and growth. Using case studies, this theoretical perspective is applied to analyze the dynamics and behaviors of individuals, families, groups/communities, and society experiencing crisis. It explores theory and evidence-based strategies for intervention. This course is appropriate for health and human services professionals dealing with people in crisis in a variety of settings.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2906",
            "course_name": "Suicide: Module II",
            "description": "NURSE-GN 2906 Suicide: Module II",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2907",
            "course_name": "Crises Intervention & Suicide Prevention",
            "description": "NURSE-GN 2907 Crises Intervention & Suicide Prevention",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2998",
            "course_name": "Special Topics:",
            "description": "NURSE-GN 2998 Special Topics:",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 2999",
            "course_name": "Special Topics:",
            "description": "NURSE-GN 2999 Special Topics:",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3000",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4994",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4995",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4996",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4997",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4998",
                    "section": "005",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4999",
                    "section": "006",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "NURSE-GN 3000 Independent Study",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3070",
            "course_name": "Alcohol Tobacco and Other Drug Problems:",
            "description": "NURSE-GN 3070 Alcohol Tobacco and Other Drug Problems:",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3313",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "5000",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "WAVE 566A"
                }
            ],
            "course_name": "Dissertation Proposal Seminar Nsg",
            "description": "NURSE-GN 3313 Dissertation Proposal Seminar Nsg \nPrerequisites: N41.3350, N41.3351, N41.3352, N41.3343, and N41.3325.  This course is designed to provide guidance in the development of the PhD dissertation proposal. Emphasis is placed on understanding and defining the logical relations between elements in a proposal including the problem statement, conceptual/theoretical framework and research design and methodology.  Teaching-learning strategies are designed to promote critical/analytical thinking and scholarly discourse.",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3320",
            "course_name": "Iss in Nursing:Designs for Effect Leadership",
            "description": "NURSE-GN 3320 Iss in Nursing:Designs for Effect Leadership",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3325",
            "course_name": "Health Disparities Theory,Rsch & Methods",
            "description": "NURSE-GN 3325 Health Disparities Theory,Rsch & Methods \nThis course focuses on concepts, theory, and research related to health disparities within the context of health care delivery. Diversity, vulnerability, culture/ethnicity and socioeconomic contexts will be presented as well as individual, health care provider and health care system level factors.  Emphasis is placed on critical appraisal and synthesis of nursing and multidisciplinary literature that guides research, clinical practice and policy focused on health disparities.  Course content emphasizes urban environments and lifestyles that contribute to health disparities.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3350",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5001",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "NURSE-GN 3350\n\n   Philosophical & Theor Perspetvs or Nursing\n\nThis course will provide participants with the opportunity to examine the historical development of the philosophy of science as it relates to the evolution of the discipline of nursing and the development of nursing knowledge, including theory development, and its application to nursing research and practice. Structure, components, assumptions, limitations, methodologies, and types of reasoning will be evaluated with regard to the development of nursing knowledge. The multiple paradigms of nursing and their implication for nursing research will be discussed. The interrelationships among philo...\n\n      more description for NURSE-GN 3350 »\n\n      \n\n\n\nThis course will provide participants with the opportunity to examine the historical development of the philosophy of science as it relates to the evolution of the discipline of nursing and the development of nursing knowledge, including theory development, and its application to nursing research and practice. Structure, components, assumptions, limitations, methodologies, and types of reasoning will be evaluated with regard to the development of nursing knowledge. The multiple paradigms of nursing and their implication for nursing research will be discussed. The interrelationships among philosophy, ethics, theory development, research, and practice will be analyzed as they relate to the discipline of nursing.\n\n      less description for NURSE-GN 3350 «",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3351",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5002",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Contemp Design & Meth I",
            "description": "NURSE-GN 3351 Contemp Design & Meth I \nStudents will examine and apply criteria used to develop and evaluate rigorous methodological designs. Current epistemological and methodological debates will be discussed. Both classic and alternative methodological approaches to answering research questions and generating evidence of significance to nursing science will be explored; the inherent strengths and limitations of various designs will be emphasized and analyzed. Design and sampling considerations for answering questions related to health disparities will be integrated throughout.",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3352",
            "course_name": "",
            "description": "NURSE-GN 3352\n\n   Contemp Design & Meth II\n\nStudents will continue their examination of methodological rigor in the research processes of measurement, instrument design, data collection and analysis. Students will also explore alternative research approaches, including mixed methods designs and secondary analysis. The strengths and limitations of various approaches to data collection will be examined. Strategies for enhancing rigor and minimizing measurement error will be discussed. Special attention will be paid to the development of culturally relevant and sensitive measures and procedures for data collection with diverse populations....\n\n      more description for NURSE-GN 3352 »\n\n      \n\n\n\nStudents will continue their examination of methodological rigor in the research processes of measurement, instrument design, data collection and analysis. Students will also explore alternative research approaches, including mixed methods designs and secondary analysis. The strengths and limitations of various approaches to data collection will be examined. Strategies for enhancing rigor and minimizing measurement error will be discussed. Special attention will be paid to the development of culturally relevant and sensitive measures and procedures for data collection with diverse populations.\n\n      less description for NURSE-GN 3352 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3353",
            "course_name": "",
            "description": "NURSE-GN 3353\n\n   Knowledge Appraisal and Development\n\nThis course will provide students with specific strategies necessary to conduct a scholarly appraisal. The adequacy of a specific body of nursing knowledge will be taught including: concept analysis, integrative and systematic reviews. Students will use concept analysis to examine concepts integral to a specific body of knowledge. In doing so, propositions, and/or theories from specific areas of nursing science will be identified and examined for adequacy. Students will begin to examine the state of the science in a specific area of knowledge development using integrated review techniques. Gen...\n\n      more description for NURSE-GN 3353 »\n\n      \n\n\n\nThis course will provide students with specific strategies necessary to conduct a scholarly appraisal. The adequacy of a specific body of nursing knowledge will be taught including: concept analysis, integrative and systematic reviews. Students will use concept analysis to examine concepts integral to a specific body of knowledge. In doing so, propositions, and/or theories from specific areas of nursing science will be identified and examined for adequacy. Students will begin to examine the state of the science in a specific area of knowledge development using integrated review techniques. Generalizability of knowledge in a specific area will be examined with attention to methodological and conceptual limitations based on gender, race, age, or ethnic group. The impact of knowledge on practice will be analyzed and strategies to increase the transfer of knowledge to/from the clinical arena will be discussed. As well as examining one specific area of nursing knowledge in class, students will use techniques learned to further individual ability to appraise and develop knowledge in an area of specific interest to the individual.\n\n      less description for NURSE-GN 3353 «",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3355",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "5003",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "25W4 C-11"
                }
            ],
            "course_name": "PhD Forum",
            "description": "NURSE-GN 3355 PhD Forum \nThis course is designed to enhance students’ socialization into the roles of scholar and researcher and assist students to develop the knowledge, skills and strategies necessary to develop a research career in nursing.  Students may opt to take this course Pass/Fail.",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3357",
            "course_name": "Methods for Writing An Nrsa",
            "description": "NURSE-GN 3357 Methods for Writing An Nrsa \nThis course will vary from semester to semester depending on student and faculty interest. The course will focus on one area of nursing research. Topics may include: secondary data analysis; current controversies in data analysis; measures used in nursing research; conducting hospital based research.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3358",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5036",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "NURSE-GN 3358\n\n   Using Qualitative Methods Nursing Research\n\nThis course is designed for graduate nursing students interested in furthering their ability to carry out qualitative research. Topics will include the approach and implementation of in-depth interviews, focus groups, and participant observation, as well as issues of proposal development, sampling, and recruitment of subjects, informed consent and analysis. Exercises will permit group interaction and hands-on practice of research design, instrument development, interviewing, group facilitation, observation, analysis and write-up of findings. Several guest speakers will provide first hand exper...\n\n      more description for NURSE-GN 3358 »\n\n      \n\n\n\nThis course is designed for graduate nursing students interested in furthering their ability to carry out qualitative research. Topics will include the approach and implementation of in-depth interviews, focus groups, and participant observation, as well as issues of proposal development, sampling, and recruitment of subjects, informed consent and analysis. Exercises will permit group interaction and hands-on practice of research design, instrument development, interviewing, group facilitation, observation, analysis and write-up of findings. Several guest speakers will provide first hand experiences of the development and implementation of their studies. Students will be expected to research methodological issues, carry out field exercises and write up \"reports\" of their experiences and data analysis. A final research project including design, instruments and human subjects’ issues will be required in lieu of an exam.\n\n      less description for NURSE-GN 3358 «",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3400",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "5004",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "5005",
                    "section": "999",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "PhD Advisement",
            "description": "NURSE-GN 3400 PhD Advisement \nOngoing PhD advisement to maintain matriculation.",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3501",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5006",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Biostatistics I",
            "description": "NURSE-GN 3501 Biostatistics I \nThis course will prepare students with core knowledge of statistical analysis needed to critically evaluate scientific research presentations. Through the interpretation and comprehension of graphical and statistical techniques, scientific hypothesis will be answered. Statistical processing through the program SPSS will be integrated into the program and used in tandem with critical principles needed for effective statistical decision making.",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3502",
            "course_name": "Biostatistics II",
            "description": "NURSE-GN 3502 Biostatistics II \nThis course is designed to further the knowledge base presented in Biostatistics I. There will be a concentration on more advanced methods of statistical analysis and research designs that are present in biological and medical applications of statistics. More complex statistical functions, such as regression, ANOVA and the Advanced Quantitative Methods sequence will be introduced as methods in analysis of scientific research.",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3810",
            "course_name": "Innovations in Inf. Technology Healthcare",
            "description": "NURSE-GN 3810 Innovations in Inf. Technology Healthcare",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3815",
            "classes": [
                {}
            ],
            "course_name": "Leadership and Org Sys Mgt for Quality Care",
            "description": "NURSE-GN 3815 Leadership and Org Sys Mgt for Quality Care",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3818",
            "course_name": "Genetics and Genomics for Healthcare",
            "description": "NURSE-GN 3818 Genetics and Genomics for Healthcare",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3819",
            "course_name": "Integrative Application of Evidence-Based Practice I",
            "description": "NURSE-GN 3819 Integrative Application of Evidence-Based Practice I",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3820",
            "course_name": "Int. App. of Evidence Based Practice II",
            "description": "NURSE-GN 3820 Int. App. of Evidence Based Practice II",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3825",
            "classes": [
                {}
            ],
            "course_name": "Improving Health Outcomes Through Quality",
            "description": "NURSE-GN 3825 Improving Health Outcomes Through Quality",
            "offering": true
        },
        {
            "course_id": "NURSE-GN 3830",
            "course_name": "Capstone Seminar I: Proposal Completion",
            "description": "NURSE-GN 3830 Capstone Seminar I: Proposal Completion",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3832",
            "course_name": "Capstone Sem/Int II",
            "description": "NURSE-GN 3832 Capstone Sem/Int II",
            "offering": false
        },
        {
            "course_id": "NURSE-GN 3833",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "5025",
                    "section": "001",
                    "period": "09/04/2015 - 09/04/2015",
                    "location": "Levin, Rona Faye; Jenkins, Matthew Scott; Bryant, Sidney; Brennan, Mary; Apold, Susan10/02/2015 - 10/02/2015 Fri 9.00 AM - 12.30 PM with Levin, Rona Faye; Jenkins, Matthew Scott; Bryant, Sidney; Brennan, Mary; Apold, Susan11/06/2015 - 11/06/2015 Fri 9.00 AM - 12.30 PM with Levin, Rona Faye; Jenkins, Matthew Scott; Bryant, Sidney; Brennan, Mary; Apold, Susan12/04/2015 - 12/04/2015 Fri 9.00 AM - 12.30 PM with Levin, Rona Faye; Jenkins, Matthew Scott; Bryant, Sidney; Brennan, Mary; Apold, Susan",
                    "time": "Fri 9.00 AM - 12.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Capstone Seminar & Intersnhip III",
            "description": "NURSE-GN 3833 Capstone Seminar & Intersnhip III",
            "offering": true
        }
    ]
}