{
    "major_id": "OART-GT",
    "file": "./2015-2016/Open_Arts_Curriculum_(OART-GT).html",
    "courses": [
        {
            "course_id": "OART-GT 205",
            "course_name": "",
            "description": "OART-GT  205\n\n   All-University Choir at Tisch\n\nAll University Choir is a highly trained vocal vehicle, dedicated to the artistic excellence of the first art, and open to the entire student body at NYU. We accept up to seventy-five beautiful blending voices: Sopranos, Altos, Tenors and Basses (Baritones). Students who read music and have previous choir experience are preferred, but we welcome all-comers. Ability to read music is a plus but not mandatory. This year's concert is entitled \"ROCK AND BACH AND ROLL\" The performance will contain works of pop and rock music from the 70s through the present, classical works from the Baroque up throu...\n\n      more description for OART-GT  205 »\n\n      \n\n\n\nAll University Choir is a highly trained vocal vehicle, dedicated to the artistic excellence of the first art, and open to the entire student body at NYU. We accept up to seventy-five beautiful blending voices: Sopranos, Altos, Tenors and Basses (Baritones). Students who read music and have previous choir experience are preferred, but we welcome all-comers. Ability to read music is a plus but not mandatory. This year's concert is entitled \"ROCK AND BACH AND ROLL\" The performance will contain works of pop and rock music from the 70s through the present, classical works from the Baroque up through the romantic era, original pieces by students at the university, and famous Broadway songs.\n\n      less description for OART-GT  205 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2006",
            "course_name": "",
            "description": "OART-GT 2006\n\n   Producing Essentials\n\nToday’s major creative fields—film, television, music, theatre, dance, and new media—need quality producers. A producer with a firm knowledge of the craft, a discerning eye for material, fund-raising ability, a grasp of the law, cash flow, people, and ethics is rare. This course provides students with a framework for understanding the dynamics of producing—as an art form and a business profession—and for completing a creative product in the entertainment and media industries. Students are introduced to the basic concepts, terms, and principles that apply to the role of producer in the entertai...\n\n      more description for OART-GT 2006 »\n\n      \n\n\n\nToday’s major creative fields—film, television, music, theatre, dance, and new media—need quality producers. A producer with a firm knowledge of the craft, a discerning eye for material, fund-raising ability, a grasp of the law, cash flow, people, and ethics is rare. This course provides students with a framework for understanding the dynamics of producing—as an art form and a business profession—and for completing a creative product in the entertainment and media industries. Students are introduced to the basic concepts, terms, and principles that apply to the role of producer in the entertainment and media industries along with the specific job functions that are required to effectively and efficiently complete a production.\n\n      less description for OART-GT 2006 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2300",
            "course_name": "",
            "description": "OART-GT 2300\n\n   Free Culture and Open Access\n\nAt the root of \"Free Culture\" and \"Open Access\" lies the idea that aesthetic and informational works become public resources that should be shared. This interdisciplinary class examines both ideas from a variety of perspectives: aesthetics, politics, law, and social movements. It pays particular attention to the relationship between these ideas and the rise of new forms of media that allow age-old concepts like \"The Commons\" to flourish. It also situates these ideas within longstanding practices of both scholarship and librarianship.  The course places a focus on contemporary and very recent a...\n\n      more description for OART-GT 2300 »\n\n      \n\n\n\nAt the root of \"Free Culture\" and \"Open Access\" lies the idea that aesthetic and informational works become public resources that should be shared. This interdisciplinary class examines both ideas from a variety of perspectives: aesthetics, politics, law, and social movements. It pays particular attention to the relationship between these ideas and the rise of new forms of media that allow age-old concepts like \"The Commons\" to flourish. It also situates these ideas within longstanding practices of both scholarship and librarianship.  The course places a focus on contemporary and very recent activities, and will also examine closely related ideas and movements such as \"Information Wants to be Free\", Free Software, CopyLeft, and Access to Knowledge.\n\n      less description for OART-GT 2300 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2560",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "5922",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 941",
                    "time": "Tue 9.30 AM - 4.45 PM",
                    "open": true,
                    "professor": "Rinella, Elizabeth; Michels, Stevin"
                },
                {
                    "format": "Studio",
                    "class_id": "5895",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 369",
                    "time": "Wed 9.30 AM - 4.45 PM",
                    "open": true,
                    "professor": "Juhola, Eric; Bankert, Scott"
                }
            ],
            "course_name": "",
            "description": "OART-GT 2560\n\n   Fundamentals of Filmmaking: A Digital Workshop\n\nThis practical workshop is designed to introduce students to the techniques and theory of developing and producing short film ideas that are shot on digital video and edited digitally on computer using FinalCut Pro Software. The course centers on learning elements of visual storytelling through a spectrum of aesthetic approaches. Working in crews of four, students learn directing, shooting, and editing skills as they each direct three short videos (three to five minutes in length). This course is specifically designed to fulfill the major requirements in production of students not majoring in ...\n\n      more description for OART-GT 2560 »\n\n      \n\n\n\nThis practical workshop is designed to introduce students to the techniques and theory of developing and producing short film ideas that are shot on digital video and edited digitally on computer using FinalCut Pro Software. The course centers on learning elements of visual storytelling through a spectrum of aesthetic approaches. Working in crews of four, students learn directing, shooting, and editing skills as they each direct three short videos (three to five minutes in length). This course is specifically designed to fulfill the major requirements in production of students not majoring in film and therefore, students who need to fulfill this requirement are given registration priority. Students should add themselves to the waitlist for this class.\n\n      less description for OART-GT 2560 «",
            "offering": true
        },
        {
            "course_id": "OART-GT 2561",
            "classes": [
                {
                    "format": "Studio",
                    "class_id": "17022",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "721B 018",
                    "time": "Wed 9.30 AM - 1.30 PM",
                    "open": true,
                    "professor": "Rinella, Elizabeth"
                }
            ],
            "course_name": "",
            "description": "OART-GT 2561\n\n   Intermediate Digital Filmmaking\n\nIn this course, students will build upon the visual storytelling skills learned in the prerequisite course, Fundamentals of Filmmaking. Students will be introduced to color cinematography, aesthetics, sound recording, casting and directing actors, production logistics, and editing. This course is aimed at the film enthusiast who would like to further explore digital filmmaking. Students will shoot on Panasonic HMC 150 HD digital video cameras, and edit with Final Cut Pro software on Apple computers. Students will have access to a compact lighting and mini mic kit for use on their productions. ...\n\n      more description for OART-GT 2561 »\n\n      \n\n\n\nIn this course, students will build upon the visual storytelling skills learned in the prerequisite course, Fundamentals of Filmmaking. Students will be introduced to color cinematography, aesthetics, sound recording, casting and directing actors, production logistics, and editing. This course is aimed at the film enthusiast who would like to further explore digital filmmaking. Students will shoot on Panasonic HMC 150 HD digital video cameras, and edit with Final Cut Pro software on Apple computers. Students will have access to a compact lighting and mini mic kit for use on their productions. Students are required to purchase their own portable hard drive to use during the editing process.\n\n      less description for OART-GT 2561 «",
            "offering": true
        },
        {
            "course_id": "OART-GT 2568",
            "course_name": "",
            "description": "OART-GT 2568\n\n   Understanding Story\n\nUnderstanding Story is a class composed of lectures, discussions, screenings, readings, critical and creative writing, group critiques and presentations.  The course is designed to expose the student to the fundamental principles of storytelling across a spectrum of mediums, including the written story, playwriting, film, poetry, dance, games, photography, fine art and music.  How do all these different art forms tell stories?  How can the student apply what is learned to their own creative work?  History and theory of story will be studied and used to inspire personal and creative work in ord...\n\n      more description for OART-GT 2568 »\n\n      \n\n\n\nUnderstanding Story is a class composed of lectures, discussions, screenings, readings, critical and creative writing, group critiques and presentations.  The course is designed to expose the student to the fundamental principles of storytelling across a spectrum of mediums, including the written story, playwriting, film, poetry, dance, games, photography, fine art and music.  How do all these different art forms tell stories?  How can the student apply what is learned to their own creative work?  History and theory of story will be studied and used to inspire personal and creative work in order to better understand how story can most successfully be expressed in different mediums and reach its audience.\n\n      less description for OART-GT 2568 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2600",
            "course_name": "",
            "description": "OART-GT 2600\n\n   Games 101\n\nGames 101 is the foundational course for the NYU Game Center and a prerequisite for all other Game Center classes starting in the fall of 2012. The focus of Games 101 is game literacy – the development of a shared understanding of games as complex cultural and aesthetic objects. This class is a broad, introductory survey which covers the full spectrum of digital and non-digital games. The class will incorporate lectures, discussions, and writing assignments, but the primary activity of the class is critical play – playing games and writing about them in order to better understand and appreciat...\n\n      more description for OART-GT 2600 »\n\n      \n\n\n\nGames 101 is the foundational course for the NYU Game Center and a prerequisite for all other Game Center classes starting in the fall of 2012. The focus of Games 101 is game literacy – the development of a shared understanding of games as complex cultural and aesthetic objects. This class is a broad, introductory survey which covers the full spectrum of digital and non-digital games. The class will incorporate lectures, discussions, and writing assignments, but the primary activity of the class is critical play – playing games and writing about them in order to better understand and appreciate them.\n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n1)\tDevelop a thorough understanding of the most important and influential historical and modern games.\n2)\tPlace games within a comprehensive overall framework of historical, technological, and stylistic categories.\n3)\tUnderstand games as designed experiences, as technological systems, and as social and cultural artifacts.\n4)\tBuild a critical vocabulary that allows them to participate in productive, high-level spoken and written conversations about games.\n5)\tAnalyze games and clearly articulate their formal, cultural, and expressive qualities\n6)\tGain a basic understanding of games as aesthetic objects that lays a foundation for further studies in game design, production, and scholarship.\n\n      less description for OART-GT 2600 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2604",
            "course_name": "",
            "description": "OART-GT 2604\n\n   Game Development Workshop\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the clo...\n\n      more description for OART-GT 2604 »\n\n      \n\n\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the close supervision of instructors, students will collaborate on the creation of a playable game. As a creative constraint to help inspire them and guide their designs, the students will be given a theme to express in their game projects.\n\n      less description for OART-GT 2604 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2605",
            "course_name": "",
            "description": "OART-GT 2605\n\n   Intro to Game Design\n\nThis is an intensive, hands-on workshop addressing the complex challenges of game design. The premise of the class is that all games, digital and non-digital, share common fundamental principles, and that understanding these principles is an essential part of designing successful games. Learning how to create successful non-digital games provides a solid foundation for the development of digital games. Students will analyze existing digital and non-digital games, taking them apart to understand how they work as interactive systems. A number of non-digital games will be created in order to mast...\n\n      more description for OART-GT 2605 »\n\n      \n\n\n\nThis is an intensive, hands-on workshop addressing the complex challenges of game design. The premise of the class is that all games, digital and non-digital, share common fundamental principles, and that understanding these principles is an essential part of designing successful games. Learning how to create successful non-digital games provides a solid foundation for the development of digital games. Students will analyze existing digital and non-digital games, taking them apart to understand how they work as interactive systems. A number of non-digital games will be created in order to master the basic design principles that apply to all games regardless of format. This course has a nonrefundable $115 lab fee.\n\n      less description for OART-GT 2605 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2606",
            "course_name": "",
            "description": "OART-GT 2606\n\n   Thinking About Games\n\nThis class is an overview of the field of video games that approaches them from several theoretical and critical perspectives. No special theoretical background or prior training is needed to take the course, but to have had a broad practical experience with and basic knowledge of games is a distinct advantage. Also, an interest in theoretical and analytical issues will help. You are expected to actively participate in the lectures, which are dialogic in form, with ample room for discussion.\n\nThe course will prepare the student to:\n\n- Understand and discuss games from a theoretical perspec...\n\n      more description for OART-GT 2606 »\n\n      \n\n\n\nThis class is an overview of the field of video games that approaches them from several theoretical and critical perspectives. No special theoretical background or prior training is needed to take the course, but to have had a broad practical experience with and basic knowledge of games is a distinct advantage. Also, an interest in theoretical and analytical issues will help. You are expected to actively participate in the lectures, which are dialogic in form, with ample room for discussion.\n\nThe course will prepare the student to:\n\n- Understand and discuss games from a theoretical perspective - what are the components of a game?\n\n- Apply new theories and evaluate them critically.\n\n- Assess and discuss game concepts and the use of games in various contexts.\n\n- Analyze games, and understand and apply a range of analytical methods.\n\n      less description for OART-GT 2606 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2607",
            "course_name": "Games: Special Topics",
            "description": "OART-GT 2607 Games: Special Topics",
            "offering": false
        },
        {
            "course_id": "OART-GT 2608",
            "course_name": "Game Studio: Lab",
            "description": "OART-GT 2608 Game Studio: Lab",
            "offering": false
        },
        {
            "course_id": "OART-GT 2609",
            "course_name": "Advanced Game Design",
            "description": "OART-GT 2609 Advanced Game Design \nThe focus of this class is the actual creation of several non-digital games. Students deeply explore advanced topics in game design, wrestling with complex and challenging problems, such as formal play-testing procedures, balancing game economies, and designing games for learning. The class will cover both the craft and the culture of making games, and has a particular emphasis on how designers communicate their ideas. Although most of the projects will take the form of non-digital design, the course will address the application of ideas and procedures to digital games.",
            "offering": false
        },
        {
            "course_id": "OART-GT 2610",
            "course_name": "",
            "description": "OART-GT 2610\n\n   Game Development: Modding\n\nIn this course, students get practice building game play experiences through a series of short-cycle exercises. Students work in small teams to create and tune gaming experiences in a range of game genres, using the game engine that they will use in Game Studio (a semester-long project class). The course introduces students to production roles, playtesting, considerations of audience and platform, and other practical concerns in building games. \n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n\n1)\tDescribe typical work practice in game development.\n2)\tDis...\n\n      more description for OART-GT 2610 »\n\n      \n\n\n\nIn this course, students get practice building game play experiences through a series of short-cycle exercises. Students work in small teams to create and tune gaming experiences in a range of game genres, using the game engine that they will use in Game Studio (a semester-long project class). The course introduces students to production roles, playtesting, considerations of audience and platform, and other practical concerns in building games. \n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n\n1)\tDescribe typical work practice in game development.\n2)\tDiscuss his/her experience in producing short gameplay experiences using a game engine.\n3)\tDemonstrate competency in game production through a series of exercises. \n4)\tWork with a game engine, and understand the basics of how to build a game in the engine.\n\n      less description for OART-GT 2610 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2611",
            "course_name": "",
            "description": "OART-GT 2611\n\n   Advanced Topics in Game Studies\n\nAdvanced Video Game Studies is a research-focused course that examines methodological and foundational issues in the study of video games. In addition, a current topic relating to video game culture, design, or theory will be explored every semester. The class is thereby focused on allowing students to actively participate in the development of video game theory, with specific attention to how video game studies evolve as a theoretical field, and how it interacts with changes in the design and culture of video games.\n\nNote: In this syllabus, the current topic is \"gamification\" – the use of g...\n\n      more description for OART-GT 2611 »\n\n      \n\n\n\nAdvanced Video Game Studies is a research-focused course that examines methodological and foundational issues in the study of video games. In addition, a current topic relating to video game culture, design, or theory will be explored every semester. The class is thereby focused on allowing students to actively participate in the development of video game theory, with specific attention to how video game studies evolve as a theoretical field, and how it interacts with changes in the design and culture of video games.\n\nNote: In this syllabus, the current topic is \"gamification\" – the use of game design in non-game contexts such as teaching, politics, or business. Every semester will explore a different current topic.\n\nCOURSE OBJECTIVES\nAt the completion of this course, the student will be able to:\n•\tTo understand the foundational discussions and questions behind the current state of video game theory.\n•\tTo develop new theory applicable to new developments in video game design/culture.\n•\tTo apply new perspectives on existing theoretical discussions in video game studies.\n•\tTo prepare to submit papers to conferences and/or write reports on game issues.\n\n      less description for OART-GT 2611 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2612",
            "course_name": "",
            "description": "OART-GT 2612\n\n   Game Development: Project Studio\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the clo...\n\n      more description for OART-GT 2612 »\n\n      \n\n\n\nThis course reflects the various skills and disciplines that are brought together in modern game development: game design, programming, visual art, animation, sound design, and writing. The workshop will situate these disciplines within a larger context of game literacy and a historical and critical understanding of games as cultural objects. Classroom lectures and lab time will all be used to bring these different educational vectors together into a coherent whole; the workshop will be organized around a single, long-term, hands-on, game creation project. Working in small groups under the close supervision of instructors, students will collaborate on the creation of a playable game. As a creative constraint to help inspire them and guide their designs, the students will be given a theme to express in their game projects.\n\n      less description for OART-GT 2612 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2702",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5870",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-13",
                    "time": "Tue 6.20 PM - 9.20 PM",
                    "open": true,
                    "professor": "Slesin, Aviva"
                }
            ],
            "course_name": "",
            "description": "OART-GT 2702\n\n   Master Class in Documentary\n\nThis course, while not a production class, is designed to give students the opportunity to learn each stage of the documentary filmmaking process from the best working professionals in their field. Each week we will watch a documentary and meet someone who had a pivotal role in the making of that documentary. Our guests will include producers, directors, cinematographers, sound engineers, editors, writers, film composers and sound mixers. These professionals will share their experience and expertise with the class and answer questions about their work thereby providing a foundation of insight ...\n\n      more description for OART-GT 2702 »\n\n      \n\n\n\nThis course, while not a production class, is designed to give students the opportunity to learn each stage of the documentary filmmaking process from the best working professionals in their field. Each week we will watch a documentary and meet someone who had a pivotal role in the making of that documentary. Our guests will include producers, directors, cinematographers, sound engineers, editors, writers, film composers and sound mixers. These professionals will share their experience and expertise with the class and answer questions about their work thereby providing a foundation of insight into the decisions, tools and skills that go into the making of good documentaries. Class discussions will explore the creative and technical decisions involved in the making the film.\n\n      less description for OART-GT 2702 «",
            "offering": true
        },
        {
            "course_id": "OART-GT 2705",
            "course_name": "",
            "description": "OART-GT 2705\n\n   Through the Documentary Lens: Civil Rights\n\nThis course is designed for students with an interest in exploring the Civil Rights Movement of 20th-century America through viewing and discussing documentaries. While the struggle for civil rights began early in American history, the course mostly focuses on the black Civil Rights movement with an emphasis on the period from 1954 through 1966. By focusing on this time period, which was reported and chronicled by the television/film media, the course covers different perspectives as well as provides insights about both the subject matter contained in the films and the techniques and skills of...\n\n      more description for OART-GT 2705 »\n\n      \n\n\n\nThis course is designed for students with an interest in exploring the Civil Rights Movement of 20th-century America through viewing and discussing documentaries. While the struggle for civil rights began early in American history, the course mostly focuses on the black Civil Rights movement with an emphasis on the period from 1954 through 1966. By focusing on this time period, which was reported and chronicled by the television/film media, the course covers different perspectives as well as provides insights about both the subject matter contained in the films and the techniques and skills of good documentary filmmaking. Through weekly screenings of films, class discussions, and invited guest speakers, students learn about the evolution of the documentary genre as a means of better understanding history, and students gain knowledge about the historical/political/cultural milestones and the heroes of the movement.\n\n      less description for OART-GT 2705 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2706",
            "course_name": "Through the Documentary Lens: Contemporary Art",
            "description": "OART-GT 2706 Through the Documentary Lens: Contemporary Art \nThis course explores contemporary fine artists and their work through documentary film. The course covers a variety of perspectives pertaining to both the art world and the techniques and skills of documentary filmmaking. Through weekly screenings of films, class discussions, a few invited guest filmmakers and several visits to museums/galleries, students will explore the evolution of the documentary genre as a means of better understanding art and a form of scholarship. The goal is to expose students to the work of contemporary artists and their creative process.",
            "offering": false
        },
        {
            "course_id": "OART-GT 2829",
            "course_name": "",
            "description": "OART-GT 2829\n\n   Poetics of Witnessing\n\nToday, many documentarians consider themselves working within a well-defined human rights framework where images and film are used to raise awareness about social injustice. On the far edge of this movement, however, there are writers, photographers and filmmakers whose work calls attention to the traditional documentary ethics of bearing witness but whose modes of representation blur the lines between fact and fiction. This body of work is more open-ended to interpretation and multiple readings, which also include more personal themes such as loss and melancholy, the ephemeral nature of time ...\n\n      more description for OART-GT 2829 »\n\n      \n\n\n\nToday, many documentarians consider themselves working within a well-defined human rights framework where images and film are used to raise awareness about social injustice. On the far edge of this movement, however, there are writers, photographers and filmmakers whose work calls attention to the traditional documentary ethics of bearing witness but whose modes of representation blur the lines between fact and fiction. This body of work is more open-ended to interpretation and multiple readings, which also include more personal themes such as loss and melancholy, the ephemeral nature of time and memory, nostalgia and change.\n \nWe will study several different kinds of visual poetics such as combining documentary photos with literature, artists working with archives and found images, the personal essay film, ethnographic poetics, photo reportage and new media visual storytelling, mixed media and public projections. Some of the writers and artists we will study include Alfredo Jaar, W.G. Sebald, Chris Marker, Christian Boltanski, Forough Farrokhzad, Susan Sontag, Marcelo Brodsky, Roland Barthes, Miguel Rio Branco, Alexander Sokurov, Lorna Simpson, Jean Rouch, Susan Meiselas, Jonas Mekas.\n\n      less description for OART-GT 2829 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2832",
            "course_name": "",
            "description": "OART-GT 2832\n\n   Contemporary Cuba: Art, Politics, History, ideas\n\nThe course will focus on the development of different artistic media over five decades of Cuba’s contemporary history and consider how Cuban works of art reflect the complexity of the country’s history, culture and changing political situations. Beginning with photography from the 1960’s that recorded the triumph of the Revolution in 1959, we will analyze the history of the post-revolutionary era,\nfocusing particularly on the fusion of propaganda and art to construct iconic images, such as the famous photo of Che Guevara by Alberto Korda. We will study the impact of Cuban cultural policy dicta...\n\n      more description for OART-GT 2832 »\n\n      \n\n\n\nThe course will focus on the development of different artistic media over five decades of Cuba’s contemporary history and consider how Cuban works of art reflect the complexity of the country’s history, culture and changing political situations. Beginning with photography from the 1960’s that recorded the triumph of the Revolution in 1959, we will analyze the history of the post-revolutionary era,\nfocusing particularly on the fusion of propaganda and art to construct iconic images, such as the famous photo of Che Guevara by Alberto Korda. We will study the impact of Cuban cultural policy dictated by Fidel Castro in 1961 and in 1970 through documents of the period, which determined the course of Cuban\narts for decades. We will continue with a survey of the visual arts on the island and consider how they constituted highly sophisticated interpretations of the always changing reality, whether in painting of the 1970’s and 80’s or installation practice of the 1990’s. Classic documentaries and films by prestigious Cuban filmmakers (Santiago Alvarez and Tomás Gutiérrez Alea) will be reviewed and analyzed, and we will conclude with an analysis of the most recent artistic expressions: Cuban hip-hop music and the edgy video works of Ernesto Oroza, Henry Eric Hernández, and other young artists. In this most recent work, political criticism, Cuban history and deconstructive techniques collide, reflecting the multiple layers of Cuban culture and its continuing development today. The course will include visits to the Center of Cuban Studies and to The 8th Floor Gallery in New York to discuss Cuban artworks in view.\n\n      less description for OART-GT 2832 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2916",
            "course_name": "",
            "description": "OART-GT 2916\n\n   Acting for Stage Screen Open Arts Acting Studio\n\nActing for Stage and Screen is the Open Arts Studio at NYU’s Tisch School of the Arts. It is designed for a select, diverse student body, ready to challenge and stretch the physical and emotional instrument of the actor. The studio is dedicated to developing the actor's entire instrument-the body, the voice, and the imagination. Training frees the actor, so that he/she is able to go with his instincts and impulses; out of the head and into the viscera. In scene study classes the student discovers the importance of text analysis and staying in the moment, and the need for selecting strong objec...\n\n      more description for OART-GT 2916 »\n\n      \n\n\n\nActing for Stage and Screen is the Open Arts Studio at NYU’s Tisch School of the Arts. It is designed for a select, diverse student body, ready to challenge and stretch the physical and emotional instrument of the actor. The studio is dedicated to developing the actor's entire instrument-the body, the voice, and the imagination. Training frees the actor, so that he/she is able to go with his instincts and impulses; out of the head and into the viscera. In scene study classes the student discovers the importance of text analysis and staying in the moment, and the need for selecting strong objectives, formidable obstacles, varied actions, and meaningful personalizations. The Alexander technique and teachings of Linklater is used in voice production. The movement component includes yoga, circus, and the teachings of Laban. Auditions are required; to set up an audition, email tisch.special.admissions@nyu.edu\n\n      less description for OART-GT 2916 «",
            "offering": false
        },
        {
            "course_id": "OART-GT 2925",
            "course_name": "",
            "description": "OART-GT 2925\n\n   Urban Arts Workshop: New York\n\nThis course will be composed of lectures, slide shows, screenings, readings, field trips, field assignments, written reactions, discussion and blogs, as well as visits from guest speakers and artists designed to expose students to the key concepts and fundamental theories of urban studies, public art and the urban-inspired works of many great artists and writers based in New York City. Each week another “form” of urban art will be investigated, including discussions about and encounters with street photography, graffiti, sculpture, installation art, dance, performance art, parkour (freestyle s...\n\n      more description for OART-GT 2925 »\n\n      \n\n\n\nThis course will be composed of lectures, slide shows, screenings, readings, field trips, field assignments, written reactions, discussion and blogs, as well as visits from guest speakers and artists designed to expose students to the key concepts and fundamental theories of urban studies, public art and the urban-inspired works of many great artists and writers based in New York City. Each week another “form” of urban art will be investigated, including discussions about and encounters with street photography, graffiti, sculpture, installation art, dance, performance art, parkour (freestyle street gymnastics), gorilla theater, art vandalism and underground art, urban sound projects, large-scale projections, poetry, essays and short stories with an aim to understand how such art forms came into being and how they express a distinctly urban message to the inhabitants and visitors of New York City. The instructor seeks to combine the critical and theoretical with the experiential and personal in order to lead students to a deeper and more fruitful relationship with their city, the arts and themselves.\n\n      less description for OART-GT 2925 «",
            "offering": false
        }
    ]
}