{
    "major_id": "PEACE-AD",
    "file": "./2015-2016/Peace_Studies_(PEACE-AD).html",
    "courses": [
        {
            "course_id": "PEACE-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13028",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 019",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Henry, Patrick"
                }
            ],
            "course_name": "",
            "description": "PEACE-AD  101\n\n   Foundations of Peace: Psychological Perspectives\n\nThis class will introduce students to the foundational theoretical approaches to peace from a psychological perspective. The class will focus on the study of conflict, aggression, civil unrest, violence, and terrorism, based on the idea that understanding the psychological roots of conflict is essential for understanding the means toward achieving peace within and between individuals, and achieving cooperation within and between groups. The class will consider the motives behind conflict, the origins of collective action, perceptions of justice in fueling conflict, the role of emotions, includ...\n\n      more description for PEACE-AD  101 »\n\n      \n\n\n\nThis class will introduce students to the foundational theoretical approaches to peace from a psychological perspective. The class will focus on the study of conflict, aggression, civil unrest, violence, and terrorism, based on the idea that understanding the psychological roots of conflict is essential for understanding the means toward achieving peace within and between individuals, and achieving cooperation within and between groups. The class will consider the motives behind conflict, the origins of collective action, perceptions of justice in fueling conflict, the role of emotions, including anger and empathy, the role of ideologies and morality systems, the rationalization and justification of aggression and inequality, and the psychological consequences of conflict. The class will consider evidence relevant to Eastern philosophical approaches to peace and conflict, such as meditation, Buddhism, etc., including their neuropsychological and physiological markers. Finally, the class will critically evaluate attempts at understanding and reducing terrorism, as well as other conflict resolution strategies from a psychological perspective. In general, students will be able to integrate a range of perspectives to evaluate the current state of the science of peace psychology, including its strengths and shortcomings.\n\n      less description for PEACE-AD  101 «",
            "offering": true
        },
        {
            "course_id": "PEACE-AD 102",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17899",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP E050",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Chacon, Mario"
                }
            ],
            "course_name": "",
            "description": "PEACE-AD  102\n\n   Foundations of Peace: Economic and Political Perspectives\n\nThis course surveys the political science and economics literature on social conflict and peacebuilding. The class will focus on major themes and issues such as the determinants of peaceful cooperation and sustainable peace; the root causes of armed conflict; the determinants of ethnic conflict; the political economy of civil wars; the variables affecting the duration and termination of wars; the phenomenon of different forms of political violence-including protests, riots, military coups, political assassinations, and terrorism; and the politics and economics of peacebuilding. The course is h...\n\n      more description for PEACE-AD  102 »\n\n      \n\n\n\nThis course surveys the political science and economics literature on social conflict and peacebuilding. The class will focus on major themes and issues such as the determinants of peaceful cooperation and sustainable peace; the root causes of armed conflict; the determinants of ethnic conflict; the political economy of civil wars; the variables affecting the duration and termination of wars; the phenomenon of different forms of political violence-including protests, riots, military coups, political assassinations, and terrorism; and the politics and economics of peacebuilding. The course is highly interdisciplinary and will cover a wide variety of cases from a comparative perspective.\n\n      less description for PEACE-AD  102 «",
            "offering": true
        },
        {
            "course_id": "PEACE-AD 120",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13029",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 019",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Abdulkadir, Rahma"
                }
            ],
            "course_name": "",
            "description": "PEACE-AD  120\n\n   Transitional Justice\n\nHow do societies emerging from authoritarian rule and intra-state armed conflict deal with past mass human rights violations? In their attempts to address past gross human rights violations, what types of justice mechanisms do such societies employ? Ruti Teitel first coined the term transitional justice in her book Transitional Justice (2000). Since then the term has circulated widely in scholarly and policy communities to describe a set of mechanisms and approaches to address past violence. This course analyzes the problems facing societies with past human rights violations, the numerous opti...\n\n      more description for PEACE-AD  120 »\n\n      \n\n\n\nHow do societies emerging from authoritarian rule and intra-state armed conflict deal with past mass human rights violations? In their attempts to address past gross human rights violations, what types of justice mechanisms do such societies employ? Ruti Teitel first coined the term transitional justice in her book Transitional Justice (2000). Since then the term has circulated widely in scholarly and policy communities to describe a set of mechanisms and approaches to address past violence. This course analyzes the problems facing societies with past human rights violations, the numerous options they have at their disposal to engage these abuses and the political, economic, legal and ethical ramifications of each choice. The course is organized into two sections. The first section introduces theoretical approaches to study of transitional justice. The second section analyzes the most frequently used mechanisms, focusing on their potency in advancing democratization and reconciliation. Case studies include: the prosecutions of Nuremberg and Tokyo; the international tribunals of the former Yugoslavia and Rwanda; the hybrid tribunals of Timor Leste, Cambodia, and Sierra Leone.\n\n      less description for PEACE-AD  120 «",
            "offering": true
        },
        {
            "course_id": "PEACE-AD 121",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13030",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 019",
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Harsch, Michael"
                }
            ],
            "course_name": "",
            "description": "PEACE-AD  121\n\n   International Organizations and Global Governance\n\nThe creation of international organizations (IOs) is a crucial moment in historical efforts at structuring and civilizing international affairs. Organizations such as the League of Nations and the UN have been at the heart of attempts to create a peaceful international order. In today’s international system, international organizations perform a huge variety of challenging tasks: they provide safeguards against the military use of nuclear technology, destroy chemical weapons, convict war criminals, assist developing countries with loans, and deliver food to populations in need. This course wil...\n\n      more description for PEACE-AD  121 »\n\n      \n\n\n\nThe creation of international organizations (IOs) is a crucial moment in historical efforts at structuring and civilizing international affairs. Organizations such as the League of Nations and the UN have been at the heart of attempts to create a peaceful international order. In today’s international system, international organizations perform a huge variety of challenging tasks: they provide safeguards against the military use of nuclear technology, destroy chemical weapons, convict war criminals, assist developing countries with loans, and deliver food to populations in need. This course will examine international organizations’ origin, logic and impact within both global and local contexts. It will provide students with a better understanding of both the theory and the practice of international cooperation and global governance. Specifically, it will study why states cooperate in IOs, how member states and international bureaucracies interact, and how IOs contribute to peaceful conflict management and human development in today’s international system.\n\n      less description for PEACE-AD  121 «",
            "offering": true
        },
        {
            "course_id": "PEACE-AD 122",
            "course_name": "J Truth, Reconciliation and Justice in Post-Conflict Situations",
            "description": "PEACE-AD  122J Truth, Reconciliation and Justice in Post-Conflict Situations \nThe focus will primarily be on the experience of the Truth and Reconciliation Commission in South Africa, why and how it came into being, how it was structured, how it functioned and its impact on the nation and national development. Sub-themes will include an analysis of four kinds of truth, the problem of denialism, and the difference and relation between restorative and punitive justice.  The course will offer comparative reflections on how similar issues have been dealt with in Northern Ireland, Colombia and Sri Lanka.",
            "offering": false
        },
        {
            "course_id": "PEACE-AD 123",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17900",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SOC_SCI 019",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Harsch, Michael"
                }
            ],
            "course_name": "",
            "description": "PEACE-AD  123\n\n   Peacebuilding\n\nThis course will help students build an analytical understanding of the potentials and pitfalls of international intervention in conflict-affected societies. Postwar peacebuilding has become a growing, yet highly controversial international activity. The experiences with attempts to promote peace and increase state capacity are sobering, in particular in terrains such as Somalia, the DRC and Afghanistan. How can the international community promote peace in these hard cases? What are the flaws of the existing “best practices” approach to peacebuilding and what are promising alternatives to it? ...\n\n      more description for PEACE-AD  123 »\n\n      \n\n\n\nThis course will help students build an analytical understanding of the potentials and pitfalls of international intervention in conflict-affected societies. Postwar peacebuilding has become a growing, yet highly controversial international activity. The experiences with attempts to promote peace and increase state capacity are sobering, in particular in terrains such as Somalia, the DRC and Afghanistan. How can the international community promote peace in these hard cases? What are the flaws of the existing “best practices” approach to peacebuilding and what are promising alternatives to it? The course will examine the current debates on peacebuilding and will invite practitioners from international organizations to discuss their approach to promoting peace in some of the world’s most challenging regions.\n\n      less description for PEACE-AD  123 «",
            "offering": true
        },
        {
            "course_id": "PEACE-AD 124",
            "course_name": "",
            "description": "PEACE-AD  124\n\n   Causes and Prevention of Violence\n\nThis course will study violence as a problem in public health and preventive medicine – indeed, the most important problem, since it could potentially, in this age of nuclear weapons, cause the self-extinction of the human species.  To do so, we will review writings that illuminate and illustrate the causes and prevention of violence, including wars and civil wars, inter-ethnic violence, revolutions, genocide, terrorism and structural violence.  We will study how the moral emotions, shame and guilt, can motivate as well as inhibit both group and individual violence.  We will also examine cogni...\n\n      more description for PEACE-AD  124 »\n\n      \n\n\n\nThis course will study violence as a problem in public health and preventive medicine – indeed, the most important problem, since it could potentially, in this age of nuclear weapons, cause the self-extinction of the human species.  To do so, we will review writings that illuminate and illustrate the causes and prevention of violence, including wars and civil wars, inter-ethnic violence, revolutions, genocide, terrorism and structural violence.  We will study how the moral emotions, shame and guilt, can motivate as well as inhibit both group and individual violence.  We will also examine cognitive causes of violence, including the backlash, in the form of “political religions” – Nationalism, Imperialism, Totalitarianism, and most recently, Apocalyptic Fundamentalism -- against the modern scientific world-view and its challenge to the credibility of the traditional sources of moral and political authority.  Readings will include the Bible and works by Thucydides, Shakespeare, Buchner, Nietzsche, Dostoevsky, Joseph Conrad, Einstein, Freud, Kafka, Adorno, Frantz Fanon and Hannah Arendt.\n\n      less description for PEACE-AD  124 «",
            "offering": false
        }
    ]
}