{
    "major_id": "PHIL-AD",
    "file": "./2015-2016/Philosophy_(PHIL-AD).html",
    "courses": [
        {
            "course_id": "PHIL-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12798",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "COMP_RES 003",
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Silverstein, Matthew"
                }
            ],
            "course_name": "Central Problems in Philosophy",
            "description": "PHIL-AD  101 Central Problems in Philosophy \nAn introduction to the discipline of philosophy by way of several central philosophical problems. Topics may include free will, the nature of the self, skepticism and the possibility of knowledge, the ethics of punishment, the existence of God, the requirements of justice, the relation between our minds and our bodies, and the nature of moral principles.",
            "offering": true
        },
        {
            "course_id": "PHIL-AD 111",
            "course_name": "Minds and Machines",
            "description": "PHIL-AD  111 Minds and Machines \nAn introduction to philosophy through the study of issues at the intersection of philosophy and cognitive science. We will focus on the conflict between computational and biological approaches to understanding the mind. Topics will include whether a machine could think, the Turing Test, mental imagery, the possibility of artificial intelligence, the reduction of the mind to the brain, and the function of consciousness.",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 112",
            "course_name": "",
            "description": "PHIL-AD  112\n\n   Life and Death\n\nWe are all going to die. This course examines a number of puzzles that arise once we start to think about our mortality. Is death bad for us? How could it be, when we will no longer be around to be the subject of the harm? Is death any worse for us than our nonexistence was prior to our birth? Is it bad not to be born at all? If so, for whom is it bad? Are we, in some sense, immortal? Is immortality even desirable? What is the appropriate attitude toward death? Can suicide be moral or rational? Is there any sense in which we could survive our deaths? How should the knowledge that we are going ...\n\n      more description for PHIL-AD  112 »\n\n      \n\n\n\nWe are all going to die. This course examines a number of puzzles that arise once we start to think about our mortality. Is death bad for us? How could it be, when we will no longer be around to be the subject of the harm? Is death any worse for us than our nonexistence was prior to our birth? Is it bad not to be born at all? If so, for whom is it bad? Are we, in some sense, immortal? Is immortality even desirable? What is the appropriate attitude toward death? Can suicide be moral or rational? Is there any sense in which we could survive our deaths? How should the knowledge that we are going to die affect the way we should live our lives?\n\n      less description for PHIL-AD  112 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 113",
            "course_name": "",
            "description": "PHIL-AD  113\n\n   Freedom and Responsibility\n\nDo we have free will? Can we think of ourselves as responsible agents while also regarding ourselves as part of the natural order? Some philosophers have argued that if our actions are causally determined, then freedom of the will is impossible. Others have argued that freedom does not depend on the truth or falsity of causal determinism. Is free will possible in a world where every event is causally determined? Are there different kinds of freedom? If so, are all kinds of freedom equally worth having? Must we act freely in order to be responsible for our actions? Do the social institutions of...\n\n      more description for PHIL-AD  113 »\n\n      \n\n\n\nDo we have free will? Can we think of ourselves as responsible agents while also regarding ourselves as part of the natural order? Some philosophers have argued that if our actions are causally determined, then freedom of the will is impossible. Others have argued that freedom does not depend on the truth or falsity of causal determinism. Is free will possible in a world where every event is causally determined? Are there different kinds of freedom? If so, are all kinds of freedom equally worth having? Must we act freely in order to be responsible for our actions? Do the social institutions of reward and punishment depend for their justification upon the existence of responsible, free agents? We will discuss the nature of persons, action, freedom, and responsibility in an effort to answer these questions.\n\n      less description for PHIL-AD  113 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 116",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12941",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W006",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Kukkonen, Kalle"
                }
            ],
            "course_name": "",
            "description": "PHIL-AD  116\n\n   Reason and Religion\n\nAn examination of various questions that arise in philosophical discussions of religion, such as: Can philosophical reflection help us to prove the existence of God or clarify such puzzling matters as God's relationship to time? How could a benevolent and omnipotent God permit the existence of evil and misfortune? Is it ever rational to form beliefs about matters which transcend the realm of the empirical? Is the concept of a specifically religious experience a coherent one? If not, can religious beliefs be supported by other means? Alternatively, is the entire project of evaluating religious ...\n\n      more description for PHIL-AD  116 »\n\n      \n\n\n\nAn examination of various questions that arise in philosophical discussions of religion, such as: Can philosophical reflection help us to prove the existence of God or clarify such puzzling matters as God's relationship to time? How could a benevolent and omnipotent God permit the existence of evil and misfortune? Is it ever rational to form beliefs about matters which transcend the realm of the empirical? Is the concept of a specifically religious experience a coherent one? If not, can religious beliefs be supported by other means? Alternatively, is the entire project of evaluating religious discourse as a set of claims about transcendent realities misguided? What should we make of the alternative explanations of religion and religious phenomena offered by philosophers from al-Farabi to Marx and Nietzsche?\n\n      less description for PHIL-AD  116 «",
            "offering": true
        },
        {
            "course_id": "PHIL-AD 118",
            "course_name": "Fear of Knowledge",
            "description": "PHIL-AD  118 Fear of Knowledge \nIt is often thought that knowledge is inherently valuable and that \"truth\" is an objective notion independent of social considerations. This course\nexamines various reasons we might have for holding these views and various challenges that have been raised against them. Why should we care about knowledge as long as our beliefs prove useful and efficacious? Is truth—and thus knowledge—more accurately understood as a culturally relative notion, so that what’s true for you might not be true for me? It is ever rational to let purely pragmatic reasons for belief trump.",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 119",
            "course_name": "",
            "description": "PHIL-AD  119\n\n   Global Ethics\n\nThis course aims to accomplish two things. The first is to introduce three broad traditions of normative thinking about social issues from around the globe: a Confucian tradition, one based in Islamic legal traditions, and one derived from European liberalism. The second is to address three current areas of normative debate: about global economic inequality, about gender justice, and about human rights. We shall explore these ethical controversies against the background of the three broad traditions. Our aim will be to understand some of the differences of approach that shape the global conver...\n\n      more description for PHIL-AD  119 »\n\n      \n\n\n\nThis course aims to accomplish two things. The first is to introduce three broad traditions of normative thinking about social issues from around the globe: a Confucian tradition, one based in Islamic legal traditions, and one derived from European liberalism. The second is to address three current areas of normative debate: about global economic inequality, about gender justice, and about human rights. We shall explore these ethical controversies against the background of the three broad traditions. Our aim will be to understand some of the differences of approach that shape the global conversation about these issues. As part of NYU’s Global Network initiative this course is being offered simultaneously in Abu Dhabi and New York. Students will collaborate with students from their sister campus throughout the semester.\n\n      less description for PHIL-AD  119 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 180",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17227",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 016",
                    "time": "Mon,Wed 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Rabin, Gabriel"
                }
            ],
            "course_name": "",
            "description": "PHIL-AD  180\n\n   Introduction to Logic\n\nAll philosophers are wise, and Socrates is a philosopher. Therefore, Socrates is wise. Our topic is the nature of this “therefore.” Logic is the science of reasoning—the study of the ways in which statements support or contradict one another.\nIn this course, we investigate and expose the logical structure of everyday language and see how the correctness or incorrectness of reasoning depends\non this structure. To aid us, we develop a formal language that makes this underlying structure more perspicuous. With this formal language at\nour disposal, we are able to construct elaborate proofs and exp...\n\n      more description for PHIL-AD  180 »\n\n      \n\n\n\nAll philosophers are wise, and Socrates is a philosopher. Therefore, Socrates is wise. Our topic is the nature of this “therefore.” Logic is the science of reasoning—the study of the ways in which statements support or contradict one another.\nIn this course, we investigate and expose the logical structure of everyday language and see how the correctness or incorrectness of reasoning depends\non this structure. To aid us, we develop a formal language that makes this underlying structure more perspicuous. With this formal language at\nour disposal, we are able to construct elaborate proofs and explore the logical relations among the various steps of complex arguments.\n\n      less description for PHIL-AD  180 «",
            "offering": true
        },
        {
            "course_id": "PHIL-AD 220",
            "course_name": "",
            "description": "PHIL-AD  220\n\n   Ancient Mediterranean Philosophy\n\nAn examination of the origins of Western philosophical thought in ancient Greece and Rome, with a special focus on the views of Plato and Aristotle. Through their work, we will grapple with a range of pressing philosophical questions, including: Is happiness more than a subjective state of consciousness? Is death harmful? Do we have free will? Do we have obligations to others that override the pursuit of our own self-interest? What is the relation between the mind (or the soul) and the body? Since most of the philosophers we will be studying thought that philosophy must be systematic in its ap...\n\n      more description for PHIL-AD  220 »\n\n      \n\n\n\nAn examination of the origins of Western philosophical thought in ancient Greece and Rome, with a special focus on the views of Plato and Aristotle. Through their work, we will grapple with a range of pressing philosophical questions, including: Is happiness more than a subjective state of consciousness? Is death harmful? Do we have free will? Do we have obligations to others that override the pursuit of our own self-interest? What is the relation between the mind (or the soul) and the body? Since most of the philosophers we will be studying thought that philosophy must be systematic in its approach, we will also try to evaluate the strengths and weaknesses of this kind of approach to philosophical questions.\n\n      less description for PHIL-AD  220 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 221",
            "course_name": "X",
            "description": "PHIL-AD  221X\n\n   Classical Arabic Philosophy\n\nAn introduction to Arabic philosophy in the form of falsafa, as developed and debated by Muslims, Christians, and Jews from the eighth to the twelfth century. The Arabic authors were heirs to the entire Greek philosophical legacy and took it in a number of important and innovative directions, some of which have remained with us to the present day. Topics broached include knowledge, certitude, and the rules of rational debate; the metaphysical distinction between essence and existence and the attendant notions of necessity and contingency; the medieval analysis of the soul, the psychic facultie...\n\n      more description for PHIL-AD  221X »\n\n      \n\n\n\nAn introduction to Arabic philosophy in the form of falsafa, as developed and debated by Muslims, Christians, and Jews from the eighth to the twelfth century. The Arabic authors were heirs to the entire Greek philosophical legacy and took it in a number of important and innovative directions, some of which have remained with us to the present day. Topics broached include knowledge, certitude, and the rules of rational debate; the metaphysical distinction between essence and existence and the attendant notions of necessity and contingency; the medieval analysis of the soul, the psychic faculties, and moral psychology; and the role of religion in society and the analysis of religious claims within philosophy.\n\n      less description for PHIL-AD  221X «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 223",
            "course_name": "",
            "description": "PHIL-AD  223\n\n   Classical Indian Philosophy\n\nAn exploration of the thought of major philosophers from the Indian subcontinent, beginning with the ancients in the fifth century BCE and concluding with thinkers on the eve of colonialism in the eighteenth century CE. Indian philosophy has been and continues to be a major world philosophy. The reach of its ideas has been vast, both historically and geographically, spanning the philosophies of Buddhism, Jainism, Islam, and Hinduism, as well as the philosophy of law, of medicine, of mathematics, and of politics and society. It is most strongly associated with wide-ranging discussions in the ph...\n\n      more description for PHIL-AD  223 »\n\n      \n\n\n\nAn exploration of the thought of major philosophers from the Indian subcontinent, beginning with the ancients in the fifth century BCE and concluding with thinkers on the eve of colonialism in the eighteenth century CE. Indian philosophy has been and continues to be a major world philosophy. The reach of its ideas has been vast, both historically and geographically, spanning the philosophies of Buddhism, Jainism, Islam, and Hinduism, as well as the philosophy of law, of medicine, of mathematics, and of politics and society. It is most strongly associated with wide-ranging discussions in the philosophy of mind, the study of language, epistemology, and metaphysics. The aim of the course is to present a balanced and impartial picture of the richness, diversity, and depth of philosophy in this region.\n\n      less description for PHIL-AD  223 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 224",
            "course_name": "",
            "description": "PHIL-AD  224\n\n   Early Modern European Philosophy\n\nA survey of European philosophy in the seventeenth and eighteenth centuries—one of the most exciting and formative periods in the history of Western philosophy. We focus on six philosophers: René Descartes, Gottfried Wilhelm Leibniz, John Locke, George Berkeley, David Hume, and Immanuel Kant. Through their writings, we trace and study philosophical arguments and debates concerning the possibility and extent of our knowledge of the external world, the nature of the self, the nature of substance and causation, the existence of God, the nature of perception, and the relation between our minds and...\n\n      more description for PHIL-AD  224 »\n\n      \n\n\n\nA survey of European philosophy in the seventeenth and eighteenth centuries—one of the most exciting and formative periods in the history of Western philosophy. We focus on six philosophers: René Descartes, Gottfried Wilhelm Leibniz, John Locke, George Berkeley, David Hume, and Immanuel Kant. Through their writings, we trace and study philosophical arguments and debates concerning the possibility and extent of our knowledge of the external world, the nature of the self, the nature of substance and causation, the existence of God, the nature of perception, and the relation between our minds and our bodies.\n\n      less description for PHIL-AD  224 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 225",
            "course_name": "",
            "description": "PHIL-AD  225\n\n   Nineteenth- and Twentieth-Century European Philosophy\n\nA survey of philosophy on the European continent in the nineteenth and twentieth centuries, beginning with German Idealism and proceeding through Marxism, existentialism, phenomenology, critical theory, and structuralism. This course will introduce you to many of the major thinkers of this period, including Hegel, Marx, Kierkegaard, Nietzsche, Husserl, Heidegger, Arendt, Sartre, Horkheimer, Adorno, and Foucault. These philosophers stand in the background of a great deal of contemporary political, social, and literary theory: their reactions to and criticisms of the Enlightenment’s celebration ...\n\n      more description for PHIL-AD  225 »\n\n      \n\n\n\nA survey of philosophy on the European continent in the nineteenth and twentieth centuries, beginning with German Idealism and proceeding through Marxism, existentialism, phenomenology, critical theory, and structuralism. This course will introduce you to many of the major thinkers of this period, including Hegel, Marx, Kierkegaard, Nietzsche, Husserl, Heidegger, Arendt, Sartre, Horkheimer, Adorno, and Foucault. These philosophers stand in the background of a great deal of contemporary political, social, and literary theory: their reactions to and criticisms of the Enlightenment’s celebration of reason continue to challenge us.\n\n      less description for PHIL-AD  225 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 240",
            "course_name": "Epistemology",
            "description": "PHIL-AD  240 Epistemology \nEpistemology is the study of knowledge and rational belief. In this course we examine various central epistemological questions, including: What is knowledge, and how does it differ from belief? Can we have knowledge of anything outside our own minds, such as physical objects or other minds? Or is the skeptic’s attack on our commonplace claims to know unanswerable? What is the relation between knowledge and perception? Is it ever rational to believe in the absence of evidence?",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 241",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17792",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Mon,Wed 3.35 PM - 4.50 PM",
                    "open": true,
                    "professor": "Rabin, Gabriel"
                }
            ],
            "course_name": "Metaphysics",
            "description": "PHIL-AD  241 Metaphysics \nMetaphysics is the investigation of the nature of reality. In this course we wrestle with some of the most fundamental questions we are capable of posing, such as: What kinds of things exist? Are there minds or material bodies? What, for that matter, is existence? Is change illusory? What is truth? To what extent is reality independent of our thoughts about it? What is the difference between the possible and the actual? Are human actions free or causally determined? What is a person?",
            "offering": true
        },
        {
            "course_id": "PHIL-AD 242",
            "course_name": "",
            "description": "PHIL-AD  242\n\n   Philosophy of Language\n\n“Socrates was poisoned.” With those vocal sounds or marks on a page, I can make a claim about someone who lived in the distant past. How is that possible? How do our words manage to pick out or latch onto particular portions of reality, even ones with which we’ve never had any contact? How does language enable us to convey thoughts about everything from Abu Dhabi, to the hopes of a friend, to the stars beyond our galaxy? For that matter, what are the thoughts, or the meanings, that our words carry or communicate? We explore these and other philosophical questions about language through a readi...\n\n      more description for PHIL-AD  242 »\n\n      \n\n\n\n“Socrates was poisoned.” With those vocal sounds or marks on a page, I can make a claim about someone who lived in the distant past. How is that possible? How do our words manage to pick out or latch onto particular portions of reality, even ones with which we’ve never had any contact? How does language enable us to convey thoughts about everything from Abu Dhabi, to the hopes of a friend, to the stars beyond our galaxy? For that matter, what are the thoughts, or the meanings, that our words carry or communicate? We explore these and other philosophical questions about language through a reading of seminal works by twentieth-century thinkers.\n\n      less description for PHIL-AD  242 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 243",
            "course_name": "",
            "description": "PHIL-AD  243\n\n   Philosophy of Mind\n\nWhat is the mind, and what can philosophy tell us about it? How is the mind related to the brain? Are they identical? How can we know when something has a mind? Could a machine have a mind? Could a machine be conscious? What, for that matter, is consciousness? Can consciousness be reconciled with a scientific view of the world? How do our mental states and attitudes, whatever\nthey are, arise from activity in the brain and cause our actions? The rise of cognitive science has shed new light on many of these old questions. Can\nphilosophers and cognitive scientists learn from each other even as th...\n\n      more description for PHIL-AD  243 »\n\n      \n\n\n\nWhat is the mind, and what can philosophy tell us about it? How is the mind related to the brain? Are they identical? How can we know when something has a mind? Could a machine have a mind? Could a machine be conscious? What, for that matter, is consciousness? Can consciousness be reconciled with a scientific view of the world? How do our mental states and attitudes, whatever\nthey are, arise from activity in the brain and cause our actions? The rise of cognitive science has shed new light on many of these old questions. Can\nphilosophers and cognitive scientists learn from each other even as they approach the study of the mind in their different ways? We examine various\nanswers to these questions, drawing readings from classical and contemporary philosophy as well as from cognitive science.\n\n      less description for PHIL-AD  243 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 244",
            "course_name": "",
            "description": "PHIL-AD  244\n\n   Philosophy of Science\n\nScience is often taken to be a distinctly rational form of empirical inquiry. This course examines various questions concerning the nature and practice of science that arise from this widespread attitude. For example, scientific theories are often thought to be subject to empirical scrutiny in ways that other theories are not. To what extent is this belief well-founded? Is it rational to believe that our best scientific theories are even approximately true? What justifies the claim that\ndifferent types of evidence lend varying degrees of support to a particular theory, or that a single piece o...\n\n      more description for PHIL-AD  244 »\n\n      \n\n\n\nScience is often taken to be a distinctly rational form of empirical inquiry. This course examines various questions concerning the nature and practice of science that arise from this widespread attitude. For example, scientific theories are often thought to be subject to empirical scrutiny in ways that other theories are not. To what extent is this belief well-founded? Is it rational to believe that our best scientific theories are even approximately true? What justifies the claim that\ndifferent types of evidence lend varying degrees of support to a particular theory, or that a single piece of evidence supports one theory more than another? Similarly, it is often claimed that scientific theories provide us with “real” explanations of physical phenomena, whereas other theories aren’t “genuinely explanatory.” To what extent is this true? What exactly is a scientific explanation, and how is it different (if at all) from a mere prediction or mathematical derivation? Can false theories provide good explanations? Some familiarity with science would be helpful but is not required.\n\n      less description for PHIL-AD  244 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 260",
            "course_name": "",
            "description": "PHIL-AD  260\n\n   Ethics\n\nWhat are our most basic values? What are the ethical principles by which we should judge our actions, ourselves, and our lives? What is involved in living a good human life? How can we reconcile the demands of morality with the personal obligations that spring from friendships and other relationships?\n Do the ends ever justify the means? We will grapple with these and other questions as we explore three of the most influential theories in Western ethical philosophy: Aristotle’s ethics of virtue, Immanuel Kant’s moral rationalism, and John Stuart Mill’s utilitarianism. We will also encounter on...\n\n      more description for PHIL-AD  260 »\n\n      \n\n\n\nWhat are our most basic values? What are the ethical principles by which we should judge our actions, ourselves, and our lives? What is involved in living a good human life? How can we reconcile the demands of morality with the personal obligations that spring from friendships and other relationships?\n Do the ends ever justify the means? We will grapple with these and other questions as we explore three of the most influential theories in Western ethical philosophy: Aristotle’s ethics of virtue, Immanuel Kant’s moral rationalism, and John Stuart Mill’s utilitarianism. We will also encounter one of modern morality’s harshest critics: Friedrich Nietzsche.\n\n      less description for PHIL-AD  260 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 261",
            "course_name": "Applied Ethics",
            "description": "PHIL-AD  261 Applied Ethics \nTorture, abortion, taxes, physician-assisted suicide, terrorism. People disagree fiercely about the morality of these and countless other human concerns. What moral theories and concepts shape these debates? Can we use these debates to refine or evaluate those theories and concepts?  Is it possible to find common ground in shared ethical principles that will allow us to engage in rational debates rather than in disrespectful shouting matches (or worse)? These will be our guiding question as we investigate several contemporary moral controversies.",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 262",
            "course_name": "Medical Ethics",
            "description": "PHIL-AD  262 Medical Ethics \nAn examination of the pressing moral questions that arise in medical practice and research. Do we have a basic right to health care? Are euthanasia and physician-assisted suicide ever morally permissible? Do we have the right to decide the course of our medical treatment, or to determine the timing and manner of our own deaths? Do we have a right to privacy and confidentiality? Should we allow medical research that harms animals (or that makes use of human stem cells)? Are there compelling moral objections to genetic testing or genetic engineering?",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 263",
            "course_name": "",
            "description": "PHIL-AD  263\n\n   Aesthetics\n\nThis course addresses a number of questions that arise in philosophical discussions of the arts. What is art, and how do we evaluate it? Is there a standard of taste? Are there special aesthetic properties? Is there a special aesthetic attitude or a special aesthetic experience? Does it matter for the aesthetic value of a supposed work of art if it is a forgery? What is beauty, and how is it related to the sublime? What is the relation between aesthetic and moral values? Can there be great works of art that are morally bad? Why do we feel for fictional characters? Why do we enjoy horror films?...\n\n      more description for PHIL-AD  263 »\n\n      \n\n\n\nThis course addresses a number of questions that arise in philosophical discussions of the arts. What is art, and how do we evaluate it? Is there a standard of taste? Are there special aesthetic properties? Is there a special aesthetic attitude or a special aesthetic experience? Does it matter for the aesthetic value of a supposed work of art if it is a forgery? What is beauty, and how is it related to the sublime? What is the relation between aesthetic and moral values? Can there be great works of art that are morally bad? Why do we feel for fictional characters? Why do we enjoy horror films? How and what do pictures represent? How does music express emotions? What is it to give an ‘authentic’ performance of a piece of music? How does our aesthetic appreciation of art differ from our aesthetic appreciation of nature?\n\n      less description for PHIL-AD  263 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 264",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "17228",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "HUMANITIES 016",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Mitsis, Phillip"
                }
            ],
            "course_name": "",
            "description": "PHIL-AD  264\n\n   Political Philosophy\n\nThe state has authority over its citizens: if you fail to comply with its dictates, you can be punished. What justifies the state’s exercise of such authority? Could it be justified because we have at least implicitly given our consent to it? This is only one central question in political philosophy. Others include: What form of government best serves the people? Who are the people, anyway? What is justice? Do we have fundamental rights to property or to free expression? If so, what is the source of these rights? What is freedom, and are there different kinds? What is the proper relation betwe...\n\n      more description for PHIL-AD  264 »\n\n      \n\n\n\nThe state has authority over its citizens: if you fail to comply with its dictates, you can be punished. What justifies the state’s exercise of such authority? Could it be justified because we have at least implicitly given our consent to it? This is only one central question in political philosophy. Others include: What form of government best serves the people? Who are the people, anyway? What is justice? Do we have fundamental rights to property or to free expression? If so, what is the source of these rights? What is freedom, and are there different kinds? What is the proper relation between freedom and equality? Is equality\ndesirable? Can we live in a genuine community that is not a community of equals? As we grapple with such questions, we draw on writings from\nboth classical and contemporary philosophers.\n\n      less description for PHIL-AD  264 «",
            "offering": true
        },
        {
            "course_id": "PHIL-AD 280",
            "course_name": "",
            "description": "PHIL-AD  280\n\n   Advanced Logic\n\nAn advanced investigation of various aspects of symbolic logic and reasoning, with an emphasis on subjects of philosophical relevance. Specific topics vary by semester, but are generally drawn from the following: modal logic (the study of reasoning about necessity, possibility, counterfactuals, and tense); metalogic (the study of provability, completeness, and other higher-order properties of logical systems); nonclassical logic (the study of three-valued logical systems, free logics, and the logic of relevance); and mathematical logic (the study of logical systems intended to model arithmetic...\n\n      more description for PHIL-AD  280 »\n\n      \n\n\n\nAn advanced investigation of various aspects of symbolic logic and reasoning, with an emphasis on subjects of philosophical relevance. Specific topics vary by semester, but are generally drawn from the following: modal logic (the study of reasoning about necessity, possibility, counterfactuals, and tense); metalogic (the study of provability, completeness, and other higher-order properties of logical systems); nonclassical logic (the study of three-valued logical systems, free logics, and the logic of relevance); and mathematical logic (the study of logical systems intended to model arithmetic reasoning).\n\n      less description for PHIL-AD  280 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 320",
            "course_name": "Topics in the History of Philosophy",
            "description": "PHIL-AD  320 Topics in the History of Philosophy \nAn advanced seminar that involves the careful study of some particular movement, philosopher, or issue in the history of philosophy. Examples: German Idealism, Ibn Rushd, Kant, theories of causation in Indian philosophy, Aristotle.",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 321",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "19697",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "HUMANITIES 012",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Kukkonen, Kalle"
                }
            ],
            "course_name": "",
            "description": "PHIL-AD  321\n\n   Aristotle\n\nAristotle is perhaps the single most celebrated and influential thinker in the history of philosophy. He is the founding father of both logic and biology, and there is nary a field of inquiry that he didn't touch upon and improve through his insights. By understanding Aristotle, we come to understand the trajectory taken not only by European but also by Arabic intellectual culture and science. This course will begin with an introduction to Aristotle’s general approach and methodology. We will then examine the philosopher’s investigations into nature, science, zoology, psychology, metaphysics, ...\n\n      more description for PHIL-AD  321 »\n\n      \n\n\n\nAristotle is perhaps the single most celebrated and influential thinker in the history of philosophy. He is the founding father of both logic and biology, and there is nary a field of inquiry that he didn't touch upon and improve through his insights. By understanding Aristotle, we come to understand the trajectory taken not only by European but also by Arabic intellectual culture and science. This course will begin with an introduction to Aristotle’s general approach and methodology. We will then examine the philosopher’s investigations into nature, science, zoology, psychology, metaphysics, ethics, politics, rhetoric, and literary theory. Along the way we will track Aristotle’s legacy as an influence spanning various cultures.\n\n      less description for PHIL-AD  321 «",
            "offering": true
        },
        {
            "course_id": "PHIL-AD 340",
            "course_name": "Topics in Theoretical Philosophy",
            "description": "PHIL-AD  340 Topics in Theoretical Philosophy \nAn advanced seminar that involves the careful study of some particular theory, philosopher, or set of issues in contemporary theoretical philosophy. Examples: realism and antirealism, David Lewis, theories of truth, formal epistemology, philosophy of logic, consciousness.",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 360",
            "course_name": "Topics in Practical Philosophy",
            "description": "PHIL-AD  360 Topics in Practical Philosophy \nAn advanced seminar that involves the careful study of some particular theory, philosopher, or set of issues in contemporary practical philosophy. Examples: consequentialism, empirical moral psychology, the philosophy of law, the ethics of gender, Rawls, metaethics.",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 361",
            "course_name": "",
            "description": "PHIL-AD  361\n\n   Metaethics\n\nMetaethics is the branch of philosophy devoted to making sense of the practice of ethics. It seeks to answer questions like: What we are doing when we do ethics? What are we doing when we make ethical judgments? What are those ethical judgments about? Are, for instance, ethical judgments best understood as attempts to describe or report the state of the world? When people are engaged in an ethical disagreement, is there ever a fact of the matter about who is correct? Are our ethical practices in tension with a scientific view of the world? To what extent, if any, can ethics be a science? Can w...\n\n      more description for PHIL-AD  361 »\n\n      \n\n\n\nMetaethics is the branch of philosophy devoted to making sense of the practice of ethics. It seeks to answer questions like: What we are doing when we do ethics? What are we doing when we make ethical judgments? What are those ethical judgments about? Are, for instance, ethical judgments best understood as attempts to describe or report the state of the world? When people are engaged in an ethical disagreement, is there ever a fact of the matter about who is correct? Are our ethical practices in tension with a scientific view of the world? To what extent, if any, can ethics be a science? Can we aspire to ethical knowledge? Are there objective moral truths that hold across all times and cultures, or is ethics always relative? Are our ethical convictions grounded in anything more than our preferences or emotions? This seminar will explore various classic and contemporary responses to these questions.\n\n      less description for PHIL-AD  361 «",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 398",
            "course_name": "Directed Study",
            "description": "PHIL-AD  398 Directed Study \nClosely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        },
        {
            "course_id": "PHIL-AD 399",
            "course_name": "Directed Study",
            "description": "PHIL-AD  399 Directed Study \nClosely supervised individual research on a particular topic, undertaken by arrangement with an individual faculty member, resulting in a substantial paper.",
            "offering": false
        }
    ]
}