{
    "major_id": "PHED-GE",
    "file": "./2015-2016/Philosophy_of_Education_(PHED-GE).html",
    "courses": [
        {
            "course_id": "PHED-GE 2000",
            "course_name": "Feminist Philos of Educ",
            "description": "PHED-GE 2000 Feminist Philos of Educ \nExamines feminist philosophies with attention to education, knowledge, power, and social change; relationship between women's learning and roles in family, work, and politics.  Attention to race, class, sexual orientation, and other diversity.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2003",
            "course_name": "Phil Ed: Theories and Methods",
            "description": "PHED-GE 2003 Phil Ed: Theories and Methods \nPhilosophical assumptions implicit in educational theories and methods; philosophical systems and their influence on education; some basic concepts of value theory in application to the comparative study of educational aims.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2011",
            "course_name": "Phil of Ed: Social Found",
            "description": "PHED-GE 2011 Phil of Ed: Social Found \nComparison of social theories dealing with social, economic, and political contexts of education; theories of culture and social change; educational implications of liberal , authoritarian, democratic, and revolutionary theories.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2013",
            "course_name": "Values, Morals & School",
            "description": "PHED-GE 2013 Values, Morals & School \nWhat has been the school's part in the moral life of the nation? This course studies twentieth-century attempts to address moral issues as they arise in the environment of the school and in the curriculum of the classroom. The course also examines the current emphasis on the development of the character and the exercise of responsibility as an answer to the question 'what ought I to do.'",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2014",
            "course_name": "The Mystical Tradition",
            "description": "PHED-GE 2014 The Mystical Tradition \nAnalysis of the nature of mysticism through contemporary readings and original sources.  Particular attention to Hindu mysticism and the evolution of Christian mysticism.  Lectures on Buddhist, Jewish, and Sufi mysticism.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2015",
            "course_name": "Professional Ethics",
            "description": "PHED-GE 2015 Professional Ethics \nA study of ethical issues faced by contemporary professionals.  The shifting meaning of 'professional: and likely consequences for the future.  Individual and group projects on the ethical dilemmas in the student's chosen profession.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2016",
            "course_name": "",
            "description": "PHED-GE 2016\n\n   Religion & Public Educ International Context\n\nThe purpose of this course on religion and public education in an international context is for us to engage together in a critical analysis of what continues to be an important contemporary issue. The seminar is designed especially for students preparing for careers in teaching - in both public and private/religious schools, educational administration, educational research, or other professions which will involve them in the ongoing public debates about the uneasy relationship of religion and public education in the United States and other countries. The course will examine these issues histor...\n\n      more description for PHED-GE 2016 »\n\n      \n\n\n\nThe purpose of this course on religion and public education in an international context is for us to engage together in a critical analysis of what continues to be an important contemporary issue. The seminar is designed especially for students preparing for careers in teaching - in both public and private/religious schools, educational administration, educational research, or other professions which will involve them in the ongoing public debates about the uneasy relationship of religion and public education in the United States and other countries. The course will examine these issues historically and in terms of current policy debates and students will be asked to make connections to their own educational practice.\n\n      less description for PHED-GE 2016 «",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2055",
            "course_name": "Philos of Progressivism",
            "description": "PHED-GE 2055 Philos of Progressivism \nIntensive study of the philosophical and educational ideas of the Progressive movement in Education. John Dewey's philosophy and its influence on other educators. Emphasis on the relevance of these ideas to contemporary educational discussions.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2060",
            "course_name": "Feminist Ideas of Teachg & Research",
            "description": "PHED-GE 2060 Feminist Ideas of Teachg & Research \nExamines ethical, political, and epistemological dimensions of feminist pedagogy and research.  Includes attention to women's studies as a discipline; the relationship between feminist and multicultural studies; and the political implications of research.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2083",
            "course_name": "Frontiers of Knowledge",
            "description": "PHED-GE 2083 Frontiers of Knowledge \nHow modern thinkers are overcoming, through fruitful hypotheses, the disorientation in through and conduct caused by overspecialization, compartmentalization of knowledge, and persistence of false theories.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2089",
            "course_name": "Philos Scientific Inqry",
            "description": "PHED-GE 2089 Philos Scientific Inqry \nFundamentals of systematic inquiry: concept formulation, types of concepts and hypotheses, quantification and measurement, meaning and methodology of the social sciences in relation to the natural sciences.  The scientific testability of hypotheses; the structure of theories and their impact on Western culture and education.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2090",
            "course_name": "Science & The Profession Philos of Applied SCI",
            "description": "PHED-GE 2090 Science & The Profession Philos of Applied SCI \nDiscussion of philosophies of applied science and technology; the relationships between pure and applied science; the utilization of knowledge claims regarding science and applied science in various professions; interpretations of problems of autonomy, legitimization, accountability, and responsibility in the light of the criteria of rationality subscribed to by diverse professions; the education relevant to a practitioner.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2155",
            "course_name": "Phil Perspectives-20 Cen",
            "description": "PHED-GE 2155 Phil Perspectives-20 Cen \nA study of themes and currents in 20th century philosophy, starting from Nietzshe and Freud.  The concern with language, reflected in Heidegger, Wittgenstein, and their descendants.  Questions raised by feminism, ecology, and political upheaval.",
            "offering": false
        },
        {
            "course_id": "PHED-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3611",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Arcilla, Rene",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "PHED-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "PHED-GE 2400",
            "course_name": "Fndtns of Ed: Phil of Ed",
            "description": "PHED-GE 2400 Fndtns of Ed: Phil of Ed \nA critical examination of the philosophic questions inherent in efforts to acquire and evaluate theoretical resources pertinent to the analysis and resolution of educational problems.",
            "offering": false
        }
    ]
}