{
    "major_id": "PT-GE",
    "file": "./2015-2016/Physical_Therapy_(PT-GE).html",
    "courses": [
        {
            "course_id": "PT-GE 2004",
            "course_name": "Histology\\General Path",
            "description": "PT-GE 2004 Histology\\General Path \nOverview of microanatomical structure from the perspective of cells, tissues, and systems.  The four tissue types are studied including epithelial, connective, nervous, and muscular tissues.  Basic concepts of cell and tissue injury and disease are presented, including examination of acute and chronic inflammation and immune and autoimmune responses.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2008",
            "course_name": "Manual Tech(Mssg,Moblztn Manipul Soft Tissue Tch)",
            "description": "PT-GE 2008 Manual Tech(Mssg,Moblztn Manipul Soft Tissue Tch) \nThis course enables the student to apply manual therapy (including mobilization and manipulation) which consists of a broad group of passive intervention in which physical therapists use their hands to modulate pain, increase joint range of motion, reduce soft tissue inflammation, induce relaxation, improve contractile and noncontractile tissue extensibility, and improve pulmonary function.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2016",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3582",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Moffat, Marilyn",
                    "time": "Wed 5.30 PM - 7.50 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Research in Phys Ther I",
            "description": "PT-GE 2016 Research in Phys Ther I \nLogic and scientific thinking; the identification of research problems; research methodology, analysis, and interpretation of data with specific reference to the physical therapy field.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2018",
            "course_name": "Research Phys Therapy II",
            "description": "PT-GE 2018 Research Phys Therapy II \nLogic and scientific thinking; the identification of research problems; research methodology, analysis, and interpretation of data with specific reference to the physical therapy field.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2019",
            "course_name": "",
            "description": "PT-GE 2019\n\n   Physical Therapist as Admin, Etc\n\nManagement of human and material resources and services to provide quality, efficient and cost effective physical therapy services based upon patient's or client's goals; practice team building and group dynamic skills; interact with patients, clients, family members, other health care providers and community based organizations for the purpose of coordinating activities to facilitate efficient and effective patient or client care; delegate physical therapy related services to appropriate human resources; supervise and manage support personnel to whom tasks have been delegated; practice advoca...\n\n      more description for PT-GE 2019 »\n\n      \n\n\n\nManagement of human and material resources and services to provide quality, efficient and cost effective physical therapy services based upon patient's or client's goals; practice team building and group dynamic skills; interact with patients, clients, family members, other health care providers and community based organizations for the purpose of coordinating activities to facilitate efficient and effective patient or client care; delegate physical therapy related services to appropriate human resources; supervise and manage support personnel to whom tasks have been delegated; practice advocacy skills for patient and through participation in the legislative processes; and participate in management budgeting, billing and reimbursement activities.\n\n      less description for PT-GE 2019 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2020",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3583",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Fishbein, Elliot Daniel",
                    "time": "Tue 9.00 AM - 11.00 AM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PT-GE 2020\n\n   The Physical Ther/Eductr Consultant Comm\n\nThe course will enable the student to: provide patient related instruction; educate others using a variety of teaching methods that are commensurate with the needs and unique characteristics of the learner; provide consultative services using the physical therapist's skills to individuals, businesses, schools, government agencies, or other organizations; expressively and receptively communicate with patients, clients, family caregivers, practitioners, consumers, payers and policy makers; and take responsibility for communication or discussion of diagnoses or clinical impressions with other pra...\n\n      more description for PT-GE 2020 »\n\n      \n\n\n\nThe course will enable the student to: provide patient related instruction; educate others using a variety of teaching methods that are commensurate with the needs and unique characteristics of the learner; provide consultative services using the physical therapist's skills to individuals, businesses, schools, government agencies, or other organizations; expressively and receptively communicate with patients, clients, family caregivers, practitioners, consumers, payers and policy makers; and take responsibility for communication or discussion of diagnoses or clinical impressions with other practitioners.\n\n      less description for PT-GE 2020 «",
            "offering": true
        },
        {
            "course_id": "PT-GE 2024",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3584",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mehreteab, Tsega",
                    "time": "Mon 9.45 AM - 12.45 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Applied Anatomy/Physlgy Cardiopulomanry System",
            "description": "PT-GE 2024 Applied Anatomy/Physlgy Cardiopulomanry System \nIn-depth knowledge of human anatomy and the principles of regulation of function of the cardiac, circulatory and pulmonary systems.  Anatomical models and specimens will complement didactic classroom activities.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2026",
            "course_name": "Clinical SCI/Path of The Cardio System",
            "description": "PT-GE 2026 Clinical SCI/Path of The Cardio System \nAnalysis of the etiology, pathology, and clinical sciences of cardiac, circulatory and pulmonary diseases, disorders, and disabilities.  Imaging techniques and clinical/ laboratory assessment techniques and pharmacological interventions will be presented.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17500",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "CPR/First Aid/Advanced Emergency Techniques",
            "description": "PT-GE 2030 CPR/First Aid/Advanced Emergency Techniques \nThis course will provide the student with all of the skills necessary to take appropriate action in an emergency in any practice setting.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2116",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3585",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "McHugh, Malachy",
                    "time": "Tue 6.00 PM - 8.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Analysis/Synth of Human Motion I",
            "description": "PT-GE 2116 Analysis/Synth of Human Motion I \nIntegration of facts and principles derived from the fields of anatomy, physiology, and biomechanics with implications for normal, physical activity, conditioning, and therapeutic exercise; research approach.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2118",
            "course_name": "Analysis/Synth of Human Motion II",
            "description": "PT-GE 2118 Analysis/Synth of Human Motion II \nAnalysis of abnormal motion and the procedures employed in its modification.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2119",
            "course_name": "Trad Accup & Trigger Therapy",
            "description": "PT-GE 2119 Trad Accup & Trigger Therapy",
            "offering": false
        },
        {
            "course_id": "PT-GE 2120",
            "course_name": "Gross Human Anatomy",
            "description": "PT-GE 2120 Gross Human Anatomy \nOverview of human anatomy of the muscular, skeletal, nervous, and circulatory systems. Anatomical models and specimens will complement didactic classroom activities.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2187",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3586",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Ling, Wen",
                    "time": "Thu 5.30 PM - 7.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Meas&Eval Human Mot I",
            "description": "PT-GE 2187 Meas&Eval Human Mot I \nThe theoretical basis, principles, and techniques of kinesiological electromyography and motion analysis of normal and abnormal human motion.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2188",
            "course_name": "Meas&Eval Human Mot II",
            "description": "PT-GE 2188 Meas&Eval Human Mot II \nThe theoretical basis, principles, and techniques of dynamometry; the integration of kinesiological electromyography, motion analysis, and dynamomtry.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2189",
            "course_name": "",
            "description": "PT-GE 2189\n\n   Measurmt & Evaluatn III\n\nAn introduction to the use of the LabVIEW computer programming language for the collection, manipulation, and processing data collected from the instruments that measure various aspects of human movement.  Examples of instruments include electromyographs (EMG), dynamometers (e.g., Biodex), and electrogoniomemters.  LabVIEW is a graphical programming language that uses software to stimulate hardware devices that may be custom-tailored to meet the needs of researchers.  LabVIEW utilizes a series of icons that represent data collection, mathematical, statistical, and file management functions.  I...\n\n      more description for PT-GE 2189 »\n\n      \n\n\n\nAn introduction to the use of the LabVIEW computer programming language for the collection, manipulation, and processing data collected from the instruments that measure various aspects of human movement.  Examples of instruments include electromyographs (EMG), dynamometers (e.g., Biodex), and electrogoniomemters.  LabVIEW is a graphical programming language that uses software to stimulate hardware devices that may be custom-tailored to meet the needs of researchers.  LabVIEW utilizes a series of icons that represent data collection, mathematical, statistical, and file management functions.  Icons are 'wired' together to establish a directional flow of information in somewhat the same way that transistors, diodes, and computer chips are wired or soldered together on circuit boards.  Data may be displayed in various graphical or tabular formats in real time or saved to memory for later analysis.\n\n      less description for PT-GE 2189 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2190",
            "course_name": "Typical & Atypical Motor Development",
            "description": "PT-GE 2190 Typical & Atypical Motor Development \nDesigned to provide the student with a detailed knowledge of typical and pathological motor development during the first two years of life.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2209",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3587",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Becker, Elaine",
                    "time": "Thu 2.00 PM - 5.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Lifespan Development",
            "description": "PT-GE 2209 Lifespan Development \nIn-depth knowledge of human development throughout the life cycle.  The student will be given the foundation upon which typical and atypical behavior may be compared.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2212",
            "course_name": "Aeseptic Tchn\\Infect and Disease Control",
            "description": "PT-GE 2212 Aeseptic Tchn\\Infect and Disease Control \nBasic aseptic techniques including practice of universal precautions to prevent infection, cross-contamination, and spread of bacterial, fungal and viral infections.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2215",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3588",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Iannuzzi, Louis",
                    "time": "Mon 1.30 PM - 5.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PT-GE 2215\n\n   Phys Agents/McHn Modlts\n\nEnables students to apply physical agents and aseptic techniques, including deep thermal modalities (e.g. ultrasound), a thermal modalities (e.g. pulsed ultrasound, pulsed electromagnetic fields), superficial thermotherapy (e.g. heat, paraffin baths, hot packs, fluidotherapy), cryotherapy modalities (cold packs, ice massage), hydrotherapy (e.g. whirlpools, tanks, contrast baths), and phototherapies (e.g. ultraviolet)in order to increase connective tissue extensibilities; modulate pain, reduce or eliminate soft tissue inflammation and swelling caused by musculoskeletal injuries or circulatory d...\n\n      more description for PT-GE 2215 »\n\n      \n\n\n\nEnables students to apply physical agents and aseptic techniques, including deep thermal modalities (e.g. ultrasound), a thermal modalities (e.g. pulsed ultrasound, pulsed electromagnetic fields), superficial thermotherapy (e.g. heat, paraffin baths, hot packs, fluidotherapy), cryotherapy modalities (cold packs, ice massage), hydrotherapy (e.g. whirlpools, tanks, contrast baths), and phototherapies (e.g. ultraviolet)in order to increase connective tissue extensibilities; modulate pain, reduce or eliminate soft tissue inflammation and swelling caused by musculoskeletal injuries or circulatory dysfunction; increase the healing rate of open wounds and soft tissue; remodel scar tissue; or treat skin conditions. Basic aseptic techniques including bacterial, fungal., and viral infections.\n\n      less description for PT-GE 2215 «",
            "offering": true
        },
        {
            "course_id": "PT-GE 2218",
            "course_name": "",
            "description": "PT-GE 2218\n\n   Electrother Modalities\n\nApplication of electrotherapeutic modalities, including alternating, direct, and pulsed current (e.g. high voltage galvanic stimulation, interferential current), neuromuscular electrical stimulation (NMES), functional electrical stimulation (FES) for improving posture for movement, transcutaneous electrical nerve stimulation (TENS), iontophoresis, electrical muscle stimulation, and biofeedback in order to:  modulate or decrease pain; reduce or eliminate soft tissue inflammation caused by musculoskeltelal, neuromuscular, peripheral vascular, or integumentary injury, disease, developmental delay...\n\n      more description for PT-GE 2218 »\n\n      \n\n\n\nApplication of electrotherapeutic modalities, including alternating, direct, and pulsed current (e.g. high voltage galvanic stimulation, interferential current), neuromuscular electrical stimulation (NMES), functional electrical stimulation (FES) for improving posture for movement, transcutaneous electrical nerve stimulation (TENS), iontophoresis, electrical muscle stimulation, and biofeedback in order to:  modulate or decrease pain; reduce or eliminate soft tissue inflammation caused by musculoskeltelal, neuromuscular, peripheral vascular, or integumentary injury, disease, developmental delay, or surgery; maintain strength after injury or surgery; decrease unwanted muscular activity; assist muscle contraction in gait or other functional training; or increase the rate of healing of open wounds.\n\n      less description for PT-GE 2218 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2219",
            "course_name": "Pres Appl/Appr Fabr/Assi Adp Ort Prt Sup/Pro Eqpt",
            "description": "PT-GE 2219 Pres Appl/Appr Fabr/Assi Adp Ort Prt Sup/Pro Eqpt \nEnables the student to: understand the physical properties and biomechanical principles of devises and equipment; to prescribe, apply, and fabricate as appropriate adaptive, orthotic, protective, supportive, and prosthetic devices and equipment for ADL and IADL; to analyze their use during ADL and IADL; and to evaluate the limitations and indications/contra indications of devises and equipment. The course enables the student to practice fabricating adaptive, supportivew, and protective devices.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2220",
            "course_name": "Kinesiology/Biome/Ergon",
            "description": "PT-GE 2220 Kinesiology/Biome/Ergon \nStudy of normal and abnormal human motion including gait and posture.  Macrophysiological and biomechanical principles will be defined and applied to static and dynamic movement. Once developed, basic concepts are applied to specific joints, the trunk and spine.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2225",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3589",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mehreteab, Tsega",
                    "time": "Thu 9.00 AM - 1.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Exercise Physiology",
            "description": "PT-GE 2225 Exercise Physiology \nPhysiological and pathophysiological principles for understanding the response of the human body to exercise. The musculoskeletal, pulmonary, cardiovascular and metabolic responses to exercise and their implications in physical therapy intervention will be explored.  The effects of aging, nutrition and environmental stress on the body's performance will be discussed.  Human energy expenditures, body composition and effects of training are presented in lectures and are coordinated with laboratory demonstration and experiences",
            "offering": true
        },
        {
            "course_id": "PT-GE 2227",
            "course_name": "",
            "description": "PT-GE 2227\n\n   Principles of Exercise\n\nAnalysis of the underlying principles of the following types of therapeutic exercise: stretching, strengthening; active assistive; active; resistive, using manual resistance pulleys, weights, hydraulics, elastics, robotics, and mechanical or electromechanical devices: neuromuscular relation, inhibition and facilitation; neuromuscular reeducation; motor training or retraining; developmental; activities; breathing exercises, including ventilatory muscle training; aerobics endurance activities, using cycles, treadmills, steppers, pools, manual resistance, pulleys, weights, hydraulics, elastics, r...\n\n      more description for PT-GE 2227 »\n\n      \n\n\n\nAnalysis of the underlying principles of the following types of therapeutic exercise: stretching, strengthening; active assistive; active; resistive, using manual resistance pulleys, weights, hydraulics, elastics, robotics, and mechanical or electromechanical devices: neuromuscular relation, inhibition and facilitation; neuromuscular reeducation; motor training or retraining; developmental; activities; breathing exercises, including ventilatory muscle training; aerobics endurance activities, using cycles, treadmills, steppers, pools, manual resistance, pulleys, weights, hydraulics, elastics, robotics, and mechanical or electromechanical devised; aquatics exercises; and conditioning and reconditioning.\n\n      less description for PT-GE 2227 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2229",
            "course_name": "Fitness Theor/Practice",
            "description": "PT-GE 2229 Fitness Theor/Practice \nTheoretical and practical aspects of physical fitness. Students to evaluate, design, and implement fitness and conditioning programs.  Health, safety, injury prevention will be discussed.  The importance of an active lifestyle, as a health behavior, and the role of physical activity in preventing cardiovascular disease and promoting health and longevity will be discussed.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2230",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3590",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Gao, Greg",
                    "time": "Wed 8.30 AM - 11.30 AM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Applied Anatomy/Physio- Logy of The Musculoskele",
            "description": "PT-GE 2230 Applied Anatomy/Physio- Logy of The Musculoskele \nIn depth-knowledge of human anatomy and the principles of regulation of function of the muscular and skeletal systems.  Anatomical models and specimens complement didactic classroom activities.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2231",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3591",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Markowicz, Daniel",
                    "time": "Tue 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Clin SCI/Path/Pharm/Imag of The M-S System",
            "description": "PT-GE 2231 Clin SCI/Path/Pharm/Imag of The M-S System \nAnalysis of the etiology, pathology and clinical sciences of muscular and skeletal diseases, disorders, and disabilities.  Imaging techniques and clinical/laboratory assessment techniques and pharmacological interventions will be presented.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2232",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3592",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Keohane, Richard",
                    "time": "Fri 9.30 AM - 12.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Appl Antm/Phys/Neuro Sys",
            "description": "PT-GE 2232 Appl Antm/Phys/Neuro Sys \nIn-depth knowledge of human anatomy and the principles of regulation of function of the central, peripheral, and autonomic nervous systems and their relationship to the muscular system.  Anatomical models and specimens will complement didactic classroom activities.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2233",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3593",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mehreteab, Tsega",
                    "time": "Thu 1.30 PM - 4.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Appld Antmy/Phys/Ob/Gyn, Intgmntry/Endoc System",
            "description": "PT-GE 2233 Appld Antmy/Phys/Ob/Gyn, Intgmntry/Endoc System \nIn-depth knowledge of human anatomy and the principles of regulation of function of the reproduction, renal, integumentary and endocrine systems. Anatomical models and specimens will complement didactic classroom activities.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2242",
            "course_name": "Clin SCI/Path/Pharm/Imag of The N-M System",
            "description": "PT-GE 2242 Clin SCI/Path/Pharm/Imag of The N-M System \nAnalysis of the etiology, pathology and clinical sciences of neuromuscular diseases, disorders, and disabilities. Imaging techniques and clinical/laboratory assessment techniques and pharmacological interventions will be presented.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2243",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3594",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Ciotoli, Carlo",
                    "time": "Tue 5.45 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Clin SCI/Path/Pharm/Imag Ob/Gyn, Intgm/Endoc Sys",
            "description": "PT-GE 2243 Clin SCI/Path/Pharm/Imag Ob/Gyn, Intgm/Endoc Sys \nAnalysis of the etiology, pathology and clinical sciences of reproductive, renal, integumentary and endocrine diseases, disorders, and disabilities. Imaging techniques and clinical/laboratory assessment techniques and pharmacological interventions will be presented.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2250",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3595",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Mehreteab, Tsega",
                    "time": "Wed 9.00 AM - 1.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PT-GE 2250\n\n   Phys Ther Exam of The C-P System\n\nThe course will enable the student to: independently examine and reexamine a patient or client with a cardiopulmonary problem by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examination data to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish differential diagno...\n\n      more description for PT-GE 2250 »\n\n      \n\n\n\nThe course will enable the student to: independently examine and reexamine a patient or client with a cardiopulmonary problem by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examination data to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish differential diagnosis for patients across the life span; and determine patient or client prognoses based on evaluation of results of examinations and medical and psychosocial information.\n\n      less description for PT-GE 2250 «",
            "offering": true
        },
        {
            "course_id": "PT-GE 2251",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3596",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Weaver, Kevin",
                    "time": "Thu 1.00 PM - 5.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PT-GE 2251\n\n   Phys Ther Exam of The M-S System\n\nThe course will enable the student to: independently examine and reexamine a patient or client with a musculoskeletal problem by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examination data to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish differential diagno...\n\n      more description for PT-GE 2251 »\n\n      \n\n\n\nThe course will enable the student to: independently examine and reexamine a patient or client with a musculoskeletal problem by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examination data to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish differential diagnoses for patients across the life span; and determine patient or client prognoses based on evaluation of results of examinations and medical and psychosocial information.\n\n      less description for PT-GE 2251 «",
            "offering": true
        },
        {
            "course_id": "PT-GE 2252",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3597",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Ling, Wen",
                    "time": "Mon 10.30 AM - 4.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PT-GE 2252\n\n   Phys Ther Exam or The Neuromuscular System\n\nStudent to independently examine and reexamine a patient or client with a neuromuscular problem by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examination data to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish differential diagnoses for patients across the li...\n\n      more description for PT-GE 2252 »\n\n      \n\n\n\nStudent to independently examine and reexamine a patient or client with a neuromuscular problem by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examination data to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish differential diagnoses for patients across the life span; and determine patient or client prognoses based on evaluation of results of examinations and medical and psychosocial information\n\n      less description for PT-GE 2252 «",
            "offering": true
        },
        {
            "course_id": "PT-GE 2253",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3598",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Iannuzzi, Louis",
                    "time": "Wed 1.30 PM - 5.30 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PT-GE 2253\n\n   Pt Exam Gen-Uri,Inte, End Gastro & Immune Sys\n\nThe course will enable the student to: independently examine and reexamine a patient or client with ob/gyn, integumentary or endocrine problems by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examinations and to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish d...\n\n      more description for PT-GE 2253 »\n\n      \n\n\n\nThe course will enable the student to: independently examine and reexamine a patient or client with ob/gyn, integumentary or endocrine problems by obtaining a pertinent history from the patient or client and from other relevant sources, by performing relevant systems review, and by selecting appropriate age related tests and measure; synthesize examinations and to complete the physical therapy evaluation; engage in the diagnostic process in an efficient and cost-effective manner consistent with the policies and procedures of the practice setting; engage in the diagnostic process to establish differential diagnoses for patients across the life span; and determine patient or client prognoses based on evaluation of results of examinations and medical and psychosocial information.\n\n      less description for PT-GE 2253 «",
            "offering": true
        },
        {
            "course_id": "PT-GE 2260",
            "course_name": "",
            "description": "PT-GE 2260\n\n   Phys Ther Inter/Prev Prg Well Prog Cv Resp System\n\nStudent will establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes within available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical therapy intervention to achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability.  Promote optimal health by providing information on wellness, impairment, disease, disability and health risks related to age, ...\n\n      more description for PT-GE 2260 »\n\n      \n\n\n\nStudent will establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes within available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical therapy intervention to achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability.  Promote optimal health by providing information on wellness, impairment, disease, disability and health risks related to age, gender, culture, and lifestyle; provide primary, secondary or tertiary care to patients in collaboration with other practitioners in settings supportive of comprehensive and complex services based on patient's or client's goals and expected functional outcomes and on knowledge of one's own and other's capabilities.\n\n      less description for PT-GE 2260 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2261",
            "course_name": "",
            "description": "PT-GE 2261\n\n   Pt Intervent Prevention Prog/Well Prog Ms System\n\nStudents will establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes with available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical therapy intervention of achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability; promote optimal health by providing information on wellness, impairment , disease, disability and health risks related to age, g...\n\n      more description for PT-GE 2261 »\n\n      \n\n\n\nStudents will establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes with available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical therapy intervention of achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability; promote optimal health by providing information on wellness, impairment , disease, disability and health risks related to age, gender, culture and lifestyle; provide primary, secondary or tertiary care to patients in collaboration with other practitioners in settings supportive of comprehensive and complex services based on patient's or client's goals and expected functional outcomes and on knowledge of one's own and other's capabilities,\n\n      less description for PT-GE 2261 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2262",
            "course_name": "",
            "description": "PT-GE 2262\n\n   Phys Ther Inter/Prev Prg Well Prog N-M System\n\nThe course will enable the student to establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes within available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical therapy intervention to achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability; promote optimal health by providing information on wellness, provide primary, secondary or tertiary ca...\n\n      more description for PT-GE 2262 »\n\n      \n\n\n\nThe course will enable the student to establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes within available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical therapy intervention to achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability; promote optimal health by providing information on wellness, provide primary, secondary or tertiary care to patients in collaboration with other practitioners in settings supportive of comprehensive and complex services based on patients or client's goals and expected functional outcomes and on knowledge of one's own and other's capabilities.\n\n      less description for PT-GE 2262 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2263",
            "course_name": "",
            "description": "PT-GE 2263\n\n   Phy Thr Intr/Prv Prg Wel Prg/Ob/Gyn Int/Endoc/Sys\n\nStudent to establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes within available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical intervention to achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability; promote optimal health by providing information on wellness, impairment, disease, disability and health risks related to age, gender, cul...\n\n      more description for PT-GE 2263 »\n\n      \n\n\n\nStudent to establish a safe and effective physical therapy plan of care; establish goals and functional outcomes that specify expected time duration; define achievable patient or client outcomes within available resources; monitor and adjust the plan of care in response to patient or client status; provide direct physical intervention to achieve patient or client outcomes based on the examination and on the impairment, functional limitations, and disability; promote optimal health by providing information on wellness, impairment, disease, disability and health risks related to age, gender, culture and lifestyle; provide primary, secondary or tertiary care to p[patients in collaboration with other practitioners in settings supportive of comprehensive and complex services based on patient's or client's goals and expected functional outcomes and on knowledge of one's own and other's capabilities.\n\n      less description for PT-GE 2263 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2281",
            "course_name": "",
            "description": "PT-GE 2281\n\n   Professional Behavior\n\nHistory of the profession, the professional association, professionalism, individual and cultural differences, health professional/patient relationships, medical and professional ethics, and medical legal aspects of care. The student demonstrates professional behaviors in all interactions with patients, clients, families, caregivers, and other health care providers. Enables the student to practice in a safe setting and manner to minimize risk to the patient, client, therapist, and others; be aware of the practices and ramifications of sexual harassment; identify and assess the health needs of ...\n\n      more description for PT-GE 2281 »\n\n      \n\n\n\nHistory of the profession, the professional association, professionalism, individual and cultural differences, health professional/patient relationships, medical and professional ethics, and medical legal aspects of care. The student demonstrates professional behaviors in all interactions with patients, clients, families, caregivers, and other health care providers. Enables the student to practice in a safe setting and manner to minimize risk to the patient, client, therapist, and others; be aware of the practices and ramifications of sexual harassment; identify and assess the health needs of individuals, groups, and communities including screening, prevention, and wellness programs appropriate to physical therapy; display generously as evidenced by the use of time and effort to meet patient or client needs; and demonstrate social responsibility, citizenship, and advocacy including participation in community and human service organizations and activities.\n\n      less description for PT-GE 2281 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2282",
            "course_name": "",
            "description": "PT-GE 2282\n\n   Professional Behavior II\n\nThis course will enable the student to: practice in a safe setting and manner to minimize risk to the patient; client, therapist, and others; be aware of the practices and ramifications of sexual harassment; identify and assess the health needs of individuals, group and communities including screening, prevention, and wellness programs appropriate to physical therapy; display generosity as evidenced by the use of time and effort to meet patient or client needs; demonstrate social responsibility, citizenship, and advocacy including participation in community and human service organizations and ...\n\n      more description for PT-GE 2282 »\n\n      \n\n\n\nThis course will enable the student to: practice in a safe setting and manner to minimize risk to the patient; client, therapist, and others; be aware of the practices and ramifications of sexual harassment; identify and assess the health needs of individuals, group and communities including screening, prevention, and wellness programs appropriate to physical therapy; display generosity as evidenced by the use of time and effort to meet patient or client needs; demonstrate social responsibility, citizenship, and advocacy including participation in community and human service organizations and activities; provide pro bono services; and formulate and implement a plan for personal and professional career development based upon self-assessment, reflection, and feedback from others.\n\n      less description for PT-GE 2282 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2286",
            "course_name": "",
            "description": "PT-GE 2286\n\n   Critical Inquiry/Clin Decision Making I\n\nThis course will enable the student to utilize critical inquiry by applying the principles of scientific method to read and interpret professional literature. The student will apply the principles of clinical decision-making in the delivery of patient or client care to include: identification of problem, collection and interpretation of data, formulation of hypothesis, collection of data, interpretation of findings, acceptance  or rejection of hypothesis, determination of clinical decision, deliberate action, and reevaluation of actions. The final outcome of this course will be a Review of Lit...\n\n      more description for PT-GE 2286 »\n\n      \n\n\n\nThis course will enable the student to utilize critical inquiry by applying the principles of scientific method to read and interpret professional literature. The student will apply the principles of clinical decision-making in the delivery of patient or client care to include: identification of problem, collection and interpretation of data, formulation of hypothesis, collection of data, interpretation of findings, acceptance  or rejection of hypothesis, determination of clinical decision, deliberate action, and reevaluation of actions. The final outcome of this course will be a Review of Literature.\n\n      less description for PT-GE 2286 «",
            "offering": false
        },
        {
            "course_id": "PT-GE 2287",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3599",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Batavia, Mitchell",
                    "time": "Tue 2.00 PM - 4.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Crit Inquiry/Clin Dcsn Making II (Case Study)",
            "description": "PT-GE 2287 Crit Inquiry/Clin Dcsn Making II (Case Study) \nDesign and implementation of decision-making guidelines in order to utilize outcome effectiveness and efficiently studies to establish, implement, and evaluate the effectiveness of patient or client protocols. The student will use a case report as a vehicle for identifying clinical problems, assessing measuring devices, and collection and interpreting data to aid in clinical decision-making.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2288",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3600",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Ling, Wen",
                    "time": "Thu 9.30 AM - 11.30 AM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Crit Inquiry/Clin Decsn Making III",
            "description": "PT-GE 2288 Crit Inquiry/Clin Decsn Making III \nStudents will integrate knowledge in physical therapy with statistics and research design to critically analyze current physical therapy literature. Each student will be able to develop a research plan with a given topic.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2295",
            "course_name": "Bus Pract/Rembrsmnt/Mrkt Tech Mngmt/Care Del Sys",
            "description": "PT-GE 2295 Bus Pract/Rembrsmnt/Mrkt Tech Mngmt/Care Del Sys \nImplementation of marketing plans and related public relations activities; major reimbursement guidelines; how to reflect patient or client care activities in all billing; apply time management principles to patient or client treatment scheduling; and understand and exhibit responsibility for practicing within the guidelines of third party payers.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3601",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Ling, Wen",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "3602",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Moffat, Marilyn",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "PT-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2303",
            "course_name": "Tpcs Phys Ther:Wm'S Hlth",
            "description": "PT-GE 2303 Tpcs Phys Ther:Wm'S Hlth \nThis course enable practicing physical therapists to gain knowledge about the female's genito-urinary system, to understand anatomical and physiological changes occurring during pregnancy, to perform physical therapy examination on a live model, and to establish and implement an intervention plan for females with disorders of the genito-urinary system.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2312",
            "course_name": "Mentored Opthopedic Pt Clinical Practice II",
            "description": "PT-GE 2312 Mentored Opthopedic Pt Clinical Practice II",
            "offering": false
        },
        {
            "course_id": "PT-GE 2400",
            "course_name": "Devel Dis Intro for P T",
            "description": "PT-GE 2400 Devel Dis Intro for P T \nOverview of topics concerning people with developmental disabilities.  Introduction of terminology and etiological concepts.  Definitions of the scope of practice and models of delivery.  Examination of the roles of related health professions.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2401",
            "course_name": "Pt Mngmt of Dev Disab I",
            "description": "PT-GE 2401 Pt Mngmt of Dev Disab I \nPrinciples and procedures of Physical Therapy evaluation and treatment of developmental disabilities.  Reviewed of current neurobiological theories, clinical application, and discussion with emphasis on handling techniques.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2402",
            "course_name": "Pt Mngmt of Dev Disab II",
            "description": "PT-GE 2402 Pt Mngmt of Dev Disab II \nDesigned to enable a student to integrate knowledge of neurophysiology and neurobehavior with physical therapy evaluation and treatment of motor dysfunction in persons with developmental disabilities.  Treatment methods currently in use are compared and contrasted.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2410",
            "course_name": "Clin Prac Devel Dis I",
            "description": "PT-GE 2410 Clin Prac Devel Dis I \nA seminar discussing clinical practice experience in the application of physical therapy procedures with developmental disabilities as it applies to current law and regulations concerning persons with developmental disabilities of all ages.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2411",
            "course_name": "Clin Prac Dev Disab II",
            "description": "PT-GE 2411 Clin Prac Dev Disab II \nClinical practice experience in the application of physical therapy procedures with developmental disabilities.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2412",
            "course_name": "Clin Pract Devel Dis III",
            "description": "PT-GE 2412 Clin Pract Devel Dis III \nProvides the opportunity for students to develop skill and discriminating judgment in the planning and execution of progressive treatment programs in accordance with the relating physical therapy practice to theory in testing persons with developmental disabilities.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2439",
            "course_name": "Prin/Prac Mng Hlth Prof",
            "description": "PT-GE 2439 Prin/Prac Mng Hlth Prof \nPresents the elements of the managerial process and its application to the various physical therapy work situations.  Designed to prepare physical therapists in the application of management principles and practices of hospitals and health institutions of physical therapy, as well as to prepare physical therapists for the process of consultation in physical therapy.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2450",
            "course_name": "Clinical Affiliation I",
            "description": "PT-GE 2450 Clinical Affiliation I \nThis experience will enable the student to:  participate in clinical education to enhance knowledge, values, and skills as a practitioner; and integrate and apply course work in the clinical setting.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2451",
            "course_name": "Clinical Affiliation II",
            "description": "PT-GE 2451 Clinical Affiliation II \nThis experience will enable the student to:  participate in clinical education to enhance knowledge, values, and skills as a practitioner: and integrate and apply course work in the clinical setting.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2452",
            "course_name": "Clinical Affiliation III",
            "description": "PT-GE 2452 Clinical Affiliation III \nThis experience will enable the student to: participate in clinical education to enhance knowledge values, and skills as a practitioner; and integrate and apply all course work in the clinical setting.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2455",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3603",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Becker, Elaine",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Clin Observ - 1 Day/Week",
            "description": "PT-GE 2455 Clin Observ - 1 Day/Week \nThis experience will enable the student to participate in clinical education through observation of master clinicians.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2456",
            "course_name": "Clin Observ - 1 Day/Week",
            "description": "PT-GE 2456 Clin Observ - 1 Day/Week \nThis experience will enable the student to particiapte in clinical education through obersvation of master clinicians.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2457",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3604",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Becker, Elaine",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Clin Observ - 1 Day/Week",
            "description": "PT-GE 2457 Clin Observ - 1 Day/Week \nThis experience will enable the student to particiapte in clinical education through obersvation of master clinicians.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2458",
            "course_name": "Clin Observ - 1 Day/Week",
            "description": "PT-GE 2458 Clin Observ - 1 Day/Week \nThis experience will enable the student to particiapte in clinical education through obersvation of master clinicians.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2601",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3605",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Weaver, Kevin",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced Pt Examination and Intervention Ms I",
            "description": "PT-GE 2601 Advanced Pt Examination and Intervention Ms I \nThis course enables the student to independently examine and reexamine a patient or client with musculoskeletal problems by obtaining a pertinent history from the patient or client and from other relevant sources by performing relevant systems review, and by selecting appropriate age-related tests and measure. The courses also enable the student:  to provide direct physical therapy interventions to achieve patient/client outcomes based on the examination and the impairments, functional limitations, and disabilities",
            "offering": true
        },
        {
            "course_id": "PT-GE 2602",
            "course_name": "Advanced Pt Examination and Intervention Ms II",
            "description": "PT-GE 2602 Advanced Pt Examination and Intervention Ms II \nThis course enables the student to independently examine and reexamine a patient or client with musculoskeletal problems by obtaining a pertinent history from the patient or client and from other relevant sources by performing relevant systems review, and by selecting appropriate age-related tests and measure. The courses also enable the student:  to provide direct physical therapy interventions to achieve patient/client outcomes based on the examination and the impairments, functional limitations, and disabilities.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2603",
            "course_name": "Advanced Pt Examination and Intervention Ms III",
            "description": "PT-GE 2603 Advanced Pt Examination and Intervention Ms III \nThis course enables the student to independently examine and reexamine a patient or client with musculoskeletal problems by obtaining a pertinent history from the patient or client and from other relevant sources by performing relevant systems review, and by selecting appropriate age-related tests and measure. The courses also enable the student:  to provide direct physical therapy interventions to achieve patient/client outcomes based on the examination and the impairments, functional limitations, and disabilities.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2604",
            "course_name": "Orthopedic Physical Therapy",
            "description": "PT-GE 2604 Orthopedic Physical Therapy \nThis course enables the student to integrate knowledge in physical therapy with motor learning, human growth and development, nutrition, pharmacology, medical diagnostic techniques, orthopedic surgery and performance as a disabled athlete and their impact on the musculoskeletal system.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2605",
            "course_name": "Advanced Evidence-Based Orthopedic Pt",
            "description": "PT-GE 2605 Advanced Evidence-Based Orthopedic Pt \nThis course enables the student to integrate knowledge in physical therapy with statistics and research design to critically analyze current physical therapy literature.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2610",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3606",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Weaver, Kevin",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Adv Anatomy Physiology Musculoskeletal",
            "description": "PT-GE 2610 Adv Anatomy Physiology Musculoskeletal \nThis course enables the student to understand advanced knowledge of the musculoskeletal system and knowledge of the interaction of this system with the neuromuscular, cardiovascular pulmonary, integumentary, endocrine, reproductive and digestive systems. The advanced knowledge  will include synthesizing histology, physiology, pathophysiology, and pathophysiology effects on the musculoskeletal system.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2611",
            "classes": [
                {
                    "format": "Clinic",
                    "class_id": "3607",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Weaver, Kevin",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Mentored Orthopedic Pt Clinical Practice I",
            "description": "PT-GE 2611 Mentored Orthopedic Pt Clinical Practice I \nThis course enables the student to independently examine and reexamine a patient or client with musculoskeletal problems by obtaining a pertinent history from the patient or client and from other relevant sources by performing relevant systems review, and by selecting appropriate age-related tests and measure. The courses also enable the student:  to provide direct physical therapy interventions to achieve patient/client outcomes based on t he examination and the impairments, functional limitations, and disabilities.",
            "offering": true
        },
        {
            "course_id": "PT-GE 2612",
            "course_name": "Mentored Orthopedic Pt Clinical Practice II",
            "description": "PT-GE 2612 Mentored Orthopedic Pt Clinical Practice II \nThis course enables the student to independently examine and reexamine a patient or client with musculoskeletal problems by obtaining a pertinent history from the patient or client and from other relevant sources by performing relevant systems review, and by selecting appropriate age-related tests and measure. The courses also enable the student:  to provide direct physical therapy interventions to achieve patient/client outcomes based on t he examination and the impairments, functional limitations, and disabilities.",
            "offering": false
        },
        {
            "course_id": "PT-GE 2613",
            "course_name": "Mentored Orthopedic Pt Clinical Practice III",
            "description": "PT-GE 2613 Mentored Orthopedic Pt Clinical Practice III \nThis course enables the student to independently examine and reexamine a patient or client with musculoskeletal problems by obtaining a pertinent history from the patient or client and from other relevant sources by performing relevant systems review, and by selecting appropriate age-related tests and measure. The courses also enable the student:  to provide direct physical therapy interventions to achieve patient/client outcomes based on t he examination and the impairments, functional limitations, and disabilities.",
            "offering": false
        },
        {
            "course_id": "PT-GE 3001",
            "classes": [
                {}
            ],
            "course_name": "Practicum Pathokin Research 1",
            "description": "PT-GE 3001 Practicum Pathokin Research 1 \nExperience in clinical research centers under supervision of experienced clinical researchers of problems concerned with human motion of cardiopulmonary function.",
            "offering": true
        },
        {
            "course_id": "PT-GE 3002",
            "course_name": "Pract in Pathokin Research II",
            "description": "PT-GE 3002 Pract in Pathokin Research II \nExperience in clinical research centers under supervision of experienced clinical researchers of problems concerned with human motion of cardiopulmonary function.",
            "offering": false
        },
        {
            "course_id": "PT-GE 3006",
            "course_name": "Dept Sem Physical Therapy",
            "description": "PT-GE 3006 Dept Sem Physical Therapy \nSeminar for doctoral students.",
            "offering": false
        },
        {
            "course_id": "PT-GE 3010",
            "classes": [
                {
                    "format": "Colloquium",
                    "class_id": "3609",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Magill, Richard",
                    "time": "Thu 4.00 PM - 6.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Doctoral Colloquim in Physical Therapy",
            "description": "PT-GE 3010 Doctoral Colloquim in Physical Therapy \nRequired every semester of all doctoral students who are working on their proposal/dissertations.  Taken in lieu of Doctoral Advisement Fee.  Provides an opportunity for students to share the most recent development of their proposals/dissertations.  Students are expected to report on their own research projects and critique the projects of others in the class.  Presentations on research design, statistics, procedures for validity and reliability measures, and grant-writing skills are included.",
            "offering": true
        }
    ]
}