{
    "major_id": "PRACT-UG",
    "file": "./2015-2016/Practicum_(PRACT-UG).html",
    "courses": [
        {
            "course_id": "PRACT-UG 1301",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12568",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "1WP 801",
                    "time": "Mon 11.00 AM - 1.45 PM",
                    "open": true,
                    "professor": "Friedman, Lise"
                }
            ],
            "course_name": "",
            "description": "PRACT-UG 1301\n\n   Practicum in Fashion Business\n\nThe fashion industry’s need to balance the conflicting demands of specialization and globalization requires innovative approaches that connect creativity, design and business. This course considers the dialogue surrounding ways the fashion business can meet these demands by linking aesthetic goals to financial plans. The course is designed to provide students interested in the fashion industry with an opportunity to develop their understanding of various approaches to bridging the gap between design and business. The course will combine hands-on group projects and case studies with interdiscip...\n\n      more description for PRACT-UG 1301 »\n\n      \n\n\n\nThe fashion industry’s need to balance the conflicting demands of specialization and globalization requires innovative approaches that connect creativity, design and business. This course considers the dialogue surrounding ways the fashion business can meet these demands by linking aesthetic goals to financial plans. The course is designed to provide students interested in the fashion industry with an opportunity to develop their understanding of various approaches to bridging the gap between design and business. The course will combine hands-on group projects and case studies with interdisciplinary readings in business and design history, consumerism, merchandizing and the business of fashion. The course will be taught by the Guess Distinguished Visiting Professor in Fashion and Fashion Business, and by a member of the Gallatin faculty. Admission is by permission of the Visiting Professor.\n\n      less description for PRACT-UG 1301 «",
            "offering": true
        },
        {
            "course_id": "PRACT-UG 1401",
            "course_name": "",
            "description": "PRACT-UG 1401\n\n   The Artist's Mind: Filmmaking and the Creative Process\n\nHow do you make a film—or any piece of art, with a succinct point of view and an original voice?  How does the artist take his or her individual, private vision and transform it into a finished work of art that best expresses these ideas? This practicum will look at the method and practice of filmmaking as a case study for the artistic process more generally. It will offer students a sense of how to move from initial inspiration to finished product: a look at the way that the creative process develops in this most collective of artistic forms. It will also provide a space for students to share...\n\n      more description for PRACT-UG 1401 »\n\n      \n\n\n\nHow do you make a film—or any piece of art, with a succinct point of view and an original voice?  How does the artist take his or her individual, private vision and transform it into a finished work of art that best expresses these ideas? This practicum will look at the method and practice of filmmaking as a case study for the artistic process more generally. It will offer students a sense of how to move from initial inspiration to finished product: a look at the way that the creative process develops in this most collective of artistic forms. It will also provide a space for students to share work in progress and to think together about the ways in which art is made. Students will workshop their material through a series of multidisciplinary exercises (i.e. painting the emotions that they wish to express with their words, photographing the central themes of their work, writing tangential stories in their characters' lives) with the aim of clarifying their ideas and expanding the prism through which they approach their work. Special sessions will introduce students to fine artists and others in the filmmaking industry, including filmmakers, actors, agents, and photographers.\n\n      less description for PRACT-UG 1401 «",
            "offering": false
        },
        {
            "course_id": "PRACT-UG 9200",
            "course_name": "",
            "description": "PRACT-UG 9200\n\n   Global Fashion Industry: Italy\n\nGlobal Fashion Industry: Italy will provide students with a deep understanding of the contemporary fashion industry in Italy, as well as of Italy's position in the global fashion arena. The course will drive students through the entire lifecycle of the fashion business, from forecasting trends to retailing, through design, sourcing, product development and production. Particular attention will be dedicated to different marketing aspects of the process, such as: identity building, brand positioning, merchandising, buying, costing, communication. All levels of retail, from luxury to mass market ...\n\n      more description for PRACT-UG 9200 »\n\n      \n\n\n\nGlobal Fashion Industry: Italy will provide students with a deep understanding of the contemporary fashion industry in Italy, as well as of Italy's position in the global fashion arena. The course will drive students through the entire lifecycle of the fashion business, from forecasting trends to retailing, through design, sourcing, product development and production. Particular attention will be dedicated to different marketing aspects of the process, such as: identity building, brand positioning, merchandising, buying, costing, communication. All levels of retail, from luxury to mass market will be covered. The course will end with an analysis of the new challenges, such as sourcing globalization, emerging markets, sustainability and growing significance of technology. A strong effort will be put into organizing site visits to studios, showrooms and factories, as well as meeting with professional players. Each session will be structured to give students an overview of a particular stage of the Industry, through a mix of lectures from the course leader and visiting professionals, studio and showroom visits, walking tours, reading assignments and practical projects.\n\n      less description for PRACT-UG 9200 «",
            "offering": false
        },
        {
            "course_id": "PRACT-UG 9250",
            "course_name": "",
            "description": "PRACT-UG 9250\n\n   Global Fashion Industry: Britain\n\nThis course will introduce students to the lifecycle of fashion, from forecasting fashion trends to the retailing and representation of vintage clothing, through design development, branding, buying and journalism. The course will also explore key issues for the sector – ethics, sustainability and the impact of the digital revolution. It will add a practical dimension to the NYU London triptych of fashion exploration, giving students unique access to studios and businesses working at the heart of London’s vibrant fashion industry. Each session is structured to give students an overview of a pa...\n\n      more description for PRACT-UG 9250 »\n\n      \n\n\n\nThis course will introduce students to the lifecycle of fashion, from forecasting fashion trends to the retailing and representation of vintage clothing, through design development, branding, buying and journalism. The course will also explore key issues for the sector – ethics, sustainability and the impact of the digital revolution. It will add a practical dimension to the NYU London triptych of fashion exploration, giving students unique access to studios and businesses working at the heart of London’s vibrant fashion industry. Each session is structured to give students an overview of a particular stage in the fashion development process, through a mix of lectures from the course leader and visiting professionals, studio visits, walking tours, reading assignments and practical projects.\n\n      less description for PRACT-UG 9250 «",
            "offering": false
        }
    ]
}