{
    "major_id": "PWRT1-GC",
    "file": "./2015-2016/Professional_Writing_(PWRT1-GC).html",
    "courses": [
        {
            "course_id": "PWRT1-GC 1000",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3007",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Spano, Andrew J",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 1000\n\n   Principles of Professional Writing\n\nThis course introduces students to the theory, research and practice of professional writing by means of lectures, assigned readings, and writing workshops, and by means of the production of  a range of professional documents.  Students develop specific writing-focused skills, including the effective use of tables, charts, and graphs to convey information.  Linguistic principles are applied to word choice, sentence creation, and paragraph construction. The course also focuses on mastery of non-writing skills that are essential to produce great professional writing, including how to conduct all...\n\n      more description for PWRT1-GC 1000 »\n\n      \n\n\n\nThis course introduces students to the theory, research and practice of professional writing by means of lectures, assigned readings, and writing workshops, and by means of the production of  a range of professional documents.  Students develop specific writing-focused skills, including the effective use of tables, charts, and graphs to convey information.  Linguistic principles are applied to word choice, sentence creation, and paragraph construction. The course also focuses on mastery of non-writing skills that are essential to produce great professional writing, including how to conduct all necessary research, to consider audience expectations, to analyze how a general format will need to be adapted to specific purposes, and how to organize the hierarchy of information in a specific writing product. The course includes seven major writing assignments culminating in a major report presented online in PowerPoint.\n\n      less description for PWRT1-GC 1000 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 1005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3008",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Borod, Elizabeth",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 1005\n\n   Writing for Digital Media\n\nThis course grounds students in the principles of digital media production. The course focuses on how to create effective content as a writer, but also how to handle all the graphical, multimedia, hypertext, and interactive elements that are involved in digital platforms. Both commercial and professional applications will be considered, as well as the use of digital media writing in political campaigns. Internet marketing channels will be explored as parts of a multi-pronged marketing strategy governing the production of individual objects and copy employed as the expressive elements in Web si...\n\n      more description for PWRT1-GC 1005 »\n\n      \n\n\n\nThis course grounds students in the principles of digital media production. The course focuses on how to create effective content as a writer, but also how to handle all the graphical, multimedia, hypertext, and interactive elements that are involved in digital platforms. Both commercial and professional applications will be considered, as well as the use of digital media writing in political campaigns. Internet marketing channels will be explored as parts of a multi-pronged marketing strategy governing the production of individual objects and copy employed as the expressive elements in Web site design. Students will get intensive practice in the writing of FAQ pages, home-page copy, newsletters, blogs, and informational Web sites and will learn to think critically as a content developer about issues of graphic design, site architecture, and editorial consistency.\n\n      less description for PWRT1-GC 1005 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 1010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3009",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 1010\n\n   Business and Organizational Writing\n\nThe goal of this course is to develop students’ ability to communicate both within and outside of a business or other organization as both members and managers, including the ability to communicate in the organization’s voice.  The course will emphasize the creation of traditional documents such as the memo, business letter, email message, request, reply, proposal, progress report, and major business report so as to inform and persuade.  Students also will develop the ability to analyze such documents for the accuracy and integrity of their content.  Finally, students will learn the basics of ...\n\n      more description for PWRT1-GC 1010 »\n\n      \n\n\n\nThe goal of this course is to develop students’ ability to communicate both within and outside of a business or other organization as both members and managers, including the ability to communicate in the organization’s voice.  The course will emphasize the creation of traditional documents such as the memo, business letter, email message, request, reply, proposal, progress report, and major business report so as to inform and persuade.  Students also will develop the ability to analyze such documents for the accuracy and integrity of their content.  Finally, students will learn the basics of creating documents ready for presentation in the form of digital media.\n\n      less description for PWRT1-GC 1010 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 1015",
            "course_name": "",
            "description": "PWRT1-GC 1015\n\n   Style and Rhetoric\n\nThis course focuses on the two related disciplines of style and rhetoric in an immediate and usable mode readily applicable to the student's work in other courses and projects throughout the program. While there will be some revisiting of classical Aristotelian rhetoric, emphasis will be on the mode of the contemporary organizational voice, its demands, ethics, forms, and applications. In addition, students develop the ability to analyze already existing media products for their rhetorical style, content, intent, and audience. This exploration includes the creation of documents for specified r...\n\n      more description for PWRT1-GC 1015 »\n\n      \n\n\n\nThis course focuses on the two related disciplines of style and rhetoric in an immediate and usable mode readily applicable to the student's work in other courses and projects throughout the program. While there will be some revisiting of classical Aristotelian rhetoric, emphasis will be on the mode of the contemporary organizational voice, its demands, ethics, forms, and applications. In addition, students develop the ability to analyze already existing media products for their rhetorical style, content, intent, and audience. This exploration includes the creation of documents for specified rhetorical purposes and other documents embedded in real-world functionality. Students acquire skills at analyzing audience need, and learn to skillfully shape their writing to persuade, inform, and influence. Manuals of style will be thoroughly consulted so that students develop the ability to use these modes in everyday professional discourse.\n\n      less description for PWRT1-GC 1015 «",
            "offering": false
        },
        {
            "course_id": "PWRT1-GC 1020",
            "course_name": "",
            "description": "PWRT1-GC 1020\n\n   Document Design and Media Presentation\n\nThis course teaches students how to creatively develop presentation of content for specific audiences. Students develop analytic knowledge about how documents are presented, both in electronic and physical \"print,\" as well as through media aids such as PowerPoint. While the emphasis is on actual document creation and presenting through various media, there will also be instruction on the social and semiotic dimensions of communications through these means. Practice will be aimed at different situations, audiences, and assignments and tasks to prepare the student for the world of professional d...\n\n      more description for PWRT1-GC 1020 »\n\n      \n\n\n\nThis course teaches students how to creatively develop presentation of content for specific audiences. Students develop analytic knowledge about how documents are presented, both in electronic and physical \"print,\" as well as through media aids such as PowerPoint. While the emphasis is on actual document creation and presenting through various media, there will also be instruction on the social and semiotic dimensions of communications through these means. Practice will be aimed at different situations, audiences, and assignments and tasks to prepare the student for the world of professional design and presentation. Students also learn how writing can be effectively integrated into presentation design for greater impact and communication, including technical aspects of both print design and electronic/digital media. Students explore the elements of effective design in print and electronic platforms using charts, graphs, tables, and various images and even sounds and effects to create memorable products\n\n      less description for PWRT1-GC 1020 «",
            "offering": false
        },
        {
            "course_id": "PWRT1-GC 1025",
            "course_name": "",
            "description": "PWRT1-GC 1025\n\n   Principles of Information Architecture\n\nStudents in this course learn about information architecture from two vantage points: 1) by practicing the techniques used in the creation of digital media (such as Web sites) to create the hierarchy of information all such media follows, and 2) by exploring and using traditional and classic information architecture as it is presented in extensive databases and through the tools (such as search engines) designed to navigate data. The goal is to provide users with the most facile experience in the location and employment of data. Students learn the basics of populating learning systems with con...\n\n      more description for PWRT1-GC 1025 »\n\n      \n\n\n\nStudents in this course learn about information architecture from two vantage points: 1) by practicing the techniques used in the creation of digital media (such as Web sites) to create the hierarchy of information all such media follows, and 2) by exploring and using traditional and classic information architecture as it is presented in extensive databases and through the tools (such as search engines) designed to navigate data. The goal is to provide users with the most facile experience in the location and employment of data. Students learn the basics of populating learning systems with content through the development of tree systems of categorized knowledge. They also learn to create templates, wireframes, sitemaps, flow charts and diagrams and page elements and to design Web elements used to organize large data sets.\n\n      less description for PWRT1-GC 1025 «",
            "offering": false
        },
        {
            "course_id": "PWRT1-GC 3000",
            "course_name": "",
            "description": "PWRT1-GC 3000\n\n   Writing for the Health Professions\n\nThis course is designed for students to broaden their understanding of professional communications, possibly develop a specialization in the area of the allied health professions. The material concentrates on the various types of documents, internal and external, required by the profession. The course is also intended as a primer for students interested in the healthcare professions per se who may be moving on to a professional career in that field. It is expected, however, that the technical and scientific nature of the course content will augment any pursuit of greater skill and knowledge in...\n\n      more description for PWRT1-GC 3000 »\n\n      \n\n\n\nThis course is designed for students to broaden their understanding of professional communications, possibly develop a specialization in the area of the allied health professions. The material concentrates on the various types of documents, internal and external, required by the profession. The course is also intended as a primer for students interested in the healthcare professions per se who may be moving on to a professional career in that field. It is expected, however, that the technical and scientific nature of the course content will augment any pursuit of greater skill and knowledge in technical and informational writing in general. There will be consideration given to the public affairs dimension of health communications, as well as analysis and production of journalistic efforts aimed at health publications. Finally, the course is for those who in their professions are required to convey technical health information to hospitals, clinics, nonprofit agencies, government, and the public.\n\n      less description for PWRT1-GC 3000 «",
            "offering": false
        },
        {
            "course_id": "PWRT1-GC 3005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3010",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Dabrowska, Marta",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 3005\n\n   Promotional Writing\n\nThe purpose of this course is to take the student who already has some familiarity with writing copy for public relations, advertising, and Web site creation and developing those skills to the solidly professional level. First, the techniques of persuasion will be discussed and practiced, including motivational sequences, the \"you\" orientation, big ideas, and mass psychology. Next, students will embark upon the creation of a complete \"press kit\" which will include copy and graphic information as well as digital media designed to promote a product, service, or idea. The press kit will be reprod...\n\n      more description for PWRT1-GC 3005 »\n\n      \n\n\n\nThe purpose of this course is to take the student who already has some familiarity with writing copy for public relations, advertising, and Web site creation and developing those skills to the solidly professional level. First, the techniques of persuasion will be discussed and practiced, including motivational sequences, the \"you\" orientation, big ideas, and mass psychology. Next, students will embark upon the creation of a complete \"press kit\" which will include copy and graphic information as well as digital media designed to promote a product, service, or idea. The press kit will be reproducible in both digital online form and as hard copy. Methods of information dissemination, to individuals, and large and small groups, will be explored as well. Finally, students will explore a solid grounding in \"new media\" methods of promotion and persuasion such as promotional Web sites, blogs, social networking Web sites, and real-time bulletin boards such as Twitter.\n\n      less description for PWRT1-GC 3005 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 3010",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "3019",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Spano, Andrew J",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 3010\n\n   Independent Study in Professional Writing\n\nThe independent study course is a valuable method for students to pursue special interests in depth, under the direction of a faculty member. It is intended to advance the student’s knowledge and skills in ways clearly useful in professional writing settings. The course will focus on a significant contemporary question, issue, or concern in professional writing. It is the equivalent of a regular 3-credit elective course in the program, and contains a comparable quantity of academic and applied work. It can, for example, address pure research issues that potentially affect the theory and practi...\n\n      more description for PWRT1-GC 3010 »\n\n      \n\n\n\nThe independent study course is a valuable method for students to pursue special interests in depth, under the direction of a faculty member. It is intended to advance the student’s knowledge and skills in ways clearly useful in professional writing settings. The course will focus on a significant contemporary question, issue, or concern in professional writing. It is the equivalent of a regular 3-credit elective course in the program, and contains a comparable quantity of academic and applied work. It can, for example, address pure research issues that potentially affect the theory and practice of professional writing; organizational, technological, or social challenges to the profession and possible practical innovations and solutions; or other issues.\n\nStudents registering for this course meet with the Academic Advisor of the program to discuss and get approval for the planned independent study content and to select a faculty member qualified to direct the course. The faculty member will require a formal research proposal which includes a suitable bibliography consisting of a sufficient number of texts, including peer-reviewed and other academic papers. Student and faculty will establish a timeline for meetings and for individual assignments, and any other product or application. An academic research paper is required focusing on the significance and relevance of the study to professional writing, and highlighting the topical concern of the study. In addition, a student may propose to engage in a semester-long project demonstrating the professional application of the topic. Evaluation is based on meeting deadlines, stated expectations, and on the quality and quantity of the completed work.  Students can take one Independent Study course during the duration of their degree.\n\n      less description for PWRT1-GC 3010 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 3015",
            "course_name": "",
            "description": "PWRT1-GC 3015\n\n   Technical Writing for the Information Professions\n\nThis course has two primary foci: how to present technical information in forms readily useable to a broad audience of laypersons and professionals, and how to communicate to reach audiences with unequivocal meaning and intent. Students are expected to understand and appreciate these needs and be able to organize and manipulate information in a professional context using organized writing, graphic aids, and through the writing of abstracts, procedures, manuals, and white papers.  Students will acquire the ability to convey technical concepts to a general audience of lay persons without reducti...\n\n      more description for PWRT1-GC 3015 »\n\n      \n\n\n\nThis course has two primary foci: how to present technical information in forms readily useable to a broad audience of laypersons and professionals, and how to communicate to reach audiences with unequivocal meaning and intent. Students are expected to understand and appreciate these needs and be able to organize and manipulate information in a professional context using organized writing, graphic aids, and through the writing of abstracts, procedures, manuals, and white papers.  Students will acquire the ability to convey technical concepts to a general audience of lay persons without reduction of the meaning and intent of the information. Within the technical context, students are expected to understand the principles of information technology as they apply to the presentation of concepts, ideas, procedures, and instructions.\n\n      less description for PWRT1-GC 3015 «",
            "offering": false
        },
        {
            "course_id": "PWRT1-GC 3020",
            "course_name": "",
            "description": "PWRT1-GC 3020\n\n   Writing for Science and the Environment\n\nThis course offers specialized training in the complexities of professional, scientific and environmental writing.  Students develop advanced skills in researching, interviewing, and writing scientific and environmental topics for a variety of formats. Through the production of press releases, policy statements, technical white papers, and reports, students learn to communicate scientific information clearly and accurately.  A particular focus is the written communication of scientific materials and complex scientific and environmental issues for general audiences and policymakers. Both the Ch...\n\n      more description for PWRT1-GC 3020 »\n\n      \n\n\n\nThis course offers specialized training in the complexities of professional, scientific and environmental writing.  Students develop advanced skills in researching, interviewing, and writing scientific and environmental topics for a variety of formats. Through the production of press releases, policy statements, technical white papers, and reports, students learn to communicate scientific information clearly and accurately.  A particular focus is the written communication of scientific materials and complex scientific and environmental issues for general audiences and policymakers. Both the Chicago and APA styles will be practiced.  Students are required to complete twelve writing assignments and one final paper.\n\n      less description for PWRT1-GC 3020 «",
            "offering": false
        },
        {
            "course_id": "PWRT1-GC 3025",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3234",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 3025\n\n   Writing Proposals and Grants\n\nThis course teaches the strategies and processes of writing effective research proposals as well as fundraising documents, including grant proposals.  Students explore the elements and characteristics of a successful proposal, including information gathering, organization, and budget review. The basics of conducting needs assessments, establishing goals for funding, and writing proposals based on those needs and goals will be explored, as will tailoring proposals to the prospective fund source.  The components of a successful fundraising campaign, including the use of new media and social netw...\n\n      more description for PWRT1-GC 3025 »\n\n      \n\n\n\nThis course teaches the strategies and processes of writing effective research proposals as well as fundraising documents, including grant proposals.  Students explore the elements and characteristics of a successful proposal, including information gathering, organization, and budget review. The basics of conducting needs assessments, establishing goals for funding, and writing proposals based on those needs and goals will be explored, as will tailoring proposals to the prospective fund source.  The components of a successful fundraising campaign, including the use of new media and social networks, will also be examined and practiced.  Participants complete twelve weekly written assignments, culminating in a fundraising plan.\n\n      less description for PWRT1-GC 3025 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 3030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3233",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Ryst, Sonja",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 3030\n\n   Writing for Finance\n\nThis course is designed for students interested in advancing their ability to write within a professional financial context. It is expected that students will develop their ability to write in both a journalistic and a technical style. As part of this development, students will hone their skill in analyzing corporate literature, annual reports, financial prospecti, and other documents generated in the financial world. Financial strategy will be explored through corporate literature and objective journalism from the financial publications. Topics are introduced using articles and business cases...\n\n      more description for PWRT1-GC 3030 »\n\n      \n\n\n\nThis course is designed for students interested in advancing their ability to write within a professional financial context. It is expected that students will develop their ability to write in both a journalistic and a technical style. As part of this development, students will hone their skill in analyzing corporate literature, annual reports, financial prospecti, and other documents generated in the financial world. Financial strategy will be explored through corporate literature and objective journalism from the financial publications. Topics are introduced using articles and business cases as well as major investigative journalism and situations from the textbook. Students are expected to complete at least one major report on an approved topic and to provide a formal presentation with media to the online class. Students will become familiar with the financial markets, corporate communication, and the terminology of the global marketplace.\n\n      less description for PWRT1-GC 3030 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 3900",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3054",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Spano, Andrew J",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 3900\n\n   Portfolio/Thesis Requirement\n\nThis program offers a unique pairing of a thesis and an e-portfolio. Both products work together to create a significant body of work spanning the needs of the professional environment and the requirements of the academic system of evaluation. Students contract with a faculty adviser in the first or second semesters, indicating a concentration in a particular discipline of professional writing (e.g. medicine, digital media, finance, grants, business), or a combination of disciplines. The portfolio will contain documents and other media demonstrating the student's understanding of the principle...\n\n      more description for PWRT1-GC 3900 »\n\n      \n\n\n\nThis program offers a unique pairing of a thesis and an e-portfolio. Both products work together to create a significant body of work spanning the needs of the professional environment and the requirements of the academic system of evaluation. Students contract with a faculty adviser in the first or second semesters, indicating a concentration in a particular discipline of professional writing (e.g. medicine, digital media, finance, grants, business), or a combination of disciplines. The portfolio will contain documents and other media demonstrating the student's understanding of the principles, concepts, styles, formats, and content of the chosen concentration. While the portfolio will develop during the entire experience in the program, the thesis is a culminating study reserved for the final semester (Fall 3) of the student's experience. Students are required to take only two electives during the ultimate term to provide for time to work, under the guidance of an advisor, on the thesis. The thesis will demonstrate the theoretical knowledge behind the portfolio and bridge the portfolio with course work and other products from the online courses. The thesis will be in the form of a major report and will range from 40-60 pages single spaced.\n\n      less description for PWRT1-GC 3900 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 3905",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3055",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Spano, Andrew J",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 3905\n\n   Internship\n\nThe Internship gives students the opportunity to apply course work to the professional writing field in a supervised environment. Placements are in organizations where professional writing is required, or where skills from the course of study are practiced, such as writing for digital media or developing presentations or grant writing. The student and the work are evaluated by the hosting organization and the supervising faculty. During the six-week placement, students report each week to the faculty member in the form of a narrative description, with analysis of tasks performed and knowledge ...\n\n      more description for PWRT1-GC 3905 »\n\n      \n\n\n\nThe Internship gives students the opportunity to apply course work to the professional writing field in a supervised environment. Placements are in organizations where professional writing is required, or where skills from the course of study are practiced, such as writing for digital media or developing presentations or grant writing. The student and the work are evaluated by the hosting organization and the supervising faculty. During the six-week placement, students report each week to the faculty member in the form of a narrative description, with analysis of tasks performed and knowledge gained, showing the continuity and contextualization of those accomplishments. At the end of the internship, the student writes a formal report tying the experience into the relevant literature. This report may include supporting documents or other products created during the Internship which may be added to the student’s e-portfolio.\n\n      less description for PWRT1-GC 3905 «",
            "offering": true
        },
        {
            "course_id": "PWRT1-GC 3910",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3056",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Spano, Andrew J",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PWRT1-GC 3910\n\n   Directed Study\n\nThe Directed Study allows students to apply course work to a formal project of study, approved by a faculty member and with a specified outcome or product. The criterion for a successful directed study will be the practice or analysis of professional documents and products that deepen and expand understanding of the discipline. A student making this choice may arrange with his or her employer to complete a special project, or may work independently to create a product relevant to that student’s specialization or area of interest. During the six-week study the student will report each week to t...\n\n      more description for PWRT1-GC 3910 »\n\n      \n\n\n\nThe Directed Study allows students to apply course work to a formal project of study, approved by a faculty member and with a specified outcome or product. The criterion for a successful directed study will be the practice or analysis of professional documents and products that deepen and expand understanding of the discipline. A student making this choice may arrange with his or her employer to complete a special project, or may work independently to create a product relevant to that student’s specialization or area of interest. During the six-week study the student will report each week to the supervising faculty member on progress toward the established goals of the proposal. The study culminates in a report accompanying the project, and may include specific writing documents or other products associated with the report.\n\n      less description for PWRT1-GC 3910 «",
            "offering": true
        }
    ]
}