{
    "major_id": "PUHE-UE",
    "file": "./2015-2016/Public_Health_(PUHE-UE).html",
    "courses": [
        {
            "course_id": "PUHE-UE 70",
            "course_name": "Health and Society:",
            "description": "PUHE-UE   70 Health and Society: \nThis course examines the various dimensions of the field of public health & how the public's health is protected. Students will explore the ways social, economic, & political forces influence the health of populations. Additionally, this course will focus upon some of the current ethical public health dilemmas where the rights of the individual vesus the rights of society come into conflict.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1000",
            "course_name": "Independent Study",
            "description": "PUHE-UE 1000 Independent Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point..  Independent study cannot be applied to the established professional education sequence in teaching curricula.  Each departmental program has established its own maximum credit allowance for independent study.  This information may be obtain from the student's department.  Prior to registering for independent study; each student should obtain an Independent Study approval from the adviser.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1306",
            "course_name": "Intro to Epidemiology",
            "description": "PUHE-UE 1306 Intro to Epidemiology \nIntroduction to the field of public health epidemiology, emphasizing methods for assessing factors associated with the distribution and etiology of health and disease, including social factors such as race and gender and global differences in disease distribution and control.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1310",
            "course_name": "Intro to Global Public Health",
            "description": "PUHE-UE 1310 Intro to Global Public Health \nIntroduction to public health issues from a global perspective. Examination of social environment influences and their impact on populations throughout the world. The threat of global epidemics will be examined as well as strategies to control the spread of disease. Current ethical public health dilemmas where the rights of individuals can conflict with national or international public safety are discussed.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1315",
            "course_name": "Intro to Public Health Nutrition",
            "description": "PUHE-UE 1315 Intro to Public Health Nutrition \nIntroduction to the concepts, principles, and scope of public health nutrition. Discussion of major factors that distinguish public health nutrition from clinical nutrition with a focus on populations rather than individuals. Integrate basic information about food and nutrition into discussions of policies and programs designed to improve the dietary intake, physical activity level, and health status of populations, in addition to addressing barriers to implementation of important public health policies and programs.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1321",
            "course_name": "Principles of Health Promotion and Education",
            "description": "PUHE-UE 1321 Principles of Health Promotion and Education \nIntroduction to the theories of health behavior that guide many public health interventions. Compares and contrasts the assumptions of different theories in shaping health behavior, and examines the ways in which such theories are currently employed in public health interventions. Students will undertake a semester long project applying the skills gained in class to a public health problem they identify on the college campus.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1323",
            "course_name": "Environmental Health Soc Movements/Public Policy",
            "description": "PUHE-UE 1323 Environmental Health Soc Movements/Public Policy \nExamines some of the key issues, achievements, shortfalls and principles of environmental health practice through a series of case studies. Focuses on the how environmental health issues are defined and approached by civic groups, government officials and researchers. It will highlight how environmental threats come to the attention of the public and weigh the options for addressing these threats.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1325",
            "course_name": "Understanding Social Context/Risk Behavior:",
            "description": "PUHE-UE 1325 Understanding Social Context/Risk Behavior: \nFocuses on the relationship of risk behavior to social context. Includes discussion of the distribution of different types of risk factors across the U.S. population over the past fifty years, paying particular attention to class, race, geographic region of the country and age. Examines the historical policy approaches to addressing risk behaviors and social issues such as substance abuse, violence, and forms of sexual behavior. Emphasis will be placed on the ways in which social interpretations of behaviors have contributed to the development of public health interventions to address them.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1327",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "11669",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 202",
                    "time": "Fri 12.30 PM - 3.15 PM",
                    "open": true,
                    "professor": "Guttmacher, Sally"
                }
            ],
            "course_name": "Public Health Profession and Practice:",
            "description": "PUHE-UE 1327 Public Health Profession and Practice: \nFamiliarizes students with the practice of public health, introducing them to the various settings and arenas in which public health professionals work. Through discussions with professionals in the field, students gain exposure to the roles and responsibilities of the public health workforce, and consider the different contributions and limitations of various efforts.",
            "offering": true
        },
        {
            "course_id": "PUHE-UE 1330",
            "course_name": "Community Public Health Internship and Seminar",
            "description": "PUHE-UE 1330 Community Public Health Internship and Seminar \nA culminating experience that broadens students' exposure to public health practice, facilitates valuable work experience, and increases students knowledge of specific career opportunities. Placements are a semester long and serve as the basis for the internship seminar that meets periodically throughout the semester.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 1335",
            "course_name": "Introduction to Public Health Research",
            "description": "PUHE-UE 1335 Introduction to Public Health Research \nStudent teams engage in the study and practice of data collection and analysis using tools and applications commonly used in public health research. The course is divided into two units: an introduction to public health informatics, and an introduction to survey research.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 9070",
            "course_name": "Health and Society",
            "description": "PUHE-UE 9070 Health and Society",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 9070",
            "course_name": "Health and Society",
            "description": "PUHE-UE 9070 Health and Society \nThis course examines the various dimensions of the field of public health & how the public's health is protected. Students will explore the ways social, economic, & political forces influence the health of populations. Additionally, this course will focus upon some of the current ethical public health dilemmas where the rights of the individual vesus the rights of society come into conflict.",
            "offering": false
        },
        {
            "course_id": "PUHE-UE 9306",
            "course_name": "Introduction  to Epidemiology",
            "description": "PUHE-UE 9306 Introduction  to Epidemiology",
            "offering": false
        }
    ]
}