{
    "major_id": "PADM1-UC",
    "file": "./2015-2016/Public_Administration_(PADM1-UC).html",
    "courses": [
        {
            "course_id": "PADM1-UC 6600",
            "course_name": "Intro to Public Administration",
            "description": "PADM1-UC 6600 Intro to Public Administration",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6601",
            "course_name": "Public Policy Analysis",
            "description": "PADM1-UC 6601 Public Policy Analysis \nThis course is intended to provide a broad introduction to the field of public policy analysis. The goals of the course are to better understand (1) the nature of public policy, (2) stages within the policy process; (3) the policy players; and (4) basic methods of policy analysis. Students will gain an understanding and knowledge in the problem-solving process and will enhance their research skills, including design, data collection, and data analysis.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6620",
            "course_name": "Labor Relations & Mediation",
            "description": "PADM1-UC 6620 Labor Relations & Mediation \nThis course will provide students with an overview of the major influences and trends in labor history in the U.S with a focus on the historical role of government involvement in resolving labor disputes.  It will also focus, from a historical perspective on the development of mediation as an alternative employment dispute mechanism, the principles of mediation and how mediation is used to resolve labor disputes.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6621",
            "course_name": "",
            "description": "PADM1-UC 6621\n\n   Government Auditing Practices\n\nGovernment auditing plays an important role in holding government officials accountable for using public funds, taxpayer?s money.  This course will introduce students to the basics of government auditing standards, principles and techniques.  Students will gain an understanding of the U.S. Comptroller General?s yellow book auditing standards and basic strategies for auditing government agencies.   This course is designed to provide students with a practical understanding of the auditing field in the public sector and will focus on acquiring knowledge of specific auditing skills and techniques....\n\n      more description for PADM1-UC 6621 »\n\n      \n\n\n\nGovernment auditing plays an important role in holding government officials accountable for using public funds, taxpayer?s money.  This course will introduce students to the basics of government auditing standards, principles and techniques.  Students will gain an understanding of the U.S. Comptroller General?s yellow book auditing standards and basic strategies for auditing government agencies.   This course is designed to provide students with a practical understanding of the auditing field in the public sector and will focus on acquiring knowledge of specific auditing skills and techniques.  Students will learn how to plan an audit, prepare work papers, and develop sufficient evidence to prepare reports and findings.  In addition, case studies of government audits will be used to reinforce concepts and techniques presented in the curriculum.\n\n      less description for PADM1-UC 6621 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6623",
            "course_name": "",
            "description": "PADM1-UC 6623\n\n   Budgeting\n\nThis course will provide students with an overview and understanding of the federal budget process and the fundamental principles of public finance.  Students will obtain an understanding of the nature of the federal budget process, various factors that influence the budgetary process, and the basic techniques and methods used by government agencies and officials when preparing the federal budget.  Students will also gain an understanding of the financial structure of government agencies by examining from a fiscal administration standpoint: budgets, revenue sources, structure, and administrati...\n\n      more description for PADM1-UC 6623 »\n\n      \n\n\n\nThis course will provide students with an overview and understanding of the federal budget process and the fundamental principles of public finance.  Students will obtain an understanding of the nature of the federal budget process, various factors that influence the budgetary process, and the basic techniques and methods used by government agencies and officials when preparing the federal budget.  Students will also gain an understanding of the financial structure of government agencies by examining from a fiscal administration standpoint: budgets, revenue sources, structure, and administration, and the administration of public debt.\n\n      less description for PADM1-UC 6623 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6624",
            "course_name": "Orgnztl Theory for Govtl & Public Organizations",
            "description": "PADM1-UC 6624 Orgnztl Theory for Govtl & Public Organizations \nThis course will provide students with an understanding of various principles and paradigms of organization theory and behavior with particular emphasis on the analysis of public organizations.  Various theories and models of organizational behavior will be presented.  Students will then, apply these theories/models to the analysis of organizational processes and operations including bureaucratic decision-making and organizational change. Selected readings will supplement this approach by providing additional insight into the operations of different types of bureaucratic agencies.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6625",
            "course_name": "",
            "description": "PADM1-UC 6625\n\n   Decision Making in The Pub Sect: Case Studies\n\nPublic organizations perform crucial functions, and they need effective management. This course will focus on the process by which managers make decisions in the public sector. Specifically the course will discuss various analytical, behavioral, and information techniques which are required to successfully manage any large-scale organization in the public sector, provide students with an understanding of the organization concepts and definitions that underlie the study of public administration, and introduce techniques that can be applied in any organization at any level to help resolve concre...\n\n      more description for PADM1-UC 6625 »\n\n      \n\n\n\nPublic organizations perform crucial functions, and they need effective management. This course will focus on the process by which managers make decisions in the public sector. Specifically the course will discuss various analytical, behavioral, and information techniques which are required to successfully manage any large-scale organization in the public sector, provide students with an understanding of the organization concepts and definitions that underlie the study of public administration, and introduce techniques that can be applied in any organization at any level to help resolve concrete public policy concerns. This course will be supplemented by using a case-study approach to government decision making by analyzing the decision-making process of related cases.\n\n      less description for PADM1-UC 6625 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6640",
            "course_name": "",
            "description": "PADM1-UC 6640\n\n   Environmental Policy & Planning\n\nThis course provides an overview of the legal foundations, theory, and practice of environmental planning.  Rooted in growing environmental awareness of the 1960s and 1970s, environmental regulations attempt to balance private interests in resource development with the public good.  A background in human development and its impact on resource use will lay the groundwork for discussion of the environmental planning?s regulatory and legal framework.  Public participation in the planning process, preservation of wetlands and farmlands, and government bodies that oversee the planning processes, an...\n\n      more description for PADM1-UC 6640 »\n\n      \n\n\n\nThis course provides an overview of the legal foundations, theory, and practice of environmental planning.  Rooted in growing environmental awareness of the 1960s and 1970s, environmental regulations attempt to balance private interests in resource development with the public good.  A background in human development and its impact on resource use will lay the groundwork for discussion of the environmental planning?s regulatory and legal framework.  Public participation in the planning process, preservation of wetlands and farmlands, and government bodies that oversee the planning processes, and rapidly evolving planning technologies will be reviewed.\n\n      less description for PADM1-UC 6640 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6641",
            "course_name": "",
            "description": "PADM1-UC 6641\n\n   Techonology & Urban Development\n\nThis course traces the connection between evolving technologies and urban development patterns, from the rise of railroads in the mid 19th century to the dot com collapse of 2000.  Technologies now commonplace, from the telephone to the elevator, played key roles in creating urban economic centers as the central nervous system of national and global economic activity.  The environmental implications of high technology, from boosting industrial efficiency to the \"death of distance\" will be explored in context of urban settlement and livability.  The next wave of energy technologies - envisioned...\n\n      more description for PADM1-UC 6641 »\n\n      \n\n\n\nThis course traces the connection between evolving technologies and urban development patterns, from the rise of railroads in the mid 19th century to the dot com collapse of 2000.  Technologies now commonplace, from the telephone to the elevator, played key roles in creating urban economic centers as the central nervous system of national and global economic activity.  The environmental implications of high technology, from boosting industrial efficiency to the \"death of distance\" will be explored in context of urban settlement and livability.  The next wave of energy technologies - envisioned as the \"hydrogen economy\" - will be highlighted.\n\n      less description for PADM1-UC 6641 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6642",
            "course_name": "Economic Development Planning & Policy",
            "description": "PADM1-UC 6642 Economic Development Planning & Policy \nThis course, after reviewing economic development theory, focuses largely on economic development policy at the national, state, and local levels.  In light of the technology boom and bust of the 1990s, as well as major disparities in regional employment, job growth and retention, and industrial sector mixes, theories covered will include product cycle theory, trade theory, growth theories and models, and theories of localized innovation.  Access to skilled labor, ?knowledge centers,? infrastructure, cultural and urban amenities will be assessed as anchors of economic development.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6643",
            "course_name": "",
            "description": "PADM1-UC 6643\n\n   New York City Infrastructure\n\nThis course will cover the history and current status of New York City?s vast infrastructure systems.  Rooted in early industrial New York, and largely built in response to dire economic and social conditions, these massive systems continue to play an essential role in the region?s economy, social and cultural life.  Surveying the world?s most extensive water and subway systems (19th century systems) followed by the highway construction boom largely associated with the Robert Moses era (early-mid 20th century), the class will also access broader definitions of public works. These include parks...\n\n      more description for PADM1-UC 6643 »\n\n      \n\n\n\nThis course will cover the history and current status of New York City?s vast infrastructure systems.  Rooted in early industrial New York, and largely built in response to dire economic and social conditions, these massive systems continue to play an essential role in the region?s economy, social and cultural life.  Surveying the world?s most extensive water and subway systems (19th century systems) followed by the highway construction boom largely associated with the Robert Moses era (early-mid 20th century), the class will also access broader definitions of public works. These include parks, waterfront, power systems as well as new high tech infrastructure that has played an essential role in the 1990s economic boom.  The chief aim is to provide contemporary context for individual?s view of infrastructure and daily use of public systems. The evolving perception of public works, infrastructure as societal symbol, infrastructure as ?social issue?, the shift from public transit to private auto-based systems, the battle to rebuild systems while they?re in use, and New York?s unique position as center of disasters as well as innovation will be covered.  Site visits and guest lecturers are planned.\n\n      less description for PADM1-UC 6643 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6644",
            "course_name": "",
            "description": "PADM1-UC 6644\n\n   The Planning Process\n\nThis course presents an overview of the mechanisms that control the contemporary built environment.  The modern city can be viewed as an intricate organism governed by complex social, economic, and historic influences. Governmental oversight of the development process in the U.S. is largely reactive, designed to inventory and mitigate potential impacts of privately driven development activities. Modern day regulatory mechanisms, including federal, state, and local ordinances, create broad criteria for developing and analyzing development options. Local regulations vary widely, and will be disc...\n\n      more description for PADM1-UC 6644 »\n\n      \n\n\n\nThis course presents an overview of the mechanisms that control the contemporary built environment.  The modern city can be viewed as an intricate organism governed by complex social, economic, and historic influences. Governmental oversight of the development process in the U.S. is largely reactive, designed to inventory and mitigate potential impacts of privately driven development activities. Modern day regulatory mechanisms, including federal, state, and local ordinances, create broad criteria for developing and analyzing development options. Local regulations vary widely, and will be discussed in the context of New York City?s City Environmental Quality Review (CEQR) process, and the Uniform Land Use Review Procedure (ULURP), among the nation?s most stringent local controls. The history of zoning in the U.S., zoning definitions, bulk and height controls, urban design, and related public oversight will be reviewed, and contrasted with regional planning?s impact on ex-urban and rural areas..  Students will receive a hands-on look at the New York City development process in light of both private development and \"public works\", including housing, infrastructure, energy, and transportation systems.\n\n      less description for PADM1-UC 6644 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6645",
            "course_name": "",
            "description": "PADM1-UC 6645\n\n   Transportation Planning in Urban Centers\n\nIn dense urban centers, the tradeoff between public transportation systems and private auto-based infrastructure is debated in context of local, state, and national transportation priorities. In New York City, private auto ownership per capita is the lowest in the country, while the subway system carries over a billion passengers a year.  Rebuilding 60-year-old highways systems - often with outmoded designs, and damaged by decades of poor maintenance - is made far more complex by the need to simultaneously keep them open to traffic during work hours.  Alternative strategies to road building in...\n\n      more description for PADM1-UC 6645 »\n\n      \n\n\n\nIn dense urban centers, the tradeoff between public transportation systems and private auto-based infrastructure is debated in context of local, state, and national transportation priorities. In New York City, private auto ownership per capita is the lowest in the country, while the subway system carries over a billion passengers a year.  Rebuilding 60-year-old highways systems - often with outmoded designs, and damaged by decades of poor maintenance - is made far more complex by the need to simultaneously keep them open to traffic during work hours.  Alternative strategies to road building include pricing strategies, high tech demand control systems, pedestrian and bicycle programs.  An overview of the theory and practice of urban transportation planning will provide background for technical analytical techniques, focusing on level of service (LOS) assessment, for public transportation, autos, and pedestrian infrastructure. The class will familiarize students with the history and status of transportation planning activities as affected by national, state and local legislation.  Recent case studies will be highlighted, including Boston's 'Big Dig,' New York City?s West Side highway, and Portland's MAX light rail system.\n\n      less description for PADM1-UC 6645 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6646",
            "course_name": "Cities & Intellectuals",
            "description": "PADM1-UC 6646 Cities & Intellectuals",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6650",
            "course_name": "",
            "description": "PADM1-UC 6650\n\n   Globalization & Public Policy\n\nThis course is designed for students interested\nin the impact of globalization on public policy.\nGlobalization refers to ever-increasing levels of\npolitical, economic, social, and cultural connections\namong the world?s nations, institutions, citizens,\nand businesses. Some people view these\ntrends very positively, while others are harsh critics.\nQuestions the course considers include: What\nis globalization? Is it a new phenomenon? Why do\npeople have such sharp differences of opinion\nabout it? Where did it come from and what are its\neffects? Topics include the pros and cons of globalization;\ntra...\n\n      more description for PADM1-UC 6650 »\n\n      \n\n\n\nThis course is designed for students interested\nin the impact of globalization on public policy.\nGlobalization refers to ever-increasing levels of\npolitical, economic, social, and cultural connections\namong the world?s nations, institutions, citizens,\nand businesses. Some people view these\ntrends very positively, while others are harsh critics.\nQuestions the course considers include: What\nis globalization? Is it a new phenomenon? Why do\npeople have such sharp differences of opinion\nabout it? Where did it come from and what are its\neffects? Topics include the pros and cons of globalization;\ntrade between and among nations; the\noutsourcing of jobs; sweatshop labor; the roles of\nthe United Nations, IMF, and the World Bank;\nglobalization and the environment; worldwide\nhuman rights; and cultural domination and\ncultural preservation.\n\n      less description for PADM1-UC 6650 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6651",
            "course_name": "Health Planning & Policy",
            "description": "PADM1-UC 6651 Health Planning & Policy \nThis course introduces students to health planning and policy analysis by examining key policy issues in the health sector. The course provides an overview of the principles behind health planning and policy making. Examples of national policies will be used for analyzing policy decisions, including Medicare, Medicaid, managed care, providing adequate access to medical services for all, the control of rising health care costs, and regulation of the medical care industry.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6652",
            "course_name": "Formation & Analysis of Education Policy",
            "description": "PADM1-UC 6652 Formation & Analysis of Education Policy \nThis course examines the relationships among politics, education policy development, and policy implementation at the local, state, and national levels.  The course will cover such topics as policy formulation, interest groups, political goals and strategies, the role of local school boards, state boards of education, multiculturalism, affirmative action, bilingual education, and school choice (vouchers).",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6653",
            "course_name": "State & Local Government",
            "description": "PADM1-UC 6653 State & Local Government \nThis course covers the basics of how state and local governments operate in the United States. It includes topics such as federalism, state constitutions, political parties and elections at the state and local level, state legislatures, governors, the judiciary at the state level, the structure of local governments, public budgeting, and service delivery. The course also deals with several policy areas germane to state and local governments such as education, criminal justice, economic development, social welfare, and health care policy.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6660",
            "course_name": "Public Administration Ethics",
            "description": "PADM1-UC 6660 Public Administration Ethics",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 6661",
            "course_name": "",
            "description": "PADM1-UC 6661\n\n   Public Personnel Management\n\nPublic personnel management is at the heart of\nthe governmental process. Some of the most contentious\nissues in American society are actually\npersonnel issues. These include sexual harassment,\nsmoking in the workplace, discrimination against\nworkers with AIDS, and affirmative action. If the\norganization has more than a dozen or so people,\nit?s probably someone from personnel who handles\nthese issues. Whether in a business or a governmental\norganization, someone has to know what\nmust, can, and can?t be done in hiring, training,\nappraising, caring for, and maintaining merit standards\nfor employe...\n\n      more description for PADM1-UC 6661 »\n\n      \n\n\n\nPublic personnel management is at the heart of\nthe governmental process. Some of the most contentious\nissues in American society are actually\npersonnel issues. These include sexual harassment,\nsmoking in the workplace, discrimination against\nworkers with AIDS, and affirmative action. If the\norganization has more than a dozen or so people,\nit?s probably someone from personnel who handles\nthese issues. Whether in a business or a governmental\norganization, someone has to know what\nmust, can, and can?t be done in hiring, training,\nappraising, caring for, and maintaining merit standards\nfor employees. This course looks at the\nrange of responsibilities and activities that fall\nunder the umbrella of personnel administration. It\ndraws on the most recent personnel literature, legislation,\nand current headlines to gain an appreciation\nof what personnel management is about, why\nit is a crucial function for organizations everywhere,\nand how it affects everyone both as an employee\nand as a citizen.\n\n      less description for PADM1-UC 6661 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 7940",
            "course_name": "Internship in Public Administration",
            "description": "PADM1-UC 7940 Internship in Public Administration \nThis course will provide students with an opportunity to gain experience and knowledge through fieldwork in the public or non-profit sectors.  Students are required to complete a minimum of 90 hours of fieldwork over the course of the semester under the guidance of a fieldwork supervisor and McGhee faculty member.  Regular meetings with the internship coordinator, the maintenance of a journal, and a final written project are required.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 7990",
            "course_name": "Sp Tpcs in Public Admin",
            "description": "PADM1-UC 7990 Sp Tpcs in Public Admin \nThis course provides an opportunity for intensive study of specific topics in Public Administration. It focuses on a different theme each time it is offered. The specific topic is listed in each semester?s schedule.",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 7991",
            "course_name": "",
            "description": "PADM1-UC 7991\n\n   Senior Project Seminar: Public Administration\n\nThe graduation project consists of either a seminar project or an internship. The seminar allows students to develop a project under the guidance of a faculty mentor. The seminar requires regular class attendance to discuss projects and to document them, as well as individual meetings with the mentor. The projects themselves may be in one of the degree?s various concentration areas. Projects must be the student?s individual, original work and include the product, the technical documentation, and a learning experience essay summarizing the process and skills used. The internship provides an opp...\n\n      more description for PADM1-UC 7991 »\n\n      \n\n\n\nThe graduation project consists of either a seminar project or an internship. The seminar allows students to develop a project under the guidance of a faculty mentor. The seminar requires regular class attendance to discuss projects and to document them, as well as individual meetings with the mentor. The projects themselves may be in one of the degree?s various concentration areas. Projects must be the student?s individual, original work and include the product, the technical documentation, and a learning experience essay summarizing the process and skills used. The internship provides an opportunity for students to use knowledge gained in their major combined with the knowledge provide by professionals in a variety of industry settings. Students are required to complete a minimum of 100 hours during the semester to earn four credits. (Students? full-time jobs cannot serve as internships.) In addition to hours at their placement, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final learning experience essay summarizing the outcome, including samples of work completed.\n\n      less description for PADM1-UC 7991 «",
            "offering": false
        },
        {
            "course_id": "PADM1-UC 7992",
            "course_name": "",
            "description": "PADM1-UC 7992\n\n   Senior Projct Internshp: Public Administration\n\nThe graduation project consists of either a seminar project or an internship. The internship provides an opportunity for students to use knowledge gained in their major combined with the knowledge provide by professionals in a variety of industry settings. Students are required to complete a minimum of 100 hours during the semester to earn four credits. (Students' full-time jobs cannot serve as internships.) In addition to hours at their placement, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final learning-experience essay summarizing t...\n\n      more description for PADM1-UC 7992 »\n\n      \n\n\n\nThe graduation project consists of either a seminar project or an internship. The internship provides an opportunity for students to use knowledge gained in their major combined with the knowledge provide by professionals in a variety of industry settings. Students are required to complete a minimum of 100 hours during the semester to earn four credits. (Students' full-time jobs cannot serve as internships.) In addition to hours at their placement, they meet regularly with the internship coordinator, maintain weekly logs or journals, and complete a final learning-experience essay summarizing the outcome, including samples of work completed.\n\n      less description for PADM1-UC 7992 «",
            "offering": false
        }
    ]
}