{
    "major_id": "PUBB1-GC",
    "file": "./2015-2016/Publishing_Masters_(PUBB1-GC).html",
    "courses": [
        {
            "course_id": "PUBB1-GC 1005",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2558",
                    "section": "001",
                    "period": "09/08/2015 - 10/27/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2559",
                    "section": "002",
                    "period": "09/08/2015 - 10/27/2015",
                    "location": "Adams, Robert",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2765",
                    "section": "003",
                    "period": "09/08/2015 - 10/27/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Introduction to Book Publishing",
            "description": "PUBB1-GC 1005 Introduction to Book Publishing \nThis is the first course taken in the curriculum. It provides an introduction to all aspects of book publishing in the digital age. Students will learn the fundamentals of editorial acquisitions and editing, marketing, publicity, sales, design and production as well as the increasing importance of the Internet in promotion and sales. Students will be required to think like publishers, seeking creative sales and marketing strategies to stay ahead of the curve as the web and other media compete for consumers’ time and attention. Guest speakers present practical business perspectives.",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1010",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2560",
                    "section": "001",
                    "period": "11/03/2015 - 12/15/2015",
                    "location": "Savu, Lavinel",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2561",
                    "section": "002",
                    "period": "11/03/2015 - 12/15/2015",
                    "location": "Steele, Michael",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2766",
                    "section": "003",
                    "period": "11/03/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1010\n\n   Introduction to Magazine Media\n\nAfter learning the fundamentals of the book industry in PUBB1-GC 1005: Introduction to Book Publishing, students now examine the editorial, business and digital operations of media brands, including magazines, content-rich e-commerce companies, and digital-only brands. In this seven-week course, students are given a broad understanding of the changing face of media in an era of new digital formats. The basics of editorial positioning, consumer marketing and audience response, art and production, advertising, sales and marketing are thoroughly examined, not only for magazines, but for related c...\n\n      more description for PUBB1-GC 1010 »\n\n      \n\n\n\nAfter learning the fundamentals of the book industry in PUBB1-GC 1005: Introduction to Book Publishing, students now examine the editorial, business and digital operations of media brands, including magazines, content-rich e-commerce companies, and digital-only brands. In this seven-week course, students are given a broad understanding of the changing face of media in an era of new digital formats. The basics of editorial positioning, consumer marketing and audience response, art and production, advertising, sales and marketing are thoroughly examined, not only for magazines, but for related content sites and brands.. In addition, students learn about tablet and other digital formats as well as shifting business models for print and Web. For their final project, students work in teams to create/redesign a new magazine brand with multiple formats and revenue streams.\n\n      less description for PUBB1-GC 1010 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1100",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2562",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015",
                    "location": "Reynders, Mathew",
                    "time": "Thu 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1100\n\n   Management and Leadership in Transitional Times\n\nUnderstanding how organizations function is essential for any publishing manager.  In this course, students explore the inner workings of corporations and the role of the manager and leader within this context.  They also examine how corporations adapt roles and responsibilities as traditional media merges into digital media. In addition, students gain an understanding of the fundamentals of management theory and develop essential management skills: self-awareness, communication, motivation, leadership, and conflict management.  The course discusses the various theories and styles of managemen...\n\n      more description for PUBB1-GC 1100 »\n\n      \n\n\n\nUnderstanding how organizations function is essential for any publishing manager.  In this course, students explore the inner workings of corporations and the role of the manager and leader within this context.  They also examine how corporations adapt roles and responsibilities as traditional media merges into digital media. In addition, students gain an understanding of the fundamentals of management theory and develop essential management skills: self-awareness, communication, motivation, leadership, and conflict management.  The course discusses the various theories and styles of management and supervision employed in the publication of books, periodicals, and in digital media.\n\n      less description for PUBB1-GC 1100 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1150",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2563",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015",
                    "location": "Reiner, Edward",
                    "time": "Thu 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2564",
                    "section": "002",
                    "period": "09/03/2015 - 12/10/2015",
                    "location": "Boccardi, Paul",
                    "time": "Thu 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2767",
                    "section": "003",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1150\n\n   Intro to Multimedia Financial Analysis\n\nIn this competitive environment, publishing professionals must understand not only editorial and marketing, but all the financial elements of the industry, including the accounting process, profit and loss statements and general financial transactions. This course introduces the fundamentals of accounting and financial analysis for non-financial managers in the publishing and digital media industries.  It covers the preparation of the income statement, statement of cash flows, and balance sheets. Students learn the interrelationships and interdependencies of major financial statements and how ...\n\n      more description for PUBB1-GC 1150 »\n\n      \n\n\n\nIn this competitive environment, publishing professionals must understand not only editorial and marketing, but all the financial elements of the industry, including the accounting process, profit and loss statements and general financial transactions. This course introduces the fundamentals of accounting and financial analysis for non-financial managers in the publishing and digital media industries.  It covers the preparation of the income statement, statement of cash flows, and balance sheets. Students learn the interrelationships and interdependencies of major financial statements and how decisions such as terms of sale or practices of financing affect cash flow and general publishing decisions unique to books, magazines and online media.\n\n      less description for PUBB1-GC 1150 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1155",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2565",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015",
                    "location": "Literati, Steve",
                    "time": "Thu 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1155\n\n   Multimedia Financial Analysis II\n\nBuilding upon the concepts in Introduction to Multimedia Financial Analysis, this course focuses on interpretation and understanding of the financial results of book, magazine and online publishing and how this information is used in decision-making.  The preparation and control of budgets as a management tool and the importance of cost accounting in pricing and determining profitability is also strongly emphasized.  Students learn the basics of financial modeling and work toward a final project in which they project the financial goals and success of a major media company. In preparation for ...\n\n      more description for PUBB1-GC 1155 »\n\n      \n\n\n\nBuilding upon the concepts in Introduction to Multimedia Financial Analysis, this course focuses on interpretation and understanding of the financial results of book, magazine and online publishing and how this information is used in decision-making.  The preparation and control of budgets as a management tool and the importance of cost accounting in pricing and determining profitability is also strongly emphasized.  Students learn the basics of financial modeling and work toward a final project in which they project the financial goals and success of a major media company. In preparation for their Capstone project, students also learn the fundamentals of preparing business plans.\n\n      less description for PUBB1-GC 1155 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2566",
                    "section": "001",
                    "period": "09/14/2015 - 12/14/2015",
                    "location": "Grenier, Jane",
                    "time": "Mon 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2567",
                    "section": "002",
                    "period": "09/14/2015 - 12/14/2015",
                    "location": "Christian, Jesse B",
                    "time": "Mon 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2823",
                    "section": "003",
                    "period": "09/14/2015 - 12/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1200\n\n   Introduction to Marketing & Branding\n\nUnderstanding the customer and the best ways to reach and expand your audience are the fundamental building blocks of Introduction to Marketing and Branding. Students will learn the principles of successful marketing both in print and online as well as the fundamentals of product development and branding across multiple platforms. Students will prepare marketing plans in different areas of the media and learn the latest trends and strategies in effective marketing campaigns. This course serves as a foundation for Advanced Seminars in Book Marketing, Magazine Marketing and Communications for Pu...\n\n      more description for PUBB1-GC 1200 »\n\n      \n\n\n\nUnderstanding the customer and the best ways to reach and expand your audience are the fundamental building blocks of Introduction to Marketing and Branding. Students will learn the principles of successful marketing both in print and online as well as the fundamentals of product development and branding across multiple platforms. Students will prepare marketing plans in different areas of the media and learn the latest trends and strategies in effective marketing campaigns. This course serves as a foundation for Advanced Seminars in Book Marketing, Magazine Marketing and Communications for Publishing.\n\n      less description for PUBB1-GC 1200 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1210",
            "course_name": "Information Technology",
            "description": "PUBB1-GC 1210 Information Technology \nThis course provides an understanding of the use of technology within the publishing industry, how to help select it, manage it and evaluate its effectiveness.  It offers an introduction to information technology and its applications in the different sectors of publishing. Topics include: the role of information systems, an overview of hardware, software and networks, strategic uses of information technology, planning and development of information systems and the management of information systems. The course focuses on the uses and management of technology more than on the technology itself.",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 1250",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2568",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015",
                    "location": "Chatillon, Devereux",
                    "time": "Wed 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2569",
                    "section": "002",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2886",
                    "section": "003",
                    "period": "09/02/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1250\n\n   Publishing & Internet Law\n\nEvery publishing professional needs to understand the basics of publishing law in this litigious era. Editors must know when to flag content as potentially libelous and all employees in media industries must have a knowledge of copyright, privacy, intellectual property and other important legal issues. In this course, our faculty of experienced lawyers in the publishing industry presents the key concepts through real-world examples, case studies and presentations from guest speakers.  Students will explore legal issues in print and on the Web as blogging and sites like Facebook, Twitter and Yo...\n\n      more description for PUBB1-GC 1250 »\n\n      \n\n\n\nEvery publishing professional needs to understand the basics of publishing law in this litigious era. Editors must know when to flag content as potentially libelous and all employees in media industries must have a knowledge of copyright, privacy, intellectual property and other important legal issues. In this course, our faculty of experienced lawyers in the publishing industry presents the key concepts through real-world examples, case studies and presentations from guest speakers.  Students will explore legal issues in print and on the Web as blogging and sites like Facebook, Twitter and YouTube create a wide range of new legal and ethical issues. The course will also provide an introduction to contracts and contract negotiation.\n\n      less description for PUBB1-GC 1250 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1350",
            "course_name": "Multimedia Prod Dev",
            "description": "PUBB1-GC 1350 Multimedia Prod Dev",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 1360",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2570",
                    "section": "001",
                    "period": "09/14/2015 - 10/26/2015",
                    "location": "Restivo-Alessi, Chantal",
                    "time": "Mon 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17767",
                    "section": "002",
                    "period": "11/02/2015 - 12/14/2015",
                    "location": "Hanas, James",
                    "time": "Mon 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1360\n\n   Introduction to Digital Media\n\nAs the publishing industry turns increasingly to the Web to market products and reach a new and wider audience, students must understand the fundamentals of interactive media. This course explores the principles and practices of how book and magazine publishing companies use online media as well as the growing importance of social media sites like Facebook, YouTube and Twitter in order to compete in today’s media environment.  Students will learn about the use of video, mobile, web partnerships and sponsorships as well as the most effective business models for monetizing web content.  Through ...\n\n      more description for PUBB1-GC 1360 »\n\n      \n\n\n\nAs the publishing industry turns increasingly to the Web to market products and reach a new and wider audience, students must understand the fundamentals of interactive media. This course explores the principles and practices of how book and magazine publishing companies use online media as well as the growing importance of social media sites like Facebook, YouTube and Twitter in order to compete in today’s media environment.  Students will learn about the use of video, mobile, web partnerships and sponsorships as well as the most effective business models for monetizing web content.  Through online groups and chats, students will interact with each other and with their faculty members to become conversant in online media and strategies.  They will work toward creating a complete plan for a new site. Visiting experts in online media will provide a wide spectrum of online viewpoints and practices in this multi-faceted industry.\n\n      less description for PUBB1-GC 1360 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 1400",
            "course_name": "",
            "description": "PUBB1-GC 1400\n\n   Print Technology for Publishing\n\nUnderstanding print technology for publishing, the process, tools, equipment, and techniques behind the manufacture of books and magazines - is not just for production personnel.  Everyone who wants to be successful in publishing should be able to understand the sequence of a production workflow and how to turn the first copy of a publication into thousands and millions of printed copies.  This course charts the process from editors and art directors, and thoughts and concepts, to the printed and distributed products.  Although the ink-on-paper manufacturing process is emphasized, the course a...\n\n      more description for PUBB1-GC 1400 »\n\n      \n\n\n\nUnderstanding print technology for publishing, the process, tools, equipment, and techniques behind the manufacture of books and magazines - is not just for production personnel.  Everyone who wants to be successful in publishing should be able to understand the sequence of a production workflow and how to turn the first copy of a publication into thousands and millions of printed copies.  This course charts the process from editors and art directors, and thoughts and concepts, to the printed and distributed products.  Although the ink-on-paper manufacturing process is emphasized, the course also delves into the exciting world of electronic publishing, as well as the future of print as a publishing medium.\n\n      less description for PUBB1-GC 1400 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 1900",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2571",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Bomba, Joy",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "3043",
                    "section": "002",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Perry, Jack",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 1900\n\n   Capstone\n\nThe Capstone Thesis Course is a professional workshop that requires students to complete a business plan for a new magazine brand with full digital extensions, book or web-only property with rich publishing content.  Students enhance their knowledge of business plan preparation through class discussion and presentations by the faculty and guests. Case studies of successful businesses are presented to help students in refining their own plans through the progression of the course.  Students also study successful research methods, financial modeling and competitive analysis.  By the end of the c...\n\n      more description for PUBB1-GC 1900 »\n\n      \n\n\n\nThe Capstone Thesis Course is a professional workshop that requires students to complete a business plan for a new magazine brand with full digital extensions, book or web-only property with rich publishing content.  Students enhance their knowledge of business plan preparation through class discussion and presentations by the faculty and guests. Case studies of successful businesses are presented to help students in refining their own plans through the progression of the course.  Students also study successful research methods, financial modeling and competitive analysis.  By the end of the course, students are equipped to present a summation of their plans to a panel of industry leaders.\n\n      less description for PUBB1-GC 1900 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 2010",
            "course_name": "Digital Financials: The Web, Apps, Tablets and Video",
            "description": "PUBB1-GC 2010 Digital Financials: The Web, Apps, Tablets and Video",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3001",
            "course_name": "Book and New Media Publishing",
            "description": "PUBB1-GC 3001 Book and New Media Publishing",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3002",
            "course_name": "Magazine and New Media Publishing",
            "description": "PUBB1-GC 3002 Magazine and New Media Publishing",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3003",
            "course_name": "Information & New  Media Publishing",
            "description": "PUBB1-GC 3003 Information & New  Media Publishing",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3004",
            "course_name": "Ethical Issues in The Publish & New Media Ind",
            "description": "PUBB1-GC 3004 Ethical Issues in The Publish & New Media Ind",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3007",
            "course_name": "Intro Acct Prin & Prac",
            "description": "PUBB1-GC 3007 Intro Acct Prin & Prac",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3008",
            "course_name": "Adv Topics:Book & New Media",
            "description": "PUBB1-GC 3008 Adv Topics:Book & New Media",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3009",
            "course_name": "Book Marketing Seminar",
            "description": "PUBB1-GC 3009 Book Marketing Seminar",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3010",
            "course_name": "Leadership in Publ Ind",
            "description": "PUBB1-GC 3010 Leadership in Publ Ind",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3011",
            "course_name": "Publication Technologies",
            "description": "PUBB1-GC 3011 Publication Technologies",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3012",
            "course_name": "Consumer Magazine Publ",
            "description": "PUBB1-GC 3012 Consumer Magazine Publ",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3013",
            "course_name": "Scholarly Book & Journal",
            "description": "PUBB1-GC 3013 Scholarly Book & Journal",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3015",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2722",
                    "section": "001",
                    "period": "09/14/2015 - 10/26/2015",
                    "location": "Richard, Barbara",
                    "time": "Mon 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced Book Seminar:Editorial Fundmnt'ls: Copyed, Prfread & Fact Check",
            "description": "PUBB1-GC 3015 Advanced Book Seminar:Editorial Fundmnt'ls: Copyed, Prfread & Fact Check \nPlease note that Advanced Book Seminar topics vary from semester to semester. To see specific course descriptions, please view the “Notes” for any offered topics.",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3025",
            "course_name": "",
            "description": "PUBB1-GC 3025\n\n   Advanced Magazine Seminar\n\nMagazine Editing Workshop:\nThis is a hands-on workshop for students interested in high-level careers in magazine editing. Unlike Y59.3310 (Magazine Editing and Management), which focuses on all the wide duties and brand management responsibilities of a magazine editor, this course deals narrowly with the editing function itself. Students will explore how to edit a well story vs. a front-of-book article; how to edit a story for a general interest magazine vs. a service magazine; when a story can be fixed and when not; how to handle matters such as voice, point of view and structure.\nPrerequis...\n\n      more description for PUBB1-GC 3025 »\n\n      \n\n\n\nMagazine Editing Workshop:\nThis is a hands-on workshop for students interested in high-level careers in magazine editing. Unlike Y59.3310 (Magazine Editing and Management), which focuses on all the wide duties and brand management responsibilities of a magazine editor, this course deals narrowly with the editing function itself. Students will explore how to edit a well story vs. a front-of-book article; how to edit a story for a general interest magazine vs. a service magazine; when a story can be fixed and when not; how to handle matters such as voice, point of view and structure.\nPrerequisite: Y59. 3310 Magazine Editing and Management\n\n      less description for PUBB1-GC 3025 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3035",
            "course_name": "",
            "description": "PUBB1-GC 3035\n\n   Advanced Management Seminar:\n\nEffective project management is critical to success in the publishing industry, particularly in today?s increasingly dynamic, budget-conscious and deadline-oriented business environment. A comprehensive seminar in project management, this course provides the basic tools needed to excel as a project manager and/or team member. Whether you are involved with web projects or implementing print strategies, this course examines issues of work flow online and off, managing projects that cross borders and platforms, juggling multiple editions at one time, and working on a tight budget. Through seminar...\n\n      more description for PUBB1-GC 3035 »\n\n      \n\n\n\nEffective project management is critical to success in the publishing industry, particularly in today?s increasingly dynamic, budget-conscious and deadline-oriented business environment. A comprehensive seminar in project management, this course provides the basic tools needed to excel as a project manager and/or team member. Whether you are involved with web projects or implementing print strategies, this course examines issues of work flow online and off, managing projects that cross borders and platforms, juggling multiple editions at one time, and working on a tight budget. Through seminars, interactive exercises, guest lectures, and case studies from a wide range of industries, students examine how to plan and execute successful projects of varying scopes, durations, budgets, and objectives.\n\n      less description for PUBB1-GC 3035 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3045",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2723",
                    "section": "001",
                    "period": "11/03/2015 - 12/15/2015",
                    "location": "Panepinto, Lauren I",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced Media SeminarPrinciples of Art and Design",
            "description": "PUBB1-GC 3045 Advanced Media SeminarPrinciples of Art and Design \nPlease note that Advanced Media Seminar topics vary from semester to semester.  To see specific course descriptions, please click on “Click here to learn more:  PUBB1-GC 3045”, and view the “Notes” for any offered topics.",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3055",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2572",
                    "section": "001",
                    "period": "09/08/2015 - 10/27/2015",
                    "location": "Allessi, Ana-Maria",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17769",
                    "section": "003",
                    "period": "10/21/2015 - 12/09/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "2771",
                    "section": "002",
                    "period": "11/02/2015 - 12/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced Digital SeminarEbooks/Digital Trans: Methods/ModelsExploring User Interface DesignWeb Editing and Writing",
            "description": "PUBB1-GC 3055 Advanced Digital SeminarEbooks/Digital Trans: Methods/ModelsExploring User Interface DesignWeb Editing and Writing \nPlease note that Advanced Digital Seminar topics vary from semester to semester.  To see specific course descriptions, please click on “Click here to learn more:  PUBB1-GC 3055”, and view the “Notes” for any offered topics.",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3065",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2573",
                    "section": "001",
                    "period": "09/02/2015 - 10/14/2015",
                    "location": "Lyons, Jonathan",
                    "time": "Wed 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Advanced Law SeminarContract Negotiation",
            "description": "PUBB1-GC 3065 Advanced Law SeminarContract Negotiation \nPlease note that Advanced Law Seminar topics vary from semester to semester.  To see specific course descriptions, please click on “Click here to learn more:  PUBB1-GC 3065”, and view the “Notes” for any offered topics.",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3075",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2725",
                    "section": "001",
                    "period": "09/14/2015 - 10/26/2015",
                    "location": "Eisemann, Patricia",
                    "time": "Mon 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "17763",
                    "section": "002",
                    "period": "11/02/2015 - 12/14/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "18991",
                    "section": "004",
                    "period": "09/02/2015 - 10/14/2015",
                    "location": "Baden, Morgan",
                    "time": "Wed 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3075\n\n   Adv Marketing Seminar:Advanced Magazine Marketing and BrandingAdvanced Social Media MarketingPublic Relations & Corporate Communications\n\nWhile traditional publishing organizations are wrestling with a disrupted and dis-intermediated landscape, major marketers in all categories of business are stepping up “content production” initiatives. Today’s consumers are as likely to discover content of interest through a Twitter link or in their Facebook feed as they are through a more traditional media outlet. Furthermore, there is a blurring of editorial and advertising lines in a manner that both excites and concerns the industry. The old standards of quality, reliability and relevance are shifting as marketers create content that is h...\n\n      more description for PUBB1-GC 3075 »\n\n      \n\n\n\nWhile traditional publishing organizations are wrestling with a disrupted and dis-intermediated landscape, major marketers in all categories of business are stepping up “content production” initiatives. Today’s consumers are as likely to discover content of interest through a Twitter link or in their Facebook feed as they are through a more traditional media outlet. Furthermore, there is a blurring of editorial and advertising lines in a manner that both excites and concerns the industry. The old standards of quality, reliability and relevance are shifting as marketers create content that is highly compelling to consumers. Has the source of the content become less important to consumers? Is content marketing an effective tool….or a deterioration of standards?  In this course, you will examine both sides of the issue. In addition, you will study the evolution of  content marketing and its role as a tool that not only dates back decades but points the way forward to new creative opportunities for authors, journalists, editors and other publishing experts. We’ll discover how publishers—the original content marketers—can better use their own material to grow both audiences and revenue at a time when traditional marketing practices in publishing are declining in effectiveness. And we’ll discover the power of social media to drive a strong content marketing campaign. Each class session (with the exception of the final class, which will be devoted to student presentations) will consist of three parts: an instructor-led discussion of a particular aspect of content marketing OR a relevant guest speaker presentation and Q&A, student-led discussion of content marketing tactics “in the wild,” and group work on a content marketing initiative selected and produced by the class.\n\n      less description for PUBB1-GC 3075 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3100",
            "course_name": "",
            "description": "PUBB1-GC 3100\n\n   Mag Financial Management\n\nThis course examines key financial and operational issues unique to magazine publishing and the key operating statistics used to measure performance and prepare operating budgets.  It covers the differences between cash flow reports and accrual basis financial statements; reviews significant accounting principles and concepts related to magazine operations; the operational significance of a departmentalized chart of accounts; and the major income statement and balance sheet accounts from an operational standpoint.  It offers a detailed examination of the financial management and decision-makin...\n\n      more description for PUBB1-GC 3100 »\n\n      \n\n\n\nThis course examines key financial and operational issues unique to magazine publishing and the key operating statistics used to measure performance and prepare operating budgets.  It covers the differences between cash flow reports and accrual basis financial statements; reviews significant accounting principles and concepts related to magazine operations; the operational significance of a departmentalized chart of accounts; and the major income statement and balance sheet accounts from an operational standpoint.  It offers a detailed examination of the financial management and decision-making process for magazines from strategic planning through budgets and projections to the analysis of financial statements and related financial information.\n\n      less description for PUBB1-GC 3100 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3110",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2574",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015",
                    "location": "Jantzen, Lane",
                    "time": "Wed 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3110\n\n   Book Distribution, Merchandising, & Sales\n\nWhether a book is being created and sold strictly online or distributed in mass quantities to retail mega-stores, determining buying patterns, quantities, timing and outlets is a major challenge for publishers. This course examines the strategies for success in distributing books, from the small novel to the major bestseller. Students learn to evaluate effective sales campaigns across multiple markets including international, mass market, major retail chains, catalogues, and price clubs. The role of Amazon.com and Barnes and Noble.com will be examined. Students will be part of a mock sales lau...\n\n      more description for PUBB1-GC 3110 »\n\n      \n\n\n\nWhether a book is being created and sold strictly online or distributed in mass quantities to retail mega-stores, determining buying patterns, quantities, timing and outlets is a major challenge for publishers. This course examines the strategies for success in distributing books, from the small novel to the major bestseller. Students learn to evaluate effective sales campaigns across multiple markets including international, mass market, major retail chains, catalogues, and price clubs. The role of Amazon.com and Barnes and Noble.com will be examined. Students will be part of a mock sales launch and will compare their own sales efforts with those of a seasoned sales staff at a major publishing house.\n\n      less description for PUBB1-GC 3110 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3120",
            "course_name": "Editing Periodicals",
            "description": "PUBB1-GC 3120 Editing Periodicals \nThe course provides an intensive analysis of the demanding tasks performed by magazine editors - developing ideas, assigning, evaluating, editing and rewriting, visual treatments, developing relationships with writers and non-editorial departments, working with agents and other tasks within the overall publishing organization.  Students will gain a thorough understanding of the job of magazine editors, develop and pitch their own story ideas, evaluation other ideas, critique manuscripts, plan story visuals and analyze a variety of magazines.",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3130",
            "course_name": "",
            "description": "PUBB1-GC 3130\n\n   Adv Marketing: Strategic Apps & Case Studies\n\nBuilding upon the knowledge in Introduction to Principles of Marketing and Branding, this course provides students with hands-on applications of specific marketing problems across multiple platforms, including books, magazines and digital publishing. Each class will be conducted from a workshop and case study viewpoint.  Each week, students will address an important marketing strategy and seek solutions. A major emphasis will be placed upon the role of search engine marketing in all publishing segments. Other examples of topics that will be addressed in this course include: marketing books thr...\n\n      more description for PUBB1-GC 3130 »\n\n      \n\n\n\nBuilding upon the knowledge in Introduction to Principles of Marketing and Branding, this course provides students with hands-on applications of specific marketing problems across multiple platforms, including books, magazines and digital publishing. Each class will be conducted from a workshop and case study viewpoint.  Each week, students will address an important marketing strategy and seek solutions. A major emphasis will be placed upon the role of search engine marketing in all publishing segments. Other examples of topics that will be addressed in this course include: marketing books through tours and satellite tours; market segmentation; database marketing; website and blog marketing; custom publishing; cause marketing; lifetime value analysis; optimization; event marketing; and membership marketing strategies. Students will produce actual marketing plans for these and other segments of the marketplace.\n\n      less description for PUBB1-GC 3130 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3140",
            "course_name": "",
            "description": "PUBB1-GC 3140\n\n   Magazine Consumer Mrktng & Audience Development\n\nThis course explores the management of magazine research and circulation as a critical component of the publishing business. Students examine the economics of the major circulation sources both on and offline, analyze their economic value to the magazine, and develop effective and efficient rate base management strategies. Actual publishing case studies for newsstand sales in relation to subscription development are presented, focusing on improving the profitability for a title.  Students study the role of partnerships and alternative distribution outlets as a way to enhance sales.  They exami...\n\n      more description for PUBB1-GC 3140 »\n\n      \n\n\n\nThis course explores the management of magazine research and circulation as a critical component of the publishing business. Students examine the economics of the major circulation sources both on and offline, analyze their economic value to the magazine, and develop effective and efficient rate base management strategies. Actual publishing case studies for newsstand sales in relation to subscription development are presented, focusing on improving the profitability for a title.  Students study the role of partnerships and alternative distribution outlets as a way to enhance sales.  They examine Internet subscription sales for traditional magazines and distribution of online-only digital magazines. Numerous guest speakers provide a wide range of professional experience to the class.\n\n      less description for PUBB1-GC 3140 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3160",
            "course_name": "",
            "description": "PUBB1-GC 3160\n\n   Media Advertising\n\nAs online and print advertising sales converge, building media partnerships is a challenging topic in a competitive and changing environment. In this course, students examine the strengths and weaknesses of advertising in consumer, trade and special interest publications brands with an emphasis on multi-platform sales.  The marketing strategies of clients and the execution by their advertising agencies is reviewed and evaluated. Students explore business models for desktop, mobile, social extensions and creative services that brands born of 'traditional publishers' can build with the help of n...\n\n      more description for PUBB1-GC 3160 »\n\n      \n\n\n\nAs online and print advertising sales converge, building media partnerships is a challenging topic in a competitive and changing environment. In this course, students examine the strengths and weaknesses of advertising in consumer, trade and special interest publications brands with an emphasis on multi-platform sales.  The marketing strategies of clients and the execution by their advertising agencies is reviewed and evaluated. Students explore business models for desktop, mobile, social extensions and creative services that brands born of 'traditional publishers' can build with the help of new technology.\n\n      less description for PUBB1-GC 3160 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2575",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015",
                    "location": "Savu, Lavinel",
                    "time": "Thu 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3200\n\n   Magazine Brand Financials\n\nThis course examines key financial and operational issues unique to magazine publishing. It offers a detailed examination of the financial management and decision-making process for magazines and their online extensions.  Students will learn how to create budgets for stories, cover shoots, circulation, marketing plans, ad campaigns and websites. They will examine the financial implication of hiring and firing packages and other employee matters. By the conclusion of the course, students will be versed in all aspects of a magazine financial cycle. This course also examines the financials of a m...\n\n      more description for PUBB1-GC 3200 »\n\n      \n\n\n\nThis course examines key financial and operational issues unique to magazine publishing. It offers a detailed examination of the financial management and decision-making process for magazines and their online extensions.  Students will learn how to create budgets for stories, cover shoots, circulation, marketing plans, ad campaigns and websites. They will examine the financial implication of hiring and firing packages and other employee matters. By the conclusion of the course, students will be versed in all aspects of a magazine financial cycle. This course also examines the financials of a magazine’s expansion into multimedia.\n\n      less description for PUBB1-GC 3200 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3210",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2887",
                    "section": "001",
                    "period": "09/03/2015 - 12/10/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3210\n\n   Book Publishing Financials\n\nThe practical application of business principles for managing each function in a book publishing company and its accompanying web site is covered in this course. Based upon the knowledge gained from courses in introductory publishing and multimedia financials, this course will use the income statement as a point of departure for showing how the daily application of editorial, production, marketing, sales, and fulfillment strategies impact the financial statements of the publishing company. Students learn how companies can maximize revenues and profitability using these strategies and principle...\n\n      more description for PUBB1-GC 3210 »\n\n      \n\n\n\nThe practical application of business principles for managing each function in a book publishing company and its accompanying web site is covered in this course. Based upon the knowledge gained from courses in introductory publishing and multimedia financials, this course will use the income statement as a point of departure for showing how the daily application of editorial, production, marketing, sales, and fulfillment strategies impact the financial statements of the publishing company. Students learn how companies can maximize revenues and profitability using these strategies and principles and similarly, how to use the financial statements as strategic management tools. Students explore the financials of eBooks, Print on Demand and other digital technologies.\n\n      less description for PUBB1-GC 3210 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3220",
            "course_name": "",
            "description": "PUBB1-GC 3220\n\n   From Idea to Empire: New Business Development\n\nFrom the germ of a publishing idea to turning your concept into a fully funded business, creating a new venture takes initiative, ingenuity, skill and capital. This course examines new business development, both in print and online. Students learn how to identify business opportunities and explore sources of venture capital, partnerships and licensing arrangements for books, magazines, websites and other digital platforms. They discuss competitive analyses for new ventures, startup costs and effective business models. They learn to sell their idea to investors. This course will explore how gia...\n\n      more description for PUBB1-GC 3220 »\n\n      \n\n\n\nFrom the germ of a publishing idea to turning your concept into a fully funded business, creating a new venture takes initiative, ingenuity, skill and capital. This course examines new business development, both in print and online. Students learn how to identify business opportunities and explore sources of venture capital, partnerships and licensing arrangements for books, magazines, websites and other digital platforms. They discuss competitive analyses for new ventures, startup costs and effective business models. They learn to sell their idea to investors. This course will explore how giant media companies create new ventures and expand overseas, as well as how individual entrepreneurs launch successful print and web businesses.\n\n      less description for PUBB1-GC 3220 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3230",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2576",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Roome, Hugh",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3230\n\n   The Global Marketplace: Challengs & Opportunties\n\nGlobalization of media has meant that international publishing is the largest opportunity for future growth for American publishers. Stemming from the thesis that “the world is flat,” the ability for American publishers to translate and disseminate their content on a global basis has created both the newest and largest opportunity for media companies.  \n\nThis course will focus on practical elements of international publishing. It will provide background in legal, ethical, marketing, production, financial, and organizational elements of international magazine, book, and digital content ventur...\n\n      more description for PUBB1-GC 3230 »\n\n      \n\n\n\nGlobalization of media has meant that international publishing is the largest opportunity for future growth for American publishers. Stemming from the thesis that “the world is flat,” the ability for American publishers to translate and disseminate their content on a global basis has created both the newest and largest opportunity for media companies.  \n\nThis course will focus on practical elements of international publishing. It will provide background in legal, ethical, marketing, production, financial, and organizational elements of international magazine, book, and digital content ventures.  \n\nThe course will discuss key aspects of evaluating market opportunities and initiating new business launches, as well as local partnerships and joint ventures in Europe, Asia and Latin America. The course will also evaluate business opportunities and operational aspects of operating in the British Commonwealth markets.\n\nThe course will include actual documents from operating international media concerns, including licensing and joint venture agreements, marketing plans, and financials.  Top management executives from international publishers including, McGraw-Hill, Pearson, and Time-Warner will address the class.\n\n      less description for PUBB1-GC 3230 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3300",
            "course_name": "",
            "description": "PUBB1-GC 3300\n\n   Principles of Profit- Ability\n\nThe practical application of business principles for managing each function in a book publishing company is covered in this course. Based upon the knowledge gained from courses in introductory publishing and accounting, this course will use the income statement as a point of departure for showing how the daily application of editorial, production, marketing, sales, and fulfillment strategies impact the financial statements of the publishing company. Students learn how companies can maximize revenues and profitability using these strategies and principles and similarly, how to use the financial...\n\n      more description for PUBB1-GC 3300 »\n\n      \n\n\n\nThe practical application of business principles for managing each function in a book publishing company is covered in this course. Based upon the knowledge gained from courses in introductory publishing and accounting, this course will use the income statement as a point of departure for showing how the daily application of editorial, production, marketing, sales, and fulfillment strategies impact the financial statements of the publishing company. Students learn how companies can maximize revenues and profitability using these strategies and principles and similarly, how to use the financial statements as strategic management tools.\n\n      less description for PUBB1-GC 3300 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3310",
            "course_name": "",
            "description": "PUBB1-GC 3310\n\n   Editing Creative Content\n\nIn this multimedia age of multidimensional publishing, content has expanded beyond the margins of the print magazine and is everywhere from digital-only brands to social media to e-commerce and brand sites.  How do editors adapt to making themselves nimble in any environment?  The core skills of a magazine editor are more essential than ever. In this course, students will  not only learn the  role and duties of a magazine editor, but how to translate that knowledge to creative content making in related areas, both print and digital. Key skills that will be discussed in this course include brin...\n\n      more description for PUBB1-GC 3310 »\n\n      \n\n\n\nIn this multimedia age of multidimensional publishing, content has expanded beyond the margins of the print magazine and is everywhere from digital-only brands to social media to e-commerce and brand sites.  How do editors adapt to making themselves nimble in any environment?  The core skills of a magazine editor are more essential than ever. In this course, students will  not only learn the  role and duties of a magazine editor, but how to translate that knowledge to creative content making in related areas, both print and digital. Key skills that will be discussed in this course include bringing vision, clarity, purpose, integrity, and energy to all of the extensions in a brand’s platform. In the case of magazines, this starts with the print product and includes the website, iPad and other tablet editions, social media, e-books, and other franchises. Students will learn how to navigate story-telling through both long-form narrative and 140-character messages; develop story ideas and visual treatments; establish relationships with writers; create publicity-generating editorial; and other editorial tasks. They will also learn how to translate these skills to wider forms of creative content.\n\n      less description for PUBB1-GC 3310 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3320",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17765",
                    "section": "001",
                    "period": "09/14/2015 - 12/14/2015",
                    "location": "Schwartzman, Jill",
                    "time": "Mon 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3320\n\n   Book Acquisition & Editing\n\nThe role of the editor in acquiring and developing books is essential to the success of a publishing venture. This class discusses the publishing process from inception of idea to bound book and examines the dynamics of the publishing environment including the best sources for great books and how to bring them to market. Students dissect the agent/editor relationship as well as the author/editor relationship, with a special emphasis on the psychological components of working with creative personalities.  They develop editing skills and communication strategies with authors, learn to write jack...\n\n      more description for PUBB1-GC 3320 »\n\n      \n\n\n\nThe role of the editor in acquiring and developing books is essential to the success of a publishing venture. This class discusses the publishing process from inception of idea to bound book and examines the dynamics of the publishing environment including the best sources for great books and how to bring them to market. Students dissect the agent/editor relationship as well as the author/editor relationship, with a special emphasis on the psychological components of working with creative personalities.  They develop editing skills and communication strategies with authors, learn to write jacket and catalogue copy and examine how an editor influences major marketing and sales functions.  The focus of the course is on trade book editing.\n\n      less description for PUBB1-GC 3320 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3330",
            "course_name": "",
            "description": "PUBB1-GC 3330\n\n   Trade & General Book Publishing\n\nThis course is designed to provide an advanced overview of the book publishing process with a focus on adult trade publishing. Class concentrates on analyzing core aspects of the industry and developing practical skills in hands-on exercises for the consumer trade markets.  Students prepare presentations for sales conference and participate in role-playing, reflecting real-life-publishing issues.  Students analyze ?niche? market trends and focus on the strategies used to target specific children?s, religious, and reference book markets in order to publicize and sell a book effectively. Student...\n\n      more description for PUBB1-GC 3330 »\n\n      \n\n\n\nThis course is designed to provide an advanced overview of the book publishing process with a focus on adult trade publishing. Class concentrates on analyzing core aspects of the industry and developing practical skills in hands-on exercises for the consumer trade markets.  Students prepare presentations for sales conference and participate in role-playing, reflecting real-life-publishing issues.  Students analyze ?niche? market trends and focus on the strategies used to target specific children?s, religious, and reference book markets in order to publicize and sell a book effectively. Students are given in-depth knowledge of the field and are guided to think creatively and globally about the industry and the marketplace.  A focus on strategic thinking and problem solving gives experience in handling real-life situations.\n\n      less description for PUBB1-GC 3330 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3340",
            "course_name": "Prof Book & Info Pub",
            "description": "PUBB1-GC 3340 Prof Book & Info Pub \nThe primary objective of this course is to provide the student with a broad grasp of the structure and organization of the Business, Scientific, Technical, Medical and Scholarly publishing sector.  In addition, the student gains insight into the different organizational segments of professional publishing and how they relate to one another, how publishers and intermediaries interact, and the significant challenges the industry faces today.   Digital publishing issues will be featured in every session so that the student understands how digital publishing is changing the industry.",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3350",
            "course_name": "",
            "description": "PUBB1-GC 3350\n\n   Multi-Platform Publishing\n\nMedia convergence necessitates a thorough knowledge of the development and usage of publishing across multiple platforms including books, magazines and their related websites, TV, radio and other media. In this course, students will examine the growing media use of video, satellite radio and other technology and how publishers use media extensions such as iPods, mobile and digital readers to deliver content. Students will also learn to define and reach an audience, create their own multi-platform brand and build an effective business model. The interrelationship between print and online editor...\n\n      more description for PUBB1-GC 3350 »\n\n      \n\n\n\nMedia convergence necessitates a thorough knowledge of the development and usage of publishing across multiple platforms including books, magazines and their related websites, TV, radio and other media. In this course, students will examine the growing media use of video, satellite radio and other technology and how publishers use media extensions such as iPods, mobile and digital readers to deliver content. Students will also learn to define and reach an audience, create their own multi-platform brand and build an effective business model. The interrelationship between print and online editors will be examined as well as the growing importance of non-publishing content developers in the digital space. Students will explore how content expansion benefits the core product.\n\n      less description for PUBB1-GC 3350 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3360",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2577",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015",
                    "location": "Revitte, Daniel M",
                    "time": "Wed 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3360\n\n   Web Architecture & Content Creation\n\nPowerful web publishing tools are within affordable--and sometimes free--reach of anyone with connection to the Internet. Such tools have given way to unique distribution circumstances where traditional print and broadcast media are now competing for readers/viewers with online only publishing ventures like the Huffington Post and YouTube.\n\nIn this publishing workshop, students will develop web destinations while including examples of integrated technologies and awareness methods/techniques discussed in class. The workshop lessons will teach students basic HTML and CSS; consideration of Sear...\n\n      more description for PUBB1-GC 3360 »\n\n      \n\n\n\nPowerful web publishing tools are within affordable--and sometimes free--reach of anyone with connection to the Internet. Such tools have given way to unique distribution circumstances where traditional print and broadcast media are now competing for readers/viewers with online only publishing ventures like the Huffington Post and YouTube.\n\nIn this publishing workshop, students will develop web destinations while including examples of integrated technologies and awareness methods/techniques discussed in class. The workshop lessons will teach students basic HTML and CSS; consideration of Search Engine Optimization (SEO); incorporation of images, audio, video and Flash in a site; selection and use of student’s content management system (CMS) or blogging platform; usability considerations, construction and distribution of RSS/XML content feeds; utilization of reader/viewer feedback, sharing mechanisms and social networks from a marketing perspective; installation of a web analytics tools to the student's site and learning a basic understanding of what various metrics mean relative to the stated goal(s), and monetization programs, methods and related ideas.\nSuch wide-ranging and specific goals may include the trafficking of reader/viewership to the number of social networking connections made, to selling an item online. In this workshop, students will learn to apply and leverage various popular technology and marketing applications to work towards achieving their stated goal. By the end of the eight-week class, students will create web projects using blogging software, social networking sites like Ning and video sites like Google Video.   They will demonstrate quantitative cause and effect relationships between the strategies they implemented in reaching their stated goal.\n\n      less description for PUBB1-GC 3360 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3370",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2724",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": "Freaner, Ivan",
                    "time": "Tue 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3370\n\n   Desktop Publishing\n\nUnderstanding the basics of successful and effective book and magazine covers, layouts and promotional materials as well as basic web design is important for publishing professionals. In this lab-based course, students will be introduced to Adobe Photoshop, InDesign, InCopy and Illustrator for print and web. Basic typography and design principles will be covered as well as introductory computer-based illustration and image processing.  Students will learn how to combine photographs, illustrations and type into professional quality files ready for output. Through hands-on projects, students wil...\n\n      more description for PUBB1-GC 3370 »\n\n      \n\n\n\nUnderstanding the basics of successful and effective book and magazine covers, layouts and promotional materials as well as basic web design is important for publishing professionals. In this lab-based course, students will be introduced to Adobe Photoshop, InDesign, InCopy and Illustrator for print and web. Basic typography and design principles will be covered as well as introductory computer-based illustration and image processing.  Students will learn how to combine photographs, illustrations and type into professional quality files ready for output. Through hands-on projects, students will explore the design tools that give creative expression to specific editorial concepts  on the brand level as well as for individual layouts. This is a beginner-level desktop publishing course intended for those with little or no prior experience with the Adobe Creative Suite.\n\n      less description for PUBB1-GC 3370 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3375",
            "course_name": "Advanced Desktop Publishing",
            "description": "PUBB1-GC 3375 Advanced Desktop Publishing \nThis course is intended for students who have already completed Desktop Publishing or who can demonstrate sufficient knowledge of desktop publishing to be approved by the instructor. Building upon the basic typography and design principles covered in the introductory course, this class covers advanced techniques in InDesign, PhotoShop, and Illustrator and includes more in-depth projects, such as promotional materials, website layout and interior spreads. By the end of the course, students will have created a portfolio of work that demonstrates their mastery of desktop publishing.",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3380",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3063",
                    "section": "001",
                    "period": "09/02/2015 - 12/09/2015",
                    "location": "Chanda, Justin",
                    "time": "Wed 6.30 PM - 9.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3380\n\n   Children's Book Publishing:  An Intensive\n\nWhile many of the principles of general trade book publishing also apply to the children's and young adult market, there are numerous points of differentiation as well.  This 14-week course will explore all the facets of this 3-4 billion dollar industry from acquisition and editing to marketing and distribution.  Through special attention to both the creative and business aspects of core industry categories (picture books for young readers, middle school and YA, among others), students gain an in-depth understanding of the writing and illustrating of these books, the production challenges of m...\n\n      more description for PUBB1-GC 3380 »\n\n      \n\n\n\nWhile many of the principles of general trade book publishing also apply to the children's and young adult market, there are numerous points of differentiation as well.  This 14-week course will explore all the facets of this 3-4 billion dollar industry from acquisition and editing to marketing and distribution.  Through special attention to both the creative and business aspects of core industry categories (picture books for young readers, middle school and YA, among others), students gain an in-depth understanding of the writing and illustrating of these books, the production challenges of multi-media books, the ingenuity required for successful marketing, and the importance of a solid profit and loss statement.\n\n      less description for PUBB1-GC 3380 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3500",
            "course_name": "Internet & Intranet Busn",
            "description": "PUBB1-GC 3500 Internet & Intranet Busn",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3510",
            "course_name": "",
            "description": "PUBB1-GC 3510\n\n   Multimedia Market & Prod\n\nDeveloping products for the evolving multimedia field requires an understanding of: content development, a knowledge of industry trends, and the ability to develop and distribute deals that successfully bring your product to market. This course examines consumer demand, industry projections, delivery platforms, sources of material, the product development process (including marketing and customer support), testing, packaging and distribution, marketing and copyright issues, and product protections and registry procedures. Students are required to work in teams and create a product development ...\n\n      more description for PUBB1-GC 3510 »\n\n      \n\n\n\nDeveloping products for the evolving multimedia field requires an understanding of: content development, a knowledge of industry trends, and the ability to develop and distribute deals that successfully bring your product to market. This course examines consumer demand, industry projections, delivery platforms, sources of material, the product development process (including marketing and customer support), testing, packaging and distribution, marketing and copyright issues, and product protections and registry procedures. Students are required to work in teams and create a product development plan.\n\n      less description for PUBB1-GC 3510 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3530",
            "course_name": "",
            "description": "PUBB1-GC 3530\n\n   Electronic Content Development\n\nThis course provides an overview of the many ways in which 'content' is developed, and utilized on the web. All sites utilize content where information can make or break the user experience, and ultimately, the success of the site. Class explores important questions including: 1) Target audience? 2) Does the content engage this audience? 3) Does the content reinforce the company's mission and enhance its' bottom line? It investigates reasons why some sites have flourished while others have vanished. After examining types of interactive electronic content, it explores issues that impact the dec...\n\n      more description for PUBB1-GC 3530 »\n\n      \n\n\n\nThis course provides an overview of the many ways in which 'content' is developed, and utilized on the web. All sites utilize content where information can make or break the user experience, and ultimately, the success of the site. Class explores important questions including: 1) Target audience? 2) Does the content engage this audience? 3) Does the content reinforce the company's mission and enhance its' bottom line? It investigates reasons why some sites have flourished while others have vanished. After examining types of interactive electronic content, it explores issues that impact the decisions relating to content on a site, the editorial and production processes, and the management of 'bottom-line' issues that affect all content development.\n\n      less description for PUBB1-GC 3530 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3540",
            "course_name": "",
            "description": "PUBB1-GC 3540\n\n   Scientific, Technical & Prof Pub On The Internet\n\nThis course focuses on issues in electronic publishing that impact the decisions of Science, Technical and Medical (STM) publishers.  It explores models of delivery, current players and state-of-the-art technology. Related issues of quality, currency and functionality, and archiving and copyright issues relating to this online format are presented.  It reviews the economics of electronic publishing and looks into the perspective of a large and influential consumer ? the library.   Students explore concepts and tools that drive the creation of content and products for the Internet.  They think ...\n\n      more description for PUBB1-GC 3540 »\n\n      \n\n\n\nThis course focuses on issues in electronic publishing that impact the decisions of Science, Technical and Medical (STM) publishers.  It explores models of delivery, current players and state-of-the-art technology. Related issues of quality, currency and functionality, and archiving and copyright issues relating to this online format are presented.  It reviews the economics of electronic publishing and looks into the perspective of a large and influential consumer ? the library.   Students explore concepts and tools that drive the creation of content and products for the Internet.  They think critically about the strategic issues involved in expanding existing processes and creating new processes to support Internet publishing.\n\n      less description for PUBB1-GC 3540 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3550",
            "course_name": "",
            "description": "PUBB1-GC 3550\n\n   Web Mktg & E-Commerce\n\nThis course explores the economics of the Information Age for managers, and examines the ever-changing Internet and its unique marketing opportunities and challenges. The strategic issues of pricing, valuing and protecting intellectual content, and evaluate the consequences in development of web-based versions of information products are reviewed and analyzed.  Class covers processes for capturing information about customers, strategies for driving traffic, customization, customer satisfaction issues, and relationship marketing with an overview of current techniques.  E-commerce is covered wit...\n\n      more description for PUBB1-GC 3550 »\n\n      \n\n\n\nThis course explores the economics of the Information Age for managers, and examines the ever-changing Internet and its unique marketing opportunities and challenges. The strategic issues of pricing, valuing and protecting intellectual content, and evaluate the consequences in development of web-based versions of information products are reviewed and analyzed.  Class covers processes for capturing information about customers, strategies for driving traffic, customization, customer satisfaction issues, and relationship marketing with an overview of current techniques.  E-commerce is covered with emphasis on marketing strategies employed by leading online vendors and publishers. Students learn how to market Digital Content or an Internet publication or information business, including the use of online and offline media, advertising, public relations, and distribution alliances.  Guest speakers bring their hands-on business perspective.\n\n      less description for PUBB1-GC 3550 «",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3560",
            "course_name": "Business of Online Publishing",
            "description": "PUBB1-GC 3560 Business of Online Publishing \nThis course is designed to equip managers with the necessary knowledge and tools for developing and running a profitable online business.  Students learn how to develop a business plan for an online information service or company, which will include evaluating income, expenses, and overhead and profit projections unique to multimedia technology subject to continued changes.  Additional topics include different revenue streams, identifying projects, financing projects, cash flow problems, venture capital funds and quantifying digital assets.",
            "offering": false
        },
        {
            "course_id": "PUBB1-GC 3910",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2578",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Chambers, Andrea",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PUBB1-GC 3910\n\n   Internship in Publishing\n\nInternships are an important way to gain inside industry knowledge and access to valuable publishing contacts. With the help of the department, which supplies a list of internships each semester, students are encouraged to spend a minimum of 14-16 hours a week working in a media company under the supervision of a designated manager. Through course assignments, a group meeting and consultation with the professor, students use the internship experience as a way to gain insight into specific areas of publishing. Internships are also helpful in determining if a particular industry is the right car...\n\n      more description for PUBB1-GC 3910 »\n\n      \n\n\n\nInternships are an important way to gain inside industry knowledge and access to valuable publishing contacts. With the help of the department, which supplies a list of internships each semester, students are encouraged to spend a minimum of 14-16 hours a week working in a media company under the supervision of a designated manager. Through course assignments, a group meeting and consultation with the professor, students use the internship experience as a way to gain insight into specific areas of publishing. Internships are also helpful in determining if a particular industry is the right career pathway.  A limited number of internships are available to students on a selective basis by application and approval by the Director.\n\n      less description for PUBB1-GC 3910 «",
            "offering": true
        },
        {
            "course_id": "PUBB1-GC 3920",
            "course_name": "Capstone Course in Publ",
            "description": "PUBB1-GC 3920 Capstone Course in Publ",
            "offering": false
        }
    ]
}