{
    "major_id": "PADM-GP",
    "file": "./2015-2016/Public_and_Nonprofit_Managementand_Policy_(PADM-GP).html",
    "courses": [
        {
            "course_id": "PADM-GP 138",
            "course_name": "Macroeconomics Recitation",
            "description": "PADM-GP  138 Macroeconomics Recitation",
            "offering": false
        },
        {
            "course_id": "PADM-GP 140",
            "classes": [
                {
                    "format": "Recitation",
                    "class_id": "5171",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 8.35 PM - 9.35 PM",
                    "open": true,
                    "professor": "TISC LC9"
                },
                {
                    "format": "Recitation",
                    "class_id": "5226",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 8.35 PM - 9.35 PM",
                    "open": true,
                    "professor": "GCASL 269"
                }
            ],
            "course_name": "Public Econ and Finance Discussion",
            "description": "PADM-GP  140 Public Econ and Finance Discussion",
            "offering": true
        },
        {
            "course_id": "PADM-GP 290",
            "classes": [
                {
                    "format": "Recitation",
                    "class_id": "5207",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 8.35 PM - 9.35 PM",
                    "open": true,
                    "professor": "25W4 C-13"
                },
                {
                    "format": "Recitation",
                    "class_id": "5208",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 8.35 PM - 9.35 PM",
                    "open": true,
                    "professor": "BOBS LL139"
                },
                {
                    "format": "Recitation",
                    "class_id": "5209",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.30 PM",
                    "open": true,
                    "professor": "GCASL 388"
                }
            ],
            "course_name": "Multiple Regression Discussion",
            "description": "PADM-GP  290 Multiple Regression Discussion",
            "offering": true
        },
        {
            "course_id": "PADM-GP 1901",
            "course_name": "",
            "description": "PADM-GP 1901\n\n   Reflective Practice: Learning from Work\n\nStudents must be working at an internship or in paid employment at a public service organization during the semester they are taking this course. This course provides students with the opportunity to obtain credit for their internships. This course is designed to prepare students for a lifetime of learning by providing tools to help students learn from their own experiences as well as from those of others. This process is explored through three lenses: (1) the individual, using assessment tools designed to help students become more aware of themselves and their impact on others; (2) interperso...\n\n      more description for PADM-GP 1901 »\n\n      \n\n\n\nStudents must be working at an internship or in paid employment at a public service organization during the semester they are taking this course. This course provides students with the opportunity to obtain credit for their internships. This course is designed to prepare students for a lifetime of learning by providing tools to help students learn from their own experiences as well as from those of others. This process is explored through three lenses: (1) the individual, using assessment tools designed to help students become more aware of themselves and their impact on others; (2) interpersonal dynamics, exploring how person/role issues shape work group dynamics and can either facilitate or interfere with performance; and (3) organizational focus, examining several frames for thinking about organizational change and growth.\n\n      less description for PADM-GP 1901 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2106",
            "course_name": "Community Organizing",
            "description": "PADM-GP 2106 Community Organizing \nThe purpose of this course is to expand students understanding of community organizing. Topics include the historical roots and approaches to organizing; applications of community organizing for empowerment and social change; the nuts and bolts of organizing, including issues of strategy and tactics; and the roles and personal dimensions of being an organizer. The course integrates theory and practice through the use of guest speakers and field trips, as well as drawing on the professional and political experience of the participants.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2107",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5086",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "295L ",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Manny, Jill"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2107\n\n   Nonprofit Law\n\nThis course focuses on the federal and state legal issues affecting nonprofit organizations likely to be confronted by nonprofit managers.  The course will cover a broad range of legal issues and underlying policies contained in tax law, constitutional law, trust law, contract law, and state corporate law that govern nonprofit organizations and the individuals who manage nonprofit organizations.\n\nSpecific topics to be covered include some of the following:\nThe issues involved in obtaining and maintaining nonprofit corporate status and tax-exempt status Creating and dissolving nonprofit orga...\n\n      more description for PADM-GP 2107 »\n\n      \n\n\n\nThis course focuses on the federal and state legal issues affecting nonprofit organizations likely to be confronted by nonprofit managers.  The course will cover a broad range of legal issues and underlying policies contained in tax law, constitutional law, trust law, contract law, and state corporate law that govern nonprofit organizations and the individuals who manage nonprofit organizations.\n\nSpecific topics to be covered include some of the following:\nThe issues involved in obtaining and maintaining nonprofit corporate status and tax-exempt status Creating and dissolving nonprofit organizationsThe choice of form of entityFiduciary responsibilities of those governing nonprofit organizationsSetting appropriate executive compensationRestrictions on political and This course focuses on the federal and state legal issues affecting nonprofit organizations likely to be confronted by nonprofit managers.  The course will cover a broad range of legal issues and underlying policies contained in tax law, constitutional law, trust law, contract law, and state corporate law that govern nonprofit organizations and the individuals who manage nonprofit organizations.\n\nSpecific topics to be covered include some of the following:\nThe issues involved in obtaining and maintaining nonprofit corporate status and tax-exempt status Creating and dissolving nonprofit organizationsThe choice of form of entityFiduciary responsibilities of those governing nonprofit organizationsSetting appropriate executive compensationRestrictions on political and lobbying activities of nonprofit organizations and how to create an effective lobbying campaign within those restrictionsIssues that arise when charities use the internetThe unrelated business income taxPrivate foundation status and how and why to avoid it Charitable giving rulesSolicitations of charitable contributions \nThe purpose of the course is to familiarize nonprofit managers with the restrictions and opportunities that the law provides which impact the effective management of nonprofit organizations.  Although the course will touch on several types of nonprofit organizations, the focus will be on charities exempt from federal income tax under Section 501(c)(3) of the Internal Revenue Code.\n\n      less description for PADM-GP 2107 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2109",
            "course_name": "The Legal Context for Policy and Public Management",
            "description": "PADM-GP 2109 The Legal Context for Policy and Public Management",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2110",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5087",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC9",
                    "time": "Thu 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "D'Aunno, Thomas"
                },
                {
                    "format": "Lecture",
                    "class_id": "5229",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "GCASL 279"
                }
            ],
            "course_name": "Strategic Management",
            "description": "PADM-GP 2110 Strategic Management \nThis is a required course for the management specialization.\n \nThis course examines management theory and practice through a framework involving strategic thinking and strategic planning. It covers a number of important management topics, including the context of strategy, leadership, managerial uses of structure and design, and performance. Case studies of managerial practice in the public and nonprofit sectors are used throughout the course.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2111",
            "course_name": "Managing Service Delivery",
            "description": "PADM-GP 2111 Managing Service Delivery \nAn introduction to the major analytical frameworks used for management decision making. Topics covered include decision analysis, benefit-cost analysis, constrained optimization, and performance analysis.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2112",
            "course_name": "",
            "description": "PADM-GP 2112\n\n   Women and Men in the Workplace\n\nThis course addresses the macro and micro effects of gender in the\nworkplace, from the complicated reasons for the lack of representation of\nwomen in senior leadership across sectors to the interpersonal dynamics of\nwomen and men working together. The landscape for business has changed\ndramatically over the last few decades, and with a shift towards a more\nglobal workforce, understanding the intersection of work dynamics and gender\nis critical. \n\nIn addition, this course will explore the important intersections between\ngender and other demographic characteristics, such as race/ethnici...\n\n      more description for PADM-GP 2112 »\n\n      \n\n\n\nThis course addresses the macro and micro effects of gender in the\nworkplace, from the complicated reasons for the lack of representation of\nwomen in senior leadership across sectors to the interpersonal dynamics of\nwomen and men working together. The landscape for business has changed\ndramatically over the last few decades, and with a shift towards a more\nglobal workforce, understanding the intersection of work dynamics and gender\nis critical. \n\nIn addition, this course will explore the important intersections between\ngender and other demographic characteristics, such as race/ethnicity, sexual\norientation, and age. Finally, the course will examine the relationship\nbetween organizational culture and employee experiences in order to uncover\nstrategies and examples of how to create more diverse and inclusive work\nenvironments.\n\n      less description for PADM-GP 2112 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2116",
            "course_name": "Developing Management Skills",
            "description": "PADM-GP 2116 Developing Management Skills \nExamines the mix of skills, values, and knowledge required for effective performance by individual managers. Techniques for assessing managerial performance and creating the conditions for behavioral change. In-depth examination of concrete skills including individual and group problem solving, interpersonal communications, empowerment, motivation and performance improvement, and delegation. Special attention is paid to the problems faced by women and minorities in management. This course makes extensive use of role playing and case analyses.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2117",
            "course_name": "Information Management and Systems in Public and Nonprofit Organizations",
            "description": "PADM-GP 2117 Information Management and Systems in Public and Nonprofit Organizations",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2119",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5088",
                    "section": "001",
                    "period": "09/12/2015 - 09/12/2015",
                    "location": "BOBS LL151 with McBride, Mary09/26/2015 - 09/26/2015 Sat 9.00 AM - 12.35 PM at SILV 414 with McBride, Mary10/10/2015 - 10/10/2015 Sat 9.00 AM - 12.35 PM at SILV 414 with McBride, Mary10/24/2015 - 10/24/2015 Sat 9.00 AM - 12.35 PM at SILV 414 with McBride, Mary11/07/2015 - 11/07/2015 Sat 9.00 AM - 12.35 PM at SILV 414 with McBride, Mary11/21/2015 - 11/21/2015 Sat 9.00 AM - 12.35 PM at SILV 414 with McBride, Mary12/05/2015 - 12/05/2015 Sat 9.00 AM - 12.35 PM at SILV 414",
                    "time": "Sat 9.00 AM - 12.35 PM",
                    "open": true,
                    "professor": "McBride, Mary"
                }
            ],
            "course_name": "Marketing for Nonprofit Organizations",
            "description": "PADM-GP 2119 Marketing for Nonprofit Organizations \nA practical, in-depth examination of successful marketing for cultural and nonprofit organizations. Includes thorough coverage of the tools of marketing, their applications, and results. Provides an understanding of and practical uses for positioning an organization within its marketplace; developing a marketing plan and creative strategy; managing a board of directors and developing a long-range plan; fund raising in the private sector; and ancillary income.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2120",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17762",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "MEYR 157",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Naftali, Timothy"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2120\n\n   Control and Accountability in Organizations: Executive Decision Making\n\nWhat is it like to make decisions of war and peace, more equality or less equality? How much freedom does a senior decision-maker, including the president, have? What roles do politics, high and bureaucratic, information and time play in public policy outcomes? Through a series of case studies drawn primarily from the federal level—and involving foreign as well as domestic policy—students will examine decision-making in search of patterns and lessons helpful to future public policy.  The class is primarily a discussion section with digital content and issue-setting lectures by the professor. T...\n\n      more description for PADM-GP 2120 »\n\n      \n\n\n\nWhat is it like to make decisions of war and peace, more equality or less equality? How much freedom does a senior decision-maker, including the president, have? What roles do politics, high and bureaucratic, information and time play in public policy outcomes? Through a series of case studies drawn primarily from the federal level—and involving foreign as well as domestic policy—students will examine decision-making in search of patterns and lessons helpful to future public policy.  The class is primarily a discussion section with digital content and issue-setting lectures by the professor. Topics include nuclear danger, welfare reform, tax reform, intelligence oversight, matters of public health and the use of drones.\n\n      less description for PADM-GP 2120 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2125",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5089",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "5089",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2125\n\n   Foundations of Nonprofit Management\n\nExamination of the role of the nonprofit sector in contemporary society and the practical concerns of management. Historical, descriptive, and theoretical issues relevant to the sector are explored. Special attention is paid to the changing relationships between public, for-profit, and nonprofit organizations. Further, the course engages students in critical thinking about managerial practice, including strategy, governance, entrepreneurialship, and accountability. Students are encouraged to bring theoretical insights from their own experiences and that of their classmates to bear on case mate...\n\n      more description for PADM-GP 2125 »\n\n      \n\n\n\nExamination of the role of the nonprofit sector in contemporary society and the practical concerns of management. Historical, descriptive, and theoretical issues relevant to the sector are explored. Special attention is paid to the changing relationships between public, for-profit, and nonprofit organizations. Further, the course engages students in critical thinking about managerial practice, including strategy, governance, entrepreneurialship, and accountability. Students are encouraged to bring theoretical insights from their own experiences and that of their classmates to bear on case materials and the management literature.\n\n      less description for PADM-GP 2125 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2126",
            "course_name": "Leading Values-Based Culture in Nonprofit Organizations",
            "description": "PADM-GP 2126 Leading Values-Based Culture in Nonprofit Organizations",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2129",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5210",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 508",
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Foldy, Erica"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2129\n\n   Race, Identity, and Inclusion\n\nThis course brings together a wide range of thinking and scholarship about race and identity to encourage learning about what race is, why it matters, and racial dynamics in organizations and how best to address them. (In this description, “race” is used as a shorthand for the interconnected complex of race, ethnicity, culture and color, understanding that we will be careful to distinguish among them in the course itself.) While recognizing the importance of intersectionality and other markers of difference such as gender and class, the course focuses on race for two reasons: 1) it is generall...\n\n      more description for PADM-GP 2129 »\n\n      \n\n\n\nThis course brings together a wide range of thinking and scholarship about race and identity to encourage learning about what race is, why it matters, and racial dynamics in organizations and how best to address them. (In this description, “race” is used as a shorthand for the interconnected complex of race, ethnicity, culture and color, understanding that we will be careful to distinguish among them in the course itself.) While recognizing the importance of intersectionality and other markers of difference such as gender and class, the course focuses on race for two reasons: 1) it is generally the most charged dimension of diversity in the United States, the most difficult to discuss and, therefore, the topic we most often avoid, and 2) it has the greatest impact on life chances and opportunities: race is often the best predictor of income, wealth, education, health, employment and other important measures of well-being. Because the impact of race is highly contextual, we will focus on the United States, although our lens will broaden at different points\n\n      less description for PADM-GP 2129 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2131",
            "course_name": "Organizational & Managerial Development",
            "description": "PADM-GP 2131 Organizational & Managerial Development \nTheories, practices, and research relating to organizational and managerial development for the public service. Considers organizational behavior and organizational change. Concepts and practices relating to diagnosis, intervention, and evaluation of organizational change.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2132",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17216",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 275",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Light, Paul"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2132\n\n   Social Impact by Design\n\nThis course addresses how organizations can make better choices about how to shape their organizations for higher performance, focusing on what researchers know about what works for improving results.  Students will explore the contemporary rationale for organizational reform and will be required to develop an outcomes approach to evaluating the costs and benefits of a particular change.  The course will also review the inventory of contemporary change strategies, including whole-organizational reform versus process reforms, evidence-based reform versus motivational strategies, leadership-driv...\n\n      more description for PADM-GP 2132 »\n\n      \n\n\n\nThis course addresses how organizations can make better choices about how to shape their organizations for higher performance, focusing on what researchers know about what works for improving results.  Students will explore the contemporary rationale for organizational reform and will be required to develop an outcomes approach to evaluating the costs and benefits of a particular change.  The course will also review the inventory of contemporary change strategies, including whole-organizational reform versus process reforms, evidence-based reform versus motivational strategies, leadership-driven reform versus systems-based reform, or radical, discontinuous change versus continuous improvement strategies.\n\nStudents who are also considering taking Managing Organizational Change (P11.2133) are advised to take Designing Organizational Change first.\n\n      less description for PADM-GP 2132 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2134",
            "course_name": "",
            "description": "PADM-GP 2134\n\n   Exlporing Changes in Labor Markets: Implications for Public Service\n\nWork occupies our best waking hours and the nature of our work is the most significant determinant of the quality of our daily lives. This course is designed to provide a selective introduction into key topics in employment. The central focus of this course is to understand the impact that the changing structure of labor markets and workplaces themselves, will have on the world of work. The course begins with a presentation of competing theoretical perspectives of work. After being presented with theoretical and conceptual perspectives of work, we will move towards discussing the effects that ...\n\n      more description for PADM-GP 2134 »\n\n      \n\n\n\nWork occupies our best waking hours and the nature of our work is the most significant determinant of the quality of our daily lives. This course is designed to provide a selective introduction into key topics in employment. The central focus of this course is to understand the impact that the changing structure of labor markets and workplaces themselves, will have on the world of work. The course begins with a presentation of competing theoretical perspectives of work. After being presented with theoretical and conceptual perspectives of work, we will move towards discussing the effects that social locations, such as race, gender, and ethnicity, have on labor market participation and outcomes. Finally we will explore the impact of changes to the structure of the labor market such as corporate restructuring, outsourcing and the emergence of a new economy will have on the world of work and how we can use this knowledge to inform, and shape the policy process. After successful completion of this course, students will be able to give informed answers to such questions as: Why do we have increasing problems of low-wage work and poverty in a wealthy society? Can the U.S. really survive as a service economy? In what ways are women gaining equality in the workplace? What does the changing world economy mean for my future? And most importantly, what can I do to make the work of work a better place for myself and others?\n\n      less description for PADM-GP 2134 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2135",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5090",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 275",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Vincent, Peter"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2135\n\n   Developing Human Resources\n\nDesigned for public and non-profit managers rather than human resource professionals, this course gives a broad overview of HR dynamics and responsibilities.  It will cover basic HR functions such as recruitment, career development, performance appraisal and rewards, providing feedback and job design.  It will also explore current issues within HR management, which could include diversity and identity at work, the role of unions, or other topics.  The course will include practical application through case discussions and reflection on students? work experiences.  While it will focus on values-...\n\n      more description for PADM-GP 2135 »\n\n      \n\n\n\nDesigned for public and non-profit managers rather than human resource professionals, this course gives a broad overview of HR dynamics and responsibilities.  It will cover basic HR functions such as recruitment, career development, performance appraisal and rewards, providing feedback and job design.  It will also explore current issues within HR management, which could include diversity and identity at work, the role of unions, or other topics.  The course will include practical application through case discussions and reflection on students? work experiences.  While it will focus on values-based organizations, it will compare HR practices in the public, non-profit and for-profit sectors.\n\n      less description for PADM-GP 2135 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2138",
            "course_name": "",
            "description": "PADM-GP 2138\n\n   Macroeconomics, Global Markets and Policy\n\nThis course teaches the principles of macroeconomic policy in an international setting. The course focuses on developing a framework for understanding the forces that determine output, employment, inflation, interest rates, exchange rates, the trade deficit, and other key macroeconomic variables. This framework is used to evaluate different macroeconoThis course teaches the principles of macroeconomic policy in an international setting. The course focuses on developing a framework for understanding the forces that determine output, employment, inflation, interest rates, exchange rates, the tra...\n\n      more description for PADM-GP 2138 »\n\n      \n\n\n\nThis course teaches the principles of macroeconomic policy in an international setting. The course focuses on developing a framework for understanding the forces that determine output, employment, inflation, interest rates, exchange rates, the trade deficit, and other key macroeconomic variables. This framework is used to evaluate different macroeconoThis course teaches the principles of macroeconomic policy in an international setting. The course focuses on developing a framework for understanding the forces that determine output, employment, inflation, interest rates, exchange rates, the trade deficit, and other key macroeconomic variables. This framework is used to evaluate different macroeconomic policies in the context of different national economic environments.\n\nBy the end of the course, students will understand: (1) How an open macroeconomy functions, and why there are business cycles. (2) The role of the Federal Reserve and other central banks, and the challenges they face in designing and implementing good monetary policy. (3) The impacts of fiscal policy choices such as government budget deficits and large levels of public debt.\n\n      less description for PADM-GP 2138 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2140",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5091",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 10.00 AM - 11.40 AM",
                    "open": true,
                    "professor": "GCASL 383"
                },
                {
                    "format": "Lecture",
                    "class_id": "5092",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 206",
                    "time": "Thu 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Brindisi, Francesco"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2140\n\n   Public Economics and Finance\n\nThis course is about the economic activiThis course is about the economic activities of government, largely revenue raising and spending. The course considers market failures, the evaluation of public expenditures, and the incidence, efficiency, and effects of various taxes. Two types of questions are studied from the economic perspective: (1) what is the \"best\" governmental policy for a particular economic problem? and (2) what determines the actual policy choices in a representative government? In each case, the primary purpose is to use microeconomic tools to study the impact of government ...\n\n      more description for PADM-GP 2140 »\n\n      \n\n\n\nThis course is about the economic activiThis course is about the economic activities of government, largely revenue raising and spending. The course considers market failures, the evaluation of public expenditures, and the incidence, efficiency, and effects of various taxes. Two types of questions are studied from the economic perspective: (1) what is the \"best\" governmental policy for a particular economic problem? and (2) what determines the actual policy choices in a representative government? In each case, the primary purpose is to use microeconomic tools to study the impact of government policy on the distribution of resources. Topics include the economics of the not-for-profit sector, welfare economics, public goods, public choice, externalities, the tragedy of the commons, income redistribution, social insurance, personal income tax, corporate income tax, consumption taxes, and wealth taxes\n\n      less description for PADM-GP 2140 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2142",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5212",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 261",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Calabrese, Thad"
                }
            ],
            "course_name": "Financial Management for Nonprofit and NGO Organizations",
            "description": "PADM-GP 2142 Financial Management for Nonprofit and NGO Organizations \nThis course focuses primarily on financial management of organizations that rely on donor support through pledges, grants and endowments.  The course incorporates an international financial management perspective because many nonprofit organizations are spanning national boarders, most notably, international nongovernmental organizations, or NGOs.  The objectives of this course are for the student to understand the theoretical and applied dimensions of domestic and international nonprofit organizations.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2143",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5093",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL138",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Smith, Daniel"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2143\n\n   Government Budgeting\n\nThis is a course in state and local government budgeting in the United States. The course emphasizes budgetary policy and management, analytical techniques, and written and verbal communication. The course builds upon the concepts and techniques students learned in their core courses in financial management, microeconomics, and statistics, and it will introduce new analytical tools, including: bond analysis, fund accounting, payroll simulation, performance budgeting, and revenue estimation. In addition, students will further develop their Excel skills—particularly the use of linear regression....\n\n      more description for PADM-GP 2143 »\n\n      \n\n\n\nThis is a course in state and local government budgeting in the United States. The course emphasizes budgetary policy and management, analytical techniques, and written and verbal communication. The course builds upon the concepts and techniques students learned in their core courses in financial management, microeconomics, and statistics, and it will introduce new analytical tools, including: bond analysis, fund accounting, payroll simulation, performance budgeting, and revenue estimation. In addition, students will further develop their Excel skills—particularly the use of linear regression.\n\n      less description for PADM-GP 2143 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2144",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5243",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 304",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Wadler, Laurence"
                }
            ],
            "course_name": "Debt Financing and Management for Public Organizations",
            "description": "PADM-GP 2144 Debt Financing and Management for Public Organizations \nHow American state and local governments and some nonprofit organizations (notably, hospitals, nursing homes, and universities) raise money for capital outlays through the public debt markets. The nature of debt management institutions, investors, instruments, and players. The significance of tax exemption, debt ratings, and debt enhancements. The primary and secondary markets are explored as well as regulation, defaults, and other policy issues.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2145",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5204",
                    "section": "001",
                    "period": "09/05/2015 - 09/05/2015",
                    "location": "BOBS LL13809/19/2015 - 09/19/2015 Sat 9.00 AM - 12.35 PM at SILV 208 with Cramer, Andrew10/03/2015 - 10/03/2015 Sat 9.00 AM - 12.35 PM at SILV 208 with Cramer, Andrew10/17/2015 - 10/17/2015 Sat 9.00 AM - 12.35 PM at SILV 208 with Cramer, Andrew10/31/2015 - 10/31/2015 Sat 9.00 AM - 12.35 PM at SILV 208 with Cramer, Andrew11/14/2015 - 11/14/2015 Sat 9.00 AM - 12.35 PM at SILV 208 with Cramer, Andrew12/12/2015 - 12/12/2015 Sat 9.00 AM - 12.35 PM at SILV 208",
                    "time": "Sat 9.00 AM - 12.35 PM",
                    "open": true,
                    "professor": "Cramer, Andrew"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2145\n\n   Design Thinking\n\nThe word \"design\" has traditionally been used to describe the visual aesthetics of objects such as books, websites, products, architecture, and fashion. Yet increasingly design as a discipline is expanding to include not just the shaping of artifacts but also the ways people interact with systems, services, and organizations.\n\nAs the challenges and opportunities facing society grow more complex, and as stakeholders grow more diverse, an approach known as \"design thinking\" is playing a greater role in finding meaningful paths forward. Design thinking is an iterative problem-solving process of d...\n\n      more description for PADM-GP 2145 »\n\n      \n\n\n\nThe word \"design\" has traditionally been used to describe the visual aesthetics of objects such as books, websites, products, architecture, and fashion. Yet increasingly design as a discipline is expanding to include not just the shaping of artifacts but also the ways people interact with systems, services, and organizations.\n\nAs the challenges and opportunities facing society grow more complex, and as stakeholders grow more diverse, an approach known as \"design thinking\" is playing a greater role in finding meaningful paths forward. Design thinking is an iterative problem-solving process of discovery, ideation, and experimentation that employs design-based techniques to gain insight and yield innovative solutions for virtually any type of organizational or business challenge, prominently including those within public service.\n\nIn \"Design Thinking: A Creative Approach to Problem Solving and Creating Impact,\" we will unpack each step of the design thinking process and become familiar with the design thinker's toolkit. Students will develop skills as ethnographers, visual thinkers, strategists, and storytellers through a hybrid of seminar discussions and collaborative projects. Over the course of seven weeks, students will directly apply what they have learned to public service and social entrepreneurial challenges about which they are passionate: they will untangle the complexities of related policy and explore innovative ways to create real impact.\n\n      less description for PADM-GP 2145 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2146",
            "course_name": "",
            "description": "PADM-GP 2146\n\n   Topics in Municipal Finance\n\nThis course is designed to provide students with an advanced understanding of basic skills used in three disciplines of municipal finance: (1) municipal credit analysis; (2) municipal portfolio management; and (3) municipal derivatives management. \n\nThis course is organized as a team-taught course and is presented in three segments. Part 1 begins with a detailed examination of the credit analysis of select revenue bond sectors. Coverage includes traditional investment grade bonds, such as public power bonds, toll roads and water & sewer debt, high yield municipals, tax-exempt corporate-backe...\n\n      more description for PADM-GP 2146 »\n\n      \n\n\n\nThis course is designed to provide students with an advanced understanding of basic skills used in three disciplines of municipal finance: (1) municipal credit analysis; (2) municipal portfolio management; and (3) municipal derivatives management. \n\nThis course is organized as a team-taught course and is presented in three segments. Part 1 begins with a detailed examination of the credit analysis of select revenue bond sectors. Coverage includes traditional investment grade bonds, such as public power bonds, toll roads and water & sewer debt, high yield municipals, tax-exempt corporate-backed debt and infrastructure financing.  Part 2 focuses upon municipal portfolio management. This group of lectures will discuss and consider: (a) an overview of municipal portfolio management; (b) risk parameters and diversification; (c) the investment process and basic portfolio construction; and (d) different measures of portfolio performance. Part 3 focuses upon municipal derivatives managementThis course is designed to provide students with an advanced understanding of basic skills used in three disciplines of municipal finance: (1) municipal credit analysis; (2) municipal portfolio management; and (3) municipal derivatives management. \n\nThis course is organized as a team-taught course and is presented in three segments. Part 1 begins with a detailed examination of the credit analysis of select revenue bond sectors. Coverage includes traditional investment grade bonds, such as public power bonds, toll roads and water & sewer debt, high yield municipals, tax-exempt corporate-backed debt and infrastructure financing.  Part 2 focuses upon municipal portfolio management. This group of lectures will discuss and consider: (a) an overview of municipal portfolio management; (b) risk parameters and diversification; (c) the investment process and basic portfolio construction; and (d) different measures of portfolio performance. Part 3 focuses upon municipal derivatives management. This group of lectures will discuss and consider: (a) an overview of the derivatives market; (b) a detailed examination of derivative instruments in the public sector; (c) a review of common interest rate swap structure; and (d) an in-depth profile of derivatives origination and management in the municipal market.\n\n      less description for PADM-GP 2146 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2147",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5230",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "GCASL 279"
                }
            ],
            "course_name": "Corporate Finance and Public",
            "description": "PADM-GP 2147 Corporate Finance and Public \nThis course introduces students to the main areas of corporate finance and how they relate to policy issues and discussions. The course covers topics in the three main areas of corporate finance: 1) capital structure (financing choices), 2) valuation (project and firm valuation) and 3) corporate governance (optimal governance structures). We will analyze how public policy, through taxes, public expenditures and regulation, affect these aspects of corporate finance.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2159",
            "course_name": "",
            "description": "PADM-GP 2159\n\n   The Convergence of Business & Public Administration in the Nation's Economy\n\nAre business interests in the U.S. too politically powerful or is the government unnecessarily restricting their ability to compete in the global marketplace?  This course will explore the complex relationship between what are traditionally separate disciplines of study but which are converging in an increasingly regulated domestic and globalized economy.  The course will review the political, governmental and judicial policies that create the current environment for business as well as examine the respective roles played by the congress, the executive branch and the courts.  There will also b...\n\n      more description for PADM-GP 2159 »\n\n      \n\n\n\nAre business interests in the U.S. too politically powerful or is the government unnecessarily restricting their ability to compete in the global marketplace?  This course will explore the complex relationship between what are traditionally separate disciplines of study but which are converging in an increasingly regulated domestic and globalized economy.  The course will review the political, governmental and judicial policies that create the current environment for business as well as examine the respective roles played by the congress, the executive branch and the courts.  There will also be general comparisons between U.S. behaviors and institutions and those in Germany, the economic engine driving the European Union’s economy.  Calling upon the unique resources of Washington, DC, there will be guest lecturers to bring real world experience to subjects being discussed.\n\n      less description for PADM-GP 2159 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2170",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5094",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-20",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Privett, Natalie"
                },
                {
                    "format": "Lecture",
                    "class_id": "5188",
                    "section": "002",
                    "period": "09/05/2015 - 09/05/2015",
                    "location": "BOBS LL151 with Germain, Patrick09/19/2015 - 09/19/2015 Sat 9.00 AM - 12.35 PM at BOBS LL151 with Germain, Patrick10/03/2015 - 10/03/2015 Sat 9.00 AM - 12.35 PM at BOBS LL151 with Germain, Patrick10/17/2015 - 10/17/2015 Sat 9.00 AM - 12.35 PM at BOBS LL151 with Germain, Patrick10/31/2015 - 10/31/2015 Sat 9.00 AM - 12.35 PM at BOBS LL151 with Germain, Patrick11/14/2015 - 11/14/2015 Sat 9.00 AM - 12.35 PM at BOBS LL151 with Germain, Patrick12/12/2015 - 12/12/2015 Sat 9.00 AM - 12.35 PM at BOBS LL151",
                    "time": "Sat 9.00 AM - 12.35 PM",
                    "open": true,
                    "professor": "Germain, Patrick"
                }
            ],
            "course_name": "Performance Measurement & Management for Public, Nonprofit & Healthcare Orgs",
            "description": "PADM-GP 2170 Performance Measurement & Management for Public, Nonprofit & Healthcare Orgs \nAll public and not-for-profit organizations must assemble and report information on their performance. The need for performance measures goes beyond legal and regulatory requirements. To provide services effectively and efficiently, managers need information to make decisions. This course focuses on what performance measures are needed, how they should be created and what forms of communication are most effective.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2171",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5095",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "194M 307",
                    "time": "Mon 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Berry, Carolyn"
                },
                {
                    "format": "Lecture",
                    "class_id": "5096",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC11",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Paroff, Jodi"
                },
                {
                    "format": "Lecture",
                    "class_id": "5169",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 361",
                    "time": "Thu 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Swaner, Rachel"
                }
            ],
            "course_name": "Program Analysis and Evaluation",
            "description": "PADM-GP 2171 Program Analysis and Evaluation \nThis course serves as an introduction to those evaluation tools most commonly used to assess the performance of publicly funded programs, in both the public and private sector.  Topics include developing and assessing program theory, implementation and process assessment, methods of impact evaluation, and efficiency analysis (cost-benefit and cost-effectiveness analysis).  The focus is on critical analysis and understanding of both the underlying programs and their evaluations.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2172",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5202",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "MEYR 261",
                    "time": "Wed 6.45 PM - 9.30 PM",
                    "open": true,
                    "professor": "Dehejia, Rajeev"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2172\n\n   Advanced Empirical Methods for Policy Analysis\n\nThe goal of this course is to provide students with an introduction to advanced empirical methods. We begin by discussing a framework for causal inference and how randomized controlled trials provide a simple and powerful template for thinking about causal questions. We then develop a sequence of advanced empirical methods as alternatives to randomized trials, in settings where experiments are infeasible or not desirable. In particular we discuss regression discontinuity, matching methods, difference-in-differences and panel data, and instrumental variables. We will discuss applications from a...\n\n      more description for PADM-GP 2172 »\n\n      \n\n\n\nThe goal of this course is to provide students with an introduction to advanced empirical methods. We begin by discussing a framework for causal inference and how randomized controlled trials provide a simple and powerful template for thinking about causal questions. We then develop a sequence of advanced empirical methods as alternatives to randomized trials, in settings where experiments are infeasible or not desirable. In particular we discuss regression discontinuity, matching methods, difference-in-differences and panel data, and instrumental variables. We will discuss applications from a variety of domestic and international policy settings, and learn how to apply these methods to real-world data sets. Skills students will acquire in this course include: the capacity to reason causally and empirically, the ability critically to assess empirical work, knowledge of advanced quantitative tools, and expertise in applying these methods to policy problems.\n\n      less description for PADM-GP 2172 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2173",
            "course_name": "Operations Management for Public, Nonprofit, and Health Contexts",
            "description": "PADM-GP 2173 Operations Management for Public, Nonprofit, and Health Contexts",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2174",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5227",
                    "section": "001",
                    "period": "09/12/2015 - 09/12/2015",
                    "location": "BOBS LL138 with Privett, Natalie; Campbell, Gordon09/26/2015 - 09/26/2015 Sat 9.00 AM - 12.35 PM at BOBS LL138 with Privett, Natalie; Campbell, Gordon10/10/2015 - 10/10/2015 Sat 9.00 AM - 12.35 PM at BOBS LL138 with Privett, Natalie; Campbell, Gordon10/24/2015 - 10/24/2015 Sat 9.00 AM - 12.35 PM at BOBS LL138 with Privett, Natalie; Campbell, Gordon11/07/2015 - 11/07/2015 Sat 9.00 AM - 12.35 PM at BOBS LL138 with Privett, Natalie; Campbell, Gordon11/21/2015 - 11/21/2015 Sat 9.00 AM - 12.35 PM at BOBS LL138 with Privett, Natalie; Campbell, Gordon12/05/2015 - 12/05/2015 Sat 9.00 AM - 12.35 PM at BOBS LL138",
                    "time": "Sat 9.00 AM - 12.35 PM",
                    "open": true,
                    "professor": "Privett, Natalie; Campbell, Gordon"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2174\n\n   The Intersection of Operations and Policy\n\nPolicy and operations are inextricably linked. This course aims to expose students to policy formation in a highly political environment, operations management of systems shaped by state and local policy, and their intersection, while building a toolbox of specific skills that support analysis and decision making in a wide variety of contexts. A unifying Multimedia Interactive Case Study (MICS) focused on the NYC family homeless shelter system will be the backdrop of this course. This course is an intensive engagement that incorporates perspectives from academic theory, City, State and Federal...\n\n      more description for PADM-GP 2174 »\n\n      \n\n\n\nPolicy and operations are inextricably linked. This course aims to expose students to policy formation in a highly political environment, operations management of systems shaped by state and local policy, and their intersection, while building a toolbox of specific skills that support analysis and decision making in a wide variety of contexts. A unifying Multimedia Interactive Case Study (MICS) focused on the NYC family homeless shelter system will be the backdrop of this course. This course is an intensive engagement that incorporates perspectives from academic theory, City, State and Federal government, service providers, advocacy organizations, and public interest law.\n\n      less description for PADM-GP 2174 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2177",
            "course_name": "Leading Values-Based Culture in Nonprofit Organizations",
            "description": "PADM-GP 2177 Leading Values-Based Culture in Nonprofit Organizations",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2178",
            "course_name": "Power and Influence in Organizations and Politics",
            "description": "PADM-GP 2178 Power and Influence in Organizations and Politics \nThe goal of this course is to develop your understanding of power and techniques of analyzing influence processes. After you have completed the course, you will be able to identify more effectively the reasons for others' behavior and influence events toward the ends that you desire. You also will have confronted what power means to you and the role you would like it to play in your career.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2186",
            "course_name": "",
            "description": "PADM-GP 2186\n\n   Leadership and Social Transformation\n\nThis course is appropriate for students interested in the role that leadership plays in advancing social innovation and social change in the context of democratic governance.\n\nThe course explores the role of leadership in organizational efforts to change thinking, systems, and policies—taking into consideration the contested process by which the responsibility of addressing intractable problems is distributed among key diverse actors in a shared-power world. Traditional approaches to leadership defined by single heroic individuals who influence followers are contrasted with new perspectives—...\n\n      more description for PADM-GP 2186 »\n\n      \n\n\n\nThis course is appropriate for students interested in the role that leadership plays in advancing social innovation and social change in the context of democratic governance.\n\nThe course explores the role of leadership in organizational efforts to change thinking, systems, and policies—taking into consideration the contested process by which the responsibility of addressing intractable problems is distributed among key diverse actors in a shared-power world. Traditional approaches to leadership defined by single heroic individuals who influence followers are contrasted with new perspectives—consistent with the demands of today’s complex problems—particularly when we aspire to inclusive, transparent and democratic solutions. Emergent perspectives reveal leadership as the collective achievement of members of a group who share a vision, and who must navigate the constellation of relationships, structures, processes and institutional dynamics within the larger system in which they are embedded.\n\nThe course will focus primarily on the organizational level of action, but connections to the individual and policy levels will also be explored. An opportunity to apply course concepts in the context of a particular organization of the student’s choice (with instructor approval) will deepen and personalize the student’s understanding of the interconnections between the three levels of action, and challenge assumptions about leadership and social change and their implications for practice.\n\n      less description for PADM-GP 2186 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2188",
            "course_name": "",
            "description": "PADM-GP 2188\n\n   The Business and Psychology of Social Entrepreneurship\n\nRoll up your sleeves. This course is about addressing social problems and changing the world by using your signature strengths in the service of others. We will examine the ever-evolving theory and practice of social entrepreneurship around the globe, covering multiple change-making roles required for successful social entrepreneurship, including the visionary, the infrastructure engineer & manager, and the media & arts contributor. To this end, you and a small team of your peers will be invited to collaborate on a social enterprise business plan of your own design. The semester will progress ...\n\n      more description for PADM-GP 2188 »\n\n      \n\n\n\nRoll up your sleeves. This course is about addressing social problems and changing the world by using your signature strengths in the service of others. We will examine the ever-evolving theory and practice of social entrepreneurship around the globe, covering multiple change-making roles required for successful social entrepreneurship, including the visionary, the infrastructure engineer & manager, and the media & arts contributor. To this end, you and a small team of your peers will be invited to collaborate on a social enterprise business plan of your own design. The semester will progress as an informal laboratory where you will be required to use both sides of your brain observing, experimenting with, and helping shape what it means to be a social entrepreneur.\n\nOur objectives will be to learn about the history, context and varied definitions of social entrepreneurship, to observe effective examples of it in action, and to decipher key success factors and benefits, as well as risks and strategies for mitigating them. In addition, you will be guided through a multi-phase process of self-exploration, social analysis, business strategy, organizational structure and constructive peer critique -- all with the end goal of crafting a business plan for changing the world.\n\n      less description for PADM-GP 2188 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2196",
            "course_name": "",
            "description": "PADM-GP 2196\n\n   Moral Courage and Your Purpose\n\nMoral courage means standing up when others want you to sit down.\n\nDeveloping moral courage is crucial to authenticity of the self. It equips individuals to discover what is true about their voices, allowing them to deepen that uniqueness. \n\nIt also empowers individuals to discover what matters to them, what they stand for, even if the price is intimidation from peers or disapproval from loved ones.\n\nThese are central issues for college graduates today. Humanity's future demands creativity, which in turn requires students to find and cultivate their callings. Purpose and meaning are no longer ...\n\n      more description for PADM-GP 2196 »\n\n      \n\n\n\nMoral courage means standing up when others want you to sit down.\n\nDeveloping moral courage is crucial to authenticity of the self. It equips individuals to discover what is true about their voices, allowing them to deepen that uniqueness. \n\nIt also empowers individuals to discover what matters to them, what they stand for, even if the price is intimidation from peers or disapproval from loved ones.\n\nThese are central issues for college graduates today. Humanity's future demands creativity, which in turn requires students to find and cultivate their callings. Purpose and meaning are no longer luxuries; they are necessities in the roller-coaster ride that is a contemporary career.\n\nWhether as entrepreneurs, as social change agents, or as both, having impact requires taking risks for life-changing rewards.\n\nDeveloped by Irshad Manji, this seminar-style course is driven by Socratic questioning. It will emphasize reflection, interaction and unconventional ways of learning. Be prepared for inspiration and the hard work of applying it to your purpose.\n\nTo learn more about this course, please visit: \n\nhttp://wagner.nyu.edu/leadership/affiliates/moral_courage.\n\n      less description for PADM-GP 2196 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2197",
            "course_name": "Taub Seminar",
            "description": "PADM-GP 2197 Taub Seminar \nThis seminar explores important issues and dilemmas facing the Jewish communal sector in the U.S., and the performance of Jewish communal organizations in dealing with them. Students will be prepared to define key issues and justify their importance, identify the drivers of issues and dilemmas impacting this sector, describe organizational responsibility for given issues, describe and challenge assumptions about issues, and evaluate the way in which the sector handles important issues. The course includes visits from leaders in the field and visits to leaders in their organizations.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2201",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5174",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "GCASL 269"
                },
                {
                    "format": "Lecture",
                    "class_id": "5175",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 12.20 PM - 1.55 PM",
                    "open": true,
                    "professor": "BOBS LL138"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2201\n\n   Institutions, Governance, and International Development\n\nThis course is required for all students in the international specialization in both the PNP and HPAM programs. The course provides an introduction to the current thinking and practice of public sector institutional reform with a particular focus on developing and in-transition countries. Part-time students should plan to take this course next year when it will be offered in both the fall and spring semesters; at least one of the two sections will be offered in an evening time slot.\n\nThe bulk of the course is devoted to an examination of key institutional reforms that are intended to promote...\n\n      more description for PADM-GP 2201 »\n\n      \n\n\n\nThis course is required for all students in the international specialization in both the PNP and HPAM programs. The course provides an introduction to the current thinking and practice of public sector institutional reform with a particular focus on developing and in-transition countries. Part-time students should plan to take this course next year when it will be offered in both the fall and spring semesters; at least one of the two sections will be offered in an evening time slot.\n\nThe bulk of the course is devoted to an examination of key institutional reforms that are intended to promote good governance as economies liberalize and societies democratize. Major topics include institutional restructuring, civil service reform, anti-corruption, fiscal framework reform, citizen engagement mechanisms, public-private partnerships, performance evaluation and change management. In addition, the role of development aid and the institutions that provide it in supporting institutional reform are covered. The course concludes with a synthetic review of the topics covered and a case study exercise.\n\n      less description for PADM-GP 2201 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2202",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5176",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 401",
                    "time": "Tue 6.45 PM - 9.15 PM",
                    "open": true,
                    "professor": "Gershman, John"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2202\n\n   Politics of International Development\n\nThis course provides students with a rich sense of the institutional and political context within which policy is made and implemented.  The course aims to give students exposure to important ongoing debates in international development and their historical context.  The class will provide an overview of some of the major contemporary analytical and policy debates regarding the politics of development.  Topics to be covered are: States, Regimes and Industrialization; Politics of Poverty, Growth and Policy Reform; Governance, Civil Society and Development; and The Politics of Development in the...\n\n      more description for PADM-GP 2202 »\n\n      \n\n\n\nThis course provides students with a rich sense of the institutional and political context within which policy is made and implemented.  The course aims to give students exposure to important ongoing debates in international development and their historical context.  The class will provide an overview of some of the major contemporary analytical and policy debates regarding the politics of development.  Topics to be covered are: States, Regimes and Industrialization; Politics of Poverty, Growth and Policy Reform; Governance, Civil Society and Development; and The Politics of Development in the Age of Globalization.\n\n      less description for PADM-GP 2202 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2203",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5177",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "MEYR 261",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Dehejia, Rajeev"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2203\n\n   International Economic Development; Government Markets\n\nThis course takes up issues of economic growth and social change in a comparative perspective. While some countries have achieved unprecedented rates of economic growth in the past half century, other countries have experienced setbacks. For those that have seen rapid growth, economic changes have not always translated in proportional social changes and sometimes rapid social changes have occurred in the absence of economic growth. The course begins by reviewing theories of economic growth and recent evidence. In that context, attention then turns to policy interventions to improve education, ...\n\n      more description for PADM-GP 2203 »\n\n      \n\n\n\nThis course takes up issues of economic growth and social change in a comparative perspective. While some countries have achieved unprecedented rates of economic growth in the past half century, other countries have experienced setbacks. For those that have seen rapid growth, economic changes have not always translated in proportional social changes and sometimes rapid social changes have occurred in the absence of economic growth. The course begins by reviewing theories of economic growth and recent evidence. In that context, attention then turns to policy interventions to improve education, address market failures, confront rapid population growth, and strengthen safety nets.\n\n      less description for PADM-GP 2203 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2204",
            "course_name": "",
            "description": "PADM-GP 2204\n\n   Development Assistance Accountability and Effectiveness\n\nInternational development assistance has evolved considerably in the post WWII period.  Although some of the initial development agencies are still operating and remain influential, the way they function has evolved and important new players have entered the field.  This course provides an overview of contemporary debates in international development assistance with a detailed review of the major actors-multilateral, bilateral, and nongovernmental.   The course explores the political economy of donor-client country relationships, the key accountability challenges that have emerged, and the lin...\n\n      more description for PADM-GP 2204 »\n\n      \n\n\n\nInternational development assistance has evolved considerably in the post WWII period.  Although some of the initial development agencies are still operating and remain influential, the way they function has evolved and important new players have entered the field.  This course provides an overview of contemporary debates in international development assistance with a detailed review of the major actors-multilateral, bilateral, and nongovernmental.   The course explores the political economy of donor-client country relationships, the key accountability challenges that have emerged, and the link between accountability and aid effectiveness.  Particular emphasis is given to recent approaches to development assistance that  have attempted to bridge the accountability-effectiveness divide.  The course closes with consideration of the likely and possible future of development assistance.\n\n      less description for PADM-GP 2204 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2210",
            "course_name": "",
            "description": "PADM-GP 2210\n\n   International Organizations and their Management\n\nFocuses on the changing roles and functions of different public and private international organizations and the services they provide. Students gain an understanding of the way intergovernmental organizations work and the specific functions and responsibilities of various bodies and organizations such as the Security Council, General Assembly, ECOSOC, and regional economic commissions. In addition, students gain an appreciation of the mandates of different UN development programs and agencies, funding bodies, and specialized organizations. Through role-playing, students work on issues within t...\n\n      more description for PADM-GP 2210 »\n\n      \n\n\n\nFocuses on the changing roles and functions of different public and private international organizations and the services they provide. Students gain an understanding of the way intergovernmental organizations work and the specific functions and responsibilities of various bodies and organizations such as the Security Council, General Assembly, ECOSOC, and regional economic commissions. In addition, students gain an appreciation of the mandates of different UN development programs and agencies, funding bodies, and specialized organizations. Through role-playing, students work on issues within the UN system to further explore the complexities of international organizations and their management. Visits to the UN and firsthand dialogue with senior UN officials are an integral part of the program.\n\n      less description for PADM-GP 2210 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2211",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5178",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC11",
                    "time": "Fri 9.00 AM - 1.00 PM",
                    "open": true,
                    "professor": "Downs, Charles"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2211\n\n   International Program Development and Management\n\nThis course examines the inner workings of successful international public service projects and gives students the opportunity to design one or more themselves.  Students will then study the characteristics of effective programs, which bring together a series of projects for mutually supportive and concerted action.  Particular attention is paid to programs selected from the five areas where international public sector entities are most active: peace building, relief, development, advocacy and norm-setting. Case studies will be used in each of these areas to gain a deeper understanding of the ...\n\n      more description for PADM-GP 2211 »\n\n      \n\n\n\nThis course examines the inner workings of successful international public service projects and gives students the opportunity to design one or more themselves.  Students will then study the characteristics of effective programs, which bring together a series of projects for mutually supportive and concerted action.  Particular attention is paid to programs selected from the five areas where international public sector entities are most active: peace building, relief, development, advocacy and norm-setting. Case studies will be used in each of these areas to gain a deeper understanding of the relationship between policy and implementation.\n\n      less description for PADM-GP 2211 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2212",
            "course_name": "Managing Humanitarian Challenges: Delivery and Logistics",
            "description": "PADM-GP 2212 Managing Humanitarian Challenges: Delivery and Logistics",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2215",
            "course_name": "Globalization & Its Impact on the State",
            "description": "PADM-GP 2215 Globalization & Its Impact on the State \nThis course will examine the critical and rapidly changing role of the state at the beginning of a new millennium, paying special attention to the state as a central player in ensuring the provision of public services in varied environments. It will enable students to: engage in specific analyses of the mechanisms of governance at different levels, identify the capacities of and constraints facing governance processes, critique the manner in which reforms undertaken by governments impact social, cultural and economic development, analyze the challenges faced by government.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2216",
            "course_name": "",
            "description": "PADM-GP 2216\n\n   International Organizations: NGO's\n\nThe role of International Non-Governmental Organizations (INGOs) in relief and development has grown more complex and urgent in recent years. From the shocking poverty of sub-Saharan Africa, stabilization of Afghanistan, earthquake relief in Haiti, floods in Pakistan, and the youth bulge throughout the developing world, INGOs ability to tackle issues cross disciplines in a coordinated and sustainable way is central to their success.  This course is designed to help students increase their knowledge and understanding of such organizations -- what they do, how they operate, the complex issues th...\n\n      more description for PADM-GP 2216 »\n\n      \n\n\n\nThe role of International Non-Governmental Organizations (INGOs) in relief and development has grown more complex and urgent in recent years. From the shocking poverty of sub-Saharan Africa, stabilization of Afghanistan, earthquake relief in Haiti, floods in Pakistan, and the youth bulge throughout the developing world, INGOs ability to tackle issues cross disciplines in a coordinated and sustainable way is central to their success.  This course is designed to help students increase their knowledge and understanding of such organizations -- what they do, how they operate, the complex issues they face, and how they can be more effective in achieving their development goals. This includes analyses of the implications of international structures, human resources, cultures, the role of global politics, key management skills needed and career possibilities. Throughout the course, we will analyze and discuss various structural and management issues central to working at an INGO including:\n\n•\tThe changing role of INGOs in international development, including the growing role of contractors, security issues,\n•\tCivilian-Military relations (whether and how INGOs should work with military agencies)\n•\tINGOs role vis-à-vis donors and governments\n•\tHow INGOs are structured operationally and programmatically (the HQ-field divide) and how to manage the tensions\n•\tWorking in diverse cultures and on dispersed teams\n•\tLiving the agency’s values: ethical dilemmas\n\nThe course will use a mixture of cases, experiential exercises, debates, and classroom discussions to elicit these themes so that students can wrestle with the complexities of working in an INGO.\n\n      less description for PADM-GP 2216 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2218",
            "course_name": "Law and Development",
            "description": "PADM-GP 2218 Law and Development",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2223",
            "course_name": "",
            "description": "PADM-GP 2223\n\n   The International Human Rights Movement:  Past, Present and Future\n\nThe human rights movement is one of the most successful social justice movements of our time, establishing universal principles that govern how states should treat citizens and non-citizens, and helping to challenge dictators and authoritarian rulers in many regions, including Southern Africa, Eastern Europe, Latin America, and the Middle East. Over the last three decades, national human rights organizations have proliferated; today, a human rights community of some sort exists in virtually every country of the world. On the global level, simultaneously, the International Human Rights Movement...\n\n      more description for PADM-GP 2223 »\n\n      \n\n\n\nThe human rights movement is one of the most successful social justice movements of our time, establishing universal principles that govern how states should treat citizens and non-citizens, and helping to challenge dictators and authoritarian rulers in many regions, including Southern Africa, Eastern Europe, Latin America, and the Middle East. Over the last three decades, national human rights organizations have proliferated; today, a human rights community of some sort exists in virtually every country of the world. On the global level, simultaneously, the International Human Rights Movement (IHRM) has become a powerful force. The movement strengthens—and is strengthened by—a complex web of institutions, laws, and norms that constitute a functioning global system that builds on itself progressively, animated by strong NGOs.\n\n \n\nIn the 21st Century, the international human rights movement faces new challenges and new opportunities. Building on the standard-setting successes of the past few decades, human rights organizations are finding new ways to implement and enforce rights, moving beyond law and norm development to make rights real for more people and to demonstrate that the global human rights system can work. To do this, they are using new tools to better document, analyze and publicize human rights abuse and to better advocate for changes in policy and behavior. And they are focusing on new spaces for international engagement, from Brasilia to Beijing.\n\n \n\nThe focus of this class is the NGOs that drive the movement on the international level (e.g. Amnesty International, Human Rights Watch, International Commission of Jurists, Witness, International Center for Transitional Justice, etc.); on the regional level (e.g. Forum-Asia, West African Human Rights Defenders Network, Center for Justice and International Law); and the national/domestic level (e.g. Centro de Estudios Legales y sociales, Kenyan Human Rights Commission; Legal Resources Center, etc.). Indeed, each class will highlight the experience of at least one major human rights NGO. Drawing of two decades of working closely with these organizations, the instructor will bring countless examples from the field into the classroom, including internal debates about strategy development, institutional representation, research methodologies, partnerships, networks, venues of engagement (e.g. regional systems, Human Rights Council), campaigning, fundraising and, perhaps most importantly, the fraught and complex debates about adaptation to changing global circumstances, starting with the pre-Cold War period and including some of the most up-to-date issues and questions going on in this field today.\n\n \n\nStudents will leave with a deep appreciation of what it means to work in or with Human Rights NGOs: challenges, strategies, dilemmas, theories of change, etc. and be uniquely prepared to both analyze this sector and/or work in it as a staff person, consultant, or NGOs leader. \n\n.\n\n      less description for PADM-GP 2223 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2224",
            "course_name": "",
            "description": "PADM-GP 2224\n\n   Human Rights, Transitional Democracy and Transitional Justice\n\nShould societies confront the legacies of past human rights abuse or atrocity? If so, how? What policy options are open to successor regimes during a post-transition or post-conflict period? How do these policy options relate to broader goals, such as peace, stability, or democracy? This course seeks to answer these questions. This course begins with an exploration of why, or even if, societies should confront past human rights abuse and atrocity. Drawing on film and literature, as well as accounts by victims and arguments by victim movements, the course examines arguments about justice and de...\n\n      more description for PADM-GP 2224 »\n\n      \n\n\n\nShould societies confront the legacies of past human rights abuse or atrocity? If so, how? What policy options are open to successor regimes during a post-transition or post-conflict period? How do these policy options relate to broader goals, such as peace, stability, or democracy? This course seeks to answer these questions. This course begins with an exploration of why, or even if, societies should confront past human rights abuse and atrocity. Drawing on film and literature, as well as accounts by victims and arguments by victim movements, the course examines arguments about justice and democracy-building that have been advanced to support the field of transitional justice. The course then examines the main strategies that have emerged for an engagement with the past. These include (1) prosecuting the offenders, from Germany's Adolf Eichmann, to Chile's General Pinochet, to Iraq's Saddam Hussein, including through international tribunals or \"hybrid\" (mixed) tribunals such as the Khmer Rouge Tribunal in Cambodia; (2) developing truth commissions (such as in Chile, South Africa, Peru, and Sierra Leone), or other (e.g. non-offciial) forms of truth-telling; (3) establishing reparations programs (including the possibility of reparations for slavery in the USA); (4) launching of larger-scale institutional reforms (such as police reform or security sector reform in countries such as Northern Ireland, East Germany, and Iraq); and (5) the building of memorials and recapturing public spaces to create social dialogue (in Argentina, Cambodia, East Timor). The theme of \"reShould societies confront the legacies of past human rights abuse or atrocity? If so, how? What policy options are open to successor regimes during a post-transition or post-conflict period? How do these policy options relate to broader goals, such as peace, stability, or democracy? This course seeks to answer these questions. This course begins with an exploration of why, or even if, societies should confront past human rights abuse and atrocity. Drawing on film and literature, as well as accounts by victims and arguments by victim movements, the course examines arguments about justice and democracy-building that have been advanced to support the field of transitional justice. The course then examines the main strategies that have emerged for an engagement with the past. These include (1) prosecuting the offenders, from Germany's Adolf Eichmann, to Chile's General Pinochet, to Iraq's Saddam Hussein, including through international tribunals or \"hybrid\" (mixed) tribunals such as the Khmer Rouge Tribunal in Cambodia; (2) developing truth commissions (such as in Chile, South Africa, Peru, and Sierra Leone), or other (e.g. non-offciial) forms of truth-telling; (3) establishing reparations programs (including the possibility of reparations for slavery in the USA); (4) launching of larger-scale institutional reforms (such as police reform or security sector reform in countries such as Northern Ireland, East Germany, and Iraq); and (5) the building of memorials and recapturing public spaces to create social dialogue (in Argentina, Cambodia, East Timor). The theme of \"reconciliation\" will also be discussed throughout the course. \n\n      less description for PADM-GP 2224 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2225",
            "course_name": "",
            "description": "PADM-GP 2225\n\n   Organizing for Human Rights\n\nTeddy Roosevelt claimed that the only two ways to get somebody to do what you wanTeddy Roosevelt claimed that the only two ways to get somebody to do what you wanted them to do was to \"shoot 'em or talk 'em to death.\"  Saul Alinsky, the great community organizer, had a bit more sophisticated view.\nAmong his \"Rules for Radicals\" was this one:  \"Power is not only what you have but what the enemy thinks you have.\" This course will range in focus from the theoretical and strategic to the detailed and practical.  It will critically examine the major resources available for bringing about human rig...\n\n      more description for PADM-GP 2225 »\n\n      \n\n\n\nTeddy Roosevelt claimed that the only two ways to get somebody to do what you wanTeddy Roosevelt claimed that the only two ways to get somebody to do what you wanted them to do was to \"shoot 'em or talk 'em to death.\"  Saul Alinsky, the great community organizer, had a bit more sophisticated view.\nAmong his \"Rules for Radicals\" was this one:  \"Power is not only what you have but what the enemy thinks you have.\" This course will range in focus from the theoretical and strategic to the detailed and practical.  It will critically examine the major resources available for bringing about human rights change, from public exposure to economic sanctions, from legal challenges to military intervention, and it will help students learn to formulate and evaluate organizing efforts to foster change at the global, regional, national and local levels.  By the end of the course we will have added a myriad of techniques to Roosevelt's two and learned how, a la Alinsky, to exploit our adversaries' misperceptions as readily as we do their strategic blunders.\n\n      less description for PADM-GP 2225 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2226",
            "course_name": "",
            "description": "PADM-GP 2226\n\n   Innovative Leadership for Human Development: the UN and the MDGs\n\nThe course will explore an integral framework for international development that compliments the current hyper-rational, statistical, technocratic, bureaucratic approach. Integral development includes systems/institutions/policies, cultural development, individual behavior and individual consciousness and values. The course will then enable students to experience and practice innovative leadership methods that can make a dramatic difference in their life and work. As an alternative to a \"command and control\" leadership style, innovative leadership is facilitative, participatory, collaborative,...\n\n      more description for PADM-GP 2226 »\n\n      \n\n\n\nThe course will explore an integral framework for international development that compliments the current hyper-rational, statistical, technocratic, bureaucratic approach. Integral development includes systems/institutions/policies, cultural development, individual behavior and individual consciousness and values. The course will then enable students to experience and practice innovative leadership methods that can make a dramatic difference in their life and work. As an alternative to a \"command and control\" leadership style, innovative leadership is facilitative, participatory, collaborative, creative and profound. Four levels of innovative leadership will be experienced, enhanced and practiced:\nphysical/sensory capacities, psychological/historical capacities, mythic/symbolic capacities and unitive/intuitive capacities. UN program experience  will be shared related to the role of innovative leadership in achieving the MDGs in Nepal, Albania, the Eastern Caribbean, Kenya and the Philippines.\n\n      less description for PADM-GP 2226 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2234",
            "course_name": "Ecoleadership: Public Role of the Private Sector in Blding Sustainable Societies",
            "description": "PADM-GP 2234 Ecoleadership: Public Role of the Private Sector in Blding Sustainable Societies \nThis course examines the impact of the global quest for economic capital on the development of social and natural capital worldwide as well as the role of the private sector in shaping sustainable economic growth policies which also promote the development of social and natural capital.  The course is focused on the policy shaper and actor.  It examines the growing impact of the private sector on policy making on the provision of public goods worldwide and on the sustainability agenda through WTO and other mechanisms of global trade.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2236",
            "course_name": "Protecting Rights and Promoting Development: Labor & Env Standards/Global Econ",
            "description": "PADM-GP 2236 Protecting Rights and Promoting Development: Labor & Env Standards/Global Econ",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2242",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5203",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "BOBS LL139",
                    "time": "Thu 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Taitel, Scott B"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2242\n\n   Financial Management for International Organizations\n\nThis course builds on the themes, concepts and theories covered in the Core Financial Management course and provides students the opportunity to apply that knowledge to an international context.  Case methodology will be utilized to examine financial management practices of NGOs and Non-Profit entities throughout the world.  Through these cases, we will look at international NGOs and Non-Profit organizations' approach to cash flow management, capital budgeting, cost analysis and allocation, investment management, the analysis of new programmatic investments, project finance, currency managemen...\n\n      more description for PADM-GP 2242 »\n\n      \n\n\n\nThis course builds on the themes, concepts and theories covered in the Core Financial Management course and provides students the opportunity to apply that knowledge to an international context.  Case methodology will be utilized to examine financial management practices of NGOs and Non-Profit entities throughout the world.  Through these cases, we will look at international NGOs and Non-Profit organizations' approach to cash flow management, capital budgeting, cost analysis and allocation, investment management, the analysis of new programmatic investments, project finance, currency management and strategic financial analysis.\n\n      less description for PADM-GP 2242 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2245",
            "course_name": "",
            "description": "PADM-GP 2245\n\n   Financing Local Governmt\n\nThis class applies basic concepts of public finance to the analysis of the structure and operation of government systems in developing countries, with particular emphasis on decentralized levels of government. Major topics include understanding the broader process of economic and fiscal reform; determining the appropriate division of taxing and spending responsibilities among levels of government; evaluating decentralized government revenue-raising mechanisms; and assessing prospects and options for decentralized and intergovernmental fiscal reform. The class focuses on the economic analysis o...\n\n      more description for PADM-GP 2245 »\n\n      \n\n\n\nThis class applies basic concepts of public finance to the analysis of the structure and operation of government systems in developing countries, with particular emphasis on decentralized levels of government. Major topics include understanding the broader process of economic and fiscal reform; determining the appropriate division of taxing and spending responsibilities among levels of government; evaluating decentralized government revenue-raising mechanisms; and assessing prospects and options for decentralized and intergovernmental fiscal reform. The class focuses on the economic analysis of these issues, but attention is also given to political, institutional and cultural considerations that should influence policy design.\n\n      less description for PADM-GP 2245 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2250",
            "course_name": "",
            "description": "PADM-GP 2250\n\n   Hunger and Food Security in a Global Perspective\n\nThis course explores the political and economic policy issues surrounding hunger and food security, drawing on many case examples and using Ghana as a case study. The course will provide an overview of some of the core dimensions of global hunger and food security policy issues, including debates over a new green revolution, food aid, fair trade, the impact of expanded biofuels production and the impact of the inter-related financial, food, and fuel crises. The class will incorporate visits to sites in Ghana and discussions with NGOs and other organizations involved in various efforts to enhan...\n\n      more description for PADM-GP 2250 »\n\n      \n\n\n\nThis course explores the political and economic policy issues surrounding hunger and food security, drawing on many case examples and using Ghana as a case study. The course will provide an overview of some of the core dimensions of global hunger and food security policy issues, including debates over a new green revolution, food aid, fair trade, the impact of expanded biofuels production and the impact of the inter-related financial, food, and fuel crises. The class will incorporate visits to sites in Ghana and discussions with NGOs and other organizations involved in various efforts to enhance food security.\n\n      less description for PADM-GP 2250 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2252",
            "course_name": "Environmental Policy,Sustainable Development & the Eco of Climate Change",
            "description": "PADM-GP 2252 Environmental Policy,Sustainable Development & the Eco of Climate Change",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2310",
            "course_name": "Understanding Social Entrepreneurship",
            "description": "PADM-GP 2310 Understanding Social Entrepreneurship",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2407",
            "course_name": "",
            "description": "PADM-GP 2407\n\n   Advocacy Lab\n\nThe new and retooled Advocacy Lab is for those who could imagine working in national or local advocacy organizations that make change happen or anyone who wants to understand the art of issue advocacy as a theory and method of social change. An advocacy campaign attempts to impact public policy, most often through changes in regulations and/or legislation. There are a wide range of roles campaign workers can play from research and policy analysis to education, public relations and organizing constituencies to reaching out to a wide range of influential, legislators and other government officia...\n\n      more description for PADM-GP 2407 »\n\n      \n\n\n\nThe new and retooled Advocacy Lab is for those who could imagine working in national or local advocacy organizations that make change happen or anyone who wants to understand the art of issue advocacy as a theory and method of social change. An advocacy campaign attempts to impact public policy, most often through changes in regulations and/or legislation. There are a wide range of roles campaign workers can play from research and policy analysis to education, public relations and organizing constituencies to reaching out to a wide range of influential, legislators and other government officials. At the same time, the skills of public advocacy– listening, finding areas of consensus and building on that consensus, finding ways to make change happen – are skills that can be applied to all professional and life settings.\nThe advocacy campaign for our class will support the development and launch of JustLeadershipUSA, a new and unique national nonpartisan leadership and advocacy organization with a clear and deliberately ambitious long-term goal: to reduce the number of people in prison by half by the year 2030.  The organization believes strongly in the principles of united purpose, united voice and the united power of the people and communities impacted by crime and the criminal justice system to drive, amplify and sustain criminal justice policy reform efforts. To help achieve that audacious vision, JustLeadershipUSA plans to 1.Develop and support formerly incarcerated leaders, 2.Reshape public opinion, and 3.Engage in policy advocacy efforts on the federal, state and local levels.  To support the development of the organization, the class will engage in 1. Coalition, Membership and Partner Building Research, 2. Environmental Scans of existing Advocacy Campaigns, 3. Digital Media Strategy Research, and 4. Development Research.\n\nThe course will begin with intensive training – approximately 14 hours in the first two weeks – so that you can jump directly into launching an advocacy campaign with JustLeadershipUSA. The class will then meet periodically over the semester to check-in and meet with the JustLeadershipUSA team and key leaders and thinkers in the criminal justice reform world as well as with prosecutors, judges and political leaders.  The course will provide an overview of and training in how to affect public policy through advocacy campaigns, legislative lobbying, issue branding, coalition building and community organizing in the United States. This includes exploring the different forms of policy issue advocacy and identifying its value base; exploring the strategies, tactics and activities of organizing and running such campaigns; and thinking about marketing, language and evaluation. This is not simulation, but the real thing.\nThe goal of Advocacy Lab is to gain hands-on experience in taking on a social justice issue and make change happen. \nPrerequisites:  None\n\n      less description for PADM-GP 2407 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2411",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5099",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "BOBS LL150"
                }
            ],
            "course_name": "Pol Formation:",
            "description": "PADM-GP 2411 Pol Formation: \nThis course addresses the dual issues of the nature of the policy-making process and the role of analytic activity in that process. It identifies hypotheses about the conditions under which analysis is most and least likely to have an impact on policy outcomes and the kinds of analysis that are most appropriately prepared for different types of political circumstances. Students use case studies of important federal, state, and local decisions to examine the validity of hypotheses presented by political scientists and to develop their own judgment about how to best apply analytic resources.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2413",
            "course_name": "",
            "description": "PADM-GP 2413\n\n   Philanthropy and Public Policy\n\nThe manner in which the U.S. tax laws encourage charitable giving has had a significant impact on civil society and social welfare. This course aims to introduce students to the critical role played by U.S. foundations on public policy issues and in American society generally. It will review the history of charitable giving in the U.S., with particular emphasis on the foundations emerging in the first half of the 20th century from the great American fortunes (Carnegie, Rockefeller, Ford) and those coming to prominence around the turn of the last century (Gates, Soros). The role of conservative...\n\n      more description for PADM-GP 2413 »\n\n      \n\n\n\nThe manner in which the U.S. tax laws encourage charitable giving has had a significant impact on civil society and social welfare. This course aims to introduce students to the critical role played by U.S. foundations on public policy issues and in American society generally. It will review the history of charitable giving in the U.S., with particular emphasis on the foundations emerging in the first half of the 20th century from the great American fortunes (Carnegie, Rockefeller, Ford) and those coming to prominence around the turn of the last century (Gates, Soros). The role of conservative foundations in laying an intellectual and policy framework for the Reagan and Bush presidencies and the Giuliani mayoralty in New York will also be examined. Several classes will feature guest lecturers from leading foundations and nonprofit organizations.\n\n      less description for PADM-GP 2413 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2414",
            "course_name": "Public Policy for Metropolitan Regions",
            "description": "PADM-GP 2414 Public Policy for Metropolitan Regions \nThis course will explore how public policies, economic trends and technological change influence the development of metropolitan regions. Key topics include immigration and demographic patterns, the spatial impact of information and telecommunications technologies, metropolitan planning and regional governments; cultural innovation and creative cities, biotechnology and economic development, air transportation and high speed rail, policies for the growth of cities and large urban regions.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2425",
            "course_name": "Government 3.0: Solving Public Problems with Technology",
            "description": "PADM-GP 2425 Government 3.0: Solving Public Problems with Technology",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2430",
            "course_name": "",
            "description": "PADM-GP 2430\n\n   Multi-Sector Partnerships:  A comparative Perspective\n\nAny resolution of today's complex social problems must incorporate the perspectives of both the public and private sectors. Yet distinct assumptions, work styles, and disciplinary backgrounds of actors in each domain make collaborative work difficult, particularly when leaders do not have the skills and competencies to connect in ways that bridge the gap. Incorporating literature, cases, guest speakers and problem-based learning exercises, the course offers a structure for sustained cycles of dialogue around examples of formal collaborations between the public, nonprofit and private sectors fr...\n\n      more description for PADM-GP 2430 »\n\n      \n\n\n\nAny resolution of today's complex social problems must incorporate the perspectives of both the public and private sectors. Yet distinct assumptions, work styles, and disciplinary backgrounds of actors in each domain make collaborative work difficult, particularly when leaders do not have the skills and competencies to connect in ways that bridge the gap. Incorporating literature, cases, guest speakers and problem-based learning exercises, the course offers a structure for sustained cycles of dialogue around examples of formal collaborations between the public, nonprofit and private sectors from several countries around the world. The course encourages students to consider the assumptions of stakeholders from each sector, to clarify and challenge their own assumptions and to explore the opportunities and challenges associated with cross-sector collaboration through the lens of evidence-based knowledge of this phenomenon.\n\n      less description for PADM-GP 2430 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2435",
            "course_name": "Responsible Governance",
            "description": "PADM-GP 2435 Responsible Governance \nResponsibility in implementing public policies is the purpose of public management in a democratic society.  This course provides an analytic lens for understanding the rules, norms, processes and practices that incorporate values into administrative decisions.  We use both normative and positive theoretical arguments to understand how responsible action combines accountability with discretionary action.  To bring theory to bear on practice, we evaluate difficult cases—historical and contemporary, domestic and international—in light of these arguments.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2441",
            "course_name": "",
            "description": "PADM-GP 2441\n\n   The Economics of Education Policy and Finance\n\nReforming education policy and finance are at the center of intense debates at all levels of government, driven in part by the recognition of the central role that education plays in the economy.  Education affects the productivity of the labor force, the distribution of income, economic growth, and the individual's earnings and quality of life.  This course uses economic principles to analyze K-12 and higher education.  The course begins with an examination of the demand for education, both by the private sector (particularly individuals) and the public sector.  Next, we consider the supply a...\n\n      more description for PADM-GP 2441 »\n\n      \n\n\n\nReforming education policy and finance are at the center of intense debates at all levels of government, driven in part by the recognition of the central role that education plays in the economy.  Education affects the productivity of the labor force, the distribution of income, economic growth, and the individual's earnings and quality of life.  This course uses economic principles to analyze K-12 and higher education.  The course begins with an examination of the demand for education, both by the private sector (particularly individuals) and the public sector.  Next, we consider the supply and financing of education.  Finally, we bring these together to discuss the market for education in the United States and current issues.  While the focus of the course will be on K-12 education in the U.S., some attention will be paid to higher education and international issues.\n\n      less description for PADM-GP 2441 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2443",
            "course_name": "Financing Urban Government",
            "description": "PADM-GP 2443 Financing Urban Government \nIdentical to G31.2302.\n\nThe special character of public finance in complexly interrelated metropolitan communities operating with fragmented and multilayered governmental structures. The intergovernmental fiscal system and its functioning in urban areas. Taxes and charges as means of financing urban public services.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2444",
            "course_name": "",
            "description": "PADM-GP 2444\n\n   LGBT Issues in Public Policy\n\nThe movement for equality for lesbian, gay, bisexual and transgender (LGBT) people is one of the most successful in recent history. In the U.S., even though inequality and prejudice persist, significant policy advances have occurred. These include the repeal of Don’t Ask, Don’t Tell, the adoption of transgender nondiscrimination laws in 18 states, the extension of marriage equality in 19 states and active litigation in the other 31, and support for same-sex marriage by President Obama and the Democratic Party. Many other changes have occurred that improve treatment of LGBT people by Immigratio...\n\n      more description for PADM-GP 2444 »\n\n      \n\n\n\nThe movement for equality for lesbian, gay, bisexual and transgender (LGBT) people is one of the most successful in recent history. In the U.S., even though inequality and prejudice persist, significant policy advances have occurred. These include the repeal of Don’t Ask, Don’t Tell, the adoption of transgender nondiscrimination laws in 18 states, the extension of marriage equality in 19 states and active litigation in the other 31, and support for same-sex marriage by President Obama and the Democratic Party. Many other changes have occurred that improve treatment of LGBT people by Immigration and Customs Enforcement, Veterans Affairs, Social Security, and elder services. This graduate level course will examine the incredible successes of LGBT rights activism in the U.S. and globally, and the treatment of LGBT people in several policy areas, with an in-depth focus on several issues that afford a broad overview of domestic and global LGBT policy. These are: health policy and HIV prevention and care; elder issues; youth and education policy; criminal justice issues, including best practices for safely managing LGBT prisoners and juvenile offenders and reducing victimization; family recognition and the policy implications of race and gender differences among same-sex couple households; and LGBT rights struggles in the former Soviet bloc, Africa, and elsewhere.\n\n      less description for PADM-GP 2444 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2445",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "20472",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 369",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Wilson, Natasha"
                }
            ],
            "course_name": "Poverty, Inequality, and Policy",
            "description": "PADM-GP 2445 Poverty, Inequality, and Policy \nA systematic examination of the nature of poverty in the United States, its extent, causes, and consequences. Emphasis is placed on urban poverty and an evaluation of existing antipoverty programs, including the issues of administration and control.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2446",
            "course_name": "",
            "description": "PADM-GP 2446\n\n   Public Policy and the Arts\n\nThe United States has a highly developed arts and culture sector that operates primarily as a private sector enterprise despite (or, some would say, because of) the lack of a formal cultural policy that is a fundamental part of most governments. Rather than policy, the uniquely American cultural ?system? is facilitated by various policies conceived for the most part for other public purposes.  This course will serve as an introduction to these policies and the emergence of a cultural policy framework for understanding the arts and their increasing importance across policy fields in a post-indu...\n\n      more description for PADM-GP 2446 »\n\n      \n\n\n\nThe United States has a highly developed arts and culture sector that operates primarily as a private sector enterprise despite (or, some would say, because of) the lack of a formal cultural policy that is a fundamental part of most governments. Rather than policy, the uniquely American cultural ?system? is facilitated by various policies conceived for the most part for other public purposes.  This course will serve as an introduction to these policies and the emergence of a cultural policy framework for understanding the arts and their increasing importance across policy fields in a post-industrial world of rapid technological, social, political, and economic change. While the course will focus on non profit issues, the arts and culture sector is broadly defined and inclusive of relevant for-profit arts activity. Class meetings will include guest lectures.\n\n      less description for PADM-GP 2446 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2447",
            "course_name": "",
            "description": "PADM-GP 2447\n\n   Majorities, Minorities & Group Identities in America: Status, Rights & Public Policy\n\nThe position of minorities in the United States, an immigrant nation since its inception, remains a volatile topic of debate that touches the core of American identity. While we will review the history of minorities in America, we will focus on their status within the cultural and political framework and examine the ways that how we understand rights as either individually or communally derived informs policy decisions and shapes minority institutions. We will seek to define what \"minority\" status entails by studying how ethnicity, race, gender and religious identity, and cultural expression p...\n\n      more description for PADM-GP 2447 »\n\n      \n\n\n\nThe position of minorities in the United States, an immigrant nation since its inception, remains a volatile topic of debate that touches the core of American identity. While we will review the history of minorities in America, we will focus on their status within the cultural and political framework and examine the ways that how we understand rights as either individually or communally derived informs policy decisions and shapes minority institutions. We will seek to define what \"minority\" status entails by studying how ethnicity, race, gender and religious identity, and cultural expression play out in the political sphere. Attention will then shift to minority community building - how public policies and leaders nurture or undermine minority identity, establish and sustain institutions, and create sustainable minority communities.\n\n      less description for PADM-GP 2447 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2466",
            "course_name": "",
            "description": "PADM-GP 2466\n\n   Environmental Policy\n\nThis course is an introduction to major environmental policy issues and examines the role of government in the control of environmental exposures. An important focus of the course is an assessment of the role of policy analysis in the formation and implementation of national and local environmental policy. The course covers the legal basis for environmental action from the beginnings of The Clean Air Act, The Wilderness Act, the National Environmental Policy Act, Endangered Species Act to international treaties. The sources of pollution and threats to environmental integrity are scrutinized in...\n\n      more description for PADM-GP 2466 »\n\n      \n\n\n\nThis course is an introduction to major environmental policy issues and examines the role of government in the control of environmental exposures. An important focus of the course is an assessment of the role of policy analysis in the formation and implementation of national and local environmental policy. The course covers the legal basis for environmental action from the beginnings of The Clean Air Act, The Wilderness Act, the National Environmental Policy Act, Endangered Species Act to international treaties. The sources of pollution and threats to environmental integrity are scrutinized in detail. Consequences of pollution on the environment and health are considered. Potential policy alternatives for solutions are discussed. Importantly, the health studies including epidemiology, human exposures, animal models, and in vitro cell studies are reviewed. Science-based environmental regulation versus cost-benefit scenarios and advocacy by regulated industry and public health organizations are highlighted. The course covers air pollution, global warming and land use with an emphasis on wilderness protection. \n\n      less description for PADM-GP 2466 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2472",
            "course_name": "Environmental Economics",
            "description": "PADM-GP 2472 Environmental Economics",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2486",
            "course_name": "",
            "description": "PADM-GP 2486\n\n   Law for the Education Policymaker\n\nThis course aims to provide an understanding of law and how it shapes and influences practices in K-12 public schools. This course covers seminal education case law (i.e. judicial opinion), legislation, and regulation from the U.S. Supreme Court decision of Brown v. Board of Education to key pieces of legislation such as The Elementary and Secondary Education Act (Title I), the Individuals with Disabilities with Education Act, and The No Child Left Behind Act, to major federal agency initiatives such as Race to the Top as we explore the ever-shifting education and legal landscapes that impact ...\n\n      more description for PADM-GP 2486 »\n\n      \n\n\n\nThis course aims to provide an understanding of law and how it shapes and influences practices in K-12 public schools. This course covers seminal education case law (i.e. judicial opinion), legislation, and regulation from the U.S. Supreme Court decision of Brown v. Board of Education to key pieces of legislation such as The Elementary and Secondary Education Act (Title I), the Individuals with Disabilities with Education Act, and The No Child Left Behind Act, to major federal agency initiatives such as Race to the Top as we explore the ever-shifting education and legal landscapes that impact our nation’s students. Course participants will gain practical skills that help them understand how major educational policy has been expressed through statutory, regulatory, and case law. We will also explore law and regulatory policy through case study analysis with various federal and state agencies (e.g., U.S. Department of Education, NYC Department of Education), and seminar participants will learn how to access case law, statutory law, and federal and state regulations using legal databases such as LexisNexis, Westlaw, and the Legal Information Institute.\n\n      less description for PADM-GP 2486 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 2700",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17329",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17329",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17331",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "BOBS LL138"
                },
                {
                    "format": "Lecture",
                    "class_id": "17332",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "194M 204"
                },
                {
                    "format": "Lecture",
                    "class_id": "17336",
                    "section": "004",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": null,
                    "time": "Sat 9.00 AM - 10.40 AM",
                    "open": true,
                    "professor": "BOBS LL149"
                },
                {
                    "format": "Lecture",
                    "class_id": "17350",
                    "section": "005",
                    "period": "09/12/2015 - 09/12/2015",
                    "location": null,
                    "time": "Sat 2.20 PM - 6.00 PM",
                    "open": true,
                    "professor": "BOBS LL13809/26/2015 - 09/26/2015 Sat 2.20 PM - 6.00 PM at SILV 20810/10/2015 - 10/10/2015 Sat 2.20 PM - 6.00 PM at SILV 20810/24/2015 - 10/24/2015 Sat 2.20 PM - 6.00 PM at SILV 20811/07/2015 - 11/07/2015 Sat 2.20 PM - 6.00 PM at SILV 20811/21/2015 - 11/21/2015 Sat 2.20 PM - 6.00 PM at SILV 20812/05/2015 - 12/05/2015 Sat 2.20 PM - 6.00 PM at SILV 208"
                }
            ],
            "course_name": "Topics in Public Policy and Management",
            "description": "PADM-GP 2700 Topics in Public Policy and Management",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2875",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5109",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 261",
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Blustein, Janice"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 2875\n\n   Estimating Impact in Policy Research\n\nThis advanced course develops a set of analytic skills that are used by some policy analysts. It focuses on impact analysis. The goals of the course are to (a) extend familiarity with methodologic issues, including various study designs, measurement problems, and analytic approaches; (b) provide hands-on experience in management, analysis, and presentation of data; and (c) develop skills in reading, critiquing, and reporting on policy-relevant impact analyses written by others. The emphasis of the course is on learning by doing, through data analysis, data presentation, and study critiquing ac...\n\n      more description for PADM-GP 2875 »\n\n      \n\n\n\nThis advanced course develops a set of analytic skills that are used by some policy analysts. It focuses on impact analysis. The goals of the course are to (a) extend familiarity with methodologic issues, including various study designs, measurement problems, and analytic approaches; (b) provide hands-on experience in management, analysis, and presentation of data; and (c) develop skills in reading, critiquing, and reporting on policy-relevant impact analyses written by others. The emphasis of the course is on learning by doing, through data analysis, data presentation, and study critiquing activities. Students work on developing the ability to convey findings in text and table format.\n\n      less description for PADM-GP 2875 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 2902",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5111",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "GCASL 369"
                },
                {
                    "format": "Lecture",
                    "class_id": "5112",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 11.00 AM - 12.40 PM",
                    "open": true,
                    "professor": "SILV 414"
                }
            ],
            "course_name": "Multiple Regression and Introduction to Econometrics",
            "description": "PADM-GP 2902 Multiple Regression and Introduction to Econometrics \nMultiple regression analysis applied to problems of policy and finance analysts, managers and planners. Develops OLS regression estimators and student's ability to interpret results of studies that use multiple regression. Introduces fixed effects and some ideas from econometrics. Requires use of computers to estimate multiple regression equations.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4101",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5151",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "12WV L120",
                    "time": "Wed 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Zerkin, Allen"
                },
                {
                    "format": "Lecture",
                    "class_id": "5183",
                    "section": "002",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "25W4 C-2",
                    "time": "Wed 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Zerkin, Allen"
                },
                {
                    "format": "Lecture",
                    "class_id": "17513",
                    "section": "003",
                    "period": "10/24/2015 - 12/05/2015",
                    "location": "BOBS LL149",
                    "time": "Sat 9.00 AM - 10.40 AM",
                    "open": true,
                    "professor": "Zerkin, Allen"
                }
            ],
            "course_name": "Conflict Management and Negotiation",
            "description": "PADM-GP 4101 Conflict Management and Negotiation \nThrough readings, discussions, case studies, and role plays, students develop an understanding of the role of conflict and its dynamics; strategies for eliciting cooperation; the fundamentals of negotiation; the variety of conflict resolution approaches used to overcome the common barriers to negotiated resolution of conflict; communication skills; and strategies for dealing with public controversy. This course emphasizes both the theoretical and the practical. Students are encouraged to apply the principles and methods of effective conflict resolution to their own professional lives.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4105",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5239",
                    "section": "001",
                    "period": "10/23/2015 - 12/11/2015",
                    "location": "25W4 C-2 with Zerkin, Allen10/23/2015 - 10/23/2015 Fri 11.00 AM - 12.40 PM at 7E12 LL21 with Zerkin, Allen10/30/2015 - 10/30/2015 Fri 11.00 AM - 12.40 PM at 7E12 LL21",
                    "time": "Fri 9.20 AM - 11.00 AM",
                    "open": true,
                    "professor": "Zerkin, Allen"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 4105\n\n   Cross-Cult Negotiations\n\nBeyond the basics of negotiation lie areas of greater complexity.  One such area is the realm of culture, encompassing the cross-cultural (attempting from one cultural perspective to understand or describe another), the intercultural (the interplay of cultures) and the transcultural (aspects of negotiation that are common to all cultures or, in intercultural situations, transcend them).  Culture can be thought of in terms of both the relatively simple, though not unimportant, aspect of etiquette and behavior, and the more complex and profound aspect of consciousness and worldview.  In the firs...\n\n      more description for PADM-GP 4105 »\n\n      \n\n\n\nBeyond the basics of negotiation lie areas of greater complexity.  One such area is the realm of culture, encompassing the cross-cultural (attempting from one cultural perspective to understand or describe another), the intercultural (the interplay of cultures) and the transcultural (aspects of negotiation that are common to all cultures or, in intercultural situations, transcend them).  Culture can be thought of in terms of both the relatively simple, though not unimportant, aspect of etiquette and behavior, and the more complex and profound aspect of consciousness and worldview.  In the first segment of the course, we will consider a framework of cultural variables that comprise or underlie negotiation styles; and then, by way of looking at one culture in particular in greater depth, contrast four efforts to understand Chinese negotiation practices; and, finally, look at implications for the practitioner. \n\n      less description for PADM-GP 4105 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4108",
            "course_name": "",
            "description": "PADM-GP 4108\n\n   Advanced Negotiation and Mediation Skills for Managers\n\nThrough readings, discussions, case studies, and simulations, students further develop the negotiation skills (in situations of greater complexity in terms of issues and parties) and the facilitative and meditative skills needed by today?s consensus-building manager. The course also examines strategies for managing and utilizing conflict in organizations and the design of systems for handling an institution?s routine internal and external disputes. Students participate in a team project focused on designing such a system for a hypothetical organization. Students are encouraged to apply the pri...\n\n      more description for PADM-GP 4108 »\n\n      \n\n\n\nThrough readings, discussions, case studies, and simulations, students further develop the negotiation skills (in situations of greater complexity in terms of issues and parties) and the facilitative and meditative skills needed by today?s consensus-building manager. The course also examines strategies for managing and utilizing conflict in organizations and the design of systems for handling an institution?s routine internal and external disputes. Students participate in a team project focused on designing such a system for a hypothetical organization. Students are encouraged to apply the principles and methods of effective conflict resolution to their own professional lives.\n\n      less description for PADM-GP 4108 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4110",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5145",
                    "section": "001",
                    "period": "10/09/2015 - 10/09/2015",
                    "location": "GCASL 279",
                    "time": "Fri 9.00 AM - 5.00 PM",
                    "open": true,
                    "professor": "Carlin, William10/23/2015 - 10/23/2015 Fri 9.00 AM - 5.00 PM at GCASL 279"
                },
                {
                    "format": "Lecture",
                    "class_id": "17334",
                    "section": "002",
                    "period": "09/12/2015 - 09/12/2015",
                    "location": "BOBS LL150 with Work, Robertson09/26/2015 - 09/26/2015 Sat 10.55 AM - 12.35 PM at BOBS LL150 with Work, Robertson10/10/2015 - 10/10/2015 Sat 10.55 AM - 12.35 PM at BOBS LL150 with Work, Robertson10/24/2015 - 10/24/2015 Sat 10.55 AM - 12.35 PM at BOBS LL150 with Work, Robertson11/07/2015 - 11/07/2015 Sat 10.55 AM - 12.35 PM at BOBS LL150 with Work, Robertson11/21/2015 - 11/21/2015 Sat 10.55 AM - 12.35 PM at BOBS LL150 with Work, Robertson12/05/2015 - 12/05/2015 Sat 10.55 AM - 12.35 PM at BOBS LL150",
                    "time": "Sat 10.55 AM - 12.35 PM",
                    "open": true,
                    "professor": "Work, Robertson"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 4110\n\n   Project Management\n\nIn public service organizations, the pace and demands of the work often seem to inhibit project planning, leading to projects that manage people instead of people who manage projects. This course offers an introduction to the basic concepts and methods of project management, focusing principally on planning and control elements with some attention to requisite skills in problem solving and interpersonal relations. Topics include basic elements of project management, the project life cycle, time management, and special techniques for project planning and implementation. This course is appropria...\n\n      more description for PADM-GP 4110 »\n\n      \n\n\n\nIn public service organizations, the pace and demands of the work often seem to inhibit project planning, leading to projects that manage people instead of people who manage projects. This course offers an introduction to the basic concepts and methods of project management, focusing principally on planning and control elements with some attention to requisite skills in problem solving and interpersonal relations. Topics include basic elements of project management, the project life cycle, time management, and special techniques for project planning and implementation. This course is appropriate for professionals who have found themselves overwhelmed by the multiple demands of their jobs and are interested in learning techniques and tools for more effective project management.\n\n      less description for PADM-GP 4110 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4111",
            "course_name": "Managing Service Delivery",
            "description": "PADM-GP 4111 Managing Service Delivery",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4112",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5146",
                    "section": "001",
                    "period": "09/25/2015 - 10/02/2015",
                    "location": "GCASL 379",
                    "time": "Fri 9.00 AM - 5.00 PM",
                    "open": true,
                    "professor": "Wagenberg, Charlotte"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 4112\n\n   Building Effective Teams\n\nIn order to utilize teams with the desired result, attention must be paid to how and why teams are assembled, launched, managed and rewarded. This course is also designed to prepare students for their Capstone project teams. \u2028\u2028This two-day course provides the fundamental principles and methods required to create high performing work, project, Capstone, and/or problem-solving teams. Topics covered will include: moving from group to team; stages of team development; identifying the key competencies for successful team functioning; critical roles and responsibilities on a team; ensuring team prod...\n\n      more description for PADM-GP 4112 »\n\n      \n\n\n\nIn order to utilize teams with the desired result, attention must be paid to how and why teams are assembled, launched, managed and rewarded. This course is also designed to prepare students for their Capstone project teams. \u2028\u2028This two-day course provides the fundamental principles and methods required to create high performing work, project, Capstone, and/or problem-solving teams. Topics covered will include: moving from group to team; stages of team development; identifying the key competencies for successful team functioning; critical roles and responsibilities on a team; ensuring team productivity; and troubleshooting common team problems. Particular attention will be paid to the critical success factors of Capstone teams - a unique type of team that has its own special challenges.\n\nNOTE: In order to apply course concepts immediately, students form teams to complete the final assignment which is due 2-3 weeks after the course ends.\n\n      less description for PADM-GP 4112 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4113",
            "course_name": "Evidence-Based Management",
            "description": "PADM-GP 4113 Evidence-Based Management",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4114",
            "course_name": "",
            "description": "PADM-GP 4114\n\n   Surveys and Interviews\n\nThis intensive laboratory in survey research is designed to meet the practical needs of professionals working in a variety of research settings. It offers an up-to-date overview of the technical issues involved in interviewing and conducting surveys. It covers a wide range of practical techniques involved in designing interviews and questionnaires. In this hands-on class, participants design and carry out mail and telephone surveys; conduct a series of interviews and learn how to draw an appropriate sample; design a questionnaire; prepare data for analysis (including coding, handling of missin...\n\n      more description for PADM-GP 4114 »\n\n      \n\n\n\nThis intensive laboratory in survey research is designed to meet the practical needs of professionals working in a variety of research settings. It offers an up-to-date overview of the technical issues involved in interviewing and conducting surveys. It covers a wide range of practical techniques involved in designing interviews and questionnaires. In this hands-on class, participants design and carry out mail and telephone surveys; conduct a series of interviews and learn how to draw an appropriate sample; design a questionnaire; prepare data for analysis (including coding, handling of missing data, and documentation); process and analyze data using a statistical package; and write reports of the results.\n\n      less description for PADM-GP 4114 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4115",
            "course_name": "",
            "description": "PADM-GP 4115\n\n   Contracts: What the Non-Lawyer Should Know\n\nThis is a course in Contracts for the non-lawyer.  Every day we see contracts and may have to read them, sign them and/or perform them.  Many organizations are not large enough to have their own in-house counsel and calling outside counsel is expensive.  Thus, more and more executives and their staff have the responsibility of understanding the day to day contracts with which they come in contact.  The course will cover specific contracts related to the type of work many Wagner students may do, such as grant agreements, agreements with fundraisers (consultants), commercial co-venture agreement...\n\n      more description for PADM-GP 4115 »\n\n      \n\n\n\nThis is a course in Contracts for the non-lawyer.  Every day we see contracts and may have to read them, sign them and/or perform them.  Many organizations are not large enough to have their own in-house counsel and calling outside counsel is expensive.  Thus, more and more executives and their staff have the responsibility of understanding the day to day contracts with which they come in contact.  The course will cover specific contracts related to the type of work many Wagner students may do, such as grant agreements, agreements with fundraisers (consultants), commercial co-venture agreements, and grants to foreign charities that involve contracts with foreign entities.\n\n      less description for PADM-GP 4115 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4116",
            "course_name": "",
            "description": "PADM-GP 4116\n\n   Participatory Policymak\n\nThere is a growing awareness that the historical and contemporary knowledge produced by public service disciplines often fails to meet the needs of communities of color. As groups of color have become the majority in many cities, the need to reduce this gap in knowledge has increased in importance. This course bridges information developed in the academic and policy journals and books with the perspectives and recommended literature and experiences on nonprofit leaders in New York City?s Asian, black, Latino, and Native American communities. The course provides a theoretical framework for inco...\n\n      more description for PADM-GP 4116 »\n\n      \n\n\n\nThere is a growing awareness that the historical and contemporary knowledge produced by public service disciplines often fails to meet the needs of communities of color. As groups of color have become the majority in many cities, the need to reduce this gap in knowledge has increased in importance. This course bridges information developed in the academic and policy journals and books with the perspectives and recommended literature and experiences on nonprofit leaders in New York City?s Asian, black, Latino, and Native American communities. The course provides a theoretical framework for incorporating contemporary public sector practices, focusing specifically on three areas: environment, education, and welfare reform. In each of the areas, academic/policy analysts and nonprofit leaders from communities of color discuss the problems of producing knowledge and strategies for closing the gap.\n\n      less description for PADM-GP 4116 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4117",
            "course_name": "",
            "description": "PADM-GP 4117\n\n   Information Systems\n\nThe management of information in human service, criminal justice and public health interventions is fraught with complexity because of the diverse perspectives of stakeholder groups including clients, front-line workers and supervisors, measurers of performance and evaluators, executive leadership, funding agencies and software developers. This course will prepare students to understand and constructively mediate these challenges. Students will adopt a systems stance to critique different ways of construing the boundaries and nature of the service environment. The course critically examines co...\n\n      more description for PADM-GP 4117 »\n\n      \n\n\n\nThe management of information in human service, criminal justice and public health interventions is fraught with complexity because of the diverse perspectives of stakeholder groups including clients, front-line workers and supervisors, measurers of performance and evaluators, executive leadership, funding agencies and software developers. This course will prepare students to understand and constructively mediate these challenges. Students will adopt a systems stance to critique different ways of construing the boundaries and nature of the service environment. The course critically examines common techniques including the system development life cycle, process modeling and logic modeling, their limitations and their practical (and unintended) consequences for decision-making about data and information systems; and it explores alternative approaches, including cybernetics, domain modeling and the ecosystems perspective, which can help organizations develop more effective, holistic and evolvable information systems.\n\n      less description for PADM-GP 4117 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4120",
            "course_name": "",
            "description": "PADM-GP 4120\n\n   Labor Management Cooperation\n\nEver-growing financial constraints have made the need for high-performing, competitively priced workforces an increasing priority for the public, private, and nonprofit sectors. Cooperative relations between labor and management teams are a key element of workplace productivity. This course emphasizes the need to promote cooperative relations between labor and management as a problem-solving approach to organizational effectiveness. Both laEver-growing financial constraints have made the need for high-performing, competitively priced workforces an increasing priority for the public, private, a...\n\n      more description for PADM-GP 4120 »\n\n      \n\n\n\nEver-growing financial constraints have made the need for high-performing, competitively priced workforces an increasing priority for the public, private, and nonprofit sectors. Cooperative relations between labor and management teams are a key element of workplace productivity. This course emphasizes the need to promote cooperative relations between labor and management as a problem-solving approach to organizational effectiveness. Both laEver-growing financial constraints have made the need for high-performing, competitively priced workforces an increasing priority for the public, private, and nonprofit sectors. Cooperative relations between labor and management teams are a key element of workplace productivity. This course emphasizes the need to promote cooperative relations between labor and management as a problem-solving approach to organizational effectiveness. Both labor and management perspectives on the trend are included. The emphasis is on discussing practical applications to develop cooperative relationships in public service organizations. This course is appropriate for professionals at all levels who seek to improve the relationships among staff and the organization's productivity.\n\n      less description for PADM-GP 4120 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4121",
            "course_name": "Government Financial Condition Analysis",
            "description": "PADM-GP 4121 Government Financial Condition Analysis \nThis course covers the theories and analytical methods for performing financial condition analysis of state and local governments.  Topics include the analysis of regional economies, revenues, expenditures, debt, pension, and internal resources.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4122",
            "course_name": "",
            "description": "PADM-GP 4122\n\n   Cost Effectiveness in  Nonprofits & the Public Sector\n\nThis is a course in applied cost-effectiveness analysis (CEA). Other similar types of analyses, like cost-benefit, resource-effectiveness, and so forth, are also discussed and contrasted to CEA. The principal focus of the course is on CEA design, implementation, and reporting/presenting. Students are expected to have an understanding of public sector policy and basic public sector economic principles. Students learn to plan all major elements of a CEA study, describe the differences among types of studies, and decide which type of analysis (or particular type of CEA) is appropriate for a given...\n\n      more description for PADM-GP 4122 »\n\n      \n\n\n\nThis is a course in applied cost-effectiveness analysis (CEA). Other similar types of analyses, like cost-benefit, resource-effectiveness, and so forth, are also discussed and contrasted to CEA. The principal focus of the course is on CEA design, implementation, and reporting/presenting. Students are expected to have an understanding of public sector policy and basic public sector economic principles. Students learn to plan all major elements of a CEA study, describe the differences among types of studies, and decide which type of analysis (or particular type of CEA) is appropriate for a given problem or decision.\n\n      less description for PADM-GP 4122 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4128",
            "course_name": "",
            "description": "PADM-GP 4128\n\n   Financial Statement Analysis for Health Care, Higher Ed, and Nonprofit Orgs\n\nThe recently increased scrutiny in the marketplace of financial accounting and presentation practices of all companies (not-for-profit included) has increased the importance for managers and finance professionals to develop the necessary skill-set required to analyze these statements and get beneath the numbers.The primary objective of this course is to familiarize students with financial statements(audited and unaudited) and to increase comfort and facility in the analysis of the quantitative and qualitative data found in these statements. An additional key objective is to expand on the funda...\n\n      more description for PADM-GP 4128 »\n\n      \n\n\n\nThe recently increased scrutiny in the marketplace of financial accounting and presentation practices of all companies (not-for-profit included) has increased the importance for managers and finance professionals to develop the necessary skill-set required to analyze these statements and get beneath the numbers.The primary objective of this course is to familiarize students with financial statements(audited and unaudited) and to increase comfort and facility in the analysis of the quantitative and qualitative data found in these statements. An additional key objective is to expand on the fundamentals learned in P11.1021 using an applied framework approach, by introducing students to various forms of financial statement analysis techniques utilized by finance professionals. A third objective is to enhance students' written and oral presentation skills of financial concepts.\n\n      less description for PADM-GP 4128 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4130",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5147",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "GCASL 383",
                    "time": "Thu 8.35 PM - 10.15 PM",
                    "open": true,
                    "professor": "Presser, Stewart"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 4130\n\n   Fundamentals of Accounting\n\nThe purpose of this course is to provide participants with essential skills of financial accounting. This course delves into many of the specific techniques related to generating financial information. Topics include debits and credits, the recording process (including double entry accounting, T-accounts, journal entries, adjusting entries, closing entries, and financial statement preparation), accounts receivable (including allowances for bad debts and aging schedules), inventory (including LIFO/FIFO, periodic versus perpetual, and lower of cost or market), and depreciation methods. This cour...\n\n      more description for PADM-GP 4130 »\n\n      \n\n\n\nThe purpose of this course is to provide participants with essential skills of financial accounting. This course delves into many of the specific techniques related to generating financial information. Topics include debits and credits, the recording process (including double entry accounting, T-accounts, journal entries, adjusting entries, closing entries, and financial statement preparation), accounts receivable (including allowances for bad debts and aging schedules), inventory (including LIFO/FIFO, periodic versus perpetual, and lower of cost or market), and depreciation methods. This course is designed for people who need to understand the details of financial accounting and is not appropriate for people seeking to understand the broader issues of financial management.\n\n      less description for PADM-GP 4130 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4131",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5148",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "GCASL 261",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Calderon, Sarah"
                }
            ],
            "course_name": "Fundamentals/Fundraising",
            "description": "PADM-GP 4131 Fundamentals/Fundraising \nStudents will have an opportunity to learn about fundraising, as well as philanthropy more broadly. This introductory course will examine the range of ways to raise funds from government, individuals, foundations and corporations. The importance of stewardship, program evaluation, and the role of the board and staff in developing effective fundraising strategies will be addressed.",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4132",
            "course_name": "",
            "description": "PADM-GP 4132\n\n   Governance of Public/Private Finance: Policy, Law & Business\n\nRecently, traditional methods of capital flow between the private and public sector have undergone tremendous change. For many years the financial and social needs of both sectors were adequately addressed by traditional debt instruments, largely bonds and notes. Starting some years ago, there began a proliferation of new entities that now account for the bulk of public indebtedness. These entities are given a variety of names: Public Authorities, Industrial Development Agencies, Economic Development Offices, Local Development Corporations, Public/Private Partnerships, and most recently and dr...\n\n      more description for PADM-GP 4132 »\n\n      \n\n\n\nRecently, traditional methods of capital flow between the private and public sector have undergone tremendous change. For many years the financial and social needs of both sectors were adequately addressed by traditional debt instruments, largely bonds and notes. Starting some years ago, there began a proliferation of new entities that now account for the bulk of public indebtedness. These entities are given a variety of names: Public Authorities, Industrial Development Agencies, Economic Development Offices, Local Development Corporations, Public/Private Partnerships, and most recently and dramatically Sovereign Wealth Funds including TARP.\n\nThese entities have sprung up without serious examination of the reasons for their creation, their governance, their policies and practices, and their consequences.\n\nThis course will examine all forms of these new entities, the law and reality of their operation, international, national and state efforts to monitor and control them, and their impacts on financial markets and government policies.\n\nIssues examined in this course include efforts by the IMF to rationalize and regulate Public/Private entities, efforts by New York State to rationalize and democratize their governance, the application of fiduciary obligation to their operations, unintended legal and financial problems, and the unresolved financial, ethical, legal, policy and political questions that remain. Cases to be studied include the financing of the new Yankee Stadium, the TARP Fund, PATH, and the Norwegian Sovereign Wealth Fund. The course will include required readings, notable guest speakers from both public and private sectors, team case studies, and a final paper.\n\n      less description for PADM-GP 4132 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4133",
            "course_name": "",
            "description": "PADM-GP 4133\n\n   Online Engagement Strategy:  Leveraging the Web and Social Media for Good\n\nNonprofit organizations use online communications strategies to engage audiences, increase visibility, shift attitudes, raise money, and create social change. This four-day intensive examines how organizations use social media, websites, email, and mobile technology to build relationships with its community. Through case studies and examples from local, national, and international organizations, students gain a broad understanding of online communications, fundraising, and advocacy in the nonprofit sector. Each student will analyze and develop a strategy for how a nonprofit organization can ma...\n\n      more description for PADM-GP 4133 »\n\n      \n\n\n\nNonprofit organizations use online communications strategies to engage audiences, increase visibility, shift attitudes, raise money, and create social change. This four-day intensive examines how organizations use social media, websites, email, and mobile technology to build relationships with its community. Through case studies and examples from local, national, and international organizations, students gain a broad understanding of online communications, fundraising, and advocacy in the nonprofit sector. Each student will analyze and develop a strategy for how a nonprofit organization can maximize online engagement to support its mission.\n\n      less description for PADM-GP 4133 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4134",
            "course_name": "",
            "description": "PADM-GP 4134\n\n   Corporate Social Responsbility\n\nCorporate Responsibility is an evolving model with more and more companies understanding its inherent value in strengthening their businesses. This course explores the trends of business awareness of customer and employee involvement, the definitions, models and metrics of strong CSR models (the triple bottom line) and shared value and the leveraging of those models amongst  corporations, nonprofits and governments. Students will learn to: understand the concepts, frameworks and consumer demands related to Corporate Social Responsibility (CSR); discuss current trends - doing well by doing good...\n\n      more description for PADM-GP 4134 »\n\n      \n\n\n\nCorporate Responsibility is an evolving model with more and more companies understanding its inherent value in strengthening their businesses. This course explores the trends of business awareness of customer and employee involvement, the definitions, models and metrics of strong CSR models (the triple bottom line) and shared value and the leveraging of those models amongst  corporations, nonprofits and governments. Students will learn to: understand the concepts, frameworks and consumer demands related to Corporate Social Responsibility (CSR); discuss current trends - doing well by doing good, diversity of stakeholders, executive focus and communications; understand the link between branding and CSR; and to apply learning to practical experience.\n\nThe course uses a multidisciplinary approach. Guest participants from corporations and nonprofits will highlight key points through practical examples.\n\n      less description for PADM-GP 4134 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4135",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5149",
                    "section": "001",
                    "period": "09/02/2015 - 10/20/2015",
                    "location": "SILV 206",
                    "time": "Tue 6.45 PM - 8.25 PM",
                    "open": true,
                    "professor": "Binney, Gayle"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 4135\n\n   Nonprofit Governance\n\nThis course is intended for graduate students interested in learning about the governance of nonprofit organizations and the role of nonprofit boards. \n\nThe role of the nonprofit board member has always been significant, but never as demanding as it is today.  With nonprofits addressing significant community needs with constricting financial resources, board members must provide both strategic leadership and responsible stewardship, with a focus on financial sustainability.  This course will examine the role of the board and will explore common questions about the roles of board members: Are b...\n\n      more description for PADM-GP 4135 »\n\n      \n\n\n\nThis course is intended for graduate students interested in learning about the governance of nonprofit organizations and the role of nonprofit boards. \n\nThe role of the nonprofit board member has always been significant, but never as demanding as it is today.  With nonprofits addressing significant community needs with constricting financial resources, board members must provide both strategic leadership and responsible stewardship, with a focus on financial sustainability.  This course will examine the role of the board and will explore common questions about the roles of board members: Are board members essentially advocates and fundraisers?  Do they direct the organization to the extent staff is unable? Or is the board’s role primarily defined by their need to resolve a crisis situation for the nonprofit organization?\n\nBy the end of this course, students will understand how nonprofits are governed and some of the current issues in nonprofit governance. Topics covered in classroom lecture, discussion and applied case studies will include the structure, functions, recruitment and composition of nonprofit boards; the relation of the board to management; the board’s role in both compliance and strategic planning; and improving board performance and accountability.\n\nAt the end of the course, learners will understand:\n1. Board structure, functions and composition.\n2. The relationship of the board to organizational/CEO performance.\n3. Fiduciary, strategic, and generative governance.\n4. Common problems and issues in non-profit governance, from both short and long term perspectives.\n5. How to assess interventions to improve board performance.\n\n      less description for PADM-GP 4135 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4137",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "5150",
                    "section": "001",
                    "period": "09/05/2015 - 09/05/2015",
                    "location": "BOBS LL150 with Trompeter, Farra09/19/2015 - 09/19/2015 Sat 10.55 AM - 12.35 PM at SILV 411 with Trompeter, Farra10/03/2015 - 10/03/2015 Sat 10.55 AM - 12.35 PM at SILV 411 with Trompeter, Farra10/17/2015 - 10/17/2015 Sat 10.55 AM - 12.35 PM at SILV 411 with Trompeter, Farra10/31/2015 - 10/31/2015 Sat 10.55 AM - 12.35 PM at SILV 411 with Trompeter, Farra11/14/2015 - 11/14/2015 Sat 10.55 AM - 12.35 PM at SILV 411 with Trompeter, Farra12/12/2015 - 12/12/2015 Sat 10.55 AM - 12.35 PM at SILV 411",
                    "time": "Sat 10.55 AM - 12.35 PM",
                    "open": true,
                    "professor": "Trompeter, Farra"
                }
            ],
            "course_name": "",
            "description": "PADM-GP 4137\n\n   Strategic Communication\n\nThis course teaches students how to communicate with the public and work with the media. The concepts and skills prepare students to generate public support for their organization's mission, strategic initiatives, and fund-raising activities. Students learn to position organizations in the public eye and translate complex concepts into clear and concise messages for public consumption. They develop skills in written and oral communication, critical thinking, and problem solving. Students learn about a range of communications vehicles and discuss ways to use those vehicles to get their messages...\n\n      more description for PADM-GP 4137 »\n\n      \n\n\n\nThis course teaches students how to communicate with the public and work with the media. The concepts and skills prepare students to generate public support for their organization's mission, strategic initiatives, and fund-raising activities. Students learn to position organizations in the public eye and translate complex concepts into clear and concise messages for public consumption. They develop skills in written and oral communication, critical thinking, and problem solving. Students learn about a range of communications vehicles and discuss ways to use those vehicles to get their messages out.\n\n      less description for PADM-GP 4137 «",
            "offering": true
        },
        {
            "course_id": "PADM-GP 4138",
            "course_name": "",
            "description": "PADM-GP 4138\n\n   Governmental Accounting\n\nThis course provides students with basic skills in accounting and financial reporting for governmental, not-for-profit, and health care organizations. The basic objectives of the course are to gain an understanding of (1) how internal control is achieved by using fund accounting and integrating budgetary accounting into financial accounting; (2) how and why accounting measurements for governmental entities differ from measurements in business, not-for-profit, and health care entities; (3) how these entities account for and report certain specific transactions; (4) the financial reporting requi...\n\n      more description for PADM-GP 4138 »\n\n      \n\n\n\nThis course provides students with basic skills in accounting and financial reporting for governmental, not-for-profit, and health care organizations. The basic objectives of the course are to gain an understanding of (1) how internal control is achieved by using fund accounting and integrating budgetary accounting into financial accounting; (2) how and why accounting measurements for governmental entities differ from measurements in business, not-for-profit, and health care entities; (3) how these entities account for and report certain specific transactions; (4) the financial reporting requirements for the three types of entities; and (5) how to read and understand the financial reports prepared by these entities.\n\n      less description for PADM-GP 4138 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4139",
            "course_name": "Investment Management in Public & NP Sectors",
            "description": "PADM-GP 4139 Investment Management in Public & NP Sectors \nThis course is designed to provide students interested in careers in state and local government, endowments, and foundations with a basic understanding of institutional investment management. With the key concepts covered in this class (portfolio construction, the risk and return characteristics of major asset classes, due diligence, investment decision making, and fiduciary responsibility), students will be equipped to understand the operations of an institution’s investment pool as well as evaluate investment and governance policy issues.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4141",
            "course_name": "",
            "description": "PADM-GP 4141\n\n   Performance Auditing\n\nThis course provides students with a basic understanding of concepts, objectives and techniques of performance auditing.  Performance auditing is the objective and systematic review of evidence for the purpose of making an independent assessment of a governmental entity?s programs, activities, and functions.  By examining the internal controls over an entity?s programs, performance auditing seeks to improve public accountability and to increase operating efficiency and effectiveness.  A relatively new field, performance auditing is the public sector counterpart to private sector internal audit...\n\n      more description for PADM-GP 4141 »\n\n      \n\n\n\nThis course provides students with a basic understanding of concepts, objectives and techniques of performance auditing.  Performance auditing is the objective and systematic review of evidence for the purpose of making an independent assessment of a governmental entity?s programs, activities, and functions.  By examining the internal controls over an entity?s programs, performance auditing seeks to improve public accountability and to increase operating efficiency and effectiveness.  A relatively new field, performance auditing is the public sector counterpart to private sector internal auditing. The illustrations covered in this course are based on governmental situations, but the techniques and some of the illustrations are equally applicable to the not-for-profit and health care field.\n\n      less description for PADM-GP 4141 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4142",
            "course_name": "",
            "description": "PADM-GP 4142\n\n   Tools for Managing Nonprofits: Compliance, Internal Control and Ethics\n\nThis class will prepare the future nonprofit manager to lead a legally compliant and ethical organization. As regulators, public funders and private donors increasingly expect the organizations they support to operate with the highest ethical standards, managers need to understand the risks and punishments for failing in this critical management function. This is especially true in the present climate where scandals in the public, nonprofit and for profit sectors have heightened awareness and expectations for transparent and competent management.\n\nUsing readings and case studies, students wi...\n\n      more description for PADM-GP 4142 »\n\n      \n\n\n\nThis class will prepare the future nonprofit manager to lead a legally compliant and ethical organization. As regulators, public funders and private donors increasingly expect the organizations they support to operate with the highest ethical standards, managers need to understand the risks and punishments for failing in this critical management function. This is especially true in the present climate where scandals in the public, nonprofit and for profit sectors have heightened awareness and expectations for transparent and competent management.\n\nUsing readings and case studies, students will gain an understanding of the legal and regulatory environment of the nonprofit organization. They will learn how to design an agency corporate compliance program, write the policies and procedures of internal controls and the basics of risk management. Ethical behavior and creating and ethical corporate culture will be woven throughout the course content.\n\n      less description for PADM-GP 4142 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4143",
            "course_name": "Research Tools and Methods for Public Service",
            "description": "PADM-GP 4143 Research Tools and Methods for Public Service",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4145",
            "course_name": "",
            "description": "PADM-GP 4145\n\n   Design Thinking\n\nThe word design has traditionally been used to describe the visual aesthetics of objects, including books, websites, products, interiors, architecture, and fashion. But increasingly, the definition of design has broadened to include not just outcomes but a process as well.\n\nDesign Thinking is an iterative approach that begins with a well-defined problem and employs a variety of design-based methodologies and tools to address virtually any type of organizational or business challenge, prominently including those within public service.\n\nIn Design Thinking: A Creative Approach to Problem Solv...\n\n      more description for PADM-GP 4145 »\n\n      \n\n\n\nThe word design has traditionally been used to describe the visual aesthetics of objects, including books, websites, products, interiors, architecture, and fashion. But increasingly, the definition of design has broadened to include not just outcomes but a process as well.\n\nDesign Thinking is an iterative approach that begins with a well-defined problem and employs a variety of design-based methodologies and tools to address virtually any type of organizational or business challenge, prominently including those within public service.\n\nIn Design Thinking: A Creative Approach to Problem Solving and Creating Impact, we will examine each step of the design process and the methods and tools that make up a designer's toolkit. We will learn how to apply this approach to some of the most complicated public service issues of the world and find innovative ways to create impact.\n\nSimilar to a design environment, this course will be team-based and highly collaborative. Students will learn to become ethnographers, translators, strategists, and compelling storytellers in matter of just 7 weeks.\n\n      less description for PADM-GP 4145 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4146",
            "course_name": "",
            "description": "PADM-GP 4146\n\n   Large Scale Change: Processes and Techniques for Public and Private Settings\n\nTwo of the most powerful set of ideas about initiating and sustaining meaningful change in all types of organizations, both public anTwo of the most powerful set of ideas about initiating and sustaining meaningful change in all types of organizations, both public and private, have been developed recently by organizational development practitioners and theorists.   High-involvement strategies are increasingly used in a variety of processes to involve people at all levels in changing their own system or organization.  High-leverage strategies are used to involve people in systematic ways to sust...\n\n      more description for PADM-GP 4146 »\n\n      \n\n\n\nTwo of the most powerful set of ideas about initiating and sustaining meaningful change in all types of organizations, both public anTwo of the most powerful set of ideas about initiating and sustaining meaningful change in all types of organizations, both public and private, have been developed recently by organizational development practitioners and theorists.   High-involvement strategies are increasingly used in a variety of processes to involve people at all levels in changing their own system or organization.  High-leverage strategies are used to involve people in systematic ways to sustain those changes.  This two-day course provides a comprehensive overview of the major change methods being used today.  A brief review identifying core principles, assumptions and processes of over 60 such techniques will be made.  In addition, participants will engage in designing and implementing three such interventions as a class:  Appreciative Inquiry, Dialogue, and Future Search.\n \nStudents of Organizational Development and Change who are interested in promoting and implementing dramatic and sustainable change need to explore and understand the core principles, assumptions and processes of such strategies.  Often termed Large-Scale Interventions, these methods are being used more and more as diverse organizations confront changing environments, expectations and realities.  It is no wonder that organizations as large as General Motors and various state government departments (social services, corrections) and as small as the local public school and community group which are interested in ?turning things around? are investigating the use of such interventions.\n\n      less description for PADM-GP 4146 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4149",
            "course_name": "",
            "description": "PADM-GP 4149\n\n   Law and Economics of Municipal Governance\n\nThis seminar investigates the role of cities in providing services to constituents and asks how characteristics such as form of governance, form of financing, labor relations, interlocal cooperation and competition, and state/local relationships affect the quantity and quality of service delivery.  We will consider the extent to which cities should offer particular services (such as education, policing, alleviation of poverty, and economic development), the various ways of paying for those services that are selected (taxes, fees, debt), and various governance structures for deciding among thes...\n\n      more description for PADM-GP 4149 »\n\n      \n\n\n\nThis seminar investigates the role of cities in providing services to constituents and asks how characteristics such as form of governance, form of financing, labor relations, interlocal cooperation and competition, and state/local relationships affect the quantity and quality of service delivery.  We will consider the extent to which cities should offer particular services (such as education, policing, alleviation of poverty, and economic development), the various ways of paying for those services that are selected (taxes, fees, debt), and various governance structures for deciding among these alternatives (strong mayor, mayor/city council, city manager).  Finally, we will consider the causes and consequences of fiscal distress that may interfere with service provision, and the role of different institutions in avoiding and alleviating local fiscal distress.  In making these inquiries, we will often evaluate cities (which are formally known as “municipal corporations”) as economic units not unlike publicly held corporations, with “shareholders” (voters), a “board of directors” (mayor and city council), and “product lines” (street cleaning and maintenance, safety, education, recreation, libraries) that it offers to potential “consumers” (residents, employers, and employees).  While no formal training in economics is required, we will consider empirical studies and basic economic theories to evaluate different forms of service delivery and governance.\n\n      less description for PADM-GP 4149 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4150",
            "course_name": "",
            "description": "PADM-GP 4150\n\n   Data-Driven Performance\n\nThis course describes the growing role of IT in nonprofits and how high-impact organizations are using IT platforms to manage and analyze their programs. Included is a discussion on the IT-related problems faced by nonprofits and solutions available to address these problems. Methods for implementing solutions and best practices for data collection and analysis will also be outlined. The second portion of the course will be hands-on: teaching techniques for quickly analyzing datasets using MS Excel and creating a functional specification document to customize an application. The course will al...\n\n      more description for PADM-GP 4150 »\n\n      \n\n\n\nThis course describes the growing role of IT in nonprofits and how high-impact organizations are using IT platforms to manage and analyze their programs. Included is a discussion on the IT-related problems faced by nonprofits and solutions available to address these problems. Methods for implementing solutions and best practices for data collection and analysis will also be outlined. The second portion of the course will be hands-on: teaching techniques for quickly analyzing datasets using MS Excel and creating a functional specification document to customize an application. The course will also examine how to best recruit and manage consultants and vendors for IT projects.\n\n      less description for PADM-GP 4150 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4152",
            "course_name": "Ethical Issues in Public Service",
            "description": "PADM-GP 4152 Ethical Issues in Public Service",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4153",
            "course_name": "Nonprofit Sec Analysis & Evolution",
            "description": "PADM-GP 4153 Nonprofit Sec Analysis & Evolution",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4188",
            "course_name": "",
            "description": "PADM-GP 4188\n\n   The Business and Psychology of Social Entrepreneurship\n\nRoll up your sleeves. This course is about addressing social problems and changing the world by using your signature strengths in the service of others. We will examine the ever-evolving theory and practice of social entrepreneurship around the globe, covering multiple change-making roles required for successful social entrepreneurship, including the visionary, the infrastructure engineer & manager, and the media & arts contributor. To this end, you and a small team of your peers will be invited to collaborate on a social enterprise business plan of your own design. The semester will progress ...\n\n      more description for PADM-GP 4188 »\n\n      \n\n\n\nRoll up your sleeves. This course is about addressing social problems and changing the world by using your signature strengths in the service of others. We will examine the ever-evolving theory and practice of social entrepreneurship around the globe, covering multiple change-making roles required for successful social entrepreneurship, including the visionary, the infrastructure engineer & manager, and the media & arts contributor. To this end, you and a small team of your peers will be invited to collaborate on a social enterprise business plan of your own design. The semester will progress as an informal laboratory where you will be required to use both sides of your brain observing, experimenting with, and helping shape what it means to be a social entrepreneur.\n\nOur objectives will be to learn about the history, context and varied definitions of social entrepreneurship, to observe effective examples of it in action, and to decipher key success factors and benefits, as well as risks and strategies for mitigating them. In addition, you will be guided through a multi-phase process of self-exploration, social analysis, business strategy, organizational structure and constructive peer critique -- all with the end goal of crafting a business plan for changing the world.\n\n      less description for PADM-GP 4188 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4189",
            "course_name": "Capital Acquisition and Sustainability in social Entrepreneurship",
            "description": "PADM-GP 4189 Capital Acquisition and Sustainability in social Entrepreneurship",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4212",
            "course_name": "Managing Humanitarian Challenges: Delivery and Logistics",
            "description": "PADM-GP 4212 Managing Humanitarian Challenges: Delivery and Logistics",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4217",
            "course_name": "",
            "description": "PADM-GP 4217\n\n   NGO Accountability\n\nThe 1990s saw a historic growth of NGOs in general, with a notable expansion in the number and scope of international organizations working in the fields of economic development, humanitarian relief, and human rights. In the past decade, these NGOs have come under criticism, with claims that they often lack the legitimacy and transparency they are known to loudly demand from governments, international organizations and the private sector. \n\nIn response, in June 2006, eleven major NGOs signed the first ever international NGO Accountability Charter, a voluntary statement of principles and poli...\n\n      more description for PADM-GP 4217 »\n\n      \n\n\n\nThe 1990s saw a historic growth of NGOs in general, with a notable expansion in the number and scope of international organizations working in the fields of economic development, humanitarian relief, and human rights. In the past decade, these NGOs have come under criticism, with claims that they often lack the legitimacy and transparency they are known to loudly demand from governments, international organizations and the private sector. \n\nIn response, in June 2006, eleven major NGOs signed the first ever international NGO Accountability Charter, a voluntary statement of principles and policies. Signatories include Amnesty International, Greenpeace, Transparency International, and Oxfam. Although currently unenforceable, this declaration could be seen to represent a historic step forward in the evolution and maturation of global civil society. \n\nThis course will look at the question of NGO accountability, with a strong focus on the particular challenges facing human rights NGOs, whether they are domestic or international in scope. The course will address key theoretical questions of accountability, including the sources from which an NGO’s legitimacy is drawn and determined, and the ways in which different sources of legitimacy may change the nature of accountability for the NGO in question. \n\nThe course will utilize a series of case studies and hypotheticals to encourage class discussion about what NGO accountability should look like in practice, seeking to help students understand that the most difficult questions of accountability often center on the balancing of interests of different stakeholders. \n\nThe course will also briefly review the range of legal and regulatory frameworks and mechanisms currently in place domestically, regionally, and internationally; while acknowledging that true accountability may depend most on voluntary mechanisms that individual NGOs put in place.\n\nPrerequisites: CORE-GP 1022\n\n      less description for PADM-GP 4217 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4223",
            "course_name": "",
            "description": "PADM-GP 4223\n\n   International Development Performance Evaluation\n\nThis course deals with evaluation as it is currently practiced and used  in many international development organizations/NGOs. Many of those  practices and uses tend to be qualitative. It also starts from the  premise that evaluation is, among other things, a tool designed to  improve performance. It therefore needs to be scrutinized and evaluated  itself in terms of the uses made of it. Consequently the course takes a  primarily qualitative approach to evaluation and how to evaluate the  effectiveness of evaluation.\n\nBy the end of the course successful students should be able to:\n1.      P...\n\n      more description for PADM-GP 4223 »\n\n      \n\n\n\nThis course deals with evaluation as it is currently practiced and used  in many international development organizations/NGOs. Many of those  practices and uses tend to be qualitative. It also starts from the  premise that evaluation is, among other things, a tool designed to  improve performance. It therefore needs to be scrutinized and evaluated  itself in terms of the uses made of it. Consequently the course takes a  primarily qualitative approach to evaluation and how to evaluate the  effectiveness of evaluation.\n\nBy the end of the course successful students should be able to:\n1.      Prepare an evaluation to be carried out by an international development organization including identifying when and why one is needed, preparing a terms of reference including a report outline; identifying skill needs for evaluators and a plan for implementing and following up of the evaluation.\n2.      Describe the different issues or problems in designing and developing an evaluation including deciding when one would be cost effective and when not; also the criteria for developing an evaluation plan for an organization.\n3.      Define which form of evaluation is most appropriate for a given problem whether it be one of policy, strategy, program or project.\n\n      less description for PADM-GP 4223 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4224",
            "course_name": "",
            "description": "PADM-GP 4224\n\n   US and the World\n\nThe rise of China. Terrorism. Nuclear proliferation. Human rights. Global poverty. Climate Change. What role should military force play in foreign policy? Arguments over how to respond to these issues reflect debates about the appropriate role that the United States should play in the world -- debates that date back to the country's founding. Should the United States aspire to global dominance? Should or can the United States foster the creation of an international society founded upon international law and cooperation? These and other questions will be explored by examining competing views on...\n\n      more description for PADM-GP 4224 »\n\n      \n\n\n\nThe rise of China. Terrorism. Nuclear proliferation. Human rights. Global poverty. Climate Change. What role should military force play in foreign policy? Arguments over how to respond to these issues reflect debates about the appropriate role that the United States should play in the world -- debates that date back to the country's founding. Should the United States aspire to global dominance? Should or can the United States foster the creation of an international society founded upon international law and cooperation? These and other questions will be explored by examining competing views on the most critical foreign policy issues of the 21st century, issues that will redefine the relationship between the United States and the world.\n\n      less description for PADM-GP 4224 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4250",
            "course_name": "Hunger and Food Security in a Global Prespective: New York",
            "description": "PADM-GP 4250 Hunger and Food Security in a Global Prespective: New York",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4310",
            "course_name": "Understanding Social Entrepreneurship",
            "description": "PADM-GP 4310 Understanding Social Entrepreneurship",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4340",
            "course_name": "Digital Innovation Lab",
            "description": "PADM-GP 4340 Digital Innovation Lab",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4401",
            "course_name": "",
            "description": "PADM-GP 4401\n\n   Criminal Justice and Neighborhoods\n\nFrom the police, to the court system, to incarceration, to community supervision, criminal justice system practitioners and policymakers increasingly acknowledge that the community is both acutely impacted by justice system policy and practice, as well as is the critical partner in the generation of public safety and citizen quality of life. This course examines a wide range of criminal justice issues and their impact on the community; also critically examines the community’s role in demonstrating effective solutions, with a particular focus on the New York City criminal justice system and NYC...\n\n      more description for PADM-GP 4401 »\n\n      \n\n\n\nFrom the police, to the court system, to incarceration, to community supervision, criminal justice system practitioners and policymakers increasingly acknowledge that the community is both acutely impacted by justice system policy and practice, as well as is the critical partner in the generation of public safety and citizen quality of life. This course examines a wide range of criminal justice issues and their impact on the community; also critically examines the community’s role in demonstrating effective solutions, with a particular focus on the New York City criminal justice system and NYC neighborhoods.\n\n      less description for PADM-GP 4401 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4402",
            "course_name": "Juvenile Justice Issues:",
            "description": "PADM-GP 4402 Juvenile Justice Issues:",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4413",
            "course_name": "Topics in Philanthropy",
            "description": "PADM-GP 4413 Topics in Philanthropy",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4414",
            "course_name": "",
            "description": "PADM-GP 4414\n\n   Corporate Philanthropy and Engagement\n\nCorporate philanthropy and engagement is an evolving space which is critical to the existence and operation of nonprofit organizations. The role of the private sector in helping nonprofits achieve their mission, serve their clients and realize their expected goals and outcomes is unique and very different from the role that government funders and individual major donors play. This course will provide a survey of key topics, trends and best practices within the corporate philanthropy, corporate social responsibility and grantmaking space, with a particular emphasis on public and private multina...\n\n      more description for PADM-GP 4414 »\n\n      \n\n\n\nCorporate philanthropy and engagement is an evolving space which is critical to the existence and operation of nonprofit organizations. The role of the private sector in helping nonprofits achieve their mission, serve their clients and realize their expected goals and outcomes is unique and very different from the role that government funders and individual major donors play. This course will provide a survey of key topics, trends and best practices within the corporate philanthropy, corporate social responsibility and grantmaking space, with a particular emphasis on public and private multinational organizations headquartered in the United States.  This course is ideal for those with limited-to-no exposure or prior engagement with corporate institutions as grantmakers and partners and/or for those who work closely with corporate giving offices and philanthropy departments.\n\n      less description for PADM-GP 4414 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4420",
            "course_name": "",
            "description": "PADM-GP 4420\n\n   Current Debates in U.S National Food Politics/Policy\n\nThis two-credit, seven-week course will explore a selected set of the most intensely debated topics in food politics/policy as currently practiced in the United States.  This is not meant to be a comprehensive study of food systems or even of food policy; other Wagner and NYU courses provide such an overview.  Instead we will investigate in depth several specific policy debates, reviewing the problem, currently-proposed solutions, and the complex politics of policymaking in a separated-powers system.\n\nWe will pay particular attention to key institutional actors throughout: these include the ...\n\n      more description for PADM-GP 4420 »\n\n      \n\n\n\nThis two-credit, seven-week course will explore a selected set of the most intensely debated topics in food politics/policy as currently practiced in the United States.  This is not meant to be a comprehensive study of food systems or even of food policy; other Wagner and NYU courses provide such an overview.  Instead we will investigate in depth several specific policy debates, reviewing the problem, currently-proposed solutions, and the complex politics of policymaking in a separated-powers system.\n\nWe will pay particular attention to key institutional actors throughout: these include the influence of lobbying groups (industry and advocacy/nonprofit); the interplay of federal departments and agencies (USDA, HHS, FDA, Executive Office of the President); the politics of food in the U.S. Congress and judiciary; as well as the role of academic and think-tank experts in shaping political outcomes.\n\n      less description for PADM-GP 4420 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4430",
            "course_name": "Critical Race Theory",
            "description": "PADM-GP 4430 Critical Race Theory",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4435",
            "course_name": "Responsible Governance",
            "description": "PADM-GP 4435 Responsible Governance \nResponsibility in implementing public policies is the purpose of public management in a democratic society.  This course provides an analytic lens for understanding the rules, norms, processes and practices that incorporate values into administrative decisions.  We use both normative and positive theoretical arguments to understand how responsible action combines accountability with discretionary action.  To bring theory to bear on practice, we evaluate difficult cases—historical and contemporary, domestic and international—in light of these arguments.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4440",
            "course_name": "Education and Social Policy",
            "description": "PADM-GP 4440 Education and Social Policy",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4444",
            "course_name": "",
            "description": "PADM-GP 4444\n\n   Topics in LGBT Public Policy\n\nThe movement for equality for lesbian, gay, bisexual and transgender (LGBT) people is one of the most successful in recent history. In the U.S., even though inequality and prejudice persist, significant policy advances have occurred. These include the repeal of Don’t Ask, Don’t Tell, the adoption of transgender nondiscrimination laws in 18 states, the extension of marriage equality in 19 states and active litigation in the other 31, and support for same-sex marriage by President Obama and the Democratic Party. Many other changes have occurred that improve treatment of LGBT people by Immigratio...\n\n      more description for PADM-GP 4444 »\n\n      \n\n\n\nThe movement for equality for lesbian, gay, bisexual and transgender (LGBT) people is one of the most successful in recent history. In the U.S., even though inequality and prejudice persist, significant policy advances have occurred. These include the repeal of Don’t Ask, Don’t Tell, the adoption of transgender nondiscrimination laws in 18 states, the extension of marriage equality in 19 states and active litigation in the other 31, and support for same-sex marriage by President Obama and the Democratic Party. Many other changes have occurred that improve treatment of LGBT people by Immigration and Customs Enforcement, Veterans Affairs, Social Security, and elder services. This graduate level course will examine the incredible successes of LGBT rights activism in the U.S. and globally, and the treatment of LGBT people in several policy areas, with an in-depth focus on several issues that afford a broad overview of domestic and global LGBT policy. These are: health policy and HIV prevention and care; elder issues; youth and education policy; criminal justice issues, including best practices for safely managing LGBT prisoners and juvenile offenders and reducing victimization; family recognition and the policy implications of race and gender differences among same-sex couple households; and LGBT rights struggles in the former Soviet bloc, Africa, and elsewhere.\n\n      less description for PADM-GP 4444 «",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4465",
            "course_name": "Climate Change for Policy Makers",
            "description": "PADM-GP 4465 Climate Change for Policy Makers",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4619",
            "course_name": "The Arts and Artist in Urban Revitalization",
            "description": "PADM-GP 4619 The Arts and Artist in Urban Revitalization \nThis 2-credit course is designed to introduce the student to the use by cities of artists and the non profit arts as key elements in their urban revitalization efforts. The course places the arts in their historical context and examines late 20th c/early 21st c revitalization models from the perspective of both private and public stakeholders and individual artists and arts organizations. Primary focus will be on U.S. cities with comparative examination of international examples.",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4620",
            "course_name": "Topics in Arts Policy",
            "description": "PADM-GP 4620 Topics in Arts Policy",
            "offering": false
        },
        {
            "course_id": "PADM-GP 4700",
            "course_name": "Topics in Public Policy and Management",
            "description": "PADM-GP 4700 Topics in Public Policy and Management",
            "offering": false
        },
        {
            "course_id": "PADM-GP 9202",
            "course_name": "The Politics of Social Impact",
            "description": "PADM-GP 9202 The Politics of Social Impact \nThis course will explore the role of the president in designing, promoting, lobbying, shaping, enacting, and implementing social change. It will focus specifically on the president’s foreign and domestic policy agendas, but will also examine the congressional policymaking process as a constraint on the president’s policymaking tools and strategies.",
            "offering": false
        }
    ]
}