{
    "major_id": "RELST-UA",
    "file": "./2015-2016/Religious_Studies_(RELST-UA).html",
    "courses": [
        {
            "course_id": "RELST-UA 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "7446",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "25W4 C-20",
                    "time": "Tue,Thu 11.00 AM - 12.15 PM",
                    "open": true,
                    "professor": "Turnbull, lesley"
                }
            ],
            "course_name": "Theories & Methods in The Study of Religion",
            "description": "RELST-UA    1 Theories & Methods in The Study of Religion \nOffered in the fall. 4 points. Focuses on fundamental theoretical and methodological issues pertaining to the academic study of religion. Exposes students to, and familiarizes them with, some of the more important theories of the origin, character, and function of religion as a human phenomenon. Students are given an opportunity to encounter and test an assortment of the main scholarly approaches to understanding and interpreting religious phenomena, including psychological, sociological, anthropological, and hermeneutical perspectives.",
            "offering": true
        },
        {
            "course_id": "RELST-UA 10",
            "course_name": "Comparative Religion",
            "description": "RELST-UA   10 Comparative Religion",
            "offering": false
        },
        {
            "course_id": "RELST-UA 11",
            "course_name": "Civilization & Culture of The Middle Ages",
            "description": "RELST-UA   11 Civilization & Culture of The Middle Ages",
            "offering": false
        },
        {
            "course_id": "RELST-UA 15",
            "course_name": "",
            "description": "RELST-UA   15\n\n   Advanced Seminar:\n\nPrerequisites: junior or senior status, RELST-UA1, and at least two other religious studies courses, or permission of the instructor. Offered every spring. 4 points. Complements and develops the methodological and theoretical emphasis encountered in Theories and Methods in the Study of Religion, albeit with a higher level of specificity and sophistication. The focus is on a specific thematic motif with cross-cultural applicability (for example, ritual, the body, sacrifice, religion and the state). Students can explore the import of the motif in question for their own area of specialization, as...\n\n      more description for RELST-UA   15 »\n\n      \n\n\n\nPrerequisites: junior or senior status, RELST-UA1, and at least two other religious studies courses, or permission of the instructor. Offered every spring. 4 points. Complements and develops the methodological and theoretical emphasis encountered in Theories and Methods in the Study of Religion, albeit with a higher level of specificity and sophistication. The focus is on a specific thematic motif with cross-cultural applicability (for example, ritual, the body, sacrifice, religion and the state). Students can explore the import of the motif in question for their own area of specialization, as well as examine its manifestations in other traditions. Students are expected to make formal presentations to the class.\n\n      less description for RELST-UA   15 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 19",
            "course_name": "Sex, Gender & The Bible",
            "description": "RELST-UA   19 Sex, Gender & The Bible \nThis course investigates a series of problems regarding the mutual constitution of male and female in the Hebrew Bible. Through close readings of a range of biblical texts (narrative, law, wisdom literature), we address such issues as the absence of the goddess in monotheism, the literary representation of women and men, the construction of gender ideals, and the legislation of sex and bodily purity. This course is sponsored by the Department of Hebrew & Judaic Studies.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 23",
            "course_name": "Bible as Literature",
            "description": "RELST-UA   23 Bible as Literature",
            "offering": false
        },
        {
            "course_id": "RELST-UA 25",
            "course_name": "Women in Hinduism and Buddhism",
            "description": "RELST-UA   25 Women in Hinduism and Buddhism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 26",
            "course_name": "Women and Islamic Law",
            "description": "RELST-UA   26 Women and Islamic Law \nThe aim of this course is to acquaint students with the ways Islamic law has treated women in theory and practice. Students are exposed to medieval and modern legal texts regarding the status of women as believers, daughters, wives, mothers, and legal persons. Case studies from different periods of Islamic history are read and discussed as well as writings from contemporary anthropology.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 28",
            "course_name": "Neoplatonism in The Mid Ages & Renaissance",
            "description": "RELST-UA   28 Neoplatonism in The Mid Ages & Renaissance",
            "offering": false
        },
        {
            "course_id": "RELST-UA 30",
            "course_name": "Intro to Global Studies: Urban Religion",
            "description": "RELST-UA   30 Intro to Global Studies: Urban Religion",
            "offering": false
        },
        {
            "course_id": "RELST-UA 34",
            "course_name": "Salvation & Revolution",
            "description": "RELST-UA   34 Salvation & Revolution",
            "offering": false
        },
        {
            "course_id": "RELST-UA 51",
            "course_name": "Talmudic, Midrashic, & Medieval Literature",
            "description": "RELST-UA   51 Talmudic, Midrashic, & Medieval Literature",
            "offering": false
        },
        {
            "course_id": "RELST-UA 60",
            "course_name": "Philosophy in The Middle Ages",
            "description": "RELST-UA   60 Philosophy in The Middle Ages",
            "offering": false
        },
        {
            "course_id": "RELST-UA 75",
            "course_name": "Modern Hebrew Literature in Hebrew",
            "description": "RELST-UA   75 Modern Hebrew Literature in Hebrew",
            "offering": false
        },
        {
            "course_id": "RELST-UA 77",
            "course_name": "Intro to Jewish Thought & Lit",
            "description": "RELST-UA   77 Intro to Jewish Thought & Lit",
            "offering": false
        },
        {
            "course_id": "RELST-UA 83",
            "course_name": "Jesus, The Jews, and The Romans",
            "description": "RELST-UA   83 Jesus, The Jews, and The Romans",
            "offering": false
        },
        {
            "course_id": "RELST-UA 85",
            "course_name": "What is Islam?",
            "description": "RELST-UA   85 What is Islam? \nAn introductory course dealing with the life of the Prophet Muhammad and the origins of Islam; the beliefs and practices of the Islamic community; differences between Sunni and Shiite Islam; Sufism; the spiritual, intellectual, and artistic life of the Islamic commonwealth; and modern Islamic revival.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 86",
            "course_name": "Gender, Sexuality, & The Body in Early Christnty",
            "description": "RELST-UA   86 Gender, Sexuality, & The Body in Early Christnty \nStudents reexamine the light shed by ancient writings (and other evidence) not only on the role(s) of women in ancient Christian groups but also on the ideologies of gender promoted or assumed by those groups. The focus, while predominantly on women, also extends to the way in which gender identities were constructed and adhered to by males and females.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 95",
            "course_name": "Freshman Sem: China & The Silk Roads",
            "description": "RELST-UA   95 Freshman Sem: China & The Silk Roads",
            "offering": false
        },
        {
            "course_id": "RELST-UA 96",
            "course_name": "Philosophy of Religion",
            "description": "RELST-UA   96 Philosophy of Religion",
            "offering": false
        },
        {
            "course_id": "RELST-UA 99",
            "course_name": "A Book Forged in Hell: Spinoza's Incendiary Treatise and Modern Judaism",
            "description": "RELST-UA   99 A Book Forged in Hell: Spinoza's Incendiary Treatise and Modern Judaism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 100",
            "course_name": "Sem: Millenarianism in Thought and Deed",
            "description": "RELST-UA  100 Sem: Millenarianism in Thought and Deed",
            "offering": false
        },
        {
            "course_id": "RELST-UA 101",
            "course_name": "Hinduism,Buddhism,Taoism",
            "description": "RELST-UA  101 Hinduism,Buddhism,Taoism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 102",
            "course_name": "Judaism, Christianity, & Islam",
            "description": "RELST-UA  102 Judaism, Christianity, & Islam \nComparative study of the three great monotheistic religious traditions: how each understood its origin and evolution and their similarities and differences in matters of scripture, worship, authority, community, theology, and mysticism.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 103",
            "course_name": "Modern Jewish Thought",
            "description": "RELST-UA  103 Modern Jewish Thought",
            "offering": false
        },
        {
            "course_id": "RELST-UA 104",
            "course_name": "Jewish Mysticism & Hasidism",
            "description": "RELST-UA  104 Jewish Mysticism & Hasidism \nIntroduction to the history of the Kabbalah and Hasidism, emphasizing the impact of these ideas on the history of Judaism.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 105",
            "course_name": "Major Christian Thinkers",
            "description": "RELST-UA  105 Major Christian Thinkers",
            "offering": false
        },
        {
            "course_id": "RELST-UA 106",
            "course_name": "Modern Jewish Philosophy",
            "description": "RELST-UA  106 Modern Jewish Philosophy \nReadings (in translation) and analysis of representative selections from the writings of the major Jewish philosophers of the Middle Ages. Emphasizes the Kuzari of Yehuda Halevi and the Guide to the Perplexed of Moses Maimonides. Special attention is paid to the cultural context in which these works were produced.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 107",
            "course_name": "Spinoza & Jewish Philosophy",
            "description": "RELST-UA  107 Spinoza & Jewish Philosophy",
            "offering": false
        },
        {
            "course_id": "RELST-UA 108",
            "course_name": "2 Medieval Minds: Augustine and Aquinas",
            "description": "RELST-UA  108 2 Medieval Minds: Augustine and Aquinas",
            "offering": false
        },
        {
            "course_id": "RELST-UA 110",
            "course_name": "Love and Desire in The Middle Ages",
            "description": "RELST-UA  110 Love and Desire in The Middle Ages",
            "offering": false
        },
        {
            "course_id": "RELST-UA 113",
            "course_name": "The Jews in Medieval Spain",
            "description": "RELST-UA  113 The Jews in Medieval Spain",
            "offering": false
        },
        {
            "course_id": "RELST-UA 115",
            "course_name": "Hinduism",
            "description": "RELST-UA  115 Hinduism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 117",
            "course_name": "Jewish Ethics",
            "description": "RELST-UA  117 Jewish Ethics \nSurveys Jewish ethical perspectives on leading moral issues, including capital punishment; business ethics; self-sacrifice, martyrdom, and suicide; truth and lying; the just war; abortion; euthanasia; birth control; and politics. Explores philosophical questions concerning the nature of ethics and methodological issues related to the use of Jewish sources. Examines classical Jewish texts (Bible, Talmud, and medieval codes) pertaining to ethical issues and discusses the range of ethical positions that may be based on the sources.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 120",
            "course_name": "Biblical Archaeology",
            "description": "RELST-UA  120 Biblical Archaeology \nExamination of the methods and conclusions of archeological research and excavation as applied to the Bible and history of Israel in antiquity. Topics include the historicity of the exodus and the Israelite conquest of Canaan, the empires of David and Solomon, and the nature of Israelite religion. The class investigates how archeology provides evidence for evaluating the biblical text and reconstructing early Israelite history. The course concentrates on the period from the exodus and conquest of the Land of Israel through the Babylonian exile.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 122",
            "course_name": "Protestant Catholic Reformations",
            "description": "RELST-UA  122 Protestant Catholic Reformations",
            "offering": false
        },
        {
            "course_id": "RELST-UA 125",
            "course_name": "Ancient Near Eastern Mythology",
            "description": "RELST-UA  125 Ancient Near Eastern Mythology",
            "offering": false
        },
        {
            "course_id": "RELST-UA 130",
            "course_name": "Ts: Language & Religion",
            "description": "RELST-UA  130 Ts: Language & Religion",
            "offering": false
        },
        {
            "course_id": "RELST-UA 140",
            "course_name": "",
            "description": "RELST-UA  140\n\n   Varieties of Religious Experience\" Revisitied\n\nThis seminar will utilize but also update William James’s pioneering approach to interpreting and understanding religion in psychological rather than theological terms. We will examine how the term “religion” is more confusing than helpful when it fails to differentiate between a wide variety of utterly incompatible beliefs and practices at different stages of cognitive and emotional development. We will discuss the phenomenon of “political religions” (nationalism, racism, totalitarianism, apocalyptic fundamentalism) as attempts to reject or distort modernity (the worldview of modern science),...\n\n      more description for RELST-UA  140 »\n\n      \n\n\n\nThis seminar will utilize but also update William James’s pioneering approach to interpreting and understanding religion in psychological rather than theological terms. We will examine how the term “religion” is more confusing than helpful when it fails to differentiate between a wide variety of utterly incompatible beliefs and practices at different stages of cognitive and emotional development. We will discuss the phenomenon of “political religions” (nationalism, racism, totalitarianism, apocalyptic fundamentalism) as attempts to reject or distort modernity (the worldview of modern science), in order to fill the vacuum that Sartre called “the God-shaped hole in the soul of modern man” that resulted when the traditional sources of moral, legal, and political authority (God, religion, pure reason) lost their credibility as sources of knowledge. We will consider the political religions as resulting from psychological regression, and contrast them with the current moment in the evolution of religious consciousness, in which the challenge is to find progressive forms of religious expression, understanding and experience that are consistent with the modern scientific mentality, while not being reducible to it. The seminar will conclude by examining whether this is the context in which the next major step in the evolution of both culture and personality will need to occur. Identical to AHSEM-UA 144.\n\n      less description for RELST-UA  140 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 165",
            "course_name": "Jewish American Novel",
            "description": "RELST-UA  165 Jewish American Novel",
            "offering": false
        },
        {
            "course_id": "RELST-UA 180",
            "course_name": "Zionism & The State of Israel",
            "description": "RELST-UA  180 Zionism & The State of Israel",
            "offering": false
        },
        {
            "course_id": "RELST-UA 181",
            "course_name": "Topics in Irish History:",
            "description": "RELST-UA  181 Topics in Irish History:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 183",
            "course_name": "Zionism & The Origins of Israel",
            "description": "RELST-UA  183 Zionism & The Origins of Israel",
            "offering": false
        },
        {
            "course_id": "RELST-UA 190",
            "course_name": "Tpcs 20C Lit: Rethinking Seculrsm Thru Global Lit",
            "description": "RELST-UA  190 Tpcs 20C Lit: Rethinking Seculrsm Thru Global Lit",
            "offering": false
        },
        {
            "course_id": "RELST-UA 192",
            "course_name": "Foundations of The Christian-Jewish Argumen",
            "description": "RELST-UA  192 Foundations of The Christian-Jewish Argumen \nIllustrates the complexity of the relationship between Jews and Christians in the Middle Ages by examining both Christian and Jewish perspectives and delineating the variety of responses within each religious community to the other. The primary focus is on the European Middle Ages, but the origins of the argument a millennium earlier are also considered.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 201",
            "course_name": "The History of The Idea of God in The West",
            "description": "RELST-UA  201 The History of The Idea of God in The West",
            "offering": false
        },
        {
            "course_id": "RELST-UA 211",
            "course_name": "Hist of Judaism: Emerg of Classical Judaism",
            "description": "RELST-UA  211 Hist of Judaism: Emerg of Classical Judaism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 212",
            "course_name": "Religion Magic & Jewish Tradition",
            "description": "RELST-UA  212 Religion Magic & Jewish Tradition \nExamines models for understanding the nature of magic as a phenomenon in society and then applies those models to help understand the different kinds of magic in Jewish history from biblical times to the present.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 217",
            "course_name": "Roman Church 1200 - 1600",
            "description": "RELST-UA  217 Roman Church 1200 - 1600",
            "offering": false
        },
        {
            "course_id": "RELST-UA 220",
            "course_name": "Early History of God",
            "description": "RELST-UA  220 Early History of God \nExplores evidence concerning the appearance of monotheism in ancient Israel, including the Hebrew Bible, ancient writing from Israel and its neighbors, and a range of other artifacts. The premise of the course is that Israel was not alone in ascribing priority of power to a single god, and Israel?s result is comprehensible only in the context of these wider currents.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 240",
            "course_name": "Varieties of Mystical Experience",
            "description": "RELST-UA  240 Varieties of Mystical Experience \nSurveys the traditional forms of mystical expression in Judaism, Christianity, and Islam.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 241",
            "course_name": "Martyrs Mystics and Prophets",
            "description": "RELST-UA  241 Martyrs Mystics and Prophets",
            "offering": false
        },
        {
            "course_id": "RELST-UA 243",
            "course_name": "Gothic Art",
            "description": "RELST-UA  243 Gothic Art",
            "offering": false
        },
        {
            "course_id": "RELST-UA 244",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16805",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "726B 542"
                }
            ],
            "course_name": "",
            "description": "RELST-UA  244\n\n   Topics:Religion and the Environment\n\nThe emphasis of this course varies by semester and is designed to allow flexibility in course offerings from visiting scholars and specialists in particular fields. This course explores the ways in which religious people and communities understand their role in shaping, protecting, and exploiting the environment. How do different religious traditions see the same thing—our planet—so differently? Is environmentalism, in itself, a religion? How do modern-day notions of development and progress come up against ancient ideas of preservation and stewardship? In answering these questions, we will ad...\n\n      more description for RELST-UA  244 »\n\n      \n\n\n\nThe emphasis of this course varies by semester and is designed to allow flexibility in course offerings from visiting scholars and specialists in particular fields. This course explores the ways in which religious people and communities understand their role in shaping, protecting, and exploiting the environment. How do different religious traditions see the same thing—our planet—so differently? Is environmentalism, in itself, a religion? How do modern-day notions of development and progress come up against ancient ideas of preservation and stewardship? In answering these questions, we will address a number of topics, including but not limited to Zen poetry on nature, the sacred groves of India, neopagan Gaia worship, and dystopian science fiction. “Religion and the Environment” is purposefully eclectic, using literature, historical scholarship, and ethnography so as to expand a subject matter beyond disciplinary boundaries.\n\n      less description for RELST-UA  244 «",
            "offering": true
        },
        {
            "course_id": "RELST-UA 245",
            "course_name": "Angels",
            "description": "RELST-UA  245 Angels",
            "offering": false
        },
        {
            "course_id": "RELST-UA 250",
            "course_name": "Passion and Desire in The Middle Ages",
            "description": "RELST-UA  250 Passion and Desire in The Middle Ages \nStudy of the kinds of loves and desires portrayed in medieval literature: passionate love, refined ?courtly? love, sexual or ?carnal? love; love of kin; love of country; love of God. Discusses how literary genres can be largely defined by the nature of the desires represented, explores medieval theorists? views of human love, and investigates the conflicts among different kinds of love for medieval people.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 260",
            "course_name": "Sacrifice and World Religions",
            "description": "RELST-UA  260 Sacrifice and World Religions",
            "offering": false
        },
        {
            "course_id": "RELST-UA 266",
            "course_name": "Christianizing The Roman Empire",
            "description": "RELST-UA  266 Christianizing The Roman Empire",
            "offering": false
        },
        {
            "course_id": "RELST-UA 270",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19038",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "726B 542",
                    "time": "Wed 11.00 AM - 1.45 PM",
                    "open": true,
                    "professor": "Neumann, Lorinda"
                }
            ],
            "course_name": "Seminar:How Will You Die?",
            "description": "RELST-UA  270 Seminar:How Will You Die?",
            "offering": true
        },
        {
            "course_id": "RELST-UA 285",
            "course_name": "Apocalypticism in European Christian Lit",
            "description": "RELST-UA  285 Apocalypticism in European Christian Lit",
            "offering": false
        },
        {
            "course_id": "RELST-UA 293",
            "course_name": "Seminar Classical Studies:",
            "description": "RELST-UA  293 Seminar Classical Studies:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 295",
            "course_name": "Sem Cls Stud:Myth-Making in Rom Antiq Early Image",
            "description": "RELST-UA  295 Sem Cls Stud:Myth-Making in Rom Antiq Early Image",
            "offering": false
        },
        {
            "course_id": "RELST-UA 302",
            "course_name": "Introduction to The New Testament",
            "description": "RELST-UA  302 Introduction to The New Testament \nIntroduces students to issues and themes in the history of the Jesus movement and early Christianity through a survey of the main texts of the canonical New Testament as well as other important early Christian documents. Students are given the opportunity to read most of the New Testament text in a lecture hall setting where the professor provides historical context and focus on significant issues, describes modern scholarly methodologies, and places the empirical material within the larger framework of ancient history and the theoretical study of religion.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 304",
            "course_name": "Idea of God in Contemp Thought",
            "description": "RELST-UA  304 Idea of God in Contemp Thought",
            "offering": false
        },
        {
            "course_id": "RELST-UA 306",
            "course_name": "Belief, Truth,&Knowledge",
            "description": "RELST-UA  306 Belief, Truth,&Knowledge",
            "offering": false
        },
        {
            "course_id": "RELST-UA 307",
            "course_name": "From Hegel to Nietzsche",
            "description": "RELST-UA  307 From Hegel to Nietzsche",
            "offering": false
        },
        {
            "course_id": "RELST-UA 308",
            "course_name": "History of Ancient Philosophy",
            "description": "RELST-UA  308 History of Ancient Philosophy",
            "offering": false
        },
        {
            "course_id": "RELST-UA 309",
            "course_name": "Life and Death",
            "description": "RELST-UA  309 Life and Death",
            "offering": false
        },
        {
            "course_id": "RELST-UA 310",
            "course_name": "Intro to Philosophy",
            "description": "RELST-UA  310 Intro to Philosophy",
            "offering": false
        },
        {
            "course_id": "RELST-UA 312",
            "course_name": "Medieval Visionary Lit",
            "description": "RELST-UA  312 Medieval Visionary Lit",
            "offering": false
        },
        {
            "course_id": "RELST-UA 313",
            "course_name": "Seminar:",
            "description": "RELST-UA  313 Seminar:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 320",
            "course_name": "Religion & Religious Life in Byzantium",
            "description": "RELST-UA  320 Religion & Religious Life in Byzantium",
            "offering": false
        },
        {
            "course_id": "RELST-UA 335",
            "course_name": "",
            "description": "RELST-UA  335\n\n   Introduction to Ancient Indian Literature\n\nAn introductory course designed to acquaint students with the great works of the ancient Indian literary tradition, a major part of which was written in Sanskrit. The earliest form of that language, called Vedic Sanskrit, is the language of the Vedic hymns, especially those of the Rig Veda. Sanskrit has had an unbroken literary tradition for over 3,000 years. This rich and vast literary, religious, and philosophical heritage is introduced in this course. In addition, students work with excerpts from the Jain and Buddhist canons written in Prakrits and examples of Tamil poetry. Selections from ...\n\n      more description for RELST-UA  335 »\n\n      \n\n\n\nAn introductory course designed to acquaint students with the great works of the ancient Indian literary tradition, a major part of which was written in Sanskrit. The earliest form of that language, called Vedic Sanskrit, is the language of the Vedic hymns, especially those of the Rig Veda. Sanskrit has had an unbroken literary tradition for over 3,000 years. This rich and vast literary, religious, and philosophical heritage is introduced in this course. In addition, students work with excerpts from the Jain and Buddhist canons written in Prakrits and examples of Tamil poetry. Selections from the Vedic literature, classical drama, epics, story literature, and lyric poetry are studied in English translation.\n\n      less description for RELST-UA  335 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 337",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19554",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "GCASL 275"
                }
            ],
            "course_name": "Religions of India",
            "description": "RELST-UA  337 Religions of India \nThe goal of this course is to introduce students to the vibrant religious traditions of South Asia. The course will examine Hindu, Buddhist, Islamic, and Jain traditions as well as the ancient and modern contexts in which they are situated. In order to guide our inquiries we will focus on relations between religion and politics from the early Vedic period to the violent communalisms of the present. The class will include extensive use of visual resources in addition to traditional texts.",
            "offering": true
        },
        {
            "course_id": "RELST-UA 340",
            "course_name": "Chinese & Japanese Religions",
            "description": "RELST-UA  340 Chinese & Japanese Religions",
            "offering": false
        },
        {
            "course_id": "RELST-UA 350",
            "course_name": "Body, Gender & Belief in China",
            "description": "RELST-UA  350 Body, Gender & Belief in China",
            "offering": false
        },
        {
            "course_id": "RELST-UA 351",
            "course_name": "",
            "description": "RELST-UA  351\n\n   Belief and Social Life in China\n\nThe Chinese word for religion means ?teaching.? ?Teaching? immediately implies someone else besides the self. Belief in China has always been theorized and practiced as mediated by the presence of others, miraculous and mundane. The class explores what Chinese people ?taught? themselves about the person, society, and the natural world and thus how social life was constructed and maintained. Examines in historical perspective the classic texts of the Taoist and Confucian canon and their synthesis; Buddhist, especially Ch?an (Zen) practices in China; issues of gender in past and present practice...\n\n      more description for RELST-UA  351 »\n\n      \n\n\n\nThe Chinese word for religion means ?teaching.? ?Teaching? immediately implies someone else besides the self. Belief in China has always been theorized and practiced as mediated by the presence of others, miraculous and mundane. The class explores what Chinese people ?taught? themselves about the person, society, and the natural world and thus how social life was constructed and maintained. Examines in historical perspective the classic texts of the Taoist and Confucian canon and their synthesis; Buddhist, especially Ch?an (Zen) practices in China; issues of gender in past and present practice; and religion?s relation to the state.\n\n      less description for RELST-UA  351 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 365",
            "course_name": "Saints: Lore and Legend",
            "description": "RELST-UA  365 Saints: Lore and Legend",
            "offering": false
        },
        {
            "course_id": "RELST-UA 404",
            "course_name": "Classical Mythology",
            "description": "RELST-UA  404 Classical Mythology \nDiscusses the myths and legends of Greek mythology and the gods, demigods, heroes, nymphs, monsters, and everyday mortals who played out their parts in this mythology. Begins with creation, as vividly described by Hesiod in the Theogony, and ends with the great Trojan War and the return of the Greek heroes. Special emphasis on the return of Odysseus, as related by Homer in the Odyssey.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 408",
            "course_name": "Christians Jews & Pagans",
            "description": "RELST-UA  408 Christians Jews & Pagans",
            "offering": false
        },
        {
            "course_id": "RELST-UA 409",
            "course_name": "",
            "description": "RELST-UA  409\n\n   Ancient Religion:\n\nThe study of ancient religion is one of  the most rapidly changing  in classical scholarship, as increasingly sophisticated theoretical models are brought to bear on it: this module will provide an opportunity to study Roman religion in the period 200 B.C.-A.D. 150 in the light of these.  It will examine the ancient development and significance of Roman religion in two key areas: that of the Greek philosophers, from whom the Romans derived most of their theoretical arguments; and the Romans’ own religious ideas, traditions, and practices, which played a central part in their social and politic...\n\n      more description for RELST-UA  409 »\n\n      \n\n\n\nThe study of ancient religion is one of  the most rapidly changing  in classical scholarship, as increasingly sophisticated theoretical models are brought to bear on it: this module will provide an opportunity to study Roman religion in the period 200 B.C.-A.D. 150 in the light of these.  It will examine the ancient development and significance of Roman religion in two key areas: that of the Greek philosophers, from whom the Romans derived most of their theoretical arguments; and the Romans’ own religious ideas, traditions, and practices, which played a central part in their social and political life.  This course is sponsored by the Department of Classics.\n\n      less description for RELST-UA  409 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 432",
            "course_name": "Religion and Society",
            "description": "RELST-UA  432 Religion and Society",
            "offering": false
        },
        {
            "course_id": "RELST-UA 459",
            "course_name": "Religion, Modernity & Postmodernity",
            "description": "RELST-UA  459 Religion, Modernity & Postmodernity",
            "offering": false
        },
        {
            "course_id": "RELST-UA 461",
            "course_name": "Symbols & The Formation of Religious Culture",
            "description": "RELST-UA  461 Symbols & The Formation of Religious Culture",
            "offering": false
        },
        {
            "course_id": "RELST-UA 465",
            "course_name": "Christian-Jewish Relations",
            "description": "RELST-UA  465 Christian-Jewish Relations",
            "offering": false
        },
        {
            "course_id": "RELST-UA 470",
            "course_name": "Jewish Responses to Modernity:Relig &Nat'Lsm",
            "description": "RELST-UA  470 Jewish Responses to Modernity:Relig &Nat'Lsm \nExamination of the impact of modernity on Jewish life and institutions in the 18th and 19th centuries. Readings in English from the works of Moses Mendelssohn, Theodor Herzl, Simon Dubnow, and the leading figures of the early Reform, Conservative, and neo-Orthodox movements. The convergence and divergence of nationalist and universalist sentiments are studied.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 480",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "16803",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 383",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Pollick, Geoffrey"
                }
            ],
            "course_name": "",
            "description": "RELST-UA  480\n\n   American Religion\n\nThis course surveys the role of religious figures and movements in the historical development of the United States, from the national founding to the late twentieth century. This course explores the various ways in which religion and national identity have been continually constructed and contested in relation to one another. Not a comprehensive enumeration of all religious expressions, the course selectively treats particular religious formations that came to influence U.S. American culture, society, and politics. Topics will include: disestablishment and church-state relations; revivalism an...\n\n      more description for RELST-UA  480 »\n\n      \n\n\n\nThis course surveys the role of religious figures and movements in the historical development of the United States, from the national founding to the late twentieth century. This course explores the various ways in which religion and national identity have been continually constructed and contested in relation to one another. Not a comprehensive enumeration of all religious expressions, the course selectively treats particular religious formations that came to influence U.S. American culture, society, and politics. Topics will include: disestablishment and church-state relations; revivalism and social activism; race and religion; women’s religious leadership; atheism, freethought, and skepticism; pluralism and religious liberalism; religion and science; immigration and nativism; and religious conservatism and politics.\n\n      less description for RELST-UA  480 «",
            "offering": true
        },
        {
            "course_id": "RELST-UA 482",
            "course_name": "American Evangelicalism",
            "description": "RELST-UA  482 American Evangelicalism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 484",
            "course_name": "Religion and Radicalism",
            "description": "RELST-UA  484 Religion and Radicalism \nThis course explores intersections between religious and political forms of radicalism in the United States, from the mid-1800s to the present. Students are introduced to various models for defining and interpreting radicalism in religion and politics. Major topics include: labor activism, the women’s movement, anti-radical repression, genealogies of socialism and communism, civil rights activism, religious fundamentalism, ethnic and immigrant expressions of radicalism, and the role of religion in Occupy Wall Street and the Tea Party movement.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 518",
            "course_name": "Topics in Middle Eastern History:",
            "description": "RELST-UA  518 Topics in Middle Eastern History:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 551",
            "course_name": "Tpcs: Belief & Social Prac in Premodern China",
            "description": "RELST-UA  551 Tpcs: Belief & Social Prac in Premodern China",
            "offering": false
        },
        {
            "course_id": "RELST-UA 555",
            "course_name": "Jewish-Christian Relations",
            "description": "RELST-UA  555 Jewish-Christian Relations",
            "offering": false
        },
        {
            "course_id": "RELST-UA 561",
            "course_name": "",
            "description": "RELST-UA  561\n\n   Confessional Culture from Augustine to Oprah\n\nThis course traces the different uses and forms ?the? confession has taken in western culture.  How has the confession evolved from a specifically religious practice to become a genre of self-making in ?secular? modernity?  A consistent concern will be the way confessional practices have increasingly become linked to ?sex? and ?sexuality.?  The range of texts and genres surveyed include philosophical and religious treatises, political pamphlets, legal history of confession, psychoanalytic case studies, feminist consciousness-raising, coming out stories, self-help literature, tell-all celebrity...\n\n      more description for RELST-UA  561 »\n\n      \n\n\n\nThis course traces the different uses and forms ?the? confession has taken in western culture.  How has the confession evolved from a specifically religious practice to become a genre of self-making in ?secular? modernity?  A consistent concern will be the way confessional practices have increasingly become linked to ?sex? and ?sexuality.?  The range of texts and genres surveyed include philosophical and religious treatises, political pamphlets, legal history of confession, psychoanalytic case studies, feminist consciousness-raising, coming out stories, self-help literature, tell-all celebrity autobiographies, TV talk shows, YouTube and film/video.  What can we learn from the differences and similarities between these confessional modes, their cultural locations, their historical moments, and their ideological effects?\n\n      less description for RELST-UA  561 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 566",
            "course_name": "Religions of Africa",
            "description": "RELST-UA  566 Religions of Africa \nCovers (1) traditional African religions, including the myths of origin; concepts of the individual and the Supreme Being; the individual?s relation to the universe; links between the world of the living and the spiritual; ancestral worship, divinities, witches, and sorcerers; and sacrifice, prayer, birth, and death; (2) the impact of Islam on traditional African religions and the spread of Islam; (3) the impact of Christianity and missionary enterprise in the late 19th and early 20th centuries in sub-Saharan Africa; and (4) the impact of secular culture on religions in sub-Saharan Africa.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 609",
            "course_name": "Land of Israel Through The Ages",
            "description": "RELST-UA  609 Land of Israel Through The Ages \nSurveys the history of the Land of Israel with special attention to its various inhabitants and cultures from prehistoric times to the present. Archeological findings receive thorough attention.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 610",
            "course_name": "",
            "description": "RELST-UA  610\n\n   Jews in The Islamic Wrld in The Modern Period\n\nThis course presents a broad, chronologically organized survey of the history of the Jewish communities in the Middle East from the rise of the Ottoman Empire to the end of the 20th century. Topics include the organization and operation of Jewish communities; interaction between Jews and Muslims; the effects of the twin processes of modernization and Westernization on these communities; and the relocation of the vast majority of Middle Eastern Jewry to the State of Israel in the 20th century. The course concludes with a brief look at the Jewish communities that continue to live in the Middle E...\n\n      more description for RELST-UA  610 »\n\n      \n\n\n\nThis course presents a broad, chronologically organized survey of the history of the Jewish communities in the Middle East from the rise of the Ottoman Empire to the end of the 20th century. Topics include the organization and operation of Jewish communities; interaction between Jews and Muslims; the effects of the twin processes of modernization and Westernization on these communities; and the relocation of the vast majority of Middle Eastern Jewry to the State of Israel in the 20th century. The course concludes with a brief look at the Jewish communities that continue to live in the Middle East.\n\n      less description for RELST-UA  610 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 611",
            "course_name": "Jews & Christians in The Ancient World",
            "description": "RELST-UA  611 Jews & Christians in The Ancient World \nStudents acquire a basic knowledge of the early history of Judaism and Christianity. However, on the theoretical level, the class aims to provide the students with a forum to ask some of the questions most relevant to religious studies (e.g.: Are we to use self-definition, typology, or both in our formulating religious categories? How do certain categories help and hinder our understanding of religious and other social phenomena? What is the relationship between ideology and social world? How do we learn about the ?real? world from literary evidence?)",
            "offering": false
        },
        {
            "course_id": "RELST-UA 613",
            "course_name": "",
            "description": "RELST-UA  613\n\n   Religion State & Politics\n\nIntroduces students to the debate on secularism by following a comparative approach. Students first gain basic knowledge related to the emergence and development of the secularization paradigm. In a second step, we confront it with empirical data. Concretely, this course introduces different examples of state-religion relationships and discusses the impact of the respective historical experiences and religio-cultural backgrounds on them. This agenda serves to develop a critical overview on scope and limits of secularization theory and provides the students with basic tools to situate current d...\n\n      more description for RELST-UA  613 »\n\n      \n\n\n\nIntroduces students to the debate on secularism by following a comparative approach. Students first gain basic knowledge related to the emergence and development of the secularization paradigm. In a second step, we confront it with empirical data. Concretely, this course introduces different examples of state-religion relationships and discusses the impact of the respective historical experiences and religio-cultural backgrounds on them. This agenda serves to develop a critical overview on scope and limits of secularization theory and provides the students with basic tools to situate current debates on religion in a broader theoretical frame.\n\n      less description for RELST-UA  613 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 616",
            "course_name": "Tpcs: Inquisitions in Medieval Mediterranean",
            "description": "RELST-UA  616 Tpcs: Inquisitions in Medieval Mediterranean",
            "offering": false
        },
        {
            "course_id": "RELST-UA 620",
            "course_name": "Sociology of Religion",
            "description": "RELST-UA  620 Sociology of Religion",
            "offering": false
        },
        {
            "course_id": "RELST-UA 625",
            "course_name": "Phenomenology of Rel",
            "description": "RELST-UA  625 Phenomenology of Rel",
            "offering": false
        },
        {
            "course_id": "RELST-UA 626",
            "course_name": "Metaphysics",
            "description": "RELST-UA  626 Metaphysics",
            "offering": false
        },
        {
            "course_id": "RELST-UA 627",
            "course_name": "Christianity",
            "description": "RELST-UA  627 Christianity",
            "offering": false
        },
        {
            "course_id": "RELST-UA 629",
            "course_name": "Contemporary Christian Thought",
            "description": "RELST-UA  629 Contemporary Christian Thought",
            "offering": false
        },
        {
            "course_id": "RELST-UA 630",
            "course_name": "Theism, Atheism & Existentialism",
            "description": "RELST-UA  630 Theism, Atheism & Existentialism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 633",
            "course_name": "Perfect Society",
            "description": "RELST-UA  633 Perfect Society",
            "offering": false
        },
        {
            "course_id": "RELST-UA 634",
            "course_name": "Why Jews Aren'T Christians",
            "description": "RELST-UA  634 Why Jews Aren'T Christians",
            "offering": false
        },
        {
            "course_id": "RELST-UA 635",
            "course_name": "Religion and Science",
            "description": "RELST-UA  635 Religion and Science",
            "offering": false
        },
        {
            "course_id": "RELST-UA 639",
            "course_name": "The Making of The Muslim Middle East, 600 - 1400",
            "description": "RELST-UA  639 The Making of The Muslim Middle East, 600 - 1400",
            "offering": false
        },
        {
            "course_id": "RELST-UA 640",
            "course_name": "Mod Spiritual Masters",
            "description": "RELST-UA  640 Mod Spiritual Masters",
            "offering": false
        },
        {
            "course_id": "RELST-UA 641",
            "course_name": "Goddess Worship",
            "description": "RELST-UA  641 Goddess Worship",
            "offering": false
        },
        {
            "course_id": "RELST-UA 642",
            "course_name": "Religious Bodies",
            "description": "RELST-UA  642 Religious Bodies",
            "offering": false
        },
        {
            "course_id": "RELST-UA 645",
            "course_name": "",
            "description": "RELST-UA  645\n\n   Religion and Media\n\nIntroduces the long-standing and complex connection between religious practices and various media. Analyzes how human hearing, vision, and the performing body have been used historically to express and maintain religious life through music, voice, images, words, and rituals. Time is then spent on more recent electronic media such as radio, film, television, video, and the Internet. An anthropological/historical perspective on studying religion is pursued. Prior course work in religious studies, anthropology, or media studies would be helpful, but is not necessary if you are willing to work har...\n\n      more description for RELST-UA  645 »\n\n      \n\n\n\nIntroduces the long-standing and complex connection between religious practices and various media. Analyzes how human hearing, vision, and the performing body have been used historically to express and maintain religious life through music, voice, images, words, and rituals. Time is then spent on more recent electronic media such as radio, film, television, video, and the Internet. An anthropological/historical perspective on studying religion is pursued. Prior course work in religious studies, anthropology, or media studies would be helpful, but is not necessary if you are willing to work hard.\n\n      less description for RELST-UA  645 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 646",
            "course_name": "",
            "description": "RELST-UA  646\n\n   Religion, Sexuality & Public Life\n\nThis country was founded on the promise of religious freedom, and yet U.S. laws and policies regulating sexual life derive much of their rationale from specifically religious notions of ?good? versus bad ?sex,? what bodies are ?for,? what kinds of human relationships are valuable. How are we to understand this apparent contradiction? If sexual life is a special case, what makes it so? Finally, what are the implications of this ?exception? for both sexual and religious freedom? Course materials are designed to introduce students to critical approaches to the study of religion in society as well...\n\n      more description for RELST-UA  646 »\n\n      \n\n\n\nThis country was founded on the promise of religious freedom, and yet U.S. laws and policies regulating sexual life derive much of their rationale from specifically religious notions of ?good? versus bad ?sex,? what bodies are ?for,? what kinds of human relationships are valuable. How are we to understand this apparent contradiction? If sexual life is a special case, what makes it so? Finally, what are the implications of this ?exception? for both sexual and religious freedom? Course materials are designed to introduce students to critical approaches to the study of religion in society as well as to familiarize them with important work in the interdisciplinary areas of gender and sexuality studies.\n\n      less description for RELST-UA  646 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 650",
            "course_name": "Topics in Religious Studies:",
            "description": "RELST-UA  650 Topics in Religious Studies: \nTopics vary by semester. Please see: http://religiousstudies.as.nyu.edu/page/home",
            "offering": false
        },
        {
            "course_id": "RELST-UA 660",
            "course_name": "",
            "description": "RELST-UA  660\n\n   Martyrdom, Ancient and Modern\n\nIdentical to V27.0646. Becker. Offered every other year. 4 points. Examines the theory and practice of martyrdom in the West. Begins with a close stIdentical to V27.0646. Becker. Offered every other year. 4 points. Examines the theory and practice of martyrdom in the West. Begins with a close study of the development of the martyrological discourse in classical, early Christian, early Jewish, and Muslim literature and culture. Also traces how the concept of martyrdom is deployed in modern culture in various phenomena, such as the \"Columbine martyrs,\" \"martyrdom operations\" (\"suicide bombers\"),...\n\n      more description for RELST-UA  660 »\n\n      \n\n\n\nIdentical to V27.0646. Becker. Offered every other year. 4 points. Examines the theory and practice of martyrdom in the West. Begins with a close stIdentical to V27.0646. Becker. Offered every other year. 4 points. Examines the theory and practice of martyrdom in the West. Begins with a close study of the development of the martyrological discourse in classical, early Christian, early Jewish, and Muslim literature and culture. Also traces how the concept of martyrdom is deployed in modern culture in various phenomena, such as the \"Columbine martyrs,\" \"martyrdom operations\" (\"suicide bombers\"), political martyrdom, and modern notions of holy war.\n\n      less description for RELST-UA  660 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 665",
            "course_name": "Perspectives On Islam",
            "description": "RELST-UA  665 Perspectives On Islam \nA broad survey of the most central Islamic texts, beliefs, and practices. Using primary texts in translation, the course examines such issues as scripture, ritual, and law and contextualize them within some of the most pivotal social and political developments in Islamic history. This course is intended for students with little or no previous background in Islamic studies.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 670",
            "course_name": "Topics:African Spirituality in The Amer",
            "description": "RELST-UA  670 Topics:African Spirituality in The Amer",
            "offering": false
        },
        {
            "course_id": "RELST-UA 674",
            "course_name": "Islam & Politics",
            "description": "RELST-UA  674 Islam & Politics",
            "offering": false
        },
        {
            "course_id": "RELST-UA 675",
            "course_name": "Jewish Philosophy in The Medieval World",
            "description": "RELST-UA  675 Jewish Philosophy in The Medieval World \nReadings (in translation) and analysis of representative selections from the writings of the major Jewish philosophers of the Middle Ages. Emphasizes the Kuzari of Yehuda Halevi and the Guide to the Perplexed of Moses Maimonides. Special attention is paid to the cultural context in which these works were produced.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 679",
            "course_name": "",
            "description": "RELST-UA  679\n\n   Introduction to Judaism\n\nThis class is intended as a basic introduction to Judaism—its history, beliefs, traditions, and ritual practices—as a living religion from its roots in the biblical, intertestamental, rabbinic, and medieval periods until their appearance in the modern world.  The course is open to students of all backgrounds and all levels of familiarity (or unfamiliarity) with Judaism. Diverse data from various epochs in Jewish religious history will be drawn together in such a way that the student will be able to assess Jewish beliefs, institutions, and practices throughout the centuries.  The aim here will ...\n\n      more description for RELST-UA  679 »\n\n      \n\n\n\nThis class is intended as a basic introduction to Judaism—its history, beliefs, traditions, and ritual practices—as a living religion from its roots in the biblical, intertestamental, rabbinic, and medieval periods until their appearance in the modern world.  The course is open to students of all backgrounds and all levels of familiarity (or unfamiliarity) with Judaism. Diverse data from various epochs in Jewish religious history will be drawn together in such a way that the student will be able to assess Jewish beliefs, institutions, and practices throughout the centuries.  The aim here will not only be to indicate the seminal role that the Bible and rabbinic writings play in Judaism, but also to explore how these texts have been interpreted and applied over the centuries.  Furthermore, continuity and discontinuity will be highlighted so that the student will gain an appreciation of how the Jewish religious tradition has evolved and grown in history.\n\n      less description for RELST-UA  679 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 680",
            "course_name": "Hist of Judaism I: Emerg of Classical Judaism",
            "description": "RELST-UA  680 Hist of Judaism I: Emerg of Classical Judaism \nHistory of Judaism during its formative periods. Hellenistic Judaism, Jewish sectarianism, and the ultimate emergence of the rabbinic system of religion and law.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 681",
            "course_name": "Modern Jewish History",
            "description": "RELST-UA  681 Modern Jewish History",
            "offering": false
        },
        {
            "course_id": "RELST-UA 682",
            "course_name": "Medieval Jewish History",
            "description": "RELST-UA  682 Medieval Jewish History",
            "offering": false
        },
        {
            "course_id": "RELST-UA 683",
            "course_name": "Judaism: from Medieval to Modern Times",
            "description": "RELST-UA  683 Judaism: from Medieval to Modern Times \nIntellectual-historical examination of continuities and discontinuities between medieval and modern Judaism as revealed in selected texts produced during the last thousand years. Emphasis is placed upon how the interactions of Jewish thinkers with the cultures of their surroundings affected their understandings of Judaism.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 684",
            "course_name": "Israel & Zionism",
            "description": "RELST-UA  684 Israel & Zionism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 687",
            "course_name": "Holocaust in Contemp Jewish-Christian Think",
            "description": "RELST-UA  687 Holocaust in Contemp Jewish-Christian Think",
            "offering": false
        },
        {
            "course_id": "RELST-UA 689",
            "course_name": "Judaism in America",
            "description": "RELST-UA  689 Judaism in America",
            "offering": false
        },
        {
            "course_id": "RELST-UA 692",
            "course_name": "Muslim Society",
            "description": "RELST-UA  692 Muslim Society",
            "offering": false
        },
        {
            "course_id": "RELST-UA 694",
            "course_name": "Islam and The West",
            "description": "RELST-UA  694 Islam and The West",
            "offering": false
        },
        {
            "course_id": "RELST-UA 695",
            "course_name": "American Jewish History",
            "description": "RELST-UA  695 American Jewish History",
            "offering": false
        },
        {
            "course_id": "RELST-UA 697",
            "course_name": "Palestine, Zionism, & Israel",
            "description": "RELST-UA  697 Palestine, Zionism, & Israel",
            "offering": false
        },
        {
            "course_id": "RELST-UA 700",
            "course_name": "Top in Crit:Holocaust Li",
            "description": "RELST-UA  700 Top in Crit:Holocaust Li",
            "offering": false
        },
        {
            "course_id": "RELST-UA 703",
            "course_name": "Death and Dying",
            "description": "RELST-UA  703 Death and Dying \nStudy of death in cultural and historical perspectives with particular attention to religious meaning and ritual. The care of those who are dying and rituals of bereavement. Ethical-religious issues concerning the dying.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 706",
            "course_name": "Muslim Spain",
            "description": "RELST-UA  706 Muslim Spain",
            "offering": false
        },
        {
            "course_id": "RELST-UA 713",
            "course_name": "From Hebrew to Israeli Lit (in Translation)",
            "description": "RELST-UA  713 From Hebrew to Israeli Lit (in Translation)",
            "offering": false
        },
        {
            "course_id": "RELST-UA 719",
            "course_name": "Introduction to Ancient Egyptian Religion",
            "description": "RELST-UA  719 Introduction to Ancient Egyptian Religion \nExamines the religious beliefs of the ancient Egyptians, including the nature of the gods, syncretism, private religion, theories of divine kingship, the judgment of the dead, cultic practices, the life of priests, the relationship between this world and the afterlife, wisdom literature as moral thought, festivals, funerary practices, creation myths, and foreign gods and influences?all illustrated by Egyptian religious texts or scenes from temples and tombs.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 721",
            "course_name": "Myth & Ancient Near East",
            "description": "RELST-UA  721 Myth & Ancient Near East",
            "offering": false
        },
        {
            "course_id": "RELST-UA 728",
            "course_name": "Women and Gender in Islam",
            "description": "RELST-UA  728 Women and Gender in Islam",
            "offering": false
        },
        {
            "course_id": "RELST-UA 729",
            "course_name": "Gender,Identity &Society in The Middle East",
            "description": "RELST-UA  729 Gender,Identity &Society in The Middle East",
            "offering": false
        },
        {
            "course_id": "RELST-UA 775",
            "course_name": "Theology of Reformation",
            "description": "RELST-UA  775 Theology of Reformation",
            "offering": false
        },
        {
            "course_id": "RELST-UA 777",
            "course_name": "Christian Attitudes Toward Judaism",
            "description": "RELST-UA  777 Christian Attitudes Toward Judaism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 780",
            "course_name": "Sociology of Religion",
            "description": "RELST-UA  780 Sociology of Religion",
            "offering": false
        },
        {
            "course_id": "RELST-UA 781",
            "course_name": "The Quran and Its Interpretation",
            "description": "RELST-UA  781 The Quran and Its Interpretation",
            "offering": false
        },
        {
            "course_id": "RELST-UA 782",
            "course_name": "Tpcs in Islamic Stds:",
            "description": "RELST-UA  782 Tpcs in Islamic Stds:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 785",
            "course_name": "Seminar:Islamic Law & Society",
            "description": "RELST-UA  785 Seminar:Islamic Law & Society",
            "offering": false
        },
        {
            "course_id": "RELST-UA 786",
            "course_name": "Reason & Faith in Islam",
            "description": "RELST-UA  786 Reason & Faith in Islam",
            "offering": false
        },
        {
            "course_id": "RELST-UA 787",
            "course_name": "Gender & Sexuality in Medieval Islamic Soc",
            "description": "RELST-UA  787 Gender & Sexuality in Medieval Islamic Soc",
            "offering": false
        },
        {
            "course_id": "RELST-UA 790",
            "course_name": "Civilizations & Religion of Ancient Near East",
            "description": "RELST-UA  790 Civilizations & Religion of Ancient Near East \nIntroduction to the ancient Near East. Places the civilizations of Mesopotamia, Egypt, and Anatolia in their historical framework and discusses their institutions.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 800",
            "course_name": "Arthurian Legend",
            "description": "RELST-UA  800 Arthurian Legend",
            "offering": false
        },
        {
            "course_id": "RELST-UA 801",
            "course_name": "God & Man in Arabia: Hist of The Holy Places",
            "description": "RELST-UA  801 God & Man in Arabia: Hist of The Holy Places",
            "offering": false
        },
        {
            "course_id": "RELST-UA 802",
            "course_name": "Honors Sem:Jewish Repres of Christanity - Judaism",
            "description": "RELST-UA  802 Honors Sem:Jewish Repres of Christanity - Judaism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 803",
            "course_name": "Origins of Christianity Apostles to Crusades",
            "description": "RELST-UA  803 Origins of Christianity Apostles to Crusades",
            "offering": false
        },
        {
            "course_id": "RELST-UA 804",
            "course_name": "Honor Seminar: The Bible in Jewish Culture",
            "description": "RELST-UA  804 Honor Seminar: The Bible in Jewish Culture",
            "offering": false
        },
        {
            "course_id": "RELST-UA 807",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17390",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KJCC BSMT",
                    "time": "Tue,Thu 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "Jassen, Alexander"
                }
            ],
            "course_name": "Dead Sea Scrolls: Judaism & Christianity",
            "description": "RELST-UA  807 Dead Sea Scrolls: Judaism & Christianity \nSurvey of the importance of the Dead Sea Scrolls for the history of early Judaism and Christianity. Reading and discussion of English translations of the major texts.",
            "offering": true
        },
        {
            "course_id": "RELST-UA 809",
            "course_name": "Modern Perspectives On The Bible",
            "description": "RELST-UA  809 Modern Perspectives On The Bible \nIntroduces students to the modern study of the Bible from historical, literary, and archeological points of view. Reading and analysis of texts in translation.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 810",
            "course_name": "Jerusalem:The City, The Shrine & The Conflict",
            "description": "RELST-UA  810 Jerusalem:The City, The Shrine & The Conflict",
            "offering": false
        },
        {
            "course_id": "RELST-UA 815",
            "course_name": "Gender & Judaism",
            "description": "RELST-UA  815 Gender & Judaism \nInvestigates the ways in which Jews have constructed gender during the rabbinic, medieval, and modern periods. Examines the implication of these constructions for the religious and social lives of Jewish women and men.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 820",
            "course_name": "Women in Religion",
            "description": "RELST-UA  820 Women in Religion",
            "offering": false
        },
        {
            "course_id": "RELST-UA 825",
            "course_name": "Women in Hinduism & Buddhism",
            "description": "RELST-UA  825 Women in Hinduism & Buddhism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 829",
            "course_name": "Religion & World View",
            "description": "RELST-UA  829 Religion & World View \nExamines the cultural nature of basic beliefs and values manifested in both simple and complex societies. Discussion of time and space, causality, myth, prophecy and divination, witchcraft and magic, and mysticism.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 830",
            "course_name": "Religion and Literature:",
            "description": "RELST-UA  830 Religion and Literature:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 831",
            "course_name": "World Mythology",
            "description": "RELST-UA  831 World Mythology",
            "offering": false
        },
        {
            "course_id": "RELST-UA 832",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "8889",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "TISC LC9",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Kelley, Christopher"
                }
            ],
            "course_name": "Intro to Buddhism",
            "description": "RELST-UA  832 Intro to Buddhism \nAn introduction to this complex religion, emphasizing its history, teachings, and practices. Discusses its doctrinal development in India, then emphasizes certain local practices: Buddhism and the family in China; Buddhism, language, and hierarchy in Japan; the politics of Buddhist Tibet; and Buddhist art. Finally the course touches on Buddhism in the United States.",
            "offering": true
        },
        {
            "course_id": "RELST-UA 835",
            "course_name": "",
            "description": "RELST-UA  835\n\n   Tibetan Buddhism\n\nIdentical to EAST-UA 833. Offered periodically. 4 points.\nAn introduction to Tibetan Buddhism doctrine and practice. Approaches the subject from historical and thematic perspectives, beginning with a close study of one of the classic Tibetan guides to Tibetan Buddhism for a solid foundation in the principles of the tradition. Proceeds along a historical track, beginning with the seventh-century arrival of Buddhism in Tibet to the present-day encounter with Western devotees of exiled Tibetan lamas. Topics include doctrinal innovation, ritual, myth, art, sacred geography, revelation, and the rol...\n\n      more description for RELST-UA  835 »\n\n      \n\n\n\nIdentical to EAST-UA 833. Offered periodically. 4 points.\nAn introduction to Tibetan Buddhism doctrine and practice. Approaches the subject from historical and thematic perspectives, beginning with a close study of one of the classic Tibetan guides to Tibetan Buddhism for a solid foundation in the principles of the tradition. Proceeds along a historical track, beginning with the seventh-century arrival of Buddhism in Tibet to the present-day encounter with Western devotees of exiled Tibetan lamas. Topics include doctrinal innovation, ritual, myth, art, sacred geography, revelation, and the role of Buddhism in Tibet’s relationship with its neighbors. Readings consist of primary texts in translation and secondary literature on the study of religion and Tibetan Buddhism.\n\n      less description for RELST-UA  835 «",
            "offering": false
        },
        {
            "course_id": "RELST-UA 843",
            "course_name": "Jesus and His Times",
            "description": "RELST-UA  843 Jesus and His Times \nIntroduces students to the modern quest to separate the historical, human Jesus from the unreliable accounts of his behavior and teaching in the early Christian gospels. The background of this ?quest? and its key techniques are surveyed in the first portion of the course; the remainder is spent applying these techniques to two very unusual ancient Christian writings: the sayings gospel ?Q? and the Gnostic Gospel of Thomas.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 844",
            "course_name": "Jesus & The Gospel Writings",
            "description": "RELST-UA  844 Jesus & The Gospel Writings",
            "offering": false
        },
        {
            "course_id": "RELST-UA 845",
            "course_name": "Early Christian Gnosticism",
            "description": "RELST-UA  845 Early Christian Gnosticism",
            "offering": false
        },
        {
            "course_id": "RELST-UA 846",
            "course_name": "Christianity in the Later Roman Empire",
            "description": "RELST-UA  846 Christianity in the Later Roman Empire",
            "offering": false
        },
        {
            "course_id": "RELST-UA 848",
            "course_name": "Orthodoxy & Confession in Russian Hist & Cultr",
            "description": "RELST-UA  848 Orthodoxy & Confession in Russian Hist & Cultr",
            "offering": false
        },
        {
            "course_id": "RELST-UA 850",
            "course_name": "Keys to The Kingdon: Unlock Medieval Christ",
            "description": "RELST-UA  850 Keys to The Kingdon: Unlock Medieval Christ",
            "offering": false
        },
        {
            "course_id": "RELST-UA 855",
            "course_name": "Life and Letters of Paul",
            "description": "RELST-UA  855 Life and Letters of Paul",
            "offering": false
        },
        {
            "course_id": "RELST-UA 860",
            "course_name": "Art in The Islamic World",
            "description": "RELST-UA  860 Art in The Islamic World",
            "offering": false
        },
        {
            "course_id": "RELST-UA 863",
            "course_name": "Sufis: Mystics in Islam",
            "description": "RELST-UA  863 Sufis: Mystics in Islam \nReadings in the Sufi poets in translation and reflections of their influence in Persian literature and the European tradition. Sufism as one of the primary manifestations of the Islamic spirit in Iran. The effect of Sufism (the hidden path that leads from the individual to God) on the shape of Islam, on the spirit of Persian literature and art, and on Western religious sensibilities.",
            "offering": false
        },
        {
            "course_id": "RELST-UA 868",
            "course_name": "Acting Medieval Lit",
            "description": "RELST-UA  868 Acting Medieval Lit",
            "offering": false
        },
        {
            "course_id": "RELST-UA 888",
            "course_name": "Advanced Seminar in Religious Studies",
            "description": "RELST-UA  888 Advanced Seminar in Religious Studies",
            "offering": false
        },
        {
            "course_id": "RELST-UA 950",
            "course_name": "Marginality & Community in The Middle Ages",
            "description": "RELST-UA  950 Marginality & Community in The Middle Ages",
            "offering": false
        },
        {
            "course_id": "RELST-UA 951",
            "course_name": "Spanish Mystics",
            "description": "RELST-UA  951 Spanish Mystics",
            "offering": false
        },
        {
            "course_id": "RELST-UA 980",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "7447",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship",
            "description": "RELST-UA  980 Internship \nPrerequisite: permission of the instructor. 1 to 4 points.",
            "offering": true
        },
        {
            "course_id": "RELST-UA 981",
            "course_name": "Internship",
            "description": "RELST-UA  981 Internship",
            "offering": false
        },
        {
            "course_id": "RELST-UA 982",
            "course_name": "The Reformation",
            "description": "RELST-UA  982 The Reformation",
            "offering": false
        },
        {
            "course_id": "RELST-UA 983",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "8890",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "Topics:",
            "description": "RELST-UA  983 Topics:",
            "offering": true
        },
        {
            "course_id": "RELST-UA 986",
            "course_name": "Introduction to Medieval Philosophy",
            "description": "RELST-UA  986 Introduction to Medieval Philosophy",
            "offering": false
        },
        {
            "course_id": "RELST-UA 990",
            "course_name": "Medieval Manuscript and Book of Hours",
            "description": "RELST-UA  990 Medieval Manuscript and Book of Hours",
            "offering": false
        },
        {
            "course_id": "RELST-UA 991",
            "course_name": "Seminar:",
            "description": "RELST-UA  991 Seminar:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 992",
            "course_name": "Pagan Mythology in The Christain World",
            "description": "RELST-UA  992 Pagan Mythology in The Christain World",
            "offering": false
        },
        {
            "course_id": "RELST-UA 993",
            "course_name": "The Kiss",
            "description": "RELST-UA  993 The Kiss",
            "offering": false
        },
        {
            "course_id": "RELST-UA 994",
            "course_name": "Renaissance Philosophy",
            "description": "RELST-UA  994 Renaissance Philosophy",
            "offering": false
        },
        {
            "course_id": "RELST-UA 995",
            "course_name": "The Wisdom Tradition",
            "description": "RELST-UA  995 The Wisdom Tradition",
            "offering": false
        },
        {
            "course_id": "RELST-UA 996",
            "course_name": "Aristotle and Averroes",
            "description": "RELST-UA  996 Aristotle and Averroes",
            "offering": false
        },
        {
            "course_id": "RELST-UA 997",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "7448",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study",
            "description": "RELST-UA  997 Independent Study \nPrerequisite: permission of the instructor. 1 to 4 points.",
            "offering": true
        },
        {
            "course_id": "RELST-UA 998",
            "course_name": "Independent Study",
            "description": "RELST-UA  998 Independent Study",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9085",
            "course_name": "What is Islam?",
            "description": "RELST-UA 9085 What is Islam?",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9270",
            "course_name": "Seminar:",
            "description": "RELST-UA 9270 Seminar:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9313",
            "course_name": "Seminar:",
            "description": "RELST-UA 9313 Seminar:",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9360",
            "course_name": "Religion, Culture, & Politics in Cent Europe",
            "description": "RELST-UA 9360 Religion, Culture, & Politics in Cent Europe",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9613",
            "course_name": "Religion, Pol & State in Compartv Perspectv",
            "description": "RELST-UA 9613 Religion, Pol & State in Compartv Perspectv",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9650",
            "course_name": "Holy People, Holy Places",
            "description": "RELST-UA 9650 Holy People, Holy Places",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9671",
            "course_name": "Magic, Religion & Inquisition",
            "description": "RELST-UA 9671 Magic, Religion & Inquisition",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9672",
            "course_name": "Mediev Church: Religious Hist of Crisis & Creativ",
            "description": "RELST-UA 9672 Mediev Church: Religious Hist of Crisis & Creativ",
            "offering": false
        },
        {
            "course_id": "RELST-UA 9888",
            "course_name": "Medieval Art& Pilgrimage Routes of The Millenium",
            "description": "RELST-UA 9888 Medieval Art& Pilgrimage Routes of The Millenium",
            "offering": false
        }
    ]
}