{
    "major_id": "SCNC1-UC",
    "file": "./2015-2016/Science_(SCNC1-UC).html",
    "courses": [
        {
            "course_id": "SCNC1-UC 2001",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9915",
                    "section": "001",
                    "period": "09/08/2015 - 12/22/2015",
                    "location": "194M 206",
                    "time": "Tue 3.30 PM - 6.00 PM",
                    "open": true,
                    "professor": "Riftina, Faina"
                }
            ],
            "course_name": "",
            "description": "SCNC1-UC 2001\n\n   Human Biology\n\nThis course focuses on the biological events that take place in the human body. It discusses such fundamental processes as cellular respiration and the role of DNA as the source of genetic inheritance. Other lecture topics include the internal organization of the human body; cell structure and functions; stem cells and their medical potential; tissues; and skin. Students also study the physiology of the digestive system and nutrition, the cardiovascular and respiratory systems, blood, and the reproductive system. As appropriate, laboratory work is used to complement and reinforce the lecture m...\n\n      more description for SCNC1-UC 2001 »\n\n      \n\n\n\nThis course focuses on the biological events that take place in the human body. It discusses such fundamental processes as cellular respiration and the role of DNA as the source of genetic inheritance. Other lecture topics include the internal organization of the human body; cell structure and functions; stem cells and their medical potential; tissues; and skin. Students also study the physiology of the digestive system and nutrition, the cardiovascular and respiratory systems, blood, and the reproductive system. As appropriate, laboratory work is used to complement and reinforce the lecture material.\n\n      less description for SCNC1-UC 2001 «",
            "offering": true
        },
        {
            "course_id": "SCNC1-UC 2102",
            "course_name": "Intro to Chemistry",
            "description": "SCNC1-UC 2102 Intro to Chemistry \nInsights into the characteristics of physical substances, the origin of the universe, the evolution of the earth, and the chemistry of life developed through the study of chemical structure. The chemist's concept of molecular architecture and forces is presented and employed to explain the physical and chemical properties of such fundamental substances as water, fuels, drugs, RNA, and DNA. Lectures, class discussions, and laboratories are closely coordinated. Registration for the laboratory section (0 Credits",
            "offering": false
        },
        {
            "course_id": "SCNC1-UC 2104",
            "course_name": "",
            "description": "SCNC1-UC 2104\n\n   The Physics of Everyday Life\n\nThe course is an introduction to physics for students who are not majoring in math or science. Using case studies focused on everyday objects and phenomena, students learn the basic principles that govern these phenomena and how they are interrelated. Topics include Newton's Laws of motion, friction, energy, equilibrium, pressure, density, temperature, Archimedes' Principle, buoyant force, ideal gas law, harmonic oscillators, simple harmonic motion, frequency, transverse and longitudinal waves, frequency and wavelength in mechanical waves, superimposition, Doppler effect, dispersion, refractio...\n\n      more description for SCNC1-UC 2104 »\n\n      \n\n\n\nThe course is an introduction to physics for students who are not majoring in math or science. Using case studies focused on everyday objects and phenomena, students learn the basic principles that govern these phenomena and how they are interrelated. Topics include Newton's Laws of motion, friction, energy, equilibrium, pressure, density, temperature, Archimedes' Principle, buoyant force, ideal gas law, harmonic oscillators, simple harmonic motion, frequency, transverse and longitudinal waves, frequency and wavelength in mechanical waves, superimposition, Doppler effect, dispersion, refraction, and interference in mechanical waves. Students gain first-hand experience of natural phenomena through classroom demonstrations.\n\n      less description for SCNC1-UC 2104 «",
            "offering": false
        },
        {
            "course_id": "SCNC1-UC 3203",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9918",
                    "section": "200",
                    "period": "09/02/2015 - 12/22/2015 ",
                    "location": "Roberts, Godfrey",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SCNC1-UC 3203\n\n   Environmental Sustainability\n\nIn this course students  review the current unsustainable path of the global environment and explore ways of shifting to a sustainable one that stabilizes population, reverses problems with climate change and pollution, and establishes a global society dependent on renewable energy sources such as hydrogen, solar, and other energy options.  Ways to reverse the negative human ecological footprint on the earth's precious resources (such as water, air and soil) are examined. Major future challenges such as poverty, hunger, emerging and reemerging diseases, threats to biodiversity, species extinct...\n\n      more description for SCNC1-UC 3203 »\n\n      \n\n\n\nIn this course students  review the current unsustainable path of the global environment and explore ways of shifting to a sustainable one that stabilizes population, reverses problems with climate change and pollution, and establishes a global society dependent on renewable energy sources such as hydrogen, solar, and other energy options.  Ways to reverse the negative human ecological footprint on the earth's precious resources (such as water, air and soil) are examined. Major future challenges such as poverty, hunger, emerging and reemerging diseases, threats to biodiversity, species extinction, domestication of food crops as well as biotechnology and genetically modified foods are discussed.\n\n      less description for SCNC1-UC 3203 «",
            "offering": true
        },
        {
            "course_id": "SCNC1-UC 3207",
            "course_name": "Stars, Planets, & Life",
            "description": "SCNC1-UC 3207 Stars, Planets, & Life \nThis course deals with the history of events in the cosmos leading up to the formation of the solar system and the appearance of life on the earth. Topics include the origin of the universe; the birth and death of stars; properties of the earth, moon, Mars, and Venus as observed by earth-bound and spacecraft observations; the origin and history of life on the earth; the impact of astronomical and geological changes on biological evolution; life and intelligence in the cosmos; and philosophical implications in the synthesis of astronomy, earth sciences, and the history of life.",
            "offering": false
        },
        {
            "course_id": "SCNC1-UC 3208",
            "course_name": "Human Genetics:  Contemporary Issues",
            "description": "SCNC1-UC 3208 Human Genetics:  Contemporary Issues",
            "offering": false
        },
        {
            "course_id": "SCNC1-UC 3215",
            "course_name": "Biology of Hunger & Population",
            "description": "SCNC1-UC 3215 Biology of Hunger & Population \nThis course explores human population change and the challenge to improve the quantity and quality of food crops. Topics include contemporary issues in plant genetics, crop biotechnology, and the genetic modification of food crops; the consequences of local and global hunger and the increasing gap between the affluent and the poor; and ethical and human rights issues in population policy, food production, and hunger.",
            "offering": false
        },
        {
            "course_id": "SCNC1-UC 3218",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17111",
                    "section": "001",
                    "period": "09/03/2015 - 12/17/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "SILV 403"
                }
            ],
            "course_name": "Darwin to DNA: An Overview of Evolution",
            "description": "SCNC1-UC 3218 Darwin to DNA: An Overview of Evolution \nThis course leads students on a broad exploration of evolutionary science. Students review the history of evolutionary thought and science; genetics; the man mechanisms and forces that drive evolution; and the tools and findings of evolutionary research, including the evolution of humans and human behavior.",
            "offering": true
        },
        {
            "course_id": "SCNC1-UC 3222",
            "course_name": "Diseases: Emerging and Re-Emerging",
            "description": "SCNC1-UC 3222 Diseases: Emerging and Re-Emerging \nExamination of the biological, social, and policy issues related to emerging and re-emerging human diseases. Major diseases such as HIV/AIDS, Lyme Disease, Lassa, Marburg, Ebola, Mad Cow Disease, and West Nile Virus are among the diseases discussed in the course.",
            "offering": false
        },
        {
            "course_id": "SCNC1-UC 3250",
            "course_name": "Environmntal Restoration",
            "description": "SCNC1-UC 3250 Environmntal Restoration",
            "offering": false
        },
        {
            "course_id": "SCNC1-UC 3290",
            "course_name": "Special Topics in Science:",
            "description": "SCNC1-UC 3290 Special Topics in Science:",
            "offering": false
        }
    ]
}