{
    "major_id": "SMSP-AD",
    "file": "./2015-2016/Sheikh_Mohamed_bin_Zayed_ScholarsProgram_(SMSP-AD).html",
    "courses": [
        {
            "course_id": "SMSP-AD 100",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12752",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SMSP-AD  100\n\n   The American Supreme Court’s Treatment of the Relationship between Religion and Government\n\nThis course is taught by John Sexton, President of NYU and former Dean of NYU’s Law School.  It will focus on a topic on which he has been a major academic voice: the relationship of government and religion, with a particular emphasis on the way the United States, acting principally through its Supreme Court, has addressed this issue.  President Sexton has taught this course for twenty years to undergraduates at NYU; it is designed to familiarize students with the workings of the American Constitutional system (especially the role of the courts), and to teach the skills of critical analysis, c...\n\n      more description for SMSP-AD  100 »\n\n      \n\n\n\nThis course is taught by John Sexton, President of NYU and former Dean of NYU’s Law School.  It will focus on a topic on which he has been a major academic voice: the relationship of government and religion, with a particular emphasis on the way the United States, acting principally through its Supreme Court, has addressed this issue.  President Sexton has taught this course for twenty years to undergraduates at NYU; it is designed to familiarize students with the workings of the American Constitutional system (especially the role of the courts), and to teach the skills of critical analysis, close reading of text, and persuasive writing.  Because the course moves beyond the substance of the material to the broader intellectual skills involved, it appeals to students in a wide range of disciplines.  Students must be prepared to invest a great deal of time preparing for class; a written paper of five to six pages is required for most classes, and the readings for each class are extensive.  Additionally, they must be willing to participate in the classroom debate and be subject to rigorous questioning by the professor.  President Sexton’s teaching team includes two American trained attorneys who will work with scholars in developing the important skills of critical thinking and persuasive writing.\n\n      less description for SMSP-AD  100 «",
            "offering": true
        },
        {
            "course_id": "SMSP-AD 101",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12753",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SMSP-AD  101\n\n   U.S. Foreign Policy\n\nThis course will examine the themes, influences, and controversies in the development and execution of U.S. foreign policy over the past 100 years. Moving chronologically, the instructor will cover six key periods in which the United States has had to define and redefine its role in the world. Students will learn how successive generations have found very different solutions to the tension between the “national interest” and idealism, and between “unilateralism” and working with international institutions. The class will weigh the success and failure of these policies, as a prelude to understa...\n\n      more description for SMSP-AD  101 »\n\n      \n\n\n\nThis course will examine the themes, influences, and controversies in the development and execution of U.S. foreign policy over the past 100 years. Moving chronologically, the instructor will cover six key periods in which the United States has had to define and redefine its role in the world. Students will learn how successive generations have found very different solutions to the tension between the “national interest” and idealism, and between “unilateralism” and working with international institutions. The class will weigh the success and failure of these policies, as a prelude to understanding and assessing the foreign policy of President Obama, which is subject to many of the same forces which have shaped earlier policy, but in a very different world.\n\n      less description for SMSP-AD  101 «",
            "offering": true
        },
        {
            "course_id": "SMSP-AD 103",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12754",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SMSP-AD  103\n\n   English Enrichment\n\nIn this year-long onsite and online course, students practice critical thinking by writing on questions that arise in their courses on judicial politics, American foreign policy and U.S. elections, receive frequent written feedback on essay assignments, and through extensive practice, learn to self-edit and become better writers. In addition, students participate in an online community where they reflect and share insights on their experience in the SMSP program. The course includes: a one-on-one assessment of writing competency at the beginning of the year, a mid-year check-in and three on-si...\n\n      more description for SMSP-AD  103 »\n\n      \n\n\n\nIn this year-long onsite and online course, students practice critical thinking by writing on questions that arise in their courses on judicial politics, American foreign policy and U.S. elections, receive frequent written feedback on essay assignments, and through extensive practice, learn to self-edit and become better writers. In addition, students participate in an online community where they reflect and share insights on their experience in the SMSP program. The course includes: a one-on-one assessment of writing competency at the beginning of the year, a mid-year check-in and three on-site class meetings (September, October, and January).\n\nThe online section of the course is hosted on NYU SCPS. This site also serves as a central repository for course materials, activities and grades for the entire SMSP program.\n\nThis course provides seven in-person sessions designed to help students improve their public speaking skills and prepare for the public presentations of topics and ideas in diverse settings. The course offers intensive feedback and correction on students' spoken English and includes videotaping of formal and informal presentations to provide students a record of their progress. Final presentations will be assessed by a panel of judges.\n\n      less description for SMSP-AD  103 «",
            "offering": true
        },
        {
            "course_id": "SMSP-AD 104",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12755",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SMSP-AD  104\n\n   Leadership Course: What Makes a Great Leader?\n\nThis leadership development program explores some of the ways in which leaders, particularly over the past two centuries, have arisen in a number of settings. The seminar will stimulate thinking through readings and discussion about leadership theories, research, and trends, as well as notable figures from the past and present in a variety of settings. Readings include selections from biography, analysis and commentary, history, and autobiography. The seminar also features private sessions with prominent leadership figures from the UAE and the United States who will discuss their views, experi...\n\n      more description for SMSP-AD  104 »\n\n      \n\n\n\nThis leadership development program explores some of the ways in which leaders, particularly over the past two centuries, have arisen in a number of settings. The seminar will stimulate thinking through readings and discussion about leadership theories, research, and trends, as well as notable figures from the past and present in a variety of settings. Readings include selections from biography, analysis and commentary, history, and autobiography. The seminar also features private sessions with prominent leadership figures from the UAE and the United States who will discuss their views, experiences, and firsthand observations about leadership. Over the past three years, the Scholars have met with notable leaders in the UAE.\n\n      less description for SMSP-AD  104 «",
            "offering": true
        }
    ]
}