{
    "major_id": "SOCY1-UC",
    "file": "./2015-2016/Sociology_(SOCY1-UC).html",
    "courses": [
        {
            "course_id": "SOCY1-UC 7200",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "9768",
                    "section": "001",
                    "period": "09/02/2015 - 12/16/2015",
                    "location": null,
                    "time": "Wed 12.30 PM - 3.00 PM",
                    "open": true,
                    "professor": "GCASL 375"
                }
            ],
            "course_name": "Intro to Sociology",
            "description": "SOCY1-UC 7200 Intro to Sociology \nA study of society, social groups, and culture, and an introduction to sociological theory as a means for interpreting and understanding social human behavior. Topics of discussion include the process of social and cultural change, social structure and stratification, social institutions and politics, social roles and gender, the family, and social control.",
            "offering": true
        },
        {
            "course_id": "SOCY1-UC 7201",
            "course_name": "Contemporary Social Theory",
            "description": "SOCY1-UC 7201 Contemporary Social Theory \nThis course offers an examination of 20th century theory in the social sciences, focusing on contributions from symbolic interactionism, neo-Marxism, structuralism, cultural materialism, feminism, social constructionism, and postmodernism. Students evaluate the contribution of these theories to the meaning, analysis, and interpretation of social and cultural institutions, ideologies, and behavior.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7202",
            "course_name": "History of Social Thought",
            "description": "SOCY1-UC 7202 History of Social Thought \nThis course explores the ways in which social change in the 19th and 20th centuries gave rise to the intellectual responses that would form the basis of the social theory that informs the contemporary academic fields of sociology and anthropology. The works of major social theorists are considered in order to reveal such central concepts as social class and social stratification; power, authority and institutions; and social change.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7203",
            "course_name": "Constructing & Deconstuc Race",
            "description": "SOCY1-UC 7203 Constructing & Deconstuc Race",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7247",
            "course_name": "Race & Ethnicity in NYC",
            "description": "SOCY1-UC 7247 Race & Ethnicity in NYC \nExplores the history and changing character of race and ethnic relations in New York, with special attention on new West Indian immigrants. Specific topics include the role of politics, culture, and religion within the lives of new immigrants, the emergence of distinct ethnic neighborhoods, relations with white Americans and African-Americans, and the multifaceted contributions of new immigrants to the city's history and culture.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7248",
            "course_name": "Social Issues in American Society",
            "description": "SOCY1-UC 7248 Social Issues in American Society \nThis course provides an analysis of a selected set of social issues and social problems in American society. The course also examines the political, economic, and cultural structures that generate and shape these problems. Topics may include problems in education, changes in the workplace, healthcare and problems of the elderly, technology, multiculturalism, and others.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7250",
            "course_name": "Inequality in Society",
            "description": "SOCY1-UC 7250 Inequality in Society \nThis course is an in-depth introduction to the key sociological categories of race, class, and gender. The course explores the classical and contemporary theories of social stratification and inequality as well as contemporary trends in the distribution of wealth, income, and education in the U.S. It addresses the social and historical construction of race and ethnicity, gender roles, and class categorical differences.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7251",
            "course_name": "Social Movements",
            "description": "SOCY1-UC 7251 Social Movements \nThis course explores the sociological roots of political action, such as the relevance of race, ethnicity, age, gender, and occupation. It raises questions of political concern about the participants, leaders, and who is different in those categories.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7252",
            "course_name": "Sociology of Groups and Organizations",
            "description": "SOCY1-UC 7252 Sociology of Groups and Organizations \nExamples of complex organizations include schools, places of employment, the military, and churches. This course examines types of organizations, organizational goals and outcomes, institutional authority and structure, organizational change, and organizational fields. Students learn to develop an analytical framework and apply it to specific complex organizations.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7254",
            "course_name": "Social Deviance",
            "description": "SOCY1-UC 7254 Social Deviance \nThis course examines deviance as a social process involving many divergent yet intersecting segments of society. To explain this process, the course focuses on individual pathology, value-conflict, social disorganization, and functionalist theories of deviation.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7255",
            "course_name": "Criminology",
            "description": "SOCY1-UC 7255 Criminology \nThis course examines the creation of criminal laws and their enforcement by police, the courts, prisons, probation and parole boards, and other agencies. Also discussed are criminal behavior systems, theories of crime and delinquency causation, victimization, the presentation of crime in the media, and the policy questions these issues raise.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7256",
            "course_name": "Families, Marriage and Kinship",
            "description": "SOCY1-UC 7256 Families, Marriage and Kinship \nThis course provides a historical and cross-cultural perspective on the nature and foundation of the family and other kinship systems. Students trace and assess the sources and implications of changes in the American family unit. The focus is on ways in which the families and kinship systems shape individuals and affect the structure of society.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7262",
            "course_name": "History of Capitalism",
            "description": "SOCY1-UC 7262 History of Capitalism \nThe coming of modern society has involved a shift from an agricultural economy in the Middle Ages to the capitalism of industrial society. In examining that development, this course is concerned with such topics as changes in the relationship between production and work, social class relationships and social change, the nature of city life under capitalism, the development and characteristics of modern consciousness, and political relationships.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7263",
            "course_name": "Sociology of Development in Global Perspective",
            "description": "SOCY1-UC 7263 Sociology of Development in Global Perspective \nThis course provides an analysis of major issues related to the economic, political, and social transformation of developing countries. The course examines theories of development and underdevelopment, history of linkages of the developed and underdeveloped world, the role of the state, class structure, ideology and political mobilization, peasantry and rural development, urbanization and marginality, revolutionary movements, and the agents, goals, paths, and prospects of development.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7268",
            "course_name": "Sexuality & Society",
            "description": "SOCY1-UC 7268 Sexuality & Society \nThis course explores the relationship between sexuality and society in historically and cross cultural contexts. It examines the biological bases of sexuality and the social construction of gender identities, including heterosexual, bisexual, lesbian, and gay. It presents the history of sexual liberation social movements in the 19th and 20th century and contemporary sexuality issues as viewed by sociology, anthropology, feminist, and gay studies.",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7269",
            "course_name": "",
            "description": "SOCY1-UC 7269\n\n   Religion, Power & Social Change\n\nThis course introduces the sociology of religion and a comparative analysis of religion in the modern world. It begins with an overview of classical approaches within the social scientific study of religion, including historical, anthropological, and sociological perspectives. It then examines contemporary approaches with an emphasis on the role of religions within social movements, social contestation, and social change. Specific topics include the Enlightenment critique of religion, the secularization debate, the resurgence of religion in late modernity, and new and emergent religious moveme...\n\n      more description for SOCY1-UC 7269 »\n\n      \n\n\n\nThis course introduces the sociology of religion and a comparative analysis of religion in the modern world. It begins with an overview of classical approaches within the social scientific study of religion, including historical, anthropological, and sociological perspectives. It then examines contemporary approaches with an emphasis on the role of religions within social movements, social contestation, and social change. Specific topics include the Enlightenment critique of religion, the secularization debate, the resurgence of religion in late modernity, and new and emergent religious movements.\n\n      less description for SOCY1-UC 7269 «",
            "offering": false
        },
        {
            "course_id": "SOCY1-UC 7290",
            "course_name": "Sp Tpcs in Sociology",
            "description": "SOCY1-UC 7290 Sp Tpcs in Sociology \nThis course provides intensive study of specific topics in sociology, focusing on a different theme or topic each semester. Example topics are social policy in the United States, sociology of work and occupations, comparative urban sociology, and sociology of revolutions. The specific topic is listed in each semester's schedule.",
            "offering": false
        }
    ]
}