{
    "major_id": "SOCS-SHU",
    "file": "./2015-2016/Social_Science_(SOCS-SHU).html",
    "courses": [
        {
            "course_id": "SOCS-SHU 50",
            "course_name": "Istanbul",
            "description": "SOCS-SHU   50 Istanbul",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 100",
            "course_name": "",
            "description": "SOCS-SHU  100\n\n   Public Speaking in a Leadership Context\n\nThe purpose of this course is to provide a competitively chosen cohort of NYUSH sophomores with at least a 3.0 GPA a unique opportunity to practice and improve their public speaking and public presentation skills within a leadership development context. All students will take the class together and enrollment is capped at 24 students.  Students will submit applications to the class during the summer of 2014, stating the reasons for their interest, and receive word of their selection by the NYUSH administration by mid-August. Students will be instructed on various public speaking tips and will ...\n\n      more description for SOCS-SHU  100 »\n\n      \n\n\n\nThe purpose of this course is to provide a competitively chosen cohort of NYUSH sophomores with at least a 3.0 GPA a unique opportunity to practice and improve their public speaking and public presentation skills within a leadership development context. All students will take the class together and enrollment is capped at 24 students.  Students will submit applications to the class during the summer of 2014, stating the reasons for their interest, and receive word of their selection by the NYUSH administration by mid-August. Students will be instructed on various public speaking tips and will be given assignments outside of class and various exercises in class to learn what goes into an effective speech or presentation and how to enhance their public speaking skills. They will read, listen to, and analyze some of the world’s greatest speeches; take part in both individual and team-based public speaking exercises; and receive detailed feedback from the instructor and classmates on content, style, organization, and delivery. The aims are that by the conclusion of the class, students will be familiar with numerous different types of speeches and presentations, will understand how leaders can use their public speaking skills to good effect, will have learned both how to employ positive speech techniques and to minimize negative speech habits, and will have more confidence in their own public speaking ability.\nThe course will be offered for 2 credit hours. Attendance is mandatory, as no part can be repeated or replicated.\nInstructor\nThis course will be led by Diane C. Yu, Esq., the Deputy President of NYU, based in New York. She has taught the University Leadership Honors Course at NYU in NY since 2002 and has been teaching a leadership class in Abu Dhabi to the Sheikh Mohamed bin Zayed Scholars since 2008 and the Leadership and Public Speaking class at the NYUAD Summer Academy since 2011. Prior to her NYU arrival in 2001 she had been a successful lawyer in the U.S. (Managing Counsel for a large corporation, General Counsel to the State Bar of California, White House Fellow, Superior Court Commissioner in California, and in private law practice). She argued and won over 30 cases in the California Supreme Court and one case in the U.S. Supreme Court, and formerly chaired the American Bar Association Commission on Women in the Profession and the ABA Section of Legal Education and Admissions to the Bar. Contact: diane.yu@nyu.edu or 212/998-2340.\n\n      less description for SOCS-SHU  100 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 129",
            "course_name": "",
            "description": "SOCS-SHU  129\n\n   Taboo and Pollution\n\nThis course is an in-depth introduction to the study of taboo, dirt, and cleanliness. We'll examine a range of actual examples from around the world, including taboos around sexuality, hair, and blood; food taboos, and other taboos governing religious practices; disgust, fear, and avoidance; modern and contemporary conceptions of hygiene, filth, and waste treatment; as well as the ideas underlying racism and social purity, built on the logic of taboo. We'll survey and discuss a wealth of writings, including the latest attempts to re-think and understand the classic topic of taboo. This is main...\n\n      more description for SOCS-SHU  129 »\n\n      \n\n\n\nThis course is an in-depth introduction to the study of taboo, dirt, and cleanliness. We'll examine a range of actual examples from around the world, including taboos around sexuality, hair, and blood; food taboos, and other taboos governing religious practices; disgust, fear, and avoidance; modern and contemporary conceptions of hygiene, filth, and waste treatment; as well as the ideas underlying racism and social purity, built on the logic of taboo. We'll survey and discuss a wealth of writings, including the latest attempts to re-think and understand the classic topic of taboo. This is mainly through anthropology (Valeri, Douglas, Steiner, and other authors) but also through crucial contributions from psychology and literary studies (Freud, Kristeva, and others). Students will engage in research and writing, including on their own personal experiences of taboo and pollution.\n\n      less description for SOCS-SHU  129 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 131",
            "course_name": "",
            "description": "SOCS-SHU  131\n\n   China and International Law\n\nChina’s emergence as a ubiquitous player in world politics brings it into sustained contact with the existing world order, held together—sometimes tightly, sometimes loosely—by international law on a number of issue areas. This course considers international law and Chinese politics in a few key areas in an effort to appreciate that fact. The course has two main objectives: to deliver an interdisciplinary approach to international law marked by a discussion of China’s domestic politics and foreign relations, and to help you to develop the ability to do original, analytical research that’s rele...\n\n      more description for SOCS-SHU  131 »\n\n      \n\n\n\nChina’s emergence as a ubiquitous player in world politics brings it into sustained contact with the existing world order, held together—sometimes tightly, sometimes loosely—by international law on a number of issue areas. This course considers international law and Chinese politics in a few key areas in an effort to appreciate that fact. The course has two main objectives: to deliver an interdisciplinary approach to international law marked by a discussion of China’s domestic politics and foreign relations, and to help you to develop the ability to do original, analytical research that’s relevant to the topics at hand. We will first introduce public international law and ground it in theories of international relations and Chinese politics. We will then explore how China and other countries create and navigate law regarding state rights and duties, human rights, environmental protection, the global economy, war and war-fighting, and territorial disputes.\n\n      less description for SOCS-SHU  131 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 132",
            "course_name": "",
            "description": "SOCS-SHU  132\n\n   Shanghai: Urban Planning and Development of a Twenty-First Century Global City\n\nShanghai continues to encounter the challenges and opportunities of a precipitously urbanizing geography, as urban planning has changed from being a socialist provider of goods and welfare to a supporter of China’s expansion through the new “reform and opening up” market economy. In this course, we will delve into the economic, political, and cultural roles of cities, with a special focus on Shanghai – probably the best living laboratory to study urban planning in the world. In order to understand Shanghai in a theoretical context, two sets of readings will be introduced for each topic: classi...\n\n      more description for SOCS-SHU  132 »\n\n      \n\n\n\nShanghai continues to encounter the challenges and opportunities of a precipitously urbanizing geography, as urban planning has changed from being a socialist provider of goods and welfare to a supporter of China’s expansion through the new “reform and opening up” market economy. In this course, we will delve into the economic, political, and cultural roles of cities, with a special focus on Shanghai – probably the best living laboratory to study urban planning in the world. In order to understand Shanghai in a theoretical context, two sets of readings will be introduced for each topic: classic writings in the field of urban studies/planning/sociology, architecture, history, and writings specific to Shanghai. This theoretical context will be heavily supplemented by a series of hand-on field trips, taking full advantage of Shanghai as our planning laboratory. The goal of this course is to introduce students to urban design, urban studies and city planning, as well as to help students develop their critical observation, analysis, and thinking skills regarding urban environment.   (satisfies Core Curriculum: Social Science Perspectives on China)\n\n      less description for SOCS-SHU  132 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 141",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19773",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "19774",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SOCS-SHU  141\n\n   Methods of Social Research\n\nThis is an introduction to research methods in the social sciences.  It is intended to provide a foundation for an understanding of the major approaches in the social sciences to the collection and analysis of quantitative and qualitative data, and the specification and testing of theories. Special attention will be given to new methods developed to study online contents, the Internet and social media (e.g., online flow, audiences, virality and impact). \nThe course covers the logic of scientific inquiry and various research techniques such as experimentation, scientific sampling, survey resear...\n\n      more description for SOCS-SHU  141 »\n\n      \n\n\n\nThis is an introduction to research methods in the social sciences.  It is intended to provide a foundation for an understanding of the major approaches in the social sciences to the collection and analysis of quantitative and qualitative data, and the specification and testing of theories. Special attention will be given to new methods developed to study online contents, the Internet and social media (e.g., online flow, audiences, virality and impact). \nThe course covers the logic of scientific inquiry and various research techniques such as experimentation, scientific sampling, survey research, field methods, archival data, and quantitative analysis that are commonly used by researchers in economics, education, political science, psychology, and sociology. The most basic goal of the class is to provide students with sufficient understanding of the basic elements of research design to be critical readers of research publications in the social sciences. In particular, they should be able to understand how the researchers arrived at their conclusions, assess whether the design of the study is adequate to support them, and possibly identify shortcomings in the design that would affect the conclusions. After completing this course students should have an overall sense of the range of methodologies for data collection and analysis available to the social science researcher, and the elements of study design required to ensure the results will actually be informative. This is not a statistics or quantitative methods class, and there will be no systematic instruction in the use of statistical software, or other quantitative analysis of data.  Students seeking training in social statistics should take a course in social statistics.\n\n      less description for SOCS-SHU  141 «",
            "offering": true
        },
        {
            "course_id": "SOCS-SHU 150",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19528",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Jones-Rooy, Andrea",
                    "time": "Tue,Thu 1.45 PM - 3.00 PM",
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Introduction to Comparative Politics",
            "description": "SOCS-SHU  150 Introduction to Comparative Politics",
            "offering": true
        },
        {
            "course_id": "SOCS-SHU 160",
            "course_name": "",
            "description": "SOCS-SHU  160\n\n   Introduction to International Politics\n\nWhat are the causes of war?  Why are some countries able to cooperate over issues like trade or the environment, while others are not?  What is the role of international organizations and alliances, such as the UN, NATO, and the EU in the international state system?  This course will give students an introduction to thinking analytically and systematically about outcomes in the international system, will teach them the prevailing major theories about these issues, and will equip students to begin to formulate their own answers to these questions.  Students will learn a set of formal tools to a...\n\n      more description for SOCS-SHU  160 »\n\n      \n\n\n\nWhat are the causes of war?  Why are some countries able to cooperate over issues like trade or the environment, while others are not?  What is the role of international organizations and alliances, such as the UN, NATO, and the EU in the international state system?  This course will give students an introduction to thinking analytically and systematically about outcomes in the international system, will teach them the prevailing major theories about these issues, and will equip students to begin to formulate their own answers to these questions.  Students will learn a set of formal tools to analyze complex world events, which will prepare them for upper level international relations and other social science courses, as well as to become comfortable applying social science methodologies and theories to better understanding the world around us.  The class will use some basic math, including introductory game theory, and some background in inferring statistical results will be helpful, but is not required.  Over the course of the semester students will be challenged to apply the models and theories from class to real world situations.\n\n      less description for SOCS-SHU  160 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 172",
            "course_name": "",
            "description": "SOCS-SHU  172\n\n   U.S. Constitution\n\nWelcome to the United States Constitution. I am looking forward to an exciting term of thinking about what the U.S. Constitution means and whether its ideas and rules can or should be exported to the People’s Republic of China.\n American constitutional law is important and interesting, but it is also inherently\nconfusing. My chief goal is to minimize the confusion that the material presents, in hopes that we can get some insight on what it means for the Constitution to supply rules of law conferring and limiting governmental officials’ authority.\n Understanding the U.S. Constitution can be dif...\n\n      more description for SOCS-SHU  172 »\n\n      \n\n\n\nWelcome to the United States Constitution. I am looking forward to an exciting term of thinking about what the U.S. Constitution means and whether its ideas and rules can or should be exported to the People’s Republic of China.\n American constitutional law is important and interesting, but it is also inherently\nconfusing. My chief goal is to minimize the confusion that the material presents, in hopes that we can get some insight on what it means for the Constitution to supply rules of law conferring and limiting governmental officials’ authority.\n Understanding the U.S. Constitution can be difficult for two reasons. First, American constitutional law purports to limit very powerful political actors with law-making and law-enforcing authority – members of Congress, state legislatures, governors, Presidents, judges,etc. It is not obvious how a piece of paper, a mere parchment barrier, can limit such actors. We know how ordinary law controls private people: If you disobey ordinary law, then the police might put you in jail, or a judge may force you to pay a fine. But constitutional law tries to tell the judge and police what to do. Why should they listen? Who will put them in jail if they ignore the law? How does a mere piece of paper limit (for instance) the President, who is himself or herself the chief executive with control over federal law enforcement? Unlike ordinary law, constitutional law requires powerful political actors voluntarily to obey the rules.\n The “real” constitution that judges and other politically powerful people actually follow, therefore, can be very different from the written constitution. Some of these hidden constitutional rules are contained in the hearts and minds of most Americans: They are unspoken assumptions about how We the People should be governed. For instance, “popular sovereignty” – the idea that a majority of citizens should control the government, because they represent everyone, including the minority of citizens – is one of those assumptions. Some of these rules and principles are more explicit: tTey are contained in the official interpretations of the written Constitution by judges, the Congress, the President, or important lawyers like the Attorney General. These official interpretations can be “precedents” that political leaders feel obliged to obey. When these precedents contain detailed reasons, then they are called “doctrine.” The doctrine is sometimes regarded as just as much part of the constitution as its\ntext. Some hidden rules are not officially recognized as doctrine: They are more like “qian guise” – customs that people follow even though they do not admit it. To know the real constitution rather than just the paper constitution, it is important to be familiar with both basic Page 2 of 14 unwritten principles, official doctrine and qian guise. \nSecond, the written Constitution in the United States is very old and very hard to change through the formal amendment process contained in the Constitution’s text (that is, Article V). The actual Constitution, therefore, gets updated not so much through formal written amendments as through big political fights. These changes take place over a long period of American history. To understand how the Constitution has changed in the past and might change in the future, it is important to be familiar with this history. We will, therefore, spend a lot of time\ndiscussing the basic principles and political fights that have shaped the Constitution’s real meaning.\n In addition to trying to figure out what American law is, we will also spend some time thinking about what constitutional law should be. The People’s Republic of China provides a good opportunity for thinking about whether and to what extent constitutional practices from one society can and should be used in another society. The Fourth Plenum of the Eighteenth People’s Congress announced a new commitment to rule according to the 1982 Constitution of the People’s Republic of China. Would any American ideas help with this commitment, or not?\nComparing the American with the Chinese experience can be a good way of understanding both better.\n This class also presents an opportunity to practice forensic and expository English. That is a fancy way of saying that I want you to get better at describing, and arguing about, law in spoken and written English. We will hold three in-class debates on whether the PRC should adopt, modify, or reject American practices on three specific constitutional topics: Judicial review, executive power, and subnational (“state” in the United States, “provincial” in China) power. For the purposes of these debates, the class will be divided into two “teams,” one for\nand the other against the Chinese adoption of an American idea. In addition, everyone must write three short (750-1,000 word) essays attacking or defending three American positions. Of course, to attack or defend an idea, you have to describe it accurately: Part of the mission of your papers and spoken presentations is not only to argue about the law effectively, but also to describe the law clearly.\n\n      less description for SOCS-SHU  172 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 185",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "19841",
                    "section": "001",
                    "period": "08/31/2015 - 12/11/2015",
                    "location": "Sexton, John",
                    "time": "Tue 9.45 AM - 11.45 AM",
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Recitation",
                    "class_id": "19842",
                    "section": "002",
                    "period": "08/31/2015 - 12/11/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "SOCS-SHU  185\n\n   The Relationship Between Government and Religion\n\nThis course examines the relationship between government and religion. To this end, the course concentrates on the interpretation, meaning, application, and wisdom of 16 words from the American Constitution: “Government shall make no law respecting an establishment of religion or prohibiting the free exercise thereof.” These 16 words serve as a starting point for the course because they broadly prohibit government entanglement with religion while simultaneously bestowing government with the responsibility to protect religious freedom. The primary texts of the course are the opinions of the Uni...\n\n      more description for SOCS-SHU  185 »\n\n      \n\n\n\nThis course examines the relationship between government and religion. To this end, the course concentrates on the interpretation, meaning, application, and wisdom of 16 words from the American Constitution: “Government shall make no law respecting an establishment of religion or prohibiting the free exercise thereof.” These 16 words serve as a starting point for the course because they broadly prohibit government entanglement with religion while simultaneously bestowing government with the responsibility to protect religious freedom. The primary texts of the course are the opinions of the United States Supreme Court, the highest Court in the United States, and final authority on interpretations of the Constitution. Prior knowledge of the subject matter or the United States is not a prerequisite for this class.\n\n      less description for SOCS-SHU  185 «",
            "offering": true
        },
        {
            "course_id": "SOCS-SHU 226",
            "course_name": "",
            "description": "SOCS-SHU  226\n\n   Poverty and Inequality Around the Globe\n\nThis course is designed to understand more formally and rigorously the causes and consequences of high and rising poverty and inequality around the globe, which is central to our preparation as global citizens. Globalization appears to be one of the major reasons to contributing the ever higher incomes of the top 1% in the U.S., for example, even as it lifts hundreds of millions of workers in Asia out of poverty. The overarching goals of this course are that students learn about poverty and inequality in both the poor and rich countries and why it matters to everyone. Students will learn the w...\n\n      more description for SOCS-SHU  226 »\n\n      \n\n\n\nThis course is designed to understand more formally and rigorously the causes and consequences of high and rising poverty and inequality around the globe, which is central to our preparation as global citizens. Globalization appears to be one of the major reasons to contributing the ever higher incomes of the top 1% in the U.S., for example, even as it lifts hundreds of millions of workers in Asia out of poverty. The overarching goals of this course are that students learn about poverty and inequality in both the poor and rich countries and why it matters to everyone. Students will learn the ways in which poverty and inequality around the globe are shaped by multifaceted contexts; understand the ways how the rich countries (i.e., US and UK) address their own poverty and inequality issues and how the major social policies and programs may affect people’s well-being or quality of life; and develop beginning expertise in understanding social policy content, policy actions of agencies, and political bodies,and the skills needed to influence social policy. This course is particularly concerned with philosophies of global justice and the ethics of global citizenship. Students are expected to critically reflect upon their own engagements with poverty action and their own aspirations for social change. This course emphasizes the roles that social issues, values, power, politics, the economy, discrimination, and advocacy play in the dynamic policy making and implementation environment. This course thus provides students with the basic policy related competencies and practice skills for conducting research-informed policy analysis and advocating for policy change.\n \nThere are no prerequisites for the class although students should be prepared to tackle advanced social science readings and analysis.\n\n      less description for SOCS-SHU  226 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 251",
            "course_name": "",
            "description": "SOCS-SHU  251\n\n   Tpcs in Law & Society: Law, Culture, & Politics in China\n\nWe live in a world where there is an emerging global focus on governance—the ways in which government, market and civil society can be used to address public problems—both domestic and global. \n\nIn Beijing as well as Washington experts now use the same global vernacular of “governance” to discuss approaches to pressing public problems.  Conference goers in either place will hear terms (often in English) such as democracy, rule of law, transparency, civil society, NGO/NPO (Nongovernment organization, nonprofit organization), GDP, crisis management, environmental sustainability, and CSR (corpora...\n\n      more description for SOCS-SHU  251 »\n\n      \n\n\n\nWe live in a world where there is an emerging global focus on governance—the ways in which government, market and civil society can be used to address public problems—both domestic and global. \n\nIn Beijing as well as Washington experts now use the same global vernacular of “governance” to discuss approaches to pressing public problems.  Conference goers in either place will hear terms (often in English) such as democracy, rule of law, transparency, civil society, NGO/NPO (Nongovernment organization, nonprofit organization), GDP, crisis management, environmental sustainability, and CSR (corporate social responsibility.)\n\nBut however flat the new common language may make the world seem to observers, the same words may have different meanings in different heads.  In each country the practical meanings of such terms are shaped by what might be called different “operating systems.” \n\nIn its remarkable rise, China studies the experiences of the world.   America may have invented modern pragmatism, but China (“black cat white cat, it does not make a difference as long as it catches mice”) may now be its leading practitioner.  But while China seeks to learn from the western—it seeks to modify them to “Chinese characteristics,” China’s own cultural values and traditions, as they have evolved over millennia.\n\n      less description for SOCS-SHU  251 «",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 310",
            "course_name": "NYU Shanghai Summer Research",
            "description": "SOCS-SHU  310 NYU Shanghai Summer Research",
            "offering": false
        },
        {
            "course_id": "SOCS-SHU 450",
            "course_name": "",
            "description": "SOCS-SHU  450\n\n   Chinese Environmental Governance\n\nAs the 21st century began, pundits debated whether, like the 20th, it  would also be “America’s century,” whether China’s remarkable economic rise would make it “China’s century,” or, perhaps, one seeing the development of “Chimerica.” At the same time, it was also said that environmental limits to development will be the primary shaper of countries and their fortunes—with China (and India), with huge population and rapid development, and the U.S., with high per capita consumption, as keys to the future of the planet. \n\nThis course will study China’s environmental challenges and governance in ...\n\n      more description for SOCS-SHU  450 »\n\n      \n\n\n\nAs the 21st century began, pundits debated whether, like the 20th, it  would also be “America’s century,” whether China’s remarkable economic rise would make it “China’s century,” or, perhaps, one seeing the development of “Chimerica.” At the same time, it was also said that environmental limits to development will be the primary shaper of countries and their fortunes—with China (and India), with huge population and rapid development, and the U.S., with high per capita consumption, as keys to the future of the planet. \n\nThis course will study China’s environmental challenges and governance in the context of America’s own environmental challenges and governance system, and in the context of the challenges to the two countries as the primary sources of the world’s greenhouse gas emissions. We will consider how developments may shape business, government, and culture, and the ways in which China and America may learn from one another.\n\n      less description for SOCS-SHU  450 «",
            "offering": false
        }
    ]
}