{
    "major_id": "SRPP-AD",
    "file": "./2015-2016/Social_Research_&_Public_Policy(SRPP-AD).html",
    "courses": [
        {
            "course_id": "SRPP-AD 110",
            "course_name": "",
            "description": "SRPP-AD  110\n\n   The World System\n\nSince the 17th century there have been a series of different hegemonic powers within a transnational capitalist economy. This course surveys (a) the history of the capitalist system from Dutch and British hegemony through the American 20th century, the growth of corporations, various approaches to economic development, and the current opening up of the world to new economic powers, and (b) the related political history of European colonialism, nationalism, postcolonial societies, the Cold War, and the emerging multipolar world of today. It considers the nature of crises and social change, effo...\n\n      more description for SRPP-AD  110 »\n\n      \n\n\n\nSince the 17th century there have been a series of different hegemonic powers within a transnational capitalist economy. This course surveys (a) the history of the capitalist system from Dutch and British hegemony through the American 20th century, the growth of corporations, various approaches to economic development, and the current opening up of the world to new economic powers, and (b) the related political history of European colonialism, nationalism, postcolonial societies, the Cold War, and the emerging multipolar world of today. It considers the nature of crises and social change, efforts to establish stability in the face of conflicts and disruptions, and possible futures open to the contemporary world. The course includes several field trips in the U.A.E..\n\n      less description for SRPP-AD  110 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 111",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12923",
                    "section": "001",
                    "period": "10/28/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "CAMP W009"
                }
            ],
            "course_name": "",
            "description": "SRPP-AD  111\n\n   Social Policy\n\nThe aim of this course is to study human conditions, social arrangements, and social processes which are sites of social, political, cultural, and moral contestations in contemporary societies. They are perceived as ‘social problems’ and divide public opinion about the appropriate ways to protect society from their deleterious effects. Lectures first focus on sociological perspectives on social problems and examine the role of social structure and social processes in their production and reproduction. Subsequent lectures focus on exploring selected social problems such as: suicide, suicide ter...\n\n      more description for SRPP-AD  111 »\n\n      \n\n\n\nThe aim of this course is to study human conditions, social arrangements, and social processes which are sites of social, political, cultural, and moral contestations in contemporary societies. They are perceived as ‘social problems’ and divide public opinion about the appropriate ways to protect society from their deleterious effects. Lectures first focus on sociological perspectives on social problems and examine the role of social structure and social processes in their production and reproduction. Subsequent lectures focus on exploring selected social problems such as: suicide, suicide terrorism, euthanasia, aging, genocide, incest, genomics, and religious fundamentalism.\nThe selected social problems are examined in a global perspective, focusing on contemporary industrialized societies.\nRecommended Prerequisites: Logic of Social Inquiry (SOCSC-AD 112)\n\n      less description for SRPP-AD  111 «",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 112",
            "course_name": "X",
            "description": "SRPP-AD  112X\n\n   Islam and Society\n\nIn this seminar, students will come to understand the diverse and dynamic roles that religious and cultural Islam can play in contemporary societies,\nespecially those in the “Middle East” and North Africa. After critically examining what might be meant by Islam and Muslims in the first place, students will use social scientific case studies to investigate how Islam does (or does not) come\nto matter in various sectors of society, including government and the state, the legal system, politics and social movements, gender relations, sexuality,\neducation, the economy, popular culture, and every...\n\n      more description for SRPP-AD  112X »\n\n      \n\n\n\nIn this seminar, students will come to understand the diverse and dynamic roles that religious and cultural Islam can play in contemporary societies,\nespecially those in the “Middle East” and North Africa. After critically examining what might be meant by Islam and Muslims in the first place, students will use social scientific case studies to investigate how Islam does (or does not) come\nto matter in various sectors of society, including government and the state, the legal system, politics and social movements, gender relations, sexuality,\neducation, the economy, popular culture, and everyday life. By the end of this course, students will be able to critically analyze the ways that religious and cultural Islam can impact society and social life. Each student will be expected to complete a final research project exploring the core questions posed by the course.\n\n      less description for SRPP-AD  112X «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 113",
            "course_name": "Globalization and Education",
            "description": "SRPP-AD  113 Globalization and Education \nWhat is globalization, and what are the implications of living in a \"global world\" for education? How can education be used as a tool to promote global social justice and prosperity? This course explores these questions by first examining various theoretical perspectives on globalization, then analyzing several major themes associated with globalization and education. Draws on case studies from Asia, Africa, Latin America, the Middle East, and North America to provide concrete examples of how global forces are changing the content and context of education internationally.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 115",
            "course_name": "J",
            "description": "SRPP-AD  115J\n\n   Social Networks\n\nSocial networks are the subject of some of the most exciting recent advances in the natural and social sciences. This course provides an introduction to the major discoveries in the field of social networks, particularly advances during\nthe last decade. It also provides students with an introduction to the methods and software used to analyze and visualize social networks. Topics include the small-world puzzle (six degrees of separation), the strength of weak ties, centrality, complexity, thresholds (‘tipping points’), and the spread of diseases and fads. Case studies used in the course includ...\n\n      more description for SRPP-AD  115J »\n\n      \n\n\n\nSocial networks are the subject of some of the most exciting recent advances in the natural and social sciences. This course provides an introduction to the major discoveries in the field of social networks, particularly advances during\nthe last decade. It also provides students with an introduction to the methods and software used to analyze and visualize social networks. Topics include the small-world puzzle (six degrees of separation), the strength of weak ties, centrality, complexity, thresholds (‘tipping points’), and the spread of diseases and fads. Case studies used in the course include topics such as the contagion of suicides, social influence on musical taste, sexual relationships among adolescents, interorganizational networks, and the network structure of the internet. Course readings are an engaging blend of popular social science texts,\njournal articles, and scientific papers.\nRecommended Prerequisites: Logic of Social Inquiry (SOCSC-AD 112)\n\n      less description for SRPP-AD  115J «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 116",
            "course_name": "",
            "description": "SRPP-AD  116\n\n   Revolutions and Social Change\n\nRevolutions mean purposive and contentious efforts to re-engineer whole societies according to the visions of justice and progress. What social theories\nbetter explain these exuberant, extraordinary events? How did the revolutionaries, their strategies, and programs evolve during the modern epoch? What typically happened after taking power? Why are there so many wars and revolutionary dictatorships? This course introduces the recent theoretical advances in understanding contentious mass politics in relation to the formation of modern states, democratization, socialism, and nationalism. Empiric...\n\n      more description for SRPP-AD  116 »\n\n      \n\n\n\nRevolutions mean purposive and contentious efforts to re-engineer whole societies according to the visions of justice and progress. What social theories\nbetter explain these exuberant, extraordinary events? How did the revolutionaries, their strategies, and programs evolve during the modern epoch? What typically happened after taking power? Why are there so many wars and revolutionary dictatorships? This course introduces the recent theoretical advances in understanding contentious mass politics in relation to the formation of modern states, democratization, socialism, and nationalism. Empirical examples include: the American Independence of 1776 and the French Revolution of 1789; the communist revolutions in Russia and China; the anti-colonial movements of the 20th century in India, South Africa and Cuba; and the youth revolts of 1968 in the West, 1979 in Iran, 1989 in the Soviet bloc, and the newest rebellions of the 2010s in the Middle East.\n\n      less description for SRPP-AD  116 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 118",
            "course_name": "J",
            "description": "SRPP-AD  118J\n\n   Public Policy and Social Problems: Homelessness, Mental Illness and Child Welfare in NYC\n\nThis course is an introduction to the study of social problems through exploration of three primary issues in New York City: homelessness, mental\nillness and child welfare. It encompasses: the history of each social condition; a review of research in each area and micro and macro (governmental)\napproaches to these problems. Students have the opportunity to visit agencies, to meet with professionals and consumers of service and to\ncompare the government and American public policy response to these problems with that of their home country. Presentations are made by guest\nspeakers who are exp...\n\n      more description for SRPP-AD  118J »\n\n      \n\n\n\nThis course is an introduction to the study of social problems through exploration of three primary issues in New York City: homelessness, mental\nillness and child welfare. It encompasses: the history of each social condition; a review of research in each area and micro and macro (governmental)\napproaches to these problems. Students have the opportunity to visit agencies, to meet with professionals and consumers of service and to\ncompare the government and American public policy response to these problems with that of their home country. Presentations are made by guest\nspeakers who are experts in each of these areas.\n\n      less description for SRPP-AD  118J «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 119",
            "course_name": "J Wealth & Inequality",
            "description": "SRPP-AD  119J Wealth & Inequality \nThe rapid increase in wealth and income inequality in many countries, and its consequences, are the subject of this course. Using New York City as our laboratory, we explore some of the ways in which wealth and power are created and maintained, as well as examining some of the social consequences of high levels of inequality for individuals and societies as a whole. Readings and\nlectures explore the social and political economy of inequality through the work of contemporary social science. Field trips, films, and guest lectures,\nas well as meetings.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 120",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "13018",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 018",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "van der Windt, Peter"
                }
            ],
            "course_name": "Survey Research",
            "description": "SRPP-AD  120 Survey Research \nThis course will teach students how to design and implement a survey, and what to do once the data is in. The course is practice oriented: we will use a lot of examples, you will create your own survey design, and we will spend more than a quarter of the course learning Stata. At the end of this course you will be able to design and implement your own, high quality survey. Moreover, you will question much of the data that is collected by others because you know all the things that can go wrong in the process. For this course I assume that you are comfortable with basic statistics.",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 121",
            "course_name": "",
            "description": "SRPP-AD  121\n\n   Race and Ethnicity\n\nRace and ethnicity (and their worrisome corollaries, racism and ethnocentrism) are topics that sociologists have spent many years trying to define, explain, and investigate empirically. While there is no uniform consensus yet, most sociologists emphasize the social constructedness of race and the dynamism of ethnicity. Sociologists question whether either term captures any objective or enduring reality, and choose instead to highlight historical and geographic variations in how the concepts play out in real life. Much social science research lends considerable empirical support to our notions ...\n\n      more description for SRPP-AD  121 »\n\n      \n\n\n\nRace and ethnicity (and their worrisome corollaries, racism and ethnocentrism) are topics that sociologists have spent many years trying to define, explain, and investigate empirically. While there is no uniform consensus yet, most sociologists emphasize the social constructedness of race and the dynamism of ethnicity. Sociologists question whether either term captures any objective or enduring reality, and choose instead to highlight historical and geographic variations in how the concepts play out in real life. Much social science research lends considerable empirical support to our notions about the dynamic nature and social constructedness of both ideas. In this course, we will focus on the socio-political development of early as well as reigning ideas about race AND the racialization uses to which ethnic differences have been put by those vested in creating and maintaining racial orders. This course is inherently comparative, but will draw most extensively from research and theories derived from the study of those societies in which racialization has been key to national development. This course connects ideas about race and ethnicity to patterns of assimilation, citizenship, class formation, state formation, empire, economic development, and stratification.\n\n      less description for SRPP-AD  121 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 122",
            "course_name": "",
            "description": "SRPP-AD  122\n\n   Entrepreneurship\n\nWhether as heroes or agents of creative destruction, entrepreneurs and their innovations have had a transformative influence on modern economic growth and the wealth of nations. The first part of the seminar introduces the classical and contemporary writings on the rise of entrepreneurial capitalism in the West and the global diffusion of modern entrepreneurial spirit and firm. Classical approaches pioneered the study of modern entrepreneurship in its rational\norientation to profit-making through innovative activity. Contemporary approaches shift the emphasis away from analysis of individual a...\n\n      more description for SRPP-AD  122 »\n\n      \n\n\n\nWhether as heroes or agents of creative destruction, entrepreneurs and their innovations have had a transformative influence on modern economic growth and the wealth of nations. The first part of the seminar introduces the classical and contemporary writings on the rise of entrepreneurial capitalism in the West and the global diffusion of modern entrepreneurial spirit and firm. Classical approaches pioneered the study of modern entrepreneurship in its rational\norientation to profit-making through innovative activity. Contemporary approaches shift the emphasis away from analysis of individual attributes and agency to focus on examining the role of social networks, organizational forms, and institutional environment in facilitating entrepreneurial activity. In the part of the seminar, we focus on research on entrepreneurship using secondary sources and data available through the internet.\n\n      less description for SRPP-AD  122 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 123",
            "course_name": "Science and Society",
            "description": "SRPP-AD  123 Science and Society \nSocial scientists who study science often make a simple, but controversial claim: that science is fundamentally shaped by social forces. This premise challenges contemporary understanding of science as producing true, objective knowledge that is independent of culture and social structure. We will study debates about the nature of science versus religion, Western versus non-Western knowledge, and the physical versus social sciences in order to form our own conclusions about the relationship between science and society.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 124",
            "course_name": "Relationships, Sex, and Love",
            "description": "SRPP-AD  124 Relationships, Sex, and Love \nThis course examines very personal areas of life—Romantic relationships, marriage, and sexuality. Behavior in these private realms is strongly affected\nby culture, economics, and politics, and varies across societies and subgroups within societies. Topics include how young adults find romantic partners, changing standards of permissible sexual behavior, attitudes toward same-sex relationships, changing meanings of marriage, and public policies\ndirected at these behaviors.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 125",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12803",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": "Tue,Thu 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "SOC_SCI 003"
                }
            ],
            "course_name": "Ethnographic Field Research",
            "description": "SRPP-AD  125 Ethnographic Field Research \nThe course offers a practical introduction to the theoretical and methodological issues of ethnographic field research. The course offers students hands-on experience to carry out ethnographic field research, conduct in-depth\ninterviews and carry out participant observations.\nRecommended Prerequisites: Logic of Social Inquiry (SOCSC-AD 112)",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 126",
            "course_name": "Immigration",
            "description": "SRPP-AD  126 Immigration \nAfter a brief historical overview of immigration trends, this course focuses on the causes and processes of contemporary international migration; the economic incorporation or exclusion of immigrants in the U.S. and other countries of the world; formulation and practice of immigration laws.\nRecommended Prerequiste: Logic of Social Inquiry (SOCSC-AD 112)",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 127",
            "course_name": "Wealth and Inequality",
            "description": "SRPP-AD  127 Wealth and Inequality \nThe course offers an overview of the causes and consequences of social inequality. Topics include: the concepts, theories, and measures of inequality;\nrace, gender, and other caste systems; social mobility and social change; institutional support for stratification, including family, schooling, and work; political power and role of elites; and comparative patterns of inequality, including capitalist, socialist, and post-socialist societies.\nRecommended Prerequisites: Logic of Social Inquiry (SOCSC-AD 112)",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 128",
            "course_name": "Policy",
            "description": "SRPP-AD  128 Policy \nThis course offers a review of urban development during the past century in the United States, but in a comparative way with the rest of the world. Special attention is paid to the question of urban poverty, debates around “culture of poverty” and “underclass” and it offers a balanced evaluation of various policy recommendations to alleviate poverty.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 129",
            "course_name": "Work in Modern Society",
            "description": "SRPP-AD  129 Work in Modern Society \nEvaluation of definitions, nature, and development of occupations and professions, occupational associations such as guilds, trade unions, and labor unions. Concepts of mobility and career patterns; how occupations maintain control over member’s behavior; how they relate to the wider community; and how they influence family life.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 130",
            "course_name": "Law, Society, and Public Policy",
            "description": "SRPP-AD  130 Law, Society, and Public Policy \nThe course offers sociological perspectives on law and legal institutions: the meaning and complexity of legal issues; the relation between law and social change; the effects of law; uses of law to overcome social disadvantage. Topics include: limits of law; legal disputes and the courts; regulation; comparative legal systems; legal education; organization.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 131",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12921",
                    "section": "001",
                    "period": "08/30/2015 - 10/20/2015",
                    "location": null,
                    "time": "Tue,Thu 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "SOC_SCI 004"
                }
            ],
            "course_name": "Gender and Society",
            "description": "SRPP-AD  131 Gender and Society \nIn every society, whether one is born male or female affects how one is expected to behave and the opportunities one confronts. However, how gender is organized varies between societies and across time. This course draws upon research from sociology, economics, psychology, and anthropology to examine gender, providing information on how gender is organized in various parts of the world. Topics include how male and female children are socialized, women’s and men’s roles in the family, trends in women’s education and employment, the sex gap in pay, and how gender is affected by public policies.",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 132",
            "course_name": "Political History Through Films",
            "description": "SRPP-AD  132 Political History Through Films \nThe juxtaposition of classical political films (Germinal, October, Nasser in 1956, Battle for Algiers, Z, Man of Marble, Last Emperor, Land and Freedom) and social science theories (Hobsbawm, Anderson, Mann, Wallerstein) gives visualized depth to exploring the political, and economic trajectory of the modern world system. Topics include: nation- and state-formation; democracy and authoritarianism; fascism; nationalism; communism; developmentalism; world wars; the generational ‘gap’ of 1968; the end of traditional societies; and globalization.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 133",
            "course_name": "J",
            "description": "SRPP-AD  133J\n\n   Wealth and Inequality in the Global City\n\nThe rapid increase in wealth and income inequality in many countries, often concentrated and most severe in the world’s leading cities, is the subject of this course. Using New York City as our laboratory, we explore some of the ways in which wealth and power are created and maintained, as well as examining some of the social consequences of high levels of inequality for families and communities. Readings and lectures explore the social and political economy\nof inequality through the work of contemporary social science. We will deepen our understanding of key issues through field trips, films,...\n\n      more description for SRPP-AD  133J »\n\n      \n\n\n\nThe rapid increase in wealth and income inequality in many countries, often concentrated and most severe in the world’s leading cities, is the subject of this course. Using New York City as our laboratory, we explore some of the ways in which wealth and power are created and maintained, as well as examining some of the social consequences of high levels of inequality for families and communities. Readings and lectures explore the social and political economy\nof inequality through the work of contemporary social science. We will deepen our understanding of key issues through field trips, films, guest lectures, and meetings with key leaders in the world of finance and business, government, and nongovernmental groups working to alleviate some of the most serious consequences of poverty and inequality in New York.\n\n      less description for SRPP-AD  133J «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 134",
            "course_name": "J",
            "description": "SRPP-AD  134J\n\n   21st-Century International Human Rights\n\nThis course asks: How can human rights advocates better operationalize 20th century tools to achieve better 21st century human rights outcomes? It examines case studies at the intersection of law, politics, policy and institutions to determine how  to achieve better human rights policy outcomes. Too often, human rights advocates -- both inside and outside governments-- fail to achieve their desired outcomes because they cannot manage politics, harness incentives and institutions, or deploy law in a way that operationalizes the principles they value. This course begins with an overview of the i...\n\n      more description for SRPP-AD  134J »\n\n      \n\n\n\nThis course asks: How can human rights advocates better operationalize 20th century tools to achieve better 21st century human rights outcomes? It examines case studies at the intersection of law, politics, policy and institutions to determine how  to achieve better human rights policy outcomes. Too often, human rights advocates -- both inside and outside governments-- fail to achieve their desired outcomes because they cannot manage politics, harness incentives and institutions, or deploy law in a way that operationalizes the principles they value. This course begins with an overview of the institutions, strategy, law, and process of human rights. We then explore a number of case studies that illustrate cutting-edge human rights problems, and the various tools that may be employed for their resolution. The course will close with a series of student presentations identifying current issue areas ripe for new and better human rights strategies that might help attack these critical questions.\n\n      less description for SRPP-AD  134J «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 135",
            "course_name": "",
            "description": "SRPP-AD  135\n\n   Modern Welfare State\n\nIntroduction to the foundations and development of the modern welfare state, with an emphasis on Western democracies. The course provides students\nwith the conceptual tools to understand welfare states and the twin pressures they have faced in recent times: population change and globalization. Life courses of individuals and households, for example, pathways in and out of poverty, provide a useful framework for thinking about welfare states\nand what they do or not do. In addition, much can be learned from a comparative perspective. Topics include poverty, inequality, fertility, health care, ed...\n\n      more description for SRPP-AD  135 »\n\n      \n\n\n\nIntroduction to the foundations and development of the modern welfare state, with an emphasis on Western democracies. The course provides students\nwith the conceptual tools to understand welfare states and the twin pressures they have faced in recent times: population change and globalization. Life courses of individuals and households, for example, pathways in and out of poverty, provide a useful framework for thinking about welfare states\nand what they do or not do. In addition, much can be learned from a comparative perspective. Topics include poverty, inequality, fertility, health care, education, retirement, and immigration.\n\n      less description for SRPP-AD  135 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 136",
            "course_name": "X State Formation: The Case of the U.A.E",
            "description": "SRPP-AD  136X State Formation: The Case of the U.A.E \nCommonly (and wrongly) people take for granted the existence of such political and cultural units as France and Germany, or Japan and India. But in the Middle East states and national cultures are at the same time ancient and recently created. Here the complex processes of state-formation are still current, and the United Arab Emirates, which is barely forty years old, serves a rich and richly varied example for the comparative understanding of state-building, cultural imagination, and economic development.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 137",
            "course_name": "X Demography of the Muslim World",
            "description": "SRPP-AD  137X Demography of the Muslim World \nAre Muslims distinct in their wellbeing? In this class students will examine the cumulative trajectories of wellbeing among Muslim populations through the interplay of three core demographic processes: fertility, mortality, and migration. Using Muslim populations as case studies, students will develop skills to create a population profile, learn about past and present characteristics of citizens and migrants, and acquire the knowledge to assess basic measures of population change. This course is designed to help students with conducting their own independent research in the social sciences.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 139",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12922",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP W004",
                    "time": "Mon,Wed 12.45 PM - 2.00 PM",
                    "open": true,
                    "professor": "Derlugyan, George"
                }
            ],
            "course_name": "Social Science Analysis of Global News",
            "description": "SRPP-AD  139 Social Science Analysis of Global News \nHow does one ‘read the news’? It might be trickier than it sounds. The  construction of what becomes ‘news’, its dissemination and interpretation\nare complex and inherently contentious social processes. Finding your way in the realm of mass communication, propagandistic conflicts, and public debate requires both theoretical lenses and good practical skills which this course intends to supply.",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 140",
            "course_name": "X",
            "description": "SRPP-AD  140X\n\n   Women and Work in the Gulf\n\nThis course critically examines how women feature in contemporary debates about employment, development, and nationalism in the context of the Gulf Cooperative Council countries. The first section of the course provides a philosophical foundation for debates about women, work, and difference based on feminist theories. In particular, we will explore postcolonial perspectives on feminism and difference, feminist Marxist critiques of capitalism, and feminist Islamist critiques of modernity.  The second part of the course provides an overview of how women in the Gulf feature in contemporary disco...\n\n      more description for SRPP-AD  140X »\n\n      \n\n\n\nThis course critically examines how women feature in contemporary debates about employment, development, and nationalism in the context of the Gulf Cooperative Council countries. The first section of the course provides a philosophical foundation for debates about women, work, and difference based on feminist theories. In particular, we will explore postcolonial perspectives on feminism and difference, feminist Marxist critiques of capitalism, and feminist Islamist critiques of modernity.  The second part of the course provides an overview of how women in the Gulf feature in contemporary discourses as participants in “globally competitive” economies, mothers of “future generations of citizens”,  and symbols of “tradition and culture”. The third part of the course provides an overview of the public policy and legal frameworks shaping women’s work. In particular, this section of the course explores how different categories of “women” are produced through public policy programs such as workforce nationalization, education policy, social policy, and the interplay of national and international laws governing domestic work, human trafficking, and domestic abuse. The course will host a number of academics, activists, and policymakers involved in policies shaping women’s work experiences in the Gulf.\n\n      less description for SRPP-AD  140X «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 141",
            "course_name": "",
            "description": "SRPP-AD  141\n\n   Urban Poverty and Social Policy\n\nThis course explores theoretical and empirical connections between economic development, urbanization, urban poverty and distress and state/non-state responses to urban poverty and distress. It begins with an exploration of theoretical and conceptual perspectives on urbanization and welfare state policies, then moves on to examine illustrative cases from global north and south cities that challenge and complicate reigning theories and concepts. The course begins with an historical and contemporary analysis of urban poverty in Global North cities (New York, Paris and London), then moves on to a...\n\n      more description for SRPP-AD  141 »\n\n      \n\n\n\nThis course explores theoretical and empirical connections between economic development, urbanization, urban poverty and distress and state/non-state responses to urban poverty and distress. It begins with an exploration of theoretical and conceptual perspectives on urbanization and welfare state policies, then moves on to examine illustrative cases from global north and south cities that challenge and complicate reigning theories and concepts. The course begins with an historical and contemporary analysis of urban poverty in Global North cities (New York, Paris and London), then moves on to an examination of emergent urban poverty patterns and cases in rapidly-changing “semi-peripheral” regions (China, for example), and finally explores urban poverty in a wide variety of Global South cities (spanning Africa, Latin America, and Southeast Asia). The course will use examples from the U.S. to explore certain key topics/concepts for debate, such as “underclass,” “informality,” “feminization of poverty,” “culture of poverty,” “prison industrial complex,” and “neo-liberal welfare state retrenchment.” Students will be asked to compare and contrast historical and contemporary patterns of urban poverty across global north and south regions, with a focus on the limits and possibilities of social policies (state- and non-state-sponsored) for addressing urban distress.\n\n      less description for SRPP-AD  141 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 142",
            "course_name": "",
            "description": "SRPP-AD  142\n\n   Renewable Energy Law and Policy\n\nEnergy’s role in global climate change is increasing its importance. This course focuses on two major and interrelated themes: climate change and energy. The class will look at implications of new climate change and renewable energy mandates for the electric power sector. Energy is considered a prerequisite for economic growth and poverty alleviation. Electricity demand almost doubled from 1990 to 2011, and is projected to grow 81% from 2011 to 2035 in the existing policies scenario. Over 70% of the increased energy demand is from developing countries. At this time some two billion people (one...\n\n      more description for SRPP-AD  142 »\n\n      \n\n\n\nEnergy’s role in global climate change is increasing its importance. This course focuses on two major and interrelated themes: climate change and energy. The class will look at implications of new climate change and renewable energy mandates for the electric power sector. Energy is considered a prerequisite for economic growth and poverty alleviation. Electricity demand almost doubled from 1990 to 2011, and is projected to grow 81% from 2011 to 2035 in the existing policies scenario. Over 70% of the increased energy demand is from developing countries. At this time some two billion people (one third of world’s population) have no access to electricity. Population growth (United Nations predicts world population growth from 6.7 billion in 2011 to 8.7 billion by 2035) and increasing standards of living (the UN Population Division projects 70 % people will be living in urban areas by 2050) for many people in developing countries will cause enormous growth in energy demand. Many poorer countries lack this essential capacity. Meeting the energy needs of developing countries without compromising the environment is a challenge. Advancement of innovative energy solutions and implementation of smart policies to make the transition to clean energy in ways that fulfill growing needs and improve economy without hurting environment is very much needed. This introductory level course on renewable energy examines the historical and legal origins of energy regulations and emerging policies. The course provides an introduction to the renewable sources and basic terms and concepts, regulatory trends and other emerging issues. The primary focus of the course will be on renewable energy policies and laws of the developing countries. We will spend considerable time with Africa, Small Island States, United Arab Emirates (UAE), and examples from other countries. The centerpiece of this course is to focus on a specific renewable energy project (in a developing country) completed with international cooperation and assistance. The course will also focus on global institutions and policymaking, the divide between industrialized countries and developing countries, the nexus between global climate change and renewable energy, sustainable energy sources, and challenges that global policymakers will face in future.  The course will look at the wide variety of local and regional laws, regulatory techniques, and policy objects. The class will embark on a week- long trip to a developing country to study renewable energy project and to get hands-on experience of power generation from a renewable energy facility.\n\n      less description for SRPP-AD  142 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 150",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12924",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 018",
                    "time": "Tue,Thu 2.10 PM - 3.25 PM",
                    "open": true,
                    "professor": "Al-Dabbagh, May"
                }
            ],
            "course_name": "",
            "description": "SRPP-AD  150\n\n   Introduction to Public Policy\n\nPublic policy affects our lives in profound ways even when we are not aware of them. What we eat, how we recycle, or when we disclose personal information on the internet are all examples of choices largely determined by public policies. This course is an introduction to public policy, why it is important, and how it involves simultaneous ethical, political, and problem-solving processes. The\ncourse introduces students to the ways in which a variety actors and institutions at the national and transnational levels interactively contribute to public policy. The course is divided into two parts. ...\n\n      more description for SRPP-AD  150 »\n\n      \n\n\n\nPublic policy affects our lives in profound ways even when we are not aware of them. What we eat, how we recycle, or when we disclose personal information on the internet are all examples of choices largely determined by public policies. This course is an introduction to public policy, why it is important, and how it involves simultaneous ethical, political, and problem-solving processes. The\ncourse introduces students to the ways in which a variety actors and institutions at the national and transnational levels interactively contribute to public policy. The course is divided into two parts. The first part provides an overview of the basic concepts underlying the public policy process and the second part provides critical perspectives on public policy-making in theory and practice.\n\n      less description for SRPP-AD  150 «",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 151",
            "course_name": "",
            "description": "SRPP-AD  151\n\n   Introduction to Global Health\n\nDespite the significant progress made towards achieving globally set targets for health in some countries, others—particularly in sub-Saharan Africa—are falling behind. This course introduces students to the main concepts of the public health field and the critical links between global health and social and economic development. Lectures explore major themes in global health, including the\nsocial determinants of health, the global distribution of disease burden and risk factors, key measures to address the disease burden in cost-effective\nways, and the role of health systems and diverse global...\n\n      more description for SRPP-AD  151 »\n\n      \n\n\n\nDespite the significant progress made towards achieving globally set targets for health in some countries, others—particularly in sub-Saharan Africa—are falling behind. This course introduces students to the main concepts of the public health field and the critical links between global health and social and economic development. Lectures explore major themes in global health, including the\nsocial determinants of health, the global distribution of disease burden and risk factors, key measures to address the disease burden in cost-effective\nways, and the role of health systems and diverse global actors in responding to the health needs of populations worldwide. The course is global in coverage, but with a focus on low- and middle income countries and on the health of the poor.\n\n      less description for SRPP-AD  151 «",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 152",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "20484",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 018",
                    "time": "Mon,Wed 9.15 AM - 10.30 AM",
                    "open": true,
                    "professor": "Katz, Ralph"
                }
            ],
            "course_name": "Epidemiology",
            "description": "SRPP-AD  152 Epidemiology",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 198",
            "course_name": "Directed Study",
            "description": "SRPP-AD  198 Directed Study \nTopics relating to Social Research and Public Policy as arranged.",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 298",
            "course_name": "Directed Study:",
            "description": "SRPP-AD  298 Directed Study:",
            "offering": false
        },
        {
            "course_id": "SRPP-AD 400",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12920",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 018",
                    "time": "Wed 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": "Brueckner, Hannah"
                },
                {
                    "format": "Seminar",
                    "class_id": "17901",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "SOC_SCI 019",
                    "time": "Wed 5.00 PM - 7.30 PM",
                    "open": true,
                    "professor": "O'Brien, John"
                }
            ],
            "course_name": "Senior Capstone Research Project",
            "description": "SRPP-AD  400 Senior Capstone Research Project \nDuring this yearlong course, students develop a research question; design and analyze quantitative or qualitative data sets relevant to public policy; and write a 40–60 page senior essay.",
            "offering": true
        },
        {
            "course_id": "SRPP-AD 401",
            "course_name": "Senior Capstone Research Project",
            "description": "SRPP-AD  401 Senior Capstone Research Project \nDuring this yearlong course, students develop a research question; design and analyze quantitative or qualitative data sets relevant to public policy; and write a 40–60 page senior essay.",
            "offering": false
        }
    ]
}