{
    "major_id": "SOED-UE",
    "file": "./2015-2016/Sociology_of_Education_(SOED-UE).html",
    "courses": [
        {
            "course_id": "SOED-UE 15",
            "course_name": "Ed as Soc Institution",
            "description": "SOED-UE   15 Ed as Soc Institution \nThe purpose of this course is to provide an introduction to the study and practice of education in the United States. As a part of the core sequence in the teacher education curriculum, this course seeks to combine classroom exercises and methods with some field experience to better prepare students to apply their specialized subject matter knowledge and skills in real schools and classrooms.",
            "offering": false
        },
        {
            "course_id": "SOED-UE 20",
            "course_name": "American Soc Movements:",
            "description": "SOED-UE   20 American Soc Movements: \nThrough the lenses of power, resistance, and identity, this course provides an introduction to American social movements from the 1950s to the present. Drawing from history, sociology, and politics, it examines a range of social movements, including: civil rights and Black Power, second and third wave feminism, gay and lesbian liberation and LGBT movements, and Right-wing mobilization. The course also examines the question of how social activism on both the political Left and Right has changed over the past fifty years.",
            "offering": false
        },
        {
            "course_id": "SOED-UE 1000",
            "course_name": "Ind Study",
            "description": "SOED-UE 1000 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": false
        },
        {
            "course_id": "SOED-UE 1002",
            "course_name": "Intro to Sociology of Ed",
            "description": "SOED-UE 1002 Intro to Sociology of Ed \nStudy of Basic Sociological concepts such as status, rule, and bureaucracy as they apply to the institution of education.  Examination of current perspectives and research findings about the social aspects of the learning process.",
            "offering": false
        },
        {
            "course_id": "SOED-UE 1010",
            "course_name": "",
            "description": "SOED-UE 1010\n\n   Growing up in America: Communities, Families, Youth Culture and Education\n\nThis class engages students in the study of “growing up in America” through scholarship on families, schools, communities, & youth culture. Students will critically read & discuss the works of historians & sociologists who write on socialization, subjectivity, exclusivity, & identity formation. With a focus on race, gender, & sexuality, students will also evaluate American society & culture in specific historical & sociological contexts. This course is designed to be of interest to students of sociology, history, social studies education, American studies, gender studies, cultural studies, & r...\n\n      more description for SOED-UE 1010 »\n\n      \n\n\n\nThis class engages students in the study of “growing up in America” through scholarship on families, schools, communities, & youth culture. Students will critically read & discuss the works of historians & sociologists who write on socialization, subjectivity, exclusivity, & identity formation. With a focus on race, gender, & sexuality, students will also evaluate American society & culture in specific historical & sociological contexts. This course is designed to be of interest to students of sociology, history, social studies education, American studies, gender studies, cultural studies, & related fields.\n\n      less description for SOED-UE 1010 «",
            "offering": false
        },
        {
            "course_id": "SOED-UE 1014",
            "course_name": "Educ and Development in Latin America",
            "description": "SOED-UE 1014 Educ and Development in Latin America",
            "offering": false
        },
        {
            "course_id": "SOED-UE 1015",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "10278",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 369",
                    "time": "Tue,Thu 3.30 PM - 4.45 PM",
                    "open": true,
                    "professor": "Rosenberg, Bryan"
                }
            ],
            "course_name": "",
            "description": "SOED-UE 1015\n\n   Educ as Soc Institution\n\nPart of the common pedagogical core, this course provides an introduction to the social foundations of education. The structure of education in terms of the rights and responsibilities of teachings, administrators, community members and policy makers in relation to the rest of the society are explored from both legal and sociological credits of view. Comparisons with education and schooling in other countries are made. The study of particular school and professional issues includes diversity, student variability, bilingualism, and special education in terms of their effects on policy, practice...\n\n      more description for SOED-UE 1015 »\n\n      \n\n\n\nPart of the common pedagogical core, this course provides an introduction to the social foundations of education. The structure of education in terms of the rights and responsibilities of teachings, administrators, community members and policy makers in relation to the rest of the society are explored from both legal and sociological credits of view. Comparisons with education and schooling in other countries are made. The study of particular school and professional issues includes diversity, student variability, bilingualism, and special education in terms of their effects on policy, practice, and student and teacher rights.\n\n      less description for SOED-UE 1015 «",
            "offering": true
        },
        {
            "course_id": "SOED-UE 1025",
            "course_name": "Sociology of Urban Life and Education",
            "description": "SOED-UE 1025 Sociology of Urban Life and Education \nProcesses of urban growth and change as well as the economic, political, social, and psychological consequences of urban growth and change processes, especially as regards education.",
            "offering": false
        },
        {
            "course_id": "SOED-UE 1030",
            "course_name": "Art and City: a Sociological Prespect",
            "description": "SOED-UE 1030 Art and City: a Sociological Prespect \nA broad introduction to the political and spatial dynamics of artistic-production in twentieth- and twenty-first centuries. Artists are viewed as makers of culture but also of urban character and geography - essential components in the elaborate divisions of labor which create the global metropolis.  Readings and lectures draw from a range of historical periods, geographic locations, and artistic genres.\n\nLiberal Arts Core/CORE Equivalent - satisfies the requirement for Society & Social Sciences",
            "offering": false
        },
        {
            "course_id": "SOED-UE 1050",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17394",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 369",
                    "time": "Tue,Thu 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Fay, Margaret"
                }
            ],
            "course_name": "",
            "description": "SOED-UE 1050\n\n   Lesbian, Gay, Bisexual, Transgender Topics in Education:\n\nThis course focuses on LGBT experiences, with an emphasis on schools & young people. The course helps students develop vocabulary & general understanding of LGBT identities, particularly as they are depicted through sexual identity development models & popular coming out narratives. Students will apply social theory to coming out narratives to gain a critical perspective on how LGBT identities are produced. Students will also examine how schools have responded to sexual & gender diversity, paying particular attention to obstacles & potential solutions to create inclusive educational environmen...\n\n      more description for SOED-UE 1050 »\n\n      \n\n\n\nThis course focuses on LGBT experiences, with an emphasis on schools & young people. The course helps students develop vocabulary & general understanding of LGBT identities, particularly as they are depicted through sexual identity development models & popular coming out narratives. Students will apply social theory to coming out narratives to gain a critical perspective on how LGBT identities are produced. Students will also examine how schools have responded to sexual & gender diversity, paying particular attention to obstacles & potential solutions to create inclusive educational environments for LGBT people.\n\n      less description for SOED-UE 1050 «",
            "offering": true
        }
    ]
}