{
    "major_id": "SOED-GE",
    "file": "./2015-2016/Sociology_of_Education_(SOED-GE).html",
    "courses": [
        {
            "course_id": "SOED-GE 2002",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3351",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "KIMB 301",
                    "time": "Tue 4.55 PM - 6.35 PM",
                    "open": true,
                    "professor": "Legewie, Joscha"
                },
                {
                    "format": "Lecture",
                    "class_id": "4170",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "SILV 403",
                    "time": "Thu 9.00 AM - 10.40 AM",
                    "open": true,
                    "professor": "Voulgarides, Catherine"
                }
            ],
            "course_name": "Intro to Sociology of Ed",
            "description": "SOED-GE 2002 Intro to Sociology of Ed \nBasic behavioral science principles applied to the study of education as a social institution. An examination of social pressures and conflicts that underlie controversies in the field of education. Inequality, innovation, organizational control are some areas to be studied.",
            "offering": true
        },
        {
            "course_id": "SOED-GE 2010",
            "course_name": "",
            "description": "SOED-GE 2010\n\n   Schools/Neighborhoods/Educational Achievement in the U.S.\n\nThis course introduces students to research on the role of schools &  neighborhoods for educational achievement with a focus on the U.S. It  covers the historical development of neighborhood & school segregation and asks whether & how schools & neighborhoods influence the educational achievement of students. Does the school & neighborhood context affect educational achievement? What are the  mechanisms that explain these effects? What are the conditions under which they occur? Are relocation or desegregation programs such as Moving to Opportunity (MTO), school busing or similar interventions e...\n\n      more description for SOED-GE 2010 »\n\n      \n\n\n\nThis course introduces students to research on the role of schools &  neighborhoods for educational achievement with a focus on the U.S. It  covers the historical development of neighborhood & school segregation and asks whether & how schools & neighborhoods influence the educational achievement of students. Does the school & neighborhood context affect educational achievement? What are the  mechanisms that explain these effects? What are the conditions under which they occur? Are relocation or desegregation programs such as Moving to Opportunity (MTO), school busing or similar interventions effective?\n\n      less description for SOED-GE 2010 «",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2055",
            "course_name": "",
            "description": "SOED-GE 2055\n\n   Cultural Psychology:\n\nThis course will introduce students to basic research on the psychocultural study of human development. It is designed to provide an overview of conceptual and empirical work on the psychocultural study of childhood and adolescence, the cultural patterning of interpersonal relationships including family life, peer groups, and schooling in plural societies. We will be examing basic research privileging comparative and interdisciplinary approaches with an emphasis on psychocultural levels of analysis. Topics of concern shall include theoretical work socialization, identity, immigration, transnat...\n\n      more description for SOED-GE 2055 »\n\n      \n\n\n\nThis course will introduce students to basic research on the psychocultural study of human development. It is designed to provide an overview of conceptual and empirical work on the psychocultural study of childhood and adolescence, the cultural patterning of interpersonal relationships including family life, peer groups, and schooling in plural societies. We will be examing basic research privileging comparative and interdisciplinary approaches with an emphasis on psychocultural levels of analysis. Topics of concern shall include theoretical work socialization, identity, immigration, transnationalism, globalization, and transculturation as it related to youth, families and communities, the psychocultural study of race and ethnicity, and the interdisciplinary study of social violence and trauma in comparative perspective.\n\n      less description for SOED-GE 2055 «",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2090",
            "course_name": "Plnd Chng Organ Settings",
            "description": "SOED-GE 2090 Plnd Chng Organ Settings \nChange in complex organizations is viewed as a social process composed of stages: initiation, implementation, and incorporation.  Studies of hospitals, schools, and other bureaucratic settings are compared emphasizing theoretical and practical issues of resistance to and implementation of the proposed changes.  Procedures for assessing organizational change are discussed.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2091",
            "course_name": "Sociology of Educ in Developing Areas",
            "description": "SOED-GE 2091 Sociology of Educ in Developing Areas \nThis course explores challenges posed to the development and improvement of education and educational systems in regions undergoing economic and political transition and development. Focus is especially on interventions in curriculum, teacher training, assessment, and reform.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2094",
            "course_name": "Education & Development in Latin America",
            "description": "SOED-GE 2094 Education & Development in Latin America \nEducation and social issues in Latin America. Explores the relationship between the national development and education - understood broadly as the processes and institutions, both formal and informal, through which people shape their cultural identities and political order. Using conceptual perspectives drawn from comparative education, the course will include case studies of individual nations as well as issues embracing the region as a whole.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2097",
            "course_name": "Latinos in Urban Schools",
            "description": "SOED-GE 2097 Latinos in Urban Schools \nIntroduction to theories and research on Latinos in urban areas, exploring their educational achievements. In particular, course reviews comparative lack of educational success. Topics include assimilation, language, and the interplay of race, class, and gender and transnational communities.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2163",
            "course_name": "Soc of Higher Ed",
            "description": "SOED-GE 2163 Soc of Higher Ed \nThe relationship of higher educational institutions to other social institutions in American society.  The development of this relationship and its consequences and  implications for the internal structure and functioning of higher educational organizations and for society at large.  Issues surrounding role of students, faculty, administration, and external interests are examined.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2300",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "4122",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Stulberg, Lisa",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "4461",
                    "section": "003",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "3352",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Arum, Richard",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Independent Study",
                    "class_id": "3353",
                    "section": "004",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Noguera, Pedro",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Ind Study",
            "description": "SOED-GE 2300 Ind Study \nIt should be noted that independent study requires a minimum of 45 hours of work per point. Independent study cannot be applied to the established professional education sequence in teaching curricula. Each departmental program has established its own maximum credit allowance for independent study. This information may be obtained from a student?s department. Prior to registering for independent study, each student should obtain an Independent Study Approval Form from the adviser.",
            "offering": true
        },
        {
            "course_id": "SOED-GE 2325",
            "course_name": "The Learning of Culture",
            "description": "SOED-GE 2325 The Learning of Culture \nExamination of the process of socialization and its interrelationship with culture in a cross-cultural perspective.  Basic issues in the study of the relationship of culture and the individual are considered.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2371",
            "course_name": "Social Inequality & Educ",
            "description": "SOED-GE 2371 Social Inequality & Educ \nConsideration of the role of educational institutions in fostering, preventing, and maintaining equalities and inequalities in American society.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2373",
            "course_name": "",
            "description": "SOED-GE 2373\n\n   Gender and Inequality: The Role of Schools\n\nThis course will cover issues concerning gender & inequality in education from early childhood to post-secondary education including professional schools with an emphasis on what happens to the success of girls in the elementary & secondary school settings once they enter post-secondary & graduate/professional education as well as the workforce.  As there are limited opportunities to foreground gender in this manner, this course will be focused on it.  The topics include how schools have historically shortchanged female students even after mass coeducation in the United States in the 1960s & 1...\n\n      more description for SOED-GE 2373 »\n\n      \n\n\n\nThis course will cover issues concerning gender & inequality in education from early childhood to post-secondary education including professional schools with an emphasis on what happens to the success of girls in the elementary & secondary school settings once they enter post-secondary & graduate/professional education as well as the workforce.  As there are limited opportunities to foreground gender in this manner, this course will be focused on it.  The topics include how schools have historically shortchanged female students even after mass coeducation in the United States in the 1960s & 1970s & the passage of Title IX; single-sex education for females & for males at the primary, secondary & post-secondary levels; the differences between coeducation & mixed-sex education; legal issues & gender equality in education; & how gender, race & class come\ntogether in schools\n\n      less description for SOED-GE 2373 «",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2400",
            "course_name": "Fndts of Ed:Ed Soc",
            "description": "SOED-GE 2400 Fndts of Ed:Ed Soc \nFundamental sociological concepts and theories are examined and applied to areas of doctoral and professional work.  Contemporary educational and social issues are discussed from a sociological vantage point.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2510",
            "course_name": "Thesis Seminar I",
            "description": "SOED-GE 2510 Thesis Seminar I \nStudents develop detailed proposals for their thesis research, obtain IRB (Institutional Review Board) approval (when applicable) and commence thesis work.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 2511",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "3355",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "Stulberg, Lisa",
                    "time": "Mon 11.00 AM - 12.40 PM",
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "Thesis Seminar II",
            "description": "SOED-GE 2511 Thesis Seminar II \nStudents will regularly consult with a faculty member as their project develops, and develop strong collegial relations with their fellow thesis-writers. Throughout the tenure of their thesis work, students will be expected to consult with faculty in HMSS and GSAS Sociology who have relevant expertise in students' fields of research specialization.",
            "offering": true
        },
        {
            "course_id": "SOED-GE 2650",
            "course_name": "Prof Ornt/Ethical Issues in Sch Cnslng",
            "description": "SOED-GE 2650 Prof Ornt/Ethical Issues in Sch Cnslng",
            "offering": false
        },
        {
            "course_id": "SOED-GE 3030",
            "course_name": "Classical Social Theory",
            "description": "SOED-GE 3030 Classical Social Theory \nExamines major figures in social thought from the 17th to the 20th century. The course includes readings from the traditional canon - Hobbes, Locke, Rousseau, Marx, Weber, Durkheim, Simmel and Parsons - as well as critics of the canon from black and female writers. Major themes include the legacy of the enlightenment, increased differentiation between social, political and economic spheres, diverse theories of historical change, and how these authors have shaped contemporary theoretical and methodological approaches to contemporary analysis.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 3035",
            "course_name": "Sociology of Educ Law",
            "description": "SOED-GE 3035 Sociology of Educ Law \nThe course provides sociological examination of how law affects education at the doctoral level. Theoretical work in law and society and the sociology of organizations is reviewed, as well as in depth examination of school desegregation, inequality in educational resources, and expansion of student rights.  The course identifies how the effects of legal intervention on schooling are mediated by social actors and school organizational cultures, producing at time unintended and unanticipated consequences.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 3111",
            "course_name": "Prosem:I Soc/Anthro Ed",
            "description": "SOED-GE 3111 Prosem:I Soc/Anthro Ed \nThe program seminar requirement is met by E20.3111 and E20.3112, while E20.3113 and E20.3114 fulfill the dissertation proposal requirement.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 3112",
            "course_name": "Prosem:II Soc/Anthro Ed",
            "description": "SOED-GE 3112 Prosem:II Soc/Anthro Ed \nThe program seminar requirement is met by E20.3111 and E20.3112, while E20.3113 and E20.3114 fulfill the dissertation proposal requirement.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 3113",
            "course_name": "Prosem:III Soc/Anthro Ed",
            "description": "SOED-GE 3113 Prosem:III Soc/Anthro Ed \nThe program seminar requirement is met by E20.3111 & E20.3112, while E20.3113 & E20.3114 fulfill the dissertation proposal requirement.",
            "offering": false
        },
        {
            "course_id": "SOED-GE 3114",
            "course_name": "Prosem:IV Soc/Anthro Ed",
            "description": "SOED-GE 3114 Prosem:IV Soc/Anthro Ed \nThe program seminar requirement is met by E20.3111 & E20.3112, while E20.3113 & E20.3114 fulfill the dissertation proposal requirement.",
            "offering": false
        }
    ]
}