{
    "major_id": "SASEM-UG",
    "file": "./2015-2016/Study_Away_Seminar_(SASEM-UG).html",
    "courses": [
        {
            "course_id": "SASEM-UG 9100",
            "course_name": "",
            "description": "SASEM-UG 9100\n\n   European Environmental Policy\n\nThe course gives an introduction to various aspects of EU environmental policy making and policy implementation. After a brief recap of the basics of policy making in the EU, students will learn about the guiding principles and developments within EU environmental policy, the main actors and their interests in and influence on policy making. An optional part of the course might be a visit to the European House of the European Commission (EC) in Berlin where students either have the opportunity to role-play the decision-making process of the EC on the introduction of CO2-standards for cars or t...\n\n      more description for SASEM-UG 9100 »\n\n      \n\n\n\nThe course gives an introduction to various aspects of EU environmental policy making and policy implementation. After a brief recap of the basics of policy making in the EU, students will learn about the guiding principles and developments within EU environmental policy, the main actors and their interests in and influence on policy making. An optional part of the course might be a visit to the European House of the European Commission (EC) in Berlin where students either have the opportunity to role-play the decision-making process of the EC on the introduction of CO2-standards for cars or to engage in a debate with an EC representative. The second half of the course analyses EU environmental policies in different issue areas (e.g. climate change, biodiversity, waste) for their effectiveness in solving environmental problems. Different policy instruments are discussed for their merits and shortcomings (one example will be the EU Emissions Trading System) and linkages to other issue areas of EU policy making (e.g. industry and agriculture) are discussed. Finally, the course provides an international perspective on EU environmental policy making: sessions will evaluate the strengths and weaknesses of EU environmental policy making at home and in international negotiations, compare it with US environmental politics, and discuss future challenges (e.g. EU enlargement) and trends for EU environmental governance.\n\n      less description for SASEM-UG 9100 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9102",
            "course_name": "",
            "description": "SASEM-UG 9102\n\n   Topics in German Cinema:\n\nFrom its beginnings, cinema in Germany was embroiled in heated debates about its aesthetic, social and political value: Is cinema a form of art or mere entertainment for the masses? And what does it mean to be a work of art? What is its significance as popular medium? Film’s relevance reaches far beyond the worlds it depicts on  screen. It is intrinsically linked to questions of German identity and self-perception.  This course provides an overview of the changing roles of cinema in the turbulent history of the 20th century in Germany as they manifests in changing visions of the city. The cour...\n\n      more description for SASEM-UG 9102 »\n\n      \n\n\n\nFrom its beginnings, cinema in Germany was embroiled in heated debates about its aesthetic, social and political value: Is cinema a form of art or mere entertainment for the masses? And what does it mean to be a work of art? What is its significance as popular medium? Film’s relevance reaches far beyond the worlds it depicts on  screen. It is intrinsically linked to questions of German identity and self-perception.  This course provides an overview of the changing roles of cinema in the turbulent history of the 20th century in Germany as they manifests in changing visions of the city. The course aims to give some insight into the competing ideas of intellectual histories and evaluate them from the angle of the visual medium and to thus offer  insight in the construction of German identity.\n\n      less description for SASEM-UG 9102 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9150",
            "course_name": "",
            "description": "SASEM-UG 9150\n\n   Tango & Mass Culture\n\nThis course explores Tango as an aesthetic, social and cultural formation that is articulated in interesting and complex ways with the traditions of culture and politics in Argentina and Latin America more generally. During the rapid modernization of the 1920s and 1930s, Tango (like Brazilian Samba), which had been seen as a primitive and exotic dance, began to emerge as a kind of modern primitive art form that quickly came to occupy a central space in nationalist discourse. The course explores the way that perceptions of a primitive and a modern converge in this unique and exciting art. In ad...\n\n      more description for SASEM-UG 9150 »\n\n      \n\n\n\nThis course explores Tango as an aesthetic, social and cultural formation that is articulated in interesting and complex ways with the traditions of culture and politics in Argentina and Latin America more generally. During the rapid modernization of the 1920s and 1930s, Tango (like Brazilian Samba), which had been seen as a primitive and exotic dance, began to emerge as a kind of modern primitive art form that quickly came to occupy a central space in nationalist discourse. The course explores the way that perceptions of a primitive and a modern converge in this unique and exciting art. In addition, the course will consider tango as a global metaphor with deeply embedded connections to urban poverty, social marginalization, and masculine authority.\n\n      less description for SASEM-UG 9150 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9151",
            "course_name": "",
            "description": "SASEM-UG 9151\n\n   Myths, Icons and Invented Traditions: A Cultural History of Latin America (in Spanish)\n\nMitos, íconos y tradiciones inventadas is an advanced conversation course, which seeks to make students familiar with the rich and complex history of Latin America through the study of some of its most known and iconic cultural expressions. It does also work as an introductory map to the most influential and widespread approaches in Latin American social sciences, cultural studies and literary criticism. Thus, students will not only have a first encounter with key historical processes that lie behind some well know cultural icons, but also will be introduced to arguments and ways of writing th...\n\n      more description for SASEM-UG 9151 »\n\n      \n\n\n\nMitos, íconos y tradiciones inventadas is an advanced conversation course, which seeks to make students familiar with the rich and complex history of Latin America through the study of some of its most known and iconic cultural expressions. It does also work as an introductory map to the most influential and widespread approaches in Latin American social sciences, cultural studies and literary criticism. Thus, students will not only have a first encounter with key historical processes that lie behind some well know cultural icons, but also will be introduced to arguments and ways of writing that help constitute modern Latin American educated Spanish. The course will be structured in seven topics; each topic will be covered in two weeks. During these four classes, students will be exposed to different kinds of cultural materials, including literary texts, film, papers from several disciplines, theater plays, art shows and live concerts.\n\n      less description for SASEM-UG 9151 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9152",
            "course_name": "Art and the City:Buenos Aires, New York, Rio de Janeiro and Mexico City",
            "description": "SASEM-UG 9152 Art and the City:Buenos Aires, New York, Rio de Janeiro and Mexico City \nThis course studies modern and contemporary art and architecture through a strategic focus on the cities of Buenos Aires, New York, Rio de Janeiro and Mexico City. We consider key artworks and architectural movements, approaching art history in urban, socio-historical and contextual terms. Emphasis is placed upon the city as a hub for the production and reception of art.",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9201",
            "course_name": "Italy and Italians in English Literature from the Romantics to Modernism",
            "description": "SASEM-UG 9201 Italy and Italians in English Literature from the Romantics to Modernism",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9202",
            "course_name": "",
            "description": "SASEM-UG 9202\n\n   The Two World Wars in Literature\n\nThis course focuses on literary representations of WWI and WWII. The online course pack includes examples of the political and military rhetoric to which Montale and Hemingway objected, historical essays and images (war photographs, recruitment posters, etc.), as well as the shorter texts we are studying. Central themes in the course are the concepts of political literature and historical fiction and the contrasting approaches and theoretical premises of classical realism and modernism. Among the supplementary sources available in the Villa Ulivi library are two good cultural histories on the ...\n\n      more description for SASEM-UG 9202 »\n\n      \n\n\n\nThis course focuses on literary representations of WWI and WWII. The online course pack includes examples of the political and military rhetoric to which Montale and Hemingway objected, historical essays and images (war photographs, recruitment posters, etc.), as well as the shorter texts we are studying. Central themes in the course are the concepts of political literature and historical fiction and the contrasting approaches and theoretical premises of classical realism and modernism. Among the supplementary sources available in the Villa Ulivi library are two good cultural histories on the subject: James Shehan Where Have All the Soldiers Gone and Mark Mazower Dark Continent. Other recurring issues will be gender, sexuality, religion, class politics, kitsch, psychoanalysis, rhetoric, and power.\n\n      less description for SASEM-UG 9202 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9250",
            "course_name": "",
            "description": "SASEM-UG 9250\n\n   Seeing London's Architecture\n\nLondon, like New York is a rich and complicated city. Unlike New York however, it has been continuously occupied for just under 2000 years. Almost every epoch of London’s history can be detected in the city’s architecture and distinctive streetscape. This course is designed to work in three ways. Firstly it is an opportunity to learn about London’s architecture and art by physically exploring it. Secondly this class is an introduction to sketching and keeping a travel notebook, a basic and useful skill that any liberal arts student should have an experience of. Finally, and perhaps most import...\n\n      more description for SASEM-UG 9250 »\n\n      \n\n\n\nLondon, like New York is a rich and complicated city. Unlike New York however, it has been continuously occupied for just under 2000 years. Almost every epoch of London’s history can be detected in the city’s architecture and distinctive streetscape. This course is designed to work in three ways. Firstly it is an opportunity to learn about London’s architecture and art by physically exploring it. Secondly this class is an introduction to sketching and keeping a travel notebook, a basic and useful skill that any liberal arts student should have an experience of. Finally, and perhaps most importantly, this course teaches how to 'read' a town or city. The ability to visually make sense of European built-environment should really help in understanding the architecture of New York City and, of course, town and cities throughout the United States, and anywhere else.\n\n      less description for SASEM-UG 9250 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9350",
            "course_name": "",
            "description": "SASEM-UG 9350\n\n   The French Art World in the 19th Century:From David-Impressionism\n\nThis course investigates French art of the nineteenth-century, paying particular attention to the way in which historical factors informed artistic production during this period.  Beginning with David, Neo-Classicism and the French Revolution, we will move to the Napoleonic period, Romanticism, the Revolutions of 1830 and 1848, and trace the connection from Realism to Impressionism.  The second half of the course will examine the disparate movements spurred by Impressionism, collectively referred to as Post-Impressionism (including Neo-Impressionism, Synthetism, and Symbolism), and will culmin...\n\n      more description for SASEM-UG 9350 »\n\n      \n\n\n\nThis course investigates French art of the nineteenth-century, paying particular attention to the way in which historical factors informed artistic production during this period.  Beginning with David, Neo-Classicism and the French Revolution, we will move to the Napoleonic period, Romanticism, the Revolutions of 1830 and 1848, and trace the connection from Realism to Impressionism.  The second half of the course will examine the disparate movements spurred by Impressionism, collectively referred to as Post-Impressionism (including Neo-Impressionism, Synthetism, and Symbolism), and will culminate with the rise of Art Nouveau at the end of the century.  Throughout, we will interrogate how social forces (including politics, gender, race, religion, etc.) influenced the manner in which “Modern” art was produced and understood in nineteenth-century France. Conducted in English.\n\n      less description for SASEM-UG 9350 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9351",
            "course_name": "",
            "description": "SASEM-UG 9351\n\n   Paris in French and Expatriate LiteratureParis in French & Expatriate Literature\n\nIn this course, we will explore the ways in which Paris plays a role in the representation of the subject. Through the study of novels and autobiographies by Breton, Hemingway, Stein, Duras, Modiano, de Beauvoir, and Baldwin, we will ask, what is the role of place in the imagining or invention of the self? How does the experience of a specific city, Paris, influence the formation of identity? How do these authors represent, or subvert, the notion of the ‘real’? Although the focus of this course is literary, we will also engage with major political, cultural, and artistic movements of the perio...\n\n      more description for SASEM-UG 9351 »\n\n      \n\n\n\nIn this course, we will explore the ways in which Paris plays a role in the representation of the subject. Through the study of novels and autobiographies by Breton, Hemingway, Stein, Duras, Modiano, de Beauvoir, and Baldwin, we will ask, what is the role of place in the imagining or invention of the self? How does the experience of a specific city, Paris, influence the formation of identity? How do these authors represent, or subvert, the notion of the ‘real’? Although the focus of this course is literary, we will also engage with major political, cultural, and artistic movements of the period, exploring the ways in which our writers negotiate history through their writings. Conducted in English.\n\n      less description for SASEM-UG 9351 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9352",
            "course_name": "",
            "description": "SASEM-UG 9352\n\n   Paris Pairs in Modern Literature and Art\n\nThis class looks closely at affinities between writers and artists who have frequented Paris cafés and ateliers together from the turn of the 20th Century up to the present day. We explore cross-pollination between the arts, as well as notable points of difference, examining works of art in the context of the dynamic artistic communities which produced them. Students learn to write about sculpture, painting, and film, as well as literature, and keep a journal of their travels within the city to pertinent neighbourhoods, parks, and museums. Our focus will be on five dynamic pairs: Rodin & Rilke...\n\n      more description for SASEM-UG 9352 »\n\n      \n\n\n\nThis class looks closely at affinities between writers and artists who have frequented Paris cafés and ateliers together from the turn of the 20th Century up to the present day. We explore cross-pollination between the arts, as well as notable points of difference, examining works of art in the context of the dynamic artistic communities which produced them. Students learn to write about sculpture, painting, and film, as well as literature, and keep a journal of their travels within the city to pertinent neighbourhoods, parks, and museums. Our focus will be on five dynamic pairs: Rodin & Rilke, Hemingway & Joyce, Stein & Picasso, Demy & Varda, Proust & Colette. Conducted in English.\n\n      less description for SASEM-UG 9352 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9400",
            "course_name": "",
            "description": "SASEM-UG 9400\n\n   Modern Dissent in Central Europe: The Art of Defeat\n\nTotalitarian ideologies which were used in European political discourse in the twentieth century to explain major historical changes have changed forever the relationship between the state and its citizens. The aspiration of the totalitarian state to acquire total control over individual lives through control of education, employment and health systems succeeded beyond anything perceived possible until then in any political regime after European Enlightenment. Nazism and Communism mobilized irrationally motivated mass support and won power in a very short time. Their success was partially base...\n\n      more description for SASEM-UG 9400 »\n\n      \n\n\n\nTotalitarian ideologies which were used in European political discourse in the twentieth century to explain major historical changes have changed forever the relationship between the state and its citizens. The aspiration of the totalitarian state to acquire total control over individual lives through control of education, employment and health systems succeeded beyond anything perceived possible until then in any political regime after European Enlightenment. Nazism and Communism mobilized irrationally motivated mass support and won power in a very short time. Their success was partially based on a mass propaganda, using fear as primary instinctive argument against a picture of both external and internal enemies. The major focus of the course will be oriented towards topics trying to explain the reasons for mass support for totalitarian ideologies and states on the basis of individual psychology. We will examine psychological explanations of a selfvictimisation, role of a victim and a perpetrator, majority society response to mass human rights abuses and the abusive past. On this background a phenomenon of a political and cultural dissent will be introduced and discussed. The role of electronic mass media, antiglobalisation movements and global terrorism are discussed as possible modern vehicles of totalitarian tendencies and reactions against them.\n\n      less description for SASEM-UG 9400 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9401",
            "course_name": "",
            "description": "SASEM-UG 9401\n\n   Kafka and His Contexts\n\n\"A book must be an ax for the frozen sea in us,\" wrote Franz Kafka (1883-1924), one of the best known but least understood authors of our times. In this course, we will break some of the clichés which are stuck to Kafka's life and work and dive into the fascinating, intricate and profoundly humorous world of his thoughts and emotions. In Prague, the city that determined and held Kafka in its \"claws\", we will trace the possible sources of the writer's private obsessions which became the general characteristics of modern men: The sense of isolation, the anxiety, the self-irony, the sense of resp...\n\n      more description for SASEM-UG 9401 »\n\n      \n\n\n\n\"A book must be an ax for the frozen sea in us,\" wrote Franz Kafka (1883-1924), one of the best known but least understood authors of our times. In this course, we will break some of the clichés which are stuck to Kafka's life and work and dive into the fascinating, intricate and profoundly humorous world of his thoughts and emotions. In Prague, the city that determined and held Kafka in its \"claws\", we will trace the possible sources of the writer's private obsessions which became the general characteristics of modern men: The sense of isolation, the anxiety, the self-irony, the sense of responsibility and guilt, the quest for freedom, the struggle of an individual against the system. We will read selected works of Kafka, but also Meyrink - the author of Prague ghetto - and Milan Kundera. This course aims to bring the students to a point from which they can find their own genuine and intimate understanding of Kafka's writing.\n\n      less description for SASEM-UG 9401 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9402",
            "course_name": "",
            "description": "SASEM-UG 9402\n\n   Civil Resistance in Central & Eastern Europe\n\nCivil resistance is not the same as opting out of society or having views that go against the grain. It is fundamentally about deciding not to conform with repressive regimes. It is also about choosing a mode of action that brings with it personal dangers even when, as is usual, it advocates non-violence. This course examines the nature and significance of civil resistance in Central and Eastern Europe in the 20th century. In studying resistance literature (including poetry and song), art and film, we will draw on ideas and arguments from the disciplines of history, political science, literatu...\n\n      more description for SASEM-UG 9402 »\n\n      \n\n\n\nCivil resistance is not the same as opting out of society or having views that go against the grain. It is fundamentally about deciding not to conform with repressive regimes. It is also about choosing a mode of action that brings with it personal dangers even when, as is usual, it advocates non-violence. This course examines the nature and significance of civil resistance in Central and Eastern Europe in the 20th century. In studying resistance literature (including poetry and song), art and film, we will draw on ideas and arguments from the disciplines of history, political science, literature, art criticism, film studies and psychology.\n\n      less description for SASEM-UG 9402 «",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9403",
            "course_name": "Central European Film",
            "description": "SASEM-UG 9403 Central European Film \nThis interdisciplinary seminar is designed to discuss and question the identity of specific nations in European space, which has always been a fascinating crossroad of ideas and ideologies as well as the birthplace of wars and totalitarian systems. The course will cover masterpieces of Russian, Hungarian, German, Polish and Czech cinematography, focusing on several crucial periods of history, in particular WWII and its aftermath, showing moral dilemmas of individuals and nations under the Nazi regime as well as revealing the bitter truth of the Stalinist years.",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9404",
            "course_name": "Literature of Place Central Europe",
            "description": "SASEM-UG 9404 Literature of Place Central Europe",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9550",
            "course_name": "The Present Past: Archaeology and History of the Land and its Relevance",
            "description": "SASEM-UG 9550 The Present Past: Archaeology and History of the Land and its Relevance",
            "offering": false
        },
        {
            "course_id": "SASEM-UG 9551",
            "course_name": "Food and Identity in the Middle East and its Jewish Communities",
            "description": "SASEM-UG 9551 Food and Identity in the Middle East and its Jewish Communities",
            "offering": false
        }
    ]
}