{
    "major_id": "TAX-GB",
    "file": "./2015-2016/Taxation_(TAX-GB).html",
    "courses": [
        {
            "course_id": "TAX-GB 1",
            "course_name": "Spanish for Beginners",
            "description": "TAX-GB    1 Spanish for Beginners",
            "offering": false
        },
        {
            "course_id": "TAX-GB 506",
            "course_name": "Fundamentals of Film Mak",
            "description": "TAX-GB  506 Fundamentals of Film Mak",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2114",
            "course_name": "Business Law for Manager",
            "description": "TAX-GB 2114 Business Law for Manager",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2120",
            "course_name": "Entertainment Law",
            "description": "TAX-GB 2120 Entertainment Law \nThis course focuses on the entertainment aspects of mass media. Major topics include the limits of a free press and the balance between the right to publish and the right to privacy, torts, and other laws.",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2301",
            "course_name": "Fund of Fed Inc Tax I",
            "description": "TAX-GB 2301 Fund of Fed Inc Tax I",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2302",
            "course_name": "",
            "description": "TAX-GB 2302\n\n   Taxation Indvd &Bus Inco\n\nThe purpose of this course is to develop, on a sound conceptual base, a basic understanding of federal income taxation to provide tools for a practical application to business and non-business situations. Includes such topics as capital asset and property transactions, business and personal deductions, depreciation, depletion, accounting methods and periods, retirement plans, tax credits and the alternative minimum tax system. While the emphasis is on business income of individuals, the course also provides an introduction to the taxation of corporations and partnerships. During the fall semes...\n\n      more description for TAX-GB 2302 »\n\n      \n\n\n\nThe purpose of this course is to develop, on a sound conceptual base, a basic understanding of federal income taxation to provide tools for a practical application to business and non-business situations. Includes such topics as capital asset and property transactions, business and personal deductions, depreciation, depletion, accounting methods and periods, retirement plans, tax credits and the alternative minimum tax system. While the emphasis is on business income of individuals, the course also provides an introduction to the taxation of corporations and partnerships. During the fall semester, the students are required to enter the annual tax tournament scheduled for late November. Students in the spring semester are required to complete a group take-home project similar to the tax tournament case study.\n\n      less description for TAX-GB 2302 «",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2305",
            "course_name": "",
            "description": "TAX-GB 2305\n\n   Taxes & Business Strateg\n\nThe objective of this interdisciplinary course is to consider the tax environment, institutional constraints, legal procedures, and the organizational structure in arriving at optimal business decisions. Modern economic theory of tax planning is used to analyze decision making, explain institutional arrangements, and predict the effects of changing tax environments for businesses. Concepts are applied to compensation and pension planning; employee stock ownership plans; multinational tax planning; capital structure and dividend policy; debt financing to eliminate corporate level taxes; repacka...\n\n      more description for TAX-GB 2305 »\n\n      \n\n\n\nThe objective of this interdisciplinary course is to consider the tax environment, institutional constraints, legal procedures, and the organizational structure in arriving at optimal business decisions. Modern economic theory of tax planning is used to analyze decision making, explain institutional arrangements, and predict the effects of changing tax environments for businesses. Concepts are applied to compensation and pension planning; employee stock ownership plans; multinational tax planning; capital structure and dividend policy; debt financing to eliminate corporate level taxes; repackaging ownership rights through joint ventures and partnerships; mergers and acquisitions; tax-free reorganizations and divestitures; and preservation of tax attributes in reorganizations. Classroom discussions include problems and case studies.\n\n      less description for TAX-GB 2305 «",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2310",
            "course_name": "Tax Planning for Mgt",
            "description": "TAX-GB 2310 Tax Planning for Mgt",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2314",
            "course_name": "Business Law for Manager",
            "description": "TAX-GB 2314 Business Law for Manager \nThe objective of this course is to help develop an ability to recognize and understand legal issues in business. This course focuses on the body of law governing the types of issues that students can expect to encounter in their roles as managers of public and private companies, consultants, and entrepreneurs. Topics for discussion include, but are not limited to contract and cyber laws; the various forms of business structures (e.g., partnerships, corporations, and limited liability companies); business torts; product liability; and specific issues regarding entrepreneurs and employment law.",
            "offering": false
        },
        {
            "course_id": "TAX-GB 2315",
            "course_name": "Law of Property, Etc.",
            "description": "TAX-GB 2315 Law of Property, Etc.",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3101",
            "course_name": "Leg & Soc Contex of Bus",
            "description": "TAX-GB 3101 Leg & Soc Contex of Bus",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3114",
            "course_name": "Federal Estate & Gift Ta",
            "description": "TAX-GB 3114 Federal Estate & Gift Ta",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3115",
            "course_name": "Exec Compens & Prof-Shar",
            "description": "TAX-GB 3115 Exec Compens & Prof-Shar",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3116",
            "course_name": "Tax Prob Partnerships",
            "description": "TAX-GB 3116 Tax Prob Partnerships",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3133",
            "course_name": "Tax Problem of Corp Reor",
            "description": "TAX-GB 3133 Tax Problem of Corp Reor",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3134",
            "course_name": "Tax Prob of Consldtd Rtr",
            "description": "TAX-GB 3134 Tax Prob of Consldtd Rtr",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3135",
            "course_name": "Federal Tax Practices",
            "description": "TAX-GB 3135 Federal Tax Practices",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3170",
            "course_name": "Independent Study",
            "description": "TAX-GB 3170 Independent Study",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3316",
            "course_name": "Tax Prob of Partnerships",
            "description": "TAX-GB 3316 Tax Prob of Partnerships",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3333",
            "course_name": "Tax Prob of Corp Reorg",
            "description": "TAX-GB 3333 Tax Prob of Corp Reorg",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3335",
            "course_name": "Federal Tax Practices",
            "description": "TAX-GB 3335 Federal Tax Practices",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3336",
            "course_name": "",
            "description": "TAX-GB 3336\n\n   Tax Mrgrs,Aquisit&Rlt Mt\n\nA study of the income tax rules relating to the formation and operation of business corporations. This course includes such topics as the organization of the corporation, redemptions, liquidations, reorganizations, divisions, multiple corporations, corporate tax attributes and carryovers, state income taxation, and U.S. taxation of foreign source income. The emphasis is, however, on the tax aspects of mergers and acquisitions. Classroom discussions include problems and case studies. Students are assigned a group project requiring the solution of a case study in the area of corporate reorganiza...\n\n      more description for TAX-GB 3336 »\n\n      \n\n\n\nA study of the income tax rules relating to the formation and operation of business corporations. This course includes such topics as the organization of the corporation, redemptions, liquidations, reorganizations, divisions, multiple corporations, corporate tax attributes and carryovers, state income taxation, and U.S. taxation of foreign source income. The emphasis is, however, on the tax aspects of mergers and acquisitions. Classroom discussions include problems and case studies. Students are assigned a group project requiring the solution of a case study in the area of corporate reorganizations and divisions.\n\n      less description for TAX-GB 3336 «",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3340",
            "course_name": "Tax Asp of Intl Bus",
            "description": "TAX-GB 3340 Tax Asp of Intl Bus",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3343",
            "course_name": "Tax Aspects of Intl Bus",
            "description": "TAX-GB 3343 Tax Aspects of Intl Bus",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3346",
            "course_name": "Tax Aspects of Intl Bus",
            "description": "TAX-GB 3346 Tax Aspects of Intl Bus",
            "offering": false
        },
        {
            "course_id": "TAX-GB 3370",
            "course_name": "Independent Study",
            "description": "TAX-GB 3370 Independent Study",
            "offering": false
        },
        {
            "course_id": "TAX-GB 6302",
            "course_name": "",
            "description": "TAX-GB 6302\n\n   Tax of Indvdl & Bus Incm\n\nThe purpose of this course is to develop, on a sound conceptual base, a basic understanding of federal income taxation to provide tools for a practical application to business and nonbusiness situations. Topics include capital asset and property transactions, business and personal deductions, depreciation, depletion, accounting methods and periods, retirement plans, tax credits, and the alternative minimum tax system. While the emphasis is on taxation of the business income of individuals, the course also provides an introduction to the taxation of corporations and partnerships. During the fal...\n\n      more description for TAX-GB 6302 »\n\n      \n\n\n\nThe purpose of this course is to develop, on a sound conceptual base, a basic understanding of federal income taxation to provide tools for a practical application to business and nonbusiness situations. Topics include capital asset and property transactions, business and personal deductions, depreciation, depletion, accounting methods and periods, retirement plans, tax credits, and the alternative minimum tax system. While the emphasis is on taxation of the business income of individuals, the course also provides an introduction to the taxation of corporations and partnerships. During the fall semester, the students are required to enter the annual tax tournament scheduled for late November. Students in the spring semester are required to complete a group take-home project similar to the tax tournament case study.\n\n      less description for TAX-GB 6302 «",
            "offering": false
        }
    ]
}