{
    "major_id": "TCTM1-GC",
    "file": "./2015-2016/Tourism_Management_(TCTM1-GC).html",
    "courses": [
        {
            "course_id": "TCTM1-GC 1",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2546",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCTM1-GC    1\n\n   Industry Orientation\n\nEvery industry has its own unique patterns of organizational behavior, distribution systems, supply analysis and other managerial challenges.  This course examines the spectrum of entities that comprise the Hospitality, Tourism and Travel Industries through management analysis and economic impact of each tourism sector group.  The class explores developing strategic partnerships, designing public-private interfaces, creating of management practices, and current hospitality and tourism trends and impacts.  Use of senior-level industry experts will aid this overview of the worldwide hospitality ...\n\n      more description for TCTM1-GC    1 »\n\n      \n\n\n\nEvery industry has its own unique patterns of organizational behavior, distribution systems, supply analysis and other managerial challenges.  This course examines the spectrum of entities that comprise the Hospitality, Tourism and Travel Industries through management analysis and economic impact of each tourism sector group.  The class explores developing strategic partnerships, designing public-private interfaces, creating of management practices, and current hospitality and tourism trends and impacts.  Use of senior-level industry experts will aid this overview of the worldwide hospitality and tourism industry.\n\n      less description for TCTM1-GC    1 «",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 2",
            "course_name": "Writing Strategies for Graduate Students",
            "description": "TCTM1-GC    2 Writing Strategies for Graduate Students",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 5",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2547",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCTM1-GC    5\n\n   Industry & Business Principles\n\nThis course provides an overview of basic economic, accounting, and finance principles and concepts.  Its purpose is to set the foundation upon which in-depth economic, accounting, and finance theory rests.  Topics include basic supply and demand theory with price relationships, the concept of elasticity and market adjustments, the difference between macro and micro economics, international trade, exchange rates, the concept of a market economy, the role of the firm, business cycles, inflation, recession, basic financial mathematics, concept of leverage, debt and equity, and basic accounting a...\n\n      more description for TCTM1-GC    5 »\n\n      \n\n\n\nThis course provides an overview of basic economic, accounting, and finance principles and concepts.  Its purpose is to set the foundation upon which in-depth economic, accounting, and finance theory rests.  Topics include basic supply and demand theory with price relationships, the concept of elasticity and market adjustments, the difference between macro and micro economics, international trade, exchange rates, the concept of a market economy, the role of the firm, business cycles, inflation, recession, basic financial mathematics, concept of leverage, debt and equity, and basic accounting and financial terminology.  Also included are basic computer operations and financial calculator procedures.\n\n      less description for TCTM1-GC    5 «",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 8",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2548",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Communications & Critical Thinking",
            "description": "TCTM1-GC    8 Communications & Critical Thinking \nThis workshop is designed to provide students with an overview of critical thinking and communications.  The content will review the concepts of critical thinking by examining the evaluation and analytical skills in reading, writing, speaking and listening. Emphasis will be placed on the process of analyzing and organizing thinking before and during written and verbal communications.",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 9",
            "course_name": "Graduate Internship",
            "description": "TCTM1-GC    9 Graduate Internship \nThe Center arranges with various hotel and tourism enterprises, internships for students who have successfully completed 15 credits of course work.  Students work a minimum of 300 hours during the period of the internship.  Admission to an internship depends on availability and approval from both the program’s internship office and the cooperating employer.",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 10",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2773",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Career and Professional Development",
            "description": "TCTM1-GC   10 Career and Professional Development \nAn overview of the career process. Topics to be covered include: focusing professional skills and interests, writing effective resumes and cover letters, interviewing and networking techniques, conducting a job search, and career transitions.",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 1030",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2549",
                    "section": "001",
                    "period": "09/03/2015 - 12/15/2015",
                    "location": null,
                    "time": "Thu 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "SILV 509"
                },
                {
                    "format": "Lecture",
                    "class_id": "17510",
                    "section": "002",
                    "period": "09/04/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 11.30 AM - 2.00 PM",
                    "open": true,
                    "professor": "7E12 121 (SB)"
                }
            ],
            "course_name": "",
            "description": "TCTM1-GC 1030\n\n   Consulting Strategies\n\nThis course will focus on understanding the roles and responsibilities of consultants, both internal and external.  By examining models, approaches, and best practices used by industry consulting professionals, students will understand the process for conducting a consulting project. Topics to be covered include: preparing a proposal, diagnosing organizational culture, contracting with a client, managing client communications, accessing and assessing resources, developing the deliverables, monitoring progress, reporting results, achieving engagement closure, and re-contracting.  Students will ...\n\n      more description for TCTM1-GC 1030 »\n\n      \n\n\n\nThis course will focus on understanding the roles and responsibilities of consultants, both internal and external.  By examining models, approaches, and best practices used by industry consulting professionals, students will understand the process for conducting a consulting project. Topics to be covered include: preparing a proposal, diagnosing organizational culture, contracting with a client, managing client communications, accessing and assessing resources, developing the deliverables, monitoring progress, reporting results, achieving engagement closure, and re-contracting.  Students will conduct a consulting project from contracting to presentation of results, working in teams, with appropriate clients under the guidance of a faculty member.\nPrerequisites: Student must be in their final 12 credits of the program, Applied Research Methods – TCTM1-GC 1050.\n\n      less description for TCTM1-GC 1030 «",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 1040",
            "course_name": "",
            "description": "TCTM1-GC 1040\n\n   Tourism Planning\n\nThis course explores tourism policy analysis and planning in today’s complex and interdependent global environment.  Students are prepared to manage, direct, and lead planning initiatives in many different sectors of the tourism field.  Students explore methods to source and analyze data, direct planning initiatives, and use technology to evaluate options and obtain measurable results.  Students investigate various strategic planning methods and industry case studies.  Topics include analyzing resources; developing research-based plans; measuring efficacy; analyzing impacts; forecasting; devel...\n\n      more description for TCTM1-GC 1040 »\n\n      \n\n\n\nThis course explores tourism policy analysis and planning in today’s complex and interdependent global environment.  Students are prepared to manage, direct, and lead planning initiatives in many different sectors of the tourism field.  Students explore methods to source and analyze data, direct planning initiatives, and use technology to evaluate options and obtain measurable results.  Students investigate various strategic planning methods and industry case studies.  Topics include analyzing resources; developing research-based plans; measuring efficacy; analyzing impacts; forecasting; developing partnerships; and integrating goals, objectives and strategies with organizational culture, mission statements, and corporate philosophies.\nPrerequisite:  None\n\n      less description for TCTM1-GC 1040 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 1050",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17460",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "TISC LC9"
                },
                {
                    "format": "Lecture",
                    "class_id": "2862",
                    "section": "002",
                    "period": "09/03/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TCTM1-GC 1050\n\n   Applied Research Methods\n\nThis course presents a managerial as well as technical perspective to tourism research. Research design includes the overall structure for gathering data, analyzing it, and drawing conclusions supported by a coherent and comprehensive review of the published literature in the field.  Students will learn how to conduct a literature review as well as design an applied research proposal.  In this course, the subjects to be examined include: quantitative, qualitative and mixed methods of research; analysis of scholarly and industry research; data gathering techniques and methods of analysis; sampl...\n\n      more description for TCTM1-GC 1050 »\n\n      \n\n\n\nThis course presents a managerial as well as technical perspective to tourism research. Research design includes the overall structure for gathering data, analyzing it, and drawing conclusions supported by a coherent and comprehensive review of the published literature in the field.  Students will learn how to conduct a literature review as well as design an applied research proposal.  In this course, the subjects to be examined include: quantitative, qualitative and mixed methods of research; analysis of scholarly and industry research; data gathering techniques and methods of analysis; sample selection and analysis; and application of findings.  \nPrerequisite:  None\n\n      less description for TCTM1-GC 1050 «",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 1060",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2552",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS LL140"
                }
            ],
            "course_name": "",
            "description": "TCTM1-GC 1060\n\n   Tourism Product Development\n\nInherent in the development of tourism products is the investigation and analysis of potential customers.  This course begins with an overview of consumer segments defined by ages, values, ethnicity, cultures, etc. with the focus on defining differences to be used for the development of tourism products.  The course then turns to the development of new tourism products and the sustainment of the existing products for specific customer bases.    Topics include: the integrated development process of public and tourism specific infrastructures, types of development, factors influencing success, s...\n\n      more description for TCTM1-GC 1060 »\n\n      \n\n\n\nInherent in the development of tourism products is the investigation and analysis of potential customers.  This course begins with an overview of consumer segments defined by ages, values, ethnicity, cultures, etc. with the focus on defining differences to be used for the development of tourism products.  The course then turns to the development of new tourism products and the sustainment of the existing products for specific customer bases.    Topics include: the integrated development process of public and tourism specific infrastructures, types of development, factors influencing success, sources of funding, projecting potential market demand; competitive conditions; and potential local obstacles. \nPrerequisite:  None\n\n      less description for TCTM1-GC 1060 «",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 1100",
            "course_name": "Economic Analysis",
            "description": "TCTM1-GC 1100 Economic Analysis",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 1300",
            "course_name": "Marketing for Hosp & Travel",
            "description": "TCTM1-GC 1300 Marketing for Hosp & Travel",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 1910",
            "course_name": "Advanced Special Project",
            "description": "TCTM1-GC 1910 Advanced Special Project \nDesigned to synthesize knowledge gained throughout the program of study by conducting an individual student research project. The Advanced Special Project is expected to combine applied research methods and theoretical knowledge to focus on a relevant topical area. Projects are to demonstrate mastery of topical areas covered in earlier master?s courses.",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 1920",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2553",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "SILV 208"
                },
                {
                    "format": "Seminar",
                    "class_id": "17522",
                    "section": "002",
                    "period": "09/04/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 8.00 AM - 10.30 AM",
                    "open": true,
                    "professor": "TISC LC6"
                }
            ],
            "course_name": "Advanced Research Seminar",
            "description": "TCTM1-GC 1920 Advanced Research Seminar \nWorking in groups, students will conduct a comprehensive research project within a specific time frame and according to specific guidelines.  The topics assigned will reflect current trends within the industry. The project is expected to combine applied research methods and theoretical knowledge to focus on a relevant topical area. \nPrerequisites: Student must be registered for final 12 units, Applied Research Methods TCTM1-GC 1050.",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 2000",
            "course_name": "Foundations of Travel and Tourism",
            "description": "TCTM1-GC 2000 Foundations of Travel and Tourism",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 2001",
            "course_name": "Found of Tourism, Travel Transportation I",
            "description": "TCTM1-GC 2001 Found of Tourism, Travel Transportation I",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 2002",
            "course_name": "Economics of Tourism, Travel and Transport",
            "description": "TCTM1-GC 2002 Economics of Tourism, Travel and Transport",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 2310",
            "course_name": "Policy Analysis & Strat Planning",
            "description": "TCTM1-GC 2310 Policy Analysis & Strat Planning",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 2320",
            "course_name": "Travel Industry Law",
            "description": "TCTM1-GC 2320 Travel Industry Law",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 2410",
            "course_name": "Destination Management and Marketing",
            "description": "TCTM1-GC 2410 Destination Management and Marketing \nThis course examines how destinations are developed and managed by governments and private entities in response to economic, social, cultural, and political considerations. The composite elements of a destination: infrastructure, amenities, services, attractions, accommodations, entertainment and information are examined in detail. Students will also learn to develop, plan and budget for destination marketing programs including: advertising and public relations, working with the media, brochure and guidebook planning and production and the use of the worldwide web for destinations.",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3000",
            "course_name": "Geography of Tourism",
            "description": "TCTM1-GC 3000 Geography of Tourism",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3031",
            "course_name": "Information Systems in Hospitality & Tourism",
            "description": "TCTM1-GC 3031 Information Systems in Hospitality & Tourism",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3040",
            "course_name": "Mtkg for Tourism/Travel",
            "description": "TCTM1-GC 3040 Mtkg for Tourism/Travel",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3043",
            "course_name": "Incentive Marketing",
            "description": "TCTM1-GC 3043 Incentive Marketing \nThis course presents the discipline of incentive marketing, the coordinated use of travel and other awards to help corporations and organizational entities increase productivity or levels of service. Lectures, reading and case studies examine such topics as: motivation, sales analysis and planning a campaign.",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3045",
            "course_name": "",
            "description": "TCTM1-GC 3045\n\n   International Tourism: Marketing and Sales\n\nThis course prepares students to manage and direct initiatives in the context of an increasingly competitive and complex international community. Students will study international marketing campaigns from many different sectors of the tourism industry involving accommodations, tour operations and destination management organizations. Topics include worldwide market analysis; international yield forecasting; planning and developing campaigns; evaluation and selection of promotional partners; vendor and supplier selection; marketing impact and analysis; cultural and language barriers and sensiti...\n\n      more description for TCTM1-GC 3045 »\n\n      \n\n\n\nThis course prepares students to manage and direct initiatives in the context of an increasingly competitive and complex international community. Students will study international marketing campaigns from many different sectors of the tourism industry involving accommodations, tour operations and destination management organizations. Topics include worldwide market analysis; international yield forecasting; planning and developing campaigns; evaluation and selection of promotional partners; vendor and supplier selection; marketing impact and analysis; cultural and language barriers and sensitivity; product positioning for export; and assessing overseas trends and competitive postures.\n\n      less description for TCTM1-GC 3045 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3047",
            "course_name": "",
            "description": "TCTM1-GC 3047\n\n   Tourism Market Analysis\n\nThe nature and uses of market research, research methodology and the management of market research functions are discussed. The course examines the measurement of demand for tourism projects in a specific destination or market. Students will study the effect on specific markets of national, regional and local factors such as economic changes, social attitudes, changing laws and legal interpretations and changes in individual attitudes. The course presents modeling techniques for forecasting demand and supply in specific markets and discusses techniques for selecting and evaluating particular s...\n\n      more description for TCTM1-GC 3047 »\n\n      \n\n\n\nThe nature and uses of market research, research methodology and the management of market research functions are discussed. The course examines the measurement of demand for tourism projects in a specific destination or market. Students will study the effect on specific markets of national, regional and local factors such as economic changes, social attitudes, changing laws and legal interpretations and changes in individual attitudes. The course presents modeling techniques for forecasting demand and supply in specific markets and discusses techniques for selecting and evaluating particular sites.\n\n      less description for TCTM1-GC 3047 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3050",
            "course_name": "Franchising Hopitality/ Tourism",
            "description": "TCTM1-GC 3050 Franchising Hopitality/ Tourism",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3055",
            "course_name": "",
            "description": "TCTM1-GC 3055\n\n   Economics & Finance for Hospitality & Tourism\n\nThis course provides an overview of domestic and world economic determinants, conditions and measurement as well as a review of the essential principles of economics and financial analysis relative to hospitality and tourism. Micro-economic concepts of industry demand, supply functions and the nature of competition will be examined. Macroeconomics issues, such as measuring economic impact through the multiplier, cost-benefit analysis, regulatory topics and balance of payment, will also be covered. Basic financial principles, concepts, theories and structures to include the time value of money ...\n\n      more description for TCTM1-GC 3055 »\n\n      \n\n\n\nThis course provides an overview of domestic and world economic determinants, conditions and measurement as well as a review of the essential principles of economics and financial analysis relative to hospitality and tourism. Micro-economic concepts of industry demand, supply functions and the nature of competition will be examined. Macroeconomics issues, such as measuring economic impact through the multiplier, cost-benefit analysis, regulatory topics and balance of payment, will also be covered. Basic financial principles, concepts, theories and structures to include the time value of money are developed and explained in the context of the hospitality and tourism industries.\n\n      less description for TCTM1-GC 3055 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3060",
            "course_name": "",
            "description": "TCTM1-GC 3060\n\n   Management of Non-Profit Organizations\n\nIn the tourism industry, most museums, cultural groups, arts organizations, destination management organizations, and national, state, city and local tourism offices are non-profit agencies which have fundamentally different behaviors and management styles than for-profit organizations. Students will examine leadership roles and evaluate management approaches to program design and execution in the non-profit world. Topics include: an analysis of legal environment; management theory and organizational structures; working with a board of directors; coordinating committees; managing volunteers; m...\n\n      more description for TCTM1-GC 3060 »\n\n      \n\n\n\nIn the tourism industry, most museums, cultural groups, arts organizations, destination management organizations, and national, state, city and local tourism offices are non-profit agencies which have fundamentally different behaviors and management styles than for-profit organizations. Students will examine leadership roles and evaluate management approaches to program design and execution in the non-profit world. Topics include: an analysis of legal environment; management theory and organizational structures; working with a board of directors; coordinating committees; managing volunteers; measuring success; working with the public sector; the role of government in tourism development and management; conflict resolution; and basic financial management for non-profits.\n\n      less description for TCTM1-GC 3060 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3100",
            "course_name": "Control Corp Travel Exp",
            "description": "TCTM1-GC 3100 Control Corp Travel Exp",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3110",
            "course_name": "Convention Planning",
            "description": "TCTM1-GC 3110 Convention Planning",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3200",
            "course_name": "Sociocultural Tourism",
            "description": "TCTM1-GC 3200 Sociocultural Tourism",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3205",
            "course_name": "",
            "description": "TCTM1-GC 3205\n\n   Tourism Advertising & Public Relations\n\nBillions of dollars are spent annually by destinations and private tourism businesses in an attempt to generate awareness, establish images, and attract visitors.  Persuasion activities are the focal point for advertising and public relations to influence the consumer: prior to leaving home; while en route to the destination; and after arriving in the destination area. Topics to be discussed include: advertising awareness, brand awareness, message recall, main point communication, campaign diagnostics, destination imagery, motivation, behavior, demographics, constructing the advertising messag...\n\n      more description for TCTM1-GC 3205 »\n\n      \n\n\n\nBillions of dollars are spent annually by destinations and private tourism businesses in an attempt to generate awareness, establish images, and attract visitors.  Persuasion activities are the focal point for advertising and public relations to influence the consumer: prior to leaving home; while en route to the destination; and after arriving in the destination area. Topics to be discussed include: advertising awareness, brand awareness, message recall, main point communication, campaign diagnostics, destination imagery, motivation, behavior, demographics, constructing the advertising message, and designing print campaigns.  In this course, students learn to develop, plan, and budget for destination advertising and public relations programs.\n\n      less description for TCTM1-GC 3205 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3210",
            "course_name": "Tourism in Urban Centers",
            "description": "TCTM1-GC 3210 Tourism in Urban Centers",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3220",
            "course_name": "",
            "description": "TCTM1-GC 3220\n\n   Tourism Market Research\n\nThis course presents research techniques and concepts useful to measuring the effectiveness of marketing.  The underlying foundation of any tourism activity should be market research and there are a variety of methods that allow for accountability and more cost efficient marketing efforts.  Topics include effectiveness of advertising, measuring pickup in sales based on research, tools to justify the level of advertising, measuring the appropriate rate of advertising, evaluating effectiveness of previous ads or other forms of persuasive communications targeted to the tourism and hospitality mar...\n\n      more description for TCTM1-GC 3220 »\n\n      \n\n\n\nThis course presents research techniques and concepts useful to measuring the effectiveness of marketing.  The underlying foundation of any tourism activity should be market research and there are a variety of methods that allow for accountability and more cost efficient marketing efforts.  Topics include effectiveness of advertising, measuring pickup in sales based on research, tools to justify the level of advertising, measuring the appropriate rate of advertising, evaluating effectiveness of previous ads or other forms of persuasive communications targeted to the tourism and hospitality marketing place, conversion research studies.\n\n      less description for TCTM1-GC 3220 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3230",
            "course_name": "Tour Packaging",
            "description": "TCTM1-GC 3230 Tour Packaging",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3245",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2554",
                    "section": "001",
                    "period": "09/14/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS LL141"
                }
            ],
            "course_name": "",
            "description": "TCTM1-GC 3245\n\n   Marketing of Destinations\n\nThis course examines how governments and private entities market destinations and how the marketing activities are measured for accountability and more cost efficient efforts. Students examine different market strategies as they relate to single and multi-markets, with a look at the feasibility of a total market strategy.  Vital to successful marketing is a defined distribution plan utilizing new technologies and data management techniques. The course examines composite elements of a destination: infrastructure, amenities, services, attractions, accommodations, and entertainment, among others,...\n\n      more description for TCTM1-GC 3245 »\n\n      \n\n\n\nThis course examines how governments and private entities market destinations and how the marketing activities are measured for accountability and more cost efficient efforts. Students examine different market strategies as they relate to single and multi-markets, with a look at the feasibility of a total market strategy.  Vital to successful marketing is a defined distribution plan utilizing new technologies and data management techniques. The course examines composite elements of a destination: infrastructure, amenities, services, attractions, accommodations, and entertainment, among others, with a goal towards marketing and information management.\nPrerequisite:  None\n\n      less description for TCTM1-GC 3245 «",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3305",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2555",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "SILV 402"
                }
            ],
            "course_name": "Financial Strategies for Tourism Development",
            "description": "TCTM1-GC 3305 Financial Strategies for Tourism Development \nThis course explores financial strategies used in tourism development projects.  Extensive examination of feasibility studies and the development of business plans form the basis of discussion.  Economic, accounting and finance terminology and principles are reviewed through the use of case studies and industry experts. Topics include the steps in feasibility analysis, revenue and expense forecasting, sources and uses of capital financing, business plan development, relationships to tourism planning, and report development and presentation.  \nPrerequisite:  None",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3310",
            "course_name": "Destination Marketing",
            "description": "TCTM1-GC 3310 Destination Marketing",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3315",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "3035",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Wed 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "BOBS LL147"
                }
            ],
            "course_name": "Events & Entertainment Tourism Development",
            "description": "TCTM1-GC 3315 Events & Entertainment Tourism Development \nEvents and entertainment are now an important part of the tourism of any major destination.  As well, festivals are becoming a significant interest area for a growing population of tourists.  Various forms of entertainment such as theater plays in urban environments are also important tourism generators.  This course investigates these important areas with regard to their development and maintenance. Topics include market development and analysis, feasibility, financial criteria, stakeholder negotiations, and marketing for sustainment.         \nPrerequisite:  None",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3320",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17499",
                    "section": "001",
                    "period": "09/03/2015 - 12/15/2015 ",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Cultural Heritage Tourism",
            "description": "TCTM1-GC 3320 Cultural Heritage Tourism \nThis course examines the development of cultural heritage tourism resources as primary or secondary destination products.  Students examine the range of cultural and heritage assets that can become viable tourism attractions including museums, the performing arts, historic sites, and national parks. Topics include: current and future cultural and heritage trends; the role of the organizations involved in cultural heritage tourism; and using cultural heritage resources for economic development. \nPrerequisite:  None",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3330",
            "course_name": "Destination Management & Marketing",
            "description": "TCTM1-GC 3330 Destination Management & Marketing",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3340",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2772",
                    "section": "001",
                    "period": "09/08/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "SILV 403"
                }
            ],
            "course_name": "",
            "description": "TCTM1-GC 3340\n\n   Tourism Principles and Practices\n\nAn examination of the politics, practices, and processes of change and destinations that create that demand around the world.  Topics to be covered include: history and evolution of Tourism, tourism as a global activity, tourism demand and supply, the role of public and private stakeholders, travel intermediaries, legislative and regulatory factors in tourism, destination management organizations, sustainability, communication technology, and future trends in tourism.An examination of the politics, practices, and processes of change and destinations that create that demand around the world.  T...\n\n      more description for TCTM1-GC 3340 »\n\n      \n\n\n\nAn examination of the politics, practices, and processes of change and destinations that create that demand around the world.  Topics to be covered include: history and evolution of Tourism, tourism as a global activity, tourism demand and supply, the role of public and private stakeholders, travel intermediaries, legislative and regulatory factors in tourism, destination management organizations, sustainability, communication technology, and future trends in tourism.An examination of the politics, practices, and processes of change and destinations that create that demand around the world.  Topics to be covered include: history and evolution of Tourism, tourism as a global activity, tourism demand and supply, the role of public and private stakeholders, travel intermediaries, legislative and regulatory factors in tourism, destination management organizations, sustainability, communication technology, and future trends in tourism.\n\n      less description for TCTM1-GC 3340 «",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3345",
            "course_name": "Sustainable Tourism",
            "description": "TCTM1-GC 3345 Sustainable Tourism \nTourism is an industry with product based on environmental consumption, both natural and man-made. Continued growth in tourism has led many nations, as well as tourism businesses, to recognize the need to develop policies and programs that protect and conserve precious tourism resources. In this course, students will examine sustainable tourism development programs and industry best practices to better understand tourism’s positive and negative impacts, and the need to protect, sustain, and conserve tourism destinations for future generations.\nPrerequisite:  None",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3355",
            "course_name": "Emerging Issues in International Tourism",
            "description": "TCTM1-GC 3355 Emerging Issues in International Tourism \nThis course is designed to analyze emerging political, technological, and economic trends and to provide a framework of exploration relative to the tourism industry. Students learn to identify issues and trends that impact destination planning, development and growth.  Topics include techniques for identifying trends and issues, measuring the impact of trends on the destination to determine which products and services will meet the needs of sophisticated and informed tourists.   \nPrerequisite:  None",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3360",
            "course_name": "Sports Tourism Development",
            "description": "TCTM1-GC 3360 Sports Tourism Development \nTourism generated by sports activities is an emerging trend in the development of major destination areas.  Students learn an awareness of the factors necessary to plan and execute this significant and growing area of tourism. This course investigates the needed infrastructures, policies and plans, marketing, special services, economic impacts, financial structures, organizational structures, and strategic sponsoring partnerships.  This course will make use of case study analysis and integrate industry expert guest speakers. \nPrerequisite:  None",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3365",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "2774",
                    "section": "001",
                    "period": "09/14/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 6.20 PM - 8.50 PM",
                    "open": true,
                    "professor": "GODD B06"
                }
            ],
            "course_name": "Tourism Policy Analysis",
            "description": "TCTM1-GC 3365 Tourism Policy Analysis \nIn this course, students develop skills in how to research tourism policy initiatives, collect and analyze data, and use technology to evaluate options and obtain measurable results.  Students examine components of the tourism industry and develop tools to analyze and evaluate tourism policy as it impacts tourism organizations in government and private sectors.  Strategic policy analysis methods and industry case studies are examined in a framework of public, private, and non-profit systems.\nPrerequisite:  None",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3620",
            "course_name": "",
            "description": "TCTM1-GC 3620\n\n   E-Travel\n\nMost tourism organizations divide and report travel in two basic segments - leisure and business. The use of the Internet for obtaining travel information and booking travel products has greatly increased in the past few years and is expected to rise dramatically during the next decade. This course explores the use of the Internet in planning and purchasing travel for both the leisure and business traveler. Topics include: an analysis of business and leisure traveler needs, development of Web sites to meet specific customer travel criteria, predicting future enhancements to web travel planners...\n\n      more description for TCTM1-GC 3620 »\n\n      \n\n\n\nMost tourism organizations divide and report travel in two basic segments - leisure and business. The use of the Internet for obtaining travel information and booking travel products has greatly increased in the past few years and is expected to rise dramatically during the next decade. This course explores the use of the Internet in planning and purchasing travel for both the leisure and business traveler. Topics include: an analysis of business and leisure traveler needs, development of Web sites to meet specific customer travel criteria, predicting future enhancements to web travel planners, leisure traveler package planning, corporate traveler package planning and value driven customer expectations in electronic travel.\n\n      less description for TCTM1-GC 3620 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3630",
            "course_name": "",
            "description": "TCTM1-GC 3630\n\n   Hospitality/Tourism E-Knowledge Systems\n\nAccess to systems that provide information in creative, useful ways is essential to the decision making process(es) affecting most businesses. The assimilation and processing of information can form knowledge systems that may create significant advantages and new opportunities in the business world. This course analyzes and develops tourism information systems and processes that provide effective industry knowledge systems. Topics include: an investigation of current information systems to create and effectively use organizational knowledge, methods of knowledge sharing, CRM and customer infor...\n\n      more description for TCTM1-GC 3630 »\n\n      \n\n\n\nAccess to systems that provide information in creative, useful ways is essential to the decision making process(es) affecting most businesses. The assimilation and processing of information can form knowledge systems that may create significant advantages and new opportunities in the business world. This course analyzes and develops tourism information systems and processes that provide effective industry knowledge systems. Topics include: an investigation of current information systems to create and effectively use organizational knowledge, methods of knowledge sharing, CRM and customer information management, content management, privacy issues, Extranet and Intranet roles in knowledge sharing, types of tourism knowledge sharing, distance learning for training and education and knowledge systems for the future.\n\n      less description for TCTM1-GC 3630 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3710",
            "course_name": "",
            "description": "TCTM1-GC 3710\n\n   Destination Analysis & Evaluation\n\nUsing significant international and domestic organizational sources, this course examines data to compare and contrast destinations under specific measurement criteria. Organizations such as the UN World Tourism Organization, the World Travel and Tourism Council, the World Bank, and the U.S. Travel Association generate significant analysis and evaluation of worldwide destinations.  Topics include sources of reliable data, the development and use of the Tourism Satellite Account system, comparative analysis, current destination trends and predictions for the future, and the relevance of analysi...\n\n      more description for TCTM1-GC 3710 »\n\n      \n\n\n\nUsing significant international and domestic organizational sources, this course examines data to compare and contrast destinations under specific measurement criteria. Organizations such as the UN World Tourism Organization, the World Travel and Tourism Council, the World Bank, and the U.S. Travel Association generate significant analysis and evaluation of worldwide destinations.  Topics include sources of reliable data, the development and use of the Tourism Satellite Account system, comparative analysis, current destination trends and predictions for the future, and the relevance of analysis to tourism destination planning.  \nPrerequisite:  None\n\n      less description for TCTM1-GC 3710 «",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3900",
            "classes": [
                {
                    "format": "Independent Study",
                    "class_id": "2556",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Independent Study in Tourism",
            "description": "TCTM1-GC 3900 Independent Study in Tourism \nProvides the opportunity to work with a faculty member on a well-defined specific topic via independent study. Approved topics should be extensions of existing courses previously taken on areas in which no courses are offered.  Independent research is intended to extend the students knowledge in an area in which his or her interest is more specialized than the norm.  Requires prior approval of an appropriate academic adviser as to the topic of the research.\nPrerequisite:  Divisional Dean approval needed, Applied Research Methods − TCTM1-GC 1050",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3910",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "2557",
                    "section": "001",
                    "period": "09/02/2015 - 12/23/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Internship I",
            "description": "TCTM1-GC 3910 Internship I \nThis course provides students with limited industry experience an opportunity to work in a hospitality enterprise.  Building a career requires appropriate industry work experience to strengthen the student’s knowledge and skills formed in the classroom.  Students are expected to complete three hundred (300) hours of work experience approved by the Tisch Center. \nPrerequisites: Faculty advisor approval needed. Completion of 18 credits, in good academic standing with the University (no academic or disciplinary action on record), and a minimum cumulative GPA of 3.0.",
            "offering": true
        },
        {
            "course_id": "TCTM1-GC 3915",
            "course_name": "Internship II",
            "description": "TCTM1-GC 3915 Internship II \nAn opportunity to expand industry experience by working in a hospitality company or organization under faculty supervision.  This course will expand students’ career opportunities beyond Internship I and provide them with additional professional industry work experience to strengthen their knowledge and skill acquired in the classroom.  Students will be expected to complete a three hundred hour (300) work experience approved by the Tisch Center.  \nPrerequisites:  Completion of TCTM1– GC.Y65.001 – Internship I",
            "offering": false
        },
        {
            "course_id": "TCTM1-GC 3920",
            "course_name": "Graduate Internship Tourism",
            "description": "TCTM1-GC 3920 Graduate Internship Tourism",
            "offering": false
        }
    ]
}