{
    "major_id": "TRAVL-UG",
    "file": "./2015-2016/Travel_Courses_(TRAVL-UG).html",
    "courses": [
        {
            "course_id": "TRAVL-UG 1200",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12674",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "TRAVL-UG 1200\n\n   The Art of Travel\n\nThis online course provides an opportunity for students studying abroad to reflect, analytically and creatively, on their travel experiences. We examine the art created by travelers--travel literature, photography, paintings--and consider how traveling can itself be viewed as an art, with its own conventions, styles, traditions, and opportunities for innovation. All of the course activities are conducted on the class Web site: students blog about their responses to the readings and their own travels, post photos, and comment on each other's posts. Enrollment is limited to students studying at ...\n\n      more description for TRAVL-UG 1200 »\n\n      \n\n\n\nThis online course provides an opportunity for students studying abroad to reflect, analytically and creatively, on their travel experiences. We examine the art created by travelers--travel literature, photography, paintings--and consider how traveling can itself be viewed as an art, with its own conventions, styles, traditions, and opportunities for innovation. All of the course activities are conducted on the class Web site: students blog about their responses to the readings and their own travels, post photos, and comment on each other's posts. Enrollment is limited to students studying at one of NYU?s study abroad sites. Reading assignments are individualized for the city and country of each study-abroad site, but some readings are for the whole class: these may include selections from de Botton's The Art of Travel, Urry's The Tourist Gaze, MacCannell's The Tourist, and Leed's The Mind of the Traveler. For more information, see the course website: travelstudies.org.\n\n      less description for TRAVL-UG 1200 «",
            "offering": true
        },
        {
            "course_id": "TRAVL-UG 9050",
            "course_name": "",
            "description": "TRAVL-UG 9050\n\n   Hawaii: Island Science\n\nTHIS COURSE  TAKES PLACE IN HAWAII.\nIslands play a special role in a variety of scientific disciplines, both as privileged sites of experimentation and as unique objects of study. Islands are places where we can see into Earth's interior, into the depths of the ocean, and into the distant past. They have also been key locations for understanding human societies and building empires in the formerly unreachable.  Hawai'i has a number of unusual natural and cultural features that make it a particularly fruitful location for this kind of pursuit. Its marine animals, such as dolphins, can help us u...\n\n      more description for TRAVL-UG 9050 »\n\n      \n\n\n\nTHIS COURSE  TAKES PLACE IN HAWAII.\nIslands play a special role in a variety of scientific disciplines, both as privileged sites of experimentation and as unique objects of study. Islands are places where we can see into Earth's interior, into the depths of the ocean, and into the distant past. They have also been key locations for understanding human societies and building empires in the formerly unreachable.  Hawai'i has a number of unusual natural and cultural features that make it a particularly fruitful location for this kind of pursuit. Its marine animals, such as dolphins, can help us understand not only the aquatic environment but also the nature of consciousness and communication. Its indigenous culture still retains a robust presence, providing a way to study how cultures develop in isolation and how they change with outside exposure.  This interdisciplinary science course will explore the Hawaiian islands through the perspective of various scientific disciplines such as geology, oceanography, marine biology, geography, ecology, and astronomy, as well as anthropology, evolution, exploration, and climate change.\n\n      less description for TRAVL-UG 9050 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9100",
            "course_name": "England in Myth and Stone",
            "description": "TRAVL-UG 9100 England in Myth and Stone",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9125",
            "course_name": "",
            "description": "TRAVL-UG 9125\n\n   Dickens' Jurisdictions: Bleak House and the Social and Legal Worlds of Nineteenth-Century London\n\nDickens'  novel, Bleak House (1852-53), is an omnibus of mid Victorian society, encompassing a wide range of themes:  wealth and poverty, children and parents, legacies, the place of women, illness and health, crime and punishment, tradition and reform--all against the background of the rapidly growing, foggy, filthy city that is nineteenth-century London. Often it is said that this novel is 'about the law;' the case of Jarndyce and Jarndyce is a central driver of Dickens' sprawling story.  Dickens also takes us into the broader world of legal London, offering some of the most memorable lawyer...\n\n      more description for TRAVL-UG 9125 »\n\n      \n\n\n\nDickens'  novel, Bleak House (1852-53), is an omnibus of mid Victorian society, encompassing a wide range of themes:  wealth and poverty, children and parents, legacies, the place of women, illness and health, crime and punishment, tradition and reform--all against the background of the rapidly growing, foggy, filthy city that is nineteenth-century London. Often it is said that this novel is 'about the law;' the case of Jarndyce and Jarndyce is a central driver of Dickens' sprawling story.  Dickens also takes us into the broader world of legal London, offering some of the most memorable lawyer characters in nineteenth-century fiction.  In this course, we focus intently on a slow and careful reading of Bleak House, supplemented by readings and field trips designed to help us understand nineteenth-century London and the Victorians. While locating the course in London will still not let us experience at first-hand Dickens' world, we can bring what might seem like very distant and strange locations closer through outside-the-classroom experiences that permit us to reflect on the city, which is in effect a character in the novel. We will frame our investigation with the idea of jurisdiction. Jurisdiction refers to the expertise or command of a particular court, but we will broaden this idea--as Dickens does in his novel--to think about space, place, and time, affect and desire, and the \" jurisdiction\" of literature. Who gets to \"say the law\" where and with what authority? What is the space of the literary? And how does the space of nineteenth-century London shape Dickens' fiction?\n\n      less description for TRAVL-UG 9125 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9150",
            "course_name": "Shakespeare in Stratford-Upn-Avon",
            "description": "TRAVL-UG 9150 Shakespeare in Stratford-Upn-Avon",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9200",
            "course_name": "Provence & Mediterranean Culture",
            "description": "TRAVL-UG 9200 Provence & Mediterranean Culture",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9250",
            "course_name": "",
            "description": "TRAVL-UG 9250\n\n   Prague: Design As Performance\n\nDuring a three-week interdisciplinary course, students will investigate the unique visual artistry inherent in Czech theater, its history and influence in Eastern Europe, and its application in contemporary theater performance. Steeped in a legacy of theater performance rooted in the visual tradition, Prague is home and host to some of the most innovative work in theatrical design and performance. This course will trace the genealogy of design influenced performance from its roots in the concentration camps of World War II where the practice of using found objects in imaginative ways began as ...\n\n      more description for TRAVL-UG 9250 »\n\n      \n\n\n\nDuring a three-week interdisciplinary course, students will investigate the unique visual artistry inherent in Czech theater, its history and influence in Eastern Europe, and its application in contemporary theater performance. Steeped in a legacy of theater performance rooted in the visual tradition, Prague is home and host to some of the most innovative work in theatrical design and performance. This course will trace the genealogy of design influenced performance from its roots in the concentration camps of World War II where the practice of using found objects in imaginative ways began as a means for creating the world of the play to the later 20th century when theater artists invented new ways of communicating visually with their audiences as a means to escape censorship from totalitarian government officials. Through architectural and gallery tours as well as attendance at Czech theaters we will investigate the historical and political conditions from which Eastern European theater emerged in the 20th century and the influence of visual design in contemporary Czech theater.  Every four years, the city is also home to the Prague Quadrennial of Performance Design and Space, the largest exhibition of stage design in the world, showcasing the work of artists from more than 75 countries and featuring performances based in visual elements. The course will coincide with PQ12 and make use of this learning resource and opportunity to interact with artists from all over the world.  The course will include hands on workshops where we will explore tools and approaches for collaboration between the visual and performing arts as well as new ways of incorporating visual arts into storytelling and performance.  Classes, taught in English, meet four days per week.\n\n      less description for TRAVL-UG 9250 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9300",
            "course_name": "Mexico City & The Urban Experience in Latin Amer",
            "description": "TRAVL-UG 9300 Mexico City & The Urban Experience in Latin Amer",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9301",
            "course_name": "",
            "description": "TRAVL-UG 9301\n\n   Paris, France: Black in the City of Light\n\nFrom the written works of Harlem Renaissance writers Langston Hughes, Claude McKay and Countee Cullen that fomented the Negritude movement, to the performances of Josephine Baker, to the art of Henry Ossawa Tanner and Beauford Delaney, to the music of jazz musicians Miles Davis, Charlie Parker and Bill Coleman, to the political philosophies and writings of W.E.B Dubois and James Baldwin, Paris's influence on the creation of African American culture has been profound. Less noted is the degree to which the African American presence in Paris influenced international art and political thought, fro...\n\n      more description for TRAVL-UG 9301 »\n\n      \n\n\n\nFrom the written works of Harlem Renaissance writers Langston Hughes, Claude McKay and Countee Cullen that fomented the Negritude movement, to the performances of Josephine Baker, to the art of Henry Ossawa Tanner and Beauford Delaney, to the music of jazz musicians Miles Davis, Charlie Parker and Bill Coleman, to the political philosophies and writings of W.E.B Dubois and James Baldwin, Paris's influence on the creation of African American culture has been profound. Less noted is the degree to which the African American presence in Paris influenced international art and political thought, from the use of African cubism among European artists to the shaping of the philosophies of thinkers like Sarte, Camus and de Beauvoir.  We will focus on Paris as a site of exchange—as an intersection through which pass influential ideas, forms and actions. We will consider the degree to which the encounter with Paris paradoxically made African American writers and artists more aware of and intent upon defining and articulating their Americanness, and finding in it a foundation for increased political activism and shaping of a Pan-African sensibility and community. This class will examine the literature, art, food, geographies and politics of African American expatriates in Paris, paying particular attention to the ways that the view from another shore shaped political thought and activism arising from a deepened awareness of national and international identity that Paris inspired.\n\n      less description for TRAVL-UG 9301 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9350",
            "course_name": "Madrid: Faces of the Changing European City",
            "description": "TRAVL-UG 9350 Madrid: Faces of the Changing European City \nTHIS COURSE  TAKES PLACE AT N.Y.U. MADRID.\nThis course explores the contemporary history and geography of Madrid, with a focus on recent changes.   Compared to just twenty years ago, Madrid, like most European cities, is today more diverse, more interconnected (and subject to more complex governance arrangements), more unequal, more subject to volatile financial investments, and more environmentally vulnerable.  This course explores both how residents have experienced these changes and how organized groups and institutions have sought to respond to these challenges.",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9400",
            "course_name": "",
            "description": "TRAVL-UG 9400\n\n   Buenos Aires: In and of the City\n\nBuenos Aires, known as \"The Paris of the South,\" is one of the mythic cities of the world. Containing nearly one-third of Argentina's population, the city has had an inordinate impact not only on Argentina, but on Latin American consciousness and identity. This three-week course will trace the evolution of the political theorists, educational reformers, and creative artists whose works have shaped the culture, art and politics of Buenos Aires and Argentina.  Readings include excerpts from the works of Domingo Faustino Sarmiento, José Enrique Rodó, Robert Ferris Thompson, and George Reid Andrew...\n\n      more description for TRAVL-UG 9400 »\n\n      \n\n\n\nBuenos Aires, known as \"The Paris of the South,\" is one of the mythic cities of the world. Containing nearly one-third of Argentina's population, the city has had an inordinate impact not only on Argentina, but on Latin American consciousness and identity. This three-week course will trace the evolution of the political theorists, educational reformers, and creative artists whose works have shaped the culture, art and politics of Buenos Aires and Argentina.  Readings include excerpts from the works of Domingo Faustino Sarmiento, José Enrique Rodó, Robert Ferris Thompson, and George Reid Andrews; fiction by Jorge Luís Borges, Silvinia Ocampo, Julio Cortázar, Roberto Arlt, and Adolfo Bioy Casares; such documents as Nunca Más, and the film The Afro-Argentines.  Field trips encompass the rich resources of the city's museums, historical sites, and ethnic neighborhoods. Sessions with leading Argentine jurists, educators, and artists are an important component of this course. In addition, students will spend one weekend in Montevideo, Uruguay.\n\n      less description for TRAVL-UG 9400 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9500",
            "course_name": "",
            "description": "TRAVL-UG 9500\n\n   Berlin: Capital of Modernity\n\nTHIS COURSE  TAKES PLACE AT N.Y.U. BERLIN.\nSome of the most thrilling, momentous, and terrible events of the 1900’s occurred in Berlin, Germany.    Today, Berlin's streets, buildings, and cultural monuments offer tales of warning and inspiration to the present century about the folly of nationalist ambition; inspiring sagas of intellectual and physical courage; cold testimonials of crime and retribution; lyrical ballads of brutal honesty; personal records of hope and despair.  This course, set in the heart of that city, will take in many of the sights and sounds of old and contemporary Berlin....\n\n      more description for TRAVL-UG 9500 »\n\n      \n\n\n\nTHIS COURSE  TAKES PLACE AT N.Y.U. BERLIN.\nSome of the most thrilling, momentous, and terrible events of the 1900’s occurred in Berlin, Germany.    Today, Berlin's streets, buildings, and cultural monuments offer tales of warning and inspiration to the present century about the folly of nationalist ambition; inspiring sagas of intellectual and physical courage; cold testimonials of crime and retribution; lyrical ballads of brutal honesty; personal records of hope and despair.  This course, set in the heart of that city, will take in many of the sights and sounds of old and contemporary Berlin.  We will focus on the involvement of twentieth-century politicians and activists, artists and architects, bohemians and intellectuals with the causes, experience, and far-reaching consequences of World War II.  Our period of study begins just after  World War I and focuses first on the turbulent politics and culture of Weimar Berlin in the 1920's.  Then we consider the consolidation of Nazi power in the 1930's when Hitler declared Berlin his capital, and the seige on Berlin of 1945 that ended Hitler's Reich once and for all.   We look next at life in Berlin during the Cold War years and pay particular attention to the impact of the Wall (built in 1961) on the imaginations and realities of Berlin's citizens, and finally we assess our experiences of this reunited city as the the astonishing building boom that followed the fall of the Wall in 1989 slows down and the city faces its future as an EU capital.  Required class meetings include several seminars a week as well as related field trips intended to deepen our understanding of the readings, as well as the rich resources of the city’s museums, neighborhoods, historical sites, memorials, and cultural monuments. There is a lot of required reading but students will find ample opportunity to explore Berlin and develop their own individual projects.  The course is taught in English but we also provide a few voluntary survival German language classes.\n\n      less description for TRAVL-UG 9500 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9600",
            "course_name": "Machiavelli'S Florence",
            "description": "TRAVL-UG 9600 Machiavelli'S Florence",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9700",
            "course_name": "",
            "description": "TRAVL-UG 9700\n\n   Culture, Development and Globalization in India\n\nContemporary representations of India either paint the subcontinent as a vast treasure trove of exotic culture and tradition and/or as an emergent economic powerhouse, rapidly modernizing to overtake the West. Sitting uneasily between these two images is the idea of India as a third world country, struggling with disparities of well being by trying to \"develop\" itself. During this two-week course based in Bangalore, India, students are offered an interdisciplinary learning experience that explores the dynamics of culture and development within globalizing India.  Bangalore, considered the “Sil...\n\n      more description for TRAVL-UG 9700 »\n\n      \n\n\n\nContemporary representations of India either paint the subcontinent as a vast treasure trove of exotic culture and tradition and/or as an emergent economic powerhouse, rapidly modernizing to overtake the West. Sitting uneasily between these two images is the idea of India as a third world country, struggling with disparities of well being by trying to \"develop\" itself. During this two-week course based in Bangalore, India, students are offered an interdisciplinary learning experience that explores the dynamics of culture and development within globalizing India.  Bangalore, considered the “Silicon Valley” of India, is at the epicenter of India’s information technology boom—its changing urban landscape a microcosm of third world urban development and globalization. In the classroom, students will be introduced to the philosophical underpinnings and practice of “development” as an important framework through which ideas of culture, economy, politics, tradition and modernity are organized and managed by the Indian state and international organizations. Background historical works will explore how the idea and practice of development are linked to colonialism and anticolonialism, capitalism, nationalism and globalization. Readings will also explore the cultural politics of tradition, tourism, heritage and monuments and the environment in order to understand how tourism is linked to development.\n\n      less description for TRAVL-UG 9700 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9750",
            "course_name": "Istanbul: Mapping The Past in The Present",
            "description": "TRAVL-UG 9750 Istanbul: Mapping The Past in The Present",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9800",
            "course_name": "",
            "description": "TRAVL-UG 9800\n\n   Africa and The Politics of Aid\n\nWith the demise of European colonial empires and the emergence of the neo-colonial state, the continent of Africa has become the center of development discourse. This dialectic between largely European and US American thinkers and nongovernmental organizations (NGOs) has produced a slew of books within the last decade that analyze the impact of NGOs and the challenges of international aid programs. For the most part, many of these texts conclude that modernization must emulate the West, while  other scholars argue the futility of monetary aid efforts.  This course examines the shifting meaning...\n\n      more description for TRAVL-UG 9800 »\n\n      \n\n\n\nWith the demise of European colonial empires and the emergence of the neo-colonial state, the continent of Africa has become the center of development discourse. This dialectic between largely European and US American thinkers and nongovernmental organizations (NGOs) has produced a slew of books within the last decade that analyze the impact of NGOs and the challenges of international aid programs. For the most part, many of these texts conclude that modernization must emulate the West, while  other scholars argue the futility of monetary aid efforts.  This course examines the shifting meaning of development from Africans and non-African thinkers. Is development a by-product of former colonial structures? In what ways do NGOs enhance or adversely affect developing nations? By exploring key texts that examine the problems of aid programs, strategies for structural and economic improvement, and ideas that address poverty, political instability and the rights of marginal groups, this course utilizes the disciplines of history, anthropology, and economics to better understand the merits and tensions of development in Africa.  Group site visits both in and out of Accra will allow for further immersion in the history and culture of the region, ranging from visits to Elmina Castle, local NGOs, the W.E.B. Du Bois Memorial Center for Pan African Culture and outings to Ghanian museums and other historical sites.  Students will live in NYU-arranged housing located in residential neighborhoods within walking distance from the NYU Center.\n\n      less description for TRAVL-UG 9800 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-UG 9801",
            "course_name": "",
            "description": "TRAVL-UG 9801\n\n   Postcolonial Urbanisms: Development, Environment, and Social Movements in Senegal\n\nThis travel course examines urban development in the postcolonial global South through the lens of cities in Senegal, West Africa. Like elsewhere across the global South, Senegal is rapidly becoming urban. This process implies a host of important transformations and challenges for development, the environment, and the socio-political lives of city-dwellers. Owing to the country’s particular development trajectory, long history of urbanization, and important legacy as one of Africa’s strongest democracies, Senegal provides an especially fascinating place to examine these dynamics and grapple wi...\n\n      more description for TRAVL-UG 9801 »\n\n      \n\n\n\nThis travel course examines urban development in the postcolonial global South through the lens of cities in Senegal, West Africa. Like elsewhere across the global South, Senegal is rapidly becoming urban. This process implies a host of important transformations and challenges for development, the environment, and the socio-political lives of city-dwellers. Owing to the country’s particular development trajectory, long history of urbanization, and important legacy as one of Africa’s strongest democracies, Senegal provides an especially fascinating place to examine these dynamics and grapple with their implications for urbanism in the global South and beyond.  This course will be based in Senegal’s capital city, Dakar, but will include overnight trips to the other important Senegalese cities of Saint Louis (the colonial capital of French West Africa) and Touba (Senegal’s Islamic Mecca) to compare the form and function of these alternative urban histories and development strategies. Through a combination of course readings, classroom lectures, tours, walks, and field visits, we will explore the legacies of colonialism and unpack a number of key contemporary debates and challenges faced by urban planners and city residents.\n\n      less description for TRAVL-UG 9801 «",
            "offering": false
        }
    ]
}