{
    "major_id": "TRAVL-GG",
    "file": "./2015-2016/Travel_Courses_(TRAVL-GG).html",
    "courses": [
        {
            "course_id": "TRAVL-GG 2060",
            "course_name": "",
            "description": "TRAVL-GG 2060\n\n   Italian Renaissance, Art and Literature: The Culture Exlposion\n\nTHIS COURSE  TAKES PLACE AT N.Y.U. FLORENCE.\nDuring a three-week, interdisciplinary program in  beautiful and historic Florence, Italy, students are offered a total immersion and multifaceted learning experience that is an essential beginning to understanding our modern world through the lens of the Italian Renaissance. This course explores the literature, culture, art, and thought of the Renaissance from multiple perspectives.  During their stay, students develop and present an individualized project based on their academic interests and background, and the ways in which the Renaissance has i...\n\n      more description for TRAVL-GG 2060 »\n\n      \n\n\n\nTHIS COURSE  TAKES PLACE AT N.Y.U. FLORENCE.\nDuring a three-week, interdisciplinary program in  beautiful and historic Florence, Italy, students are offered a total immersion and multifaceted learning experience that is an essential beginning to understanding our modern world through the lens of the Italian Renaissance. This course explores the literature, culture, art, and thought of the Renaissance from multiple perspectives.  During their stay, students develop and present an individualized project based on their academic interests and background, and the ways in which the Renaissance has inspired them. As a quintessential Gallatin experience, the course places emphasis on the cultural and historical contexts from which the literature and art of Renaissance Florence emerged.  Readings might include the works of Dante, Pico Della Mirandola, Machiavelli, and selected female writers, as well as art texts such as Vasari's The Lives of the Artists. In addition, students study the art of Florentine painters such as Botticelli, Giotto, and Michelangelo in the places where these works were created. Throughout the course, students will visit  museums and churches such as the Uffizi, The Duomo, the church of Santa Maria Novella, and the monastery of San Marco to engage fully with the art and architecture of Renaissance Italy. Classes, which are taught in English, meet four days a week.\n\n      less description for TRAVL-GG 2060 «",
            "offering": false
        },
        {
            "course_id": "TRAVL-GG 2448",
            "course_name": "Digital Activism",
            "description": "TRAVL-GG 2448 Digital Activism",
            "offering": false
        },
        {
            "course_id": "TRAVL-GG 2450",
            "course_name": "Research Activism",
            "description": "TRAVL-GG 2450 Research Activism",
            "offering": false
        },
        {
            "course_id": "TRAVL-GG 2460",
            "course_name": "English Language Literacy: Theory & Prac",
            "description": "TRAVL-GG 2460 English Language Literacy: Theory & Prac",
            "offering": false
        },
        {
            "course_id": "TRAVL-GG 9200",
            "course_name": "Provence & Mediterranean Culture",
            "description": "TRAVL-GG 9200 Provence & Mediterranean Culture",
            "offering": false
        },
        {
            "course_id": "TRAVL-GG 9301",
            "course_name": "Paris, France: Black in the City of Light",
            "description": "TRAVL-GG 9301 Paris, France: Black in the City of Light",
            "offering": false
        }
    ]
}