{
    "major_id": "UPADM-GP",
    "file": "./2015-2016/UG_Public_and_Nonprofit_Managementand_Policy_(UPADM-GP).html",
    "courses": [
        {
            "course_id": "UPADM-GP 1",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "14801",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Smith, Kerri Anna",
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Workshop",
                    "class_id": "14802",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Smith, Kerri Anna",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Leadership/Ps/Res Colleg",
            "description": "UPADM-GP    1 Leadership/Ps/Res Colleg",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 2",
            "course_name": "Leadership and Public Service: Residential College Goddard II",
            "description": "UPADM-GP    2 Leadership and Public Service: Residential College Goddard II",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 11",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14808",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015 ",
                    "location": "Smith, Kerri Anna",
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Leadership and Public Service:  Residential College",
            "description": "UPADM-GP   11 Leadership and Public Service:  Residential College",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 12",
            "course_name": "Leadership and Public Service: Residential college",
            "description": "UPADM-GP   12 Leadership and Public Service: Residential college",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 20",
            "course_name": "NYU 101:University and NYC Welcome and Transition Seminar",
            "description": "UPADM-GP   20 NYU 101:University and NYC Welcome and Transition Seminar",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 101",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14811",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 279",
                    "time": "Wed 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Nordlund, Caroline"
                }
            ],
            "course_name": "",
            "description": "UPADM-GP  101\n\n   The Politics of Public Policy\n\nThis course provides an introduction to the political institutions and processes through which public policy is made and implemented in the United States (although the key concepts are applicable to other political systems as well). The course also introduces students to the tools of policy analysis. The first half of the course presents the major models of policymaking and policy analysis. The second half of the course applies these concepts to specific policy areas such as health, education, and environment, as illustrated by real-world case studies. The course emphasizes written and oral co...\n\n      more description for UPADM-GP  101 »\n\n      \n\n\n\nThis course provides an introduction to the political institutions and processes through which public policy is made and implemented in the United States (although the key concepts are applicable to other political systems as well). The course also introduces students to the tools of policy analysis. The first half of the course presents the major models of policymaking and policy analysis. The second half of the course applies these concepts to specific policy areas such as health, education, and environment, as illustrated by real-world case studies. The course emphasizes written and oral communication through the development of professional memo-writing and presentation skills.\n\n      less description for UPADM-GP  101 «",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 102",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14813",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 369",
                    "time": "Mon,Wed 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Light, Paul"
                }
            ],
            "course_name": "",
            "description": "UPADM-GP  102\n\n   Introduction to Social Impact\n\nSeptember 11 brought a dramatic surge in what Americans expected of themselves and their civic institutions.  Americans reported increased interest in all aspects of public life, including voting, volunteering, and careers in government.  Three years later, however, the interest has yet to produce a parallel increase in civic activity.  This course will provide undergraduate students an opportunity to examine the promise of public service embedded in American history and contemporary events, while exploring the perils of participation that may explain the public's reluctance to actually engage...\n\n      more description for UPADM-GP  102 »\n\n      \n\n\n\nSeptember 11 brought a dramatic surge in what Americans expected of themselves and their civic institutions.  Americans reported increased interest in all aspects of public life, including voting, volunteering, and careers in government.  Three years later, however, the interest has yet to produce a parallel increase in civic activity.  This course will provide undergraduate students an opportunity to examine the promise of public service embedded in American history and contemporary events, while exploring the perils of participation that may explain the public's reluctance to actually engage.  The course will also explore competing definitions of public service, as well as proposals for increasing civic engagement through various forms of national service, including the draft.  The course will feature occasional guest lectures by leading public servants in New York City, as well as student research on just what public service means today.\n\n      less description for UPADM-GP  102 «",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 103",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14809",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 361",
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "Kurs, Monte"
                }
            ],
            "course_name": "",
            "description": "UPADM-GP  103\n\n   Introduction to Managing Public Service Organizations\n\nThis undergraduate course will provide students withThis undergraduate course will provide students with the tools needed to diagnose and solve organizational problems, to influence the actions of individuals, teams, and organizations, and to lead high performing effective organizations.  We will examine the key variables in the organization that must be managed including the organization?s planning systems, its culture, structure, people, and evaluation processes.  Through a highly interactive approach, students will gain a theoretical and hands-on understanding of the critical components of ...\n\n      more description for UPADM-GP  103 »\n\n      \n\n\n\nThis undergraduate course will provide students withThis undergraduate course will provide students with the tools needed to diagnose and solve organizational problems, to influence the actions of individuals, teams, and organizations, and to lead high performing effective organizations.  We will examine the key variables in the organization that must be managed including the organization?s planning systems, its culture, structure, people, and evaluation processes.  Through a highly interactive approach, students will gain a theoretical and hands-on understanding of the critical components of managing and leading in organizations.  \n\nOur focus will be on both government and nonprofit organizations and how managing in these organizations is different from managing in the for- profit sector.  For example, we will discuss public administration in the context of a democracy and the challenges of administrative leadership in an often  highly charged political system.  We?ll explore public personnel administration and Human Resource Development and discuss the government budgeting process.  We?ll also review the nature of public policy and the relationship between policy decisions and program implementation. We will also discuss the nature of managing in nonprofit organizations and the challenges of being primarily a service provider.  We?ll focus on the difficulties in evaluating and controlling service delivery, such as evaluating the impact of a mentoring program on a young man?s self-esteem.  We?ll also discuss the unique challenges in obtaining resources through foundations and other funding sources.\n\n      less description for UPADM-GP  103 «",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 111",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17340",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 383",
                    "time": "Tue 11.00 AM - 1.45 PM",
                    "open": true,
                    "professor": "Sinclair, John"
                },
                {
                    "format": "Laboratory",
                    "class_id": "17341",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Fri 12.30 PM - 1.45 PM",
                    "open": true,
                    "professor": "WAVE 668"
                }
            ],
            "course_name": "Quantitative Analysis for Public Policy",
            "description": "UPADM-GP  111 Quantitative Analysis for Public Policy \nThis course introduces students to basic statistical methods and their application to management, policy, and financial decision-making. The course covers the essential elements of descriptive statistics, univariate and bivariate statistical inference, and introduces multivariate analysis. In addition to covering statistical theory the course emphasizes applied statistics and data analysis. The primary goal of this course is to introduce these basic skills and encourage a critical approach to reviewing statistical findings and using statistical reasoning in decision making.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 112",
            "course_name": "Quantitative Analysis for Public Policy Laboratory",
            "description": "UPADM-GP  112 Quantitative Analysis for Public Policy Laboratory",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 140",
            "course_name": "",
            "description": "UPADM-GP  140\n\n   The Economics of Public Policy\n\nThe Economics of Public Policy analyzes the impact of public policy on the allocation of resources and the distribution of income in the economy. In this course, you will learn how to use the tools of microeconomics and empirical analysis to answer these questions: When should the government intervene in the economy? How might the government intervene? And, what are the effects of those interventions on economic outcomes?  The course will include topics such as: income distribution and welfare programs, taxation and tax reform, government debt, market failures, Social Security, unemployment in...\n\n      more description for UPADM-GP  140 »\n\n      \n\n\n\nThe Economics of Public Policy analyzes the impact of public policy on the allocation of resources and the distribution of income in the economy. In this course, you will learn how to use the tools of microeconomics and empirical analysis to answer these questions: When should the government intervene in the economy? How might the government intervene? And, what are the effects of those interventions on economic outcomes?  The course will include topics such as: income distribution and welfare programs, taxation and tax reform, government debt, market failures, Social Security, unemployment insurance and health insurance.\n\n      less description for UPADM-GP  140 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 211",
            "course_name": "Getting Things Done",
            "description": "UPADM-GP  211 Getting Things Done",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 212",
            "course_name": "",
            "description": "UPADM-GP  212\n\n   The Politics of Citizenship\n\nWhat does it mean to be a citizen and how do we decide who deserves to be one? At various points in our history, groups as diverse as African-Americans, gays/lesbians, women, ex-felons, and teenagers have been denied some or all of the rights of citizens. This course will study how governments (in the U.S. and elsewhere) understand membership through citizenship laws and practices, as well as how policies governing citizenship have played out in practice. Subjects covered will include the history of the idea of citizenship, civic virtue and civil liberties in contemporary politics, migration a...\n\n      more description for UPADM-GP  212 »\n\n      \n\n\n\nWhat does it mean to be a citizen and how do we decide who deserves to be one? At various points in our history, groups as diverse as African-Americans, gays/lesbians, women, ex-felons, and teenagers have been denied some or all of the rights of citizens. This course will study how governments (in the U.S. and elsewhere) understand membership through citizenship laws and practices, as well as how policies governing citizenship have played out in practice. Subjects covered will include the history of the idea of citizenship, civic virtue and civil liberties in contemporary politics, migration and immigration issues, and the possibilities of “post-national” and cosmopolitan citizenship.\n\n      less description for UPADM-GP  212 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 213",
            "course_name": "The Constitution and Today's Pub Pol Debates",
            "description": "UPADM-GP  213 The Constitution and Today's Pub Pol Debates",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 214",
            "course_name": "Law and Public Policy",
            "description": "UPADM-GP  214 Law and Public Policy",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 215",
            "course_name": "The Politics of New York",
            "description": "UPADM-GP  215 The Politics of New York \nThis course will provide undergraduate students with an understanding of the political and governmental processes that influence New York City.  The course will explore the structure of the municipal government, the role of the mayor and city council, the way in which state and regional agencies affect public services, and the role of the media in the political life of New York City.",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 216",
            "course_name": "",
            "description": "UPADM-GP  216\n\n   Majorities, Minorities & Group Identities in America: Status, Rights & Public Policy\n\nThe position of minorities in the United States, an immigrant nation since its inception, remains a volatile topic of debate that touches the core of American identity.  While we will review the history of minorities in America, we will focus on their status within the cultural and political framework and examine the ways that how we understand rights as either individually or communally derived informs policy decisions and shapes minority institutions. We will seek to define what \"minority\" status entails by studying how ethnicity, race, gender and religious identity, and cultural expression ...\n\n      more description for UPADM-GP  216 »\n\n      \n\n\n\nThe position of minorities in the United States, an immigrant nation since its inception, remains a volatile topic of debate that touches the core of American identity.  While we will review the history of minorities in America, we will focus on their status within the cultural and political framework and examine the ways that how we understand rights as either individually or communally derived informs policy decisions and shapes minority institutions. We will seek to define what \"minority\" status entails by studying how ethnicity, race, gender and religious identity, and cultural expression play out in the political sphere.  Attention will then shift to minority community building - how public policies and leaders nurture or undermine minority identity, establish and sustain institutions, and create sustainable minority communities.\n\n      less description for UPADM-GP  216 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 217",
            "course_name": "Sustainable Urban Development",
            "description": "UPADM-GP  217 Sustainable Urban Development",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 217",
            "course_name": "Sustainable Urban Development",
            "description": "UPADM-GP  217 Sustainable Urban Development \nThis course examines the social, economic and environmental dimensions\nof sustainable urban development. Some of the major themes explored\ninclude indicators of sustainability, urban demographic trends,\nenvironmental justice, green building, urban sprawl, sustainable\nenergy and transportation, and global climate change. In addition, the\nrole of information technology (IT) and social networks is discussed\nin the context of promoting ideas globally about sustainable\ndevelopment.",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 218",
            "course_name": "U.S. Immigration Policy",
            "description": "UPADM-GP  218 U.S. Immigration Policy \nThis course will explore how core features of the American polity and history have shaped the contours of American immigration politics and policy. It will embed these American practices within a global perspective, which entails analyzing how globalization has brought forth new challenges regarding citizenship, international obligations, boundaries, and economic competitiveness, and how the experiences of other countries can inform American policy.",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 219",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17342",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17342",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "Race, Class, & Gender in American Cities",
            "description": "UPADM-GP  219 Race, Class, & Gender in American Cities \nThis course examines how different racial, ethnic, and class interests interact in urban planning and development processes. It focuses on political systems and private market arrangements that affect the allocation and distribution of resources. A comparative approach identifies the ways in which different political regimes have analyzed and planned for the needs of a variety of racial, ethnic, and class interests.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 220",
            "course_name": "",
            "description": "UPADM-GP  220\n\n   American Presidential Campaigns and Elections 1960-2012\n\nThrough experience, reading, historical perspective, analysis and discussion with experts, the course will focus on essential questions concerning the health of the US political system, particularly means by which presidential candidates are selected and elected. The course will examine lessons from the 1960 through the 2012 campaigns and elections in an effort to understand the current political condition of the US and the path on which the country is headed. The course will analyze American presidential campaigns and elections since 1960. The course will also help students better understand ...\n\n      more description for UPADM-GP  220 »\n\n      \n\n\n\nThrough experience, reading, historical perspective, analysis and discussion with experts, the course will focus on essential questions concerning the health of the US political system, particularly means by which presidential candidates are selected and elected. The course will examine lessons from the 1960 through the 2012 campaigns and elections in an effort to understand the current political condition of the US and the path on which the country is headed. The course will analyze American presidential campaigns and elections since 1960. The course will also help students better understand public opinion polls and the nature and structure of American public opinion. Students will examine ways in which American news media transmit information about presidential campaigns and elections, issues, and candidates, and learn about the impact of news upon political behavior and what people do with the information they receive through the news media. In an effort better to understand the relationship (or disconnect) between theory and practice in this field, students will meet practitioners – people who are involved with presidential politics on a daily basis. By the end of the term, students will be able to make sound, informed and reliable judgments about the health of the American presidential selection system. Students will never look at conventional wisdom in the same way again.\n\n      less description for UPADM-GP  220 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 221",
            "course_name": "",
            "description": "UPADM-GP  221\n\n   The Meaning of Leadership\n\nThe Meaning of Leadership will prepare you to practice effective leadership and teamwork in a variety of contexts—business, politics, community organizing, entrepreneurship, sports, teaching, sales, coaching, etc—without relying on authority, status, hierarchy, or other external conditions.\n\nYou will learn to create more meaning, value, importance, and purpose in your teammates, work, and professional relationships. As a result, your teams will accomplish more with greater satisfaction. Your teammates will feel inspired and will want to work with you again.\n\nThe course will also help you make ...\n\n      more description for UPADM-GP  221 »\n\n      \n\n\n\nThe Meaning of Leadership will prepare you to practice effective leadership and teamwork in a variety of contexts—business, politics, community organizing, entrepreneurship, sports, teaching, sales, coaching, etc—without relying on authority, status, hierarchy, or other external conditions.\n\nYou will learn to create more meaning, value, importance, and purpose in your teammates, work, and professional relationships. As a result, your teams will accomplish more with greater satisfaction. Your teammates will feel inspired and will want to work with you again.\n\nThe course will also help you make leadership and teamwork more calm, rewarding, and enjoyable for you and your teammates—and your relationships and life in general too. You will develop professionally and personally, in a process that will continue throughout your life.\n\n      less description for UPADM-GP  221 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 222",
            "course_name": "Philanthropy, Advocacy and Social Change",
            "description": "UPADM-GP  222 Philanthropy, Advocacy and Social Change",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 223",
            "course_name": "",
            "description": "UPADM-GP  223\n\n   Politics Minority Rights\n\nThis course examines the policy debates surrounding minority rights in the US since World War II, with special emphasis on the politics of race, class, gender, sexuality, citizenship, and disability.  Our aim will be to trace the accomplishments and limitations of public policy in including minorities in the full set of social, political and economic spheres.  Federal and local (NYC) debates will be In addition to analyzing contemporary issues related to minority inclusion like school (re)segregation, universal healthcare, and job losses for low-skilled American workers, we will also debate su...\n\n      more description for UPADM-GP  223 »\n\n      \n\n\n\nThis course examines the policy debates surrounding minority rights in the US since World War II, with special emphasis on the politics of race, class, gender, sexuality, citizenship, and disability.  Our aim will be to trace the accomplishments and limitations of public policy in including minorities in the full set of social, political and economic spheres.  Federal and local (NYC) debates will be In addition to analyzing contemporary issues related to minority inclusion like school (re)segregation, universal healthcare, and job losses for low-skilled American workers, we will also debate such behemoths of minority politics as affirmative action, Title IX, the proposed Federal Marriage Amendment, the Americans with Disabilities Act (1990) and so on.\n\n      less description for UPADM-GP  223 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 224",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17344",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                },
                {
                    "format": "Lecture",
                    "class_id": "17344",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": null,
                    "open": false,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "UPADM-GP  224\n\n   Philanthopy, Advocacy and Social Change\n\nWith over $550 billion dollars in assets and contributions exceeding $36 billion/year, private charitable foundations are a source of concentrated social and political influence in American society. Through this course, students will gain an understanding of the roles and influence (positive and negative) of philanthropy on political advocacy and social change movements in the US; the scope and diversity of the philanthropic sector; political advocacy approaches and tactics; and examples of current philanthropic involvement in advocacy and social change movements across the political spectrum....\n\n      more description for UPADM-GP  224 »\n\n      \n\n\n\nWith over $550 billion dollars in assets and contributions exceeding $36 billion/year, private charitable foundations are a source of concentrated social and political influence in American society. Through this course, students will gain an understanding of the roles and influence (positive and negative) of philanthropy on political advocacy and social change movements in the US; the scope and diversity of the philanthropic sector; political advocacy approaches and tactics; and examples of current philanthropic involvement in advocacy and social change movements across the political spectrum. The course will include several guest speakers -- both philanthropic leaders and activists -- and site visits with funders to local advocacy efforts in New York City.\n\n      less description for UPADM-GP  224 «",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 225",
            "course_name": "Int'L Finance System",
            "description": "UPADM-GP  225 Int'L Finance System \nAn experienced financial regulator provides a system-wide view of this vital but poorly-understood topic.  Subjects investigated will range from individual firm compliance with Sarbanes-Oxley to public officials? struggle to design effective mechanisms to regulate hedge funds and other complex financial institutions.",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 226",
            "course_name": "",
            "description": "UPADM-GP  226\n\n   Women and Public Leadership\n\nWomen have engaged and been represented in public service in America through their fearless Women's Suffrage movement to gain the right to vote, which officially began in the 19th century, in 1848, during the Seneca Falls Convention, where the first women's rights convention, was held and was triumphantly realized in the early 20th century After a hard-fought series of votes in the U.S. Congress and in state legislatures, when the Nineteenth Amendment became part of the U.S. Constitution on August 20, 1920. To date, however, it is recognized, the road to elected and appointed office for women ...\n\n      more description for UPADM-GP  226 »\n\n      \n\n\n\nWomen have engaged and been represented in public service in America through their fearless Women's Suffrage movement to gain the right to vote, which officially began in the 19th century, in 1848, during the Seneca Falls Convention, where the first women's rights convention, was held and was triumphantly realized in the early 20th century After a hard-fought series of votes in the U.S. Congress and in state legislatures, when the Nineteenth Amendment became part of the U.S. Constitution on August 20, 1920. To date, however, it is recognized, the road to elected and appointed office for women leaders is not equitable for those seeking to serve in public office. Although women make up the majority of our American population, women are the majority of registered voters and women graduate college at higher rates than men from post secondary education institutions; women are only a fraction of our elected and appointed officials. Statistics, big data analytics tell the sobering story. This course will teach offerings which underscore \"Leadership, Women and Public Service in American Cities\" charting the course and exploring the experience of women and girls in public service leadership. We will examine the context of equity for women in the structural realities and gender attitudes within the American political and civic systems. Our students will connect with women leaders and advocates for women leaders; we will teach women’s historic and contemporary participation in public service. Utilizing political and Intersection theory we will focus on trends, implications and impact of ethnicity, race, class, gender & religion on women in politics and public service. Through coursework, guest speakers and hands-on activities students will learn how they can be a participant in and influence the public agenda through public service, politics and impacting public policy. The coursework will review leadership skills-set, career paths and analyze barriers that have traditionally kept women from achieving their political and leadership potential.\n\n      less description for UPADM-GP  226 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 227",
            "course_name": "",
            "description": "UPADM-GP  227\n\n   Trends & Issues in National Policy-Making\n\nLed by five-term Tennessee Congressman and Wagner professor Harold Ford Jr., this course will explore current topics and larger trends in U.S. public policymaking. From health reform to “cap & trade” energy legislation, from immigration to Afghanistan policy, the issues of the day will be placed in context by Prof. Ford, along with notable political figures past and present making guest appearances.\n\nAfter serving Tennessee for ten years in the United States Congress, Harold Ford, Jr. is currently Chairman of the Democratic Leadership Council and a member of the Council on Foreign Relations,...\n\n      more description for UPADM-GP  227 »\n\n      \n\n\n\nLed by five-term Tennessee Congressman and Wagner professor Harold Ford Jr., this course will explore current topics and larger trends in U.S. public policymaking. From health reform to “cap & trade” energy legislation, from immigration to Afghanistan policy, the issues of the day will be placed in context by Prof. Ford, along with notable political figures past and present making guest appearances.\n\nAfter serving Tennessee for ten years in the United States Congress, Harold Ford, Jr. is currently Chairman of the Democratic Leadership Council and a member of the Council on Foreign Relations, as well as a news analyst for NBC and MSNBC. In 2009-2010, he joined the Wagner faculty as a Distinguished Practitioner in Residence.\n\n      less description for UPADM-GP  227 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 228",
            "course_name": "",
            "description": "UPADM-GP  228\n\n   LGBT Issues in Public Policy\n\nThis course examines the recent history of the pro- and anti-gay political movements in the U.S. since the mid-1900s; the current debate over marriage, parenting, and family recognition; demographics of the lesbian, gay, bisexual and transgender (LGBT) community, including race and gender differences among same-sex couples and the particular experiences of LGBT people of color; the major policy issues affecting LGBT people; how the Christian right shapes U.S. domestic and foreign policy, and its activities in other countries and international fora; and how LGBT policy controversies play out in...\n\n      more description for UPADM-GP  228 »\n\n      \n\n\n\nThis course examines the recent history of the pro- and anti-gay political movements in the U.S. since the mid-1900s; the current debate over marriage, parenting, and family recognition; demographics of the lesbian, gay, bisexual and transgender (LGBT) community, including race and gender differences among same-sex couples and the particular experiences of LGBT people of color; the major policy issues affecting LGBT people; how the Christian right shapes U.S. domestic and foreign policy, and its activities in other countries and international fora; and how LGBT policy controversies play out in U.S. electoral politics and public opinion.\n\n\n\nFor the past two decades, Sean Cahill has been a leader the fight for LGBT equality and science-based HIV prevention and care. Cahill currently serves as Managing Director of Public Policy, Research and Community Health at Gay Men’s Health Crisis in New York. Cahill directed the National Gay and Lesbian Task Force Policy Institute from 2001 to 2007, where he created seminal research on demographics, poverty/homelessness, family recognition, aging, voting, and the anti-gay movement.\n\n      less description for UPADM-GP  228 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 229",
            "course_name": "Intersection of Politics and  Public Policy",
            "description": "UPADM-GP  229 Intersection of Politics and  Public Policy",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 230",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14814",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 379",
                    "time": "Mon 9.30 AM - 12.15 PM",
                    "open": true,
                    "professor": "Rodwin, Victor"
                }
            ],
            "course_name": "",
            "description": "UPADM-GP  230\n\n   Medical Care and Health: Comparative Perspectives\n\nThis course introduces undergraduates to the complex interplay of social factors that affect population health in any society. It focuses on the social determinants and distribution of health and disease, the organization and financing of the health care system, and the relationship of one to the other.  The first part of the class reviews  divergent perspectives for thinking about health and society. We begin by comparing clinical and public health perspectives on health and illness, reviewing alternative definitions of these concepts, tools for their assessment, and the contributions of soci...\n\n      more description for UPADM-GP  230 »\n\n      \n\n\n\nThis course introduces undergraduates to the complex interplay of social factors that affect population health in any society. It focuses on the social determinants and distribution of health and disease, the organization and financing of the health care system, and the relationship of one to the other.  The first part of the class reviews  divergent perspectives for thinking about health and society. We begin by comparing clinical and public health perspectives on health and illness, reviewing alternative definitions of these concepts, tools for their assessment, and the contributions of social and economic theory, as well as health services research, to the study of health and society. For example, we will we examine key studies on health and health care among geographic areas and socio-economic groups in society. We will also consider how these perspectives were influenced by the evolution of public health, medicine and the health care system over the course of the past century.  The second part of the class draws on these perspectives to study the health care system in the United States, how it compares to that of other nations and how population aging, urbanization and globalization are raising new challenges for health and society, worldwide. We begin by studying alternative approaches to health care financing and organization and analyzing the U.S. health care system in this context. Next, we consider how increases in human longevity and population aging will affect the organization and financing of health and social services. Also, we consider two emerging areas of study related to health and society: \"urban health\" and \"global health.\" Finally, we consider issues of health care reform in the United States in light of the experience of other wealthy nations abroad, which have developed systems of universal health care coverage.\n\n      less description for UPADM-GP  230 «",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 231",
            "course_name": "Managing Innovation In Health Care",
            "description": "UPADM-GP  231 Managing Innovation In Health Care \nThis course is aimed at students intending to work as clinicians or as managers in the health care industry.  In this course, students will: understand how health care organizations operate, the contexts they face; the opportunities and constraints facing those who wish to innovate in health care organizations; how healthcare organizations are governed and managed; examine successful innovations implemented in healthcare organizations; understand how to motivate workforce in healthcare organizations; and improve writing, presenting, and listening skills.",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 232",
            "course_name": "",
            "description": "UPADM-GP  232\n\n   Global Health: Policies, Politics and Institutions\n\nFollowing an unprecedented mobilization of resources (financial and otherwise) for HIV, new infections are down across much of sub-Saharan Africa (SSA), prevention interventions are having some impact, and access to care and treatment services are up, which has reduced AIDS-associated mortality. Still, two-thirds of all people living with HIV are in SSA, as are half of all new infections and nearly three-quarters of AIDS-related deaths. Meanwhile, the lingering global economic malaise is squeezing donor and domestic budgets alike, and a global shift in focus from HIV to health systems and othe...\n\n      more description for UPADM-GP  232 »\n\n      \n\n\n\nFollowing an unprecedented mobilization of resources (financial and otherwise) for HIV, new infections are down across much of sub-Saharan Africa (SSA), prevention interventions are having some impact, and access to care and treatment services are up, which has reduced AIDS-associated mortality. Still, two-thirds of all people living with HIV are in SSA, as are half of all new infections and nearly three-quarters of AIDS-related deaths. Meanwhile, the lingering global economic malaise is squeezing donor and domestic budgets alike, and a global shift in focus from HIV to health systems and other health concerns may jeopardize hard-won gains. It’s an ambivalent picture that portends an uncertain future, and this course unpacks the political, economic, socio-cultural and epidemiologic nuances of HIV in the region. Global, national and community-level perspectives are explored through a mix of primary and secondary sources, as well as quantitative and qualitative literature. Following a review of HIV epidemiology and pathophysiology, the course examines the rollouts of HIV prevention, care and treatment services (particular attention is given to the South African epidemic and AIDS response); costs, financing and global HIV governance; the relationship between AIDS, sex and poverty; and concludes by considering the future of the AIDS epidemic and response in SSA.\n\n      less description for UPADM-GP  232 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 236",
            "course_name": "",
            "description": "UPADM-GP  236\n\n   Topics in Health: Policy, Politics and Power\n\nHealth care now constitutes almost 15f the U.S. economy. The broad range of issues involving health care and health care delivery are at the center of national and local policy debates: Disparities in access and outcomes for vulnerable populations; right to control decisions about treatment and about dying; medical malpractice; the adequacy of the evidence base underlying medical decisions; the pharmaceutical industry and its role in health care and politics; the impact of an aging population; and coping with accelerating health cost.\n\nThis course is an introduction for undergraduate student...\n\n      more description for UPADM-GP  236 »\n\n      \n\n\n\nHealth care now constitutes almost 15f the U.S. economy. The broad range of issues involving health care and health care delivery are at the center of national and local policy debates: Disparities in access and outcomes for vulnerable populations; right to control decisions about treatment and about dying; medical malpractice; the adequacy of the evidence base underlying medical decisions; the pharmaceutical industry and its role in health care and politics; the impact of an aging population; and coping with accelerating health cost.\n\nThis course is an introduction for undergraduate students to the major policy issues affecting health care and examines the role of government in the health care system. An important focus of the course is an assessment of the role of policy analysis in the formation and implementation of national and local health policy. Because much of government health policy relates to or is implemented through payment systems, several sessions involve some discussion of the policy implications of how government pays for care. The role of the legal system with respect to adverse medical outcomes, economic rights, and individual rights is also discussed. Proposals for health policy reform at the national and local level are examined throughout the course, with an emphasis on Medicare and Medicaid reforms currently being implemented or considered.\n\n      less description for UPADM-GP  236 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 237",
            "course_name": "",
            "description": "UPADM-GP  237\n\n   Topics in Obesity Policy Research\n\nObesity is a large, pressing public health problem in the United States and the globe. In contrast to some other public health problems, we have yet to truly establish population-level solutions, though increasing attention is being given to the policy aspects of obesity prevention This is a very new field, and much of the research is contradictory, not well interpreted by the media or policy makers, and generally is sparse, relative to some other fields (like smoking policy).  In this half-semester course we will explore the research aspects of obesity policy, and delve into detail on a numbe...\n\n      more description for UPADM-GP  237 »\n\n      \n\n\n\nObesity is a large, pressing public health problem in the United States and the globe. In contrast to some other public health problems, we have yet to truly establish population-level solutions, though increasing attention is being given to the policy aspects of obesity prevention This is a very new field, and much of the research is contradictory, not well interpreted by the media or policy makers, and generally is sparse, relative to some other fields (like smoking policy).  In this half-semester course we will explore the research aspects of obesity policy, and delve into detail on a number of key policies, including those related to access, marketing, schools, pricing, information and benefit design.\n\n      less description for UPADM-GP  237 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 239",
            "course_name": "Truth and Accountability",
            "description": "UPADM-GP  239 Truth and Accountability",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 240",
            "course_name": "",
            "description": "UPADM-GP  240\n\n   Genocide Modern Era\n\nIn the aftermath of the Holocaust, the world community vowed ?never again? to allow such atrocities.  Yet genocide remains a tragic part of the human experience.  Its persistence raises urgent questions: Is genocide preventable?  Is it an inescapable aspect of human nature, or the weapon of the grossly-deviant vicious?  Can policymakers detect early signs of genocide and prevent it from occurring?  Or is punishment after the act of genocide the only viable instrument of international policy?  This course will explore these and other questions by examining genocide in an historic and legal cont...\n\n      more description for UPADM-GP  240 »\n\n      \n\n\n\nIn the aftermath of the Holocaust, the world community vowed ?never again? to allow such atrocities.  Yet genocide remains a tragic part of the human experience.  Its persistence raises urgent questions: Is genocide preventable?  Is it an inescapable aspect of human nature, or the weapon of the grossly-deviant vicious?  Can policymakers detect early signs of genocide and prevent it from occurring?  Or is punishment after the act of genocide the only viable instrument of international policy?  This course will explore these and other questions by examining genocide in an historic and legal context.  Proposed policy solutions will be evaluated through a focus on such case studies as Armenia, Ukraine, Cambodia, and the ongoing genocide in Darfur.\n\n      less description for UPADM-GP  240 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 242",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14803",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 269",
                    "time": "Wed 5.55 PM - 8.25 PM",
                    "open": true,
                    "professor": "Finger, Aria"
                }
            ],
            "course_name": "The Business of Nonprofit Management",
            "description": "UPADM-GP  242 The Business of Nonprofit Management \nThis course is a general introduction to not-for-profit management, with heavy emphasis on practical application. How do not for profit organizations actually function? How do they attract ?customers?? How do these companies grow when there are no owners with financial incentives to grow the business? What are the core elements of a ?good? not for profit company? What are the metrics for determining the health of a company without profit? And, why would anybody work for such a crazy place?",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 243",
            "course_name": "Brandraising Nprft Comm",
            "description": "UPADM-GP  243 Brandraising Nprft Comm",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 244",
            "course_name": "U.S. in the Middle East (and Beyond): Islam & Democracy",
            "description": "UPADM-GP  244 U.S. in the Middle East (and Beyond): Islam & Democracy",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 245",
            "course_name": "The United States and the Middle East: Continuing Dilemmas",
            "description": "UPADM-GP  245 The United States and the Middle East: Continuing Dilemmas",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 246",
            "course_name": "Democratizing Islam:  Indonesia to Egypt in the Arab Spring",
            "description": "UPADM-GP  246 Democratizing Islam:  Indonesia to Egypt in the Arab Spring",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 248",
            "course_name": "Al-Qaeda and United States Foreign Policy",
            "description": "UPADM-GP  248 Al-Qaeda and United States Foreign Policy",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 249",
            "course_name": "Interfaith, Dialogue, Leadership & Public Service:  Tradiations of Engagement in the US & Beyond",
            "description": "UPADM-GP  249 Interfaith, Dialogue, Leadership & Public Service:  Tradiations of Engagement in the US & Beyond",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 250",
            "course_name": "Interfaith, Dialogue, Leadership & Public Service: Traditions of Engagement in the US & Beyond",
            "description": "UPADM-GP  250 Interfaith, Dialogue, Leadership & Public Service: Traditions of Engagement in the US & Beyond",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 251",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14807",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 275",
                    "time": "Wed 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Latif, Khalid; Coolidge, Robert"
                }
            ],
            "course_name": "Legal & Ethical Approaches to Islam",
            "description": "UPADM-GP  251 Legal & Ethical Approaches to Islam \nWe will study the formation and development of Islamic law and philosophy. We will examine the evolution and development of Islamic law and its methodology and consider how its legal and philosophical traditions are structured, both legally and ethically, while analyzing the notion of authority. Case studies will relate to the status of non-Muslims, the status of women, and key issues of social responsibility.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 252",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14817",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 275",
                    "time": "Wed 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Latif, Khalid; Coolidge, Robert"
                }
            ],
            "course_name": "Legal & Ethical Approaches to Islam",
            "description": "UPADM-GP  252 Legal & Ethical Approaches to Islam \nWe will study the formation and development of Islamic law and philosophy. We will examine the evolution and development of Islamic law and its methodology and consider how its legal and philosophical traditions are structured, both legally and ethically, while analyzing the notion of authority. Case studies will relate to the status of non-Muslims, the status of women, and key issues of social responsibility.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 253",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14812",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 361",
                    "time": "Tue 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Latif, Khalid; Sarna, Judah"
                }
            ],
            "course_name": "Multi-Faith Leadership in the 21st Century",
            "description": "UPADM-GP  253 Multi-Faith Leadership in the 21st Century \nThe course utilizes the evolution of Muslim-Jewish relations in NYC since 9-11 as an extended case study in spiritual and religious leadership and public service. How have Jewish and Muslim communities worked together to combat media narratives and inherited stereotypes? What internal battles has each community experienced? What was the impact of global/national events on local reconciliation? The course will highlight the role of joint public service efforts in developing and sustaining leadership.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 254",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14810",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 361",
                    "time": "Tue 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Latif, Khalid; Sarna, Judah"
                }
            ],
            "course_name": "Multi-Faith Leadership in the 21 Century",
            "description": "UPADM-GP  254 Multi-Faith Leadership in the 21 Century \nThe course utilizes the evolution of Muslim-Jewish relations in NYC since 9-11 as an extended case study in spiritual and religious leadership and public service. How have Jewish and Muslim communities worked together to combat media narratives and inherited stereotypes? What internal battles has each community experienced? What was the impact of global/national events on local reconciliation? The course will highlight the role of joint public service efforts in developing and sustaining leadership.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 255",
            "course_name": "Contemporary Approaches to Islamic Law",
            "description": "UPADM-GP  255 Contemporary Approaches to Islamic Law",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 256",
            "course_name": "Contemporary Approaches to Islamic law",
            "description": "UPADM-GP  256 Contemporary Approaches to Islamic law",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 257",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14815",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 431",
                    "time": "Thu 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Sarna, Judah"
                }
            ],
            "course_name": "Contemporary Aproaches to Jewish Law",
            "description": "UPADM-GP  257 Contemporary Aproaches to Jewish Law \nIn this course, we will study foundational topics in Jewish law and philosophy, employing a comparative and interdisciplinary perspective. From biblical to modern times, we will trace how the Jewish legal tradition has developed. We will explore the complex interplay of law, religion, society and politics in various formative stages of the Jewish normative tradition.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 258",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14816",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "WAVE 431",
                    "time": "Thu 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Sarna, Judah"
                }
            ],
            "course_name": "Contemporary Approaches to Jewish Law",
            "description": "UPADM-GP  258 Contemporary Approaches to Jewish Law \nIn this course, we will study foundational topics in Jewish law and philosophy, employing a comparative and interdisciplinary perspective. From biblical to modern times, we will trace how the Jewish legal tradition has developed. We will explore the complex interplay of law, religion, society and politics in various formative stages of the Jewish normative tradition.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 259",
            "course_name": "Religion, Conflict and Social Change",
            "description": "UPADM-GP  259 Religion, Conflict and Social Change",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 263",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14804",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "MEYR 157",
                    "time": "Thu 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Botwinick, Michael"
                }
            ],
            "course_name": "",
            "description": "UPADM-GP  263\n\n   From Degas to Disney: Public Policy and the Arts\n\nUnlike most countries, the United States provides little direct government support, i.e., a ministry of cultural or cabinet level department, for one of the most highly developed and dynamic arts and culture sectors in the world.   Rather than the result of a single national cultural policy, the arts in America have developed for the most part as a private sector enterprise supported by a variety of government policies largely conceived for other public purposes.  This course will provide undergraduate students with an introduction to the history and development of public decision making about...\n\n      more description for UPADM-GP  263 »\n\n      \n\n\n\nUnlike most countries, the United States provides little direct government support, i.e., a ministry of cultural or cabinet level department, for one of the most highly developed and dynamic arts and culture sectors in the world.   Rather than the result of a single national cultural policy, the arts in America have developed for the most part as a private sector enterprise supported by a variety of government policies largely conceived for other public purposes.  This course will provide undergraduate students with an introduction to the history and development of public decision making about the arts anUnlike most countries, the United States provides little direct government support, i.e., a ministry of cultural or cabinet level department, for one of the most highly developed and dynamic arts and culture sectors in the world.   Rather than the result of a single national cultural policy, the arts in America have developed for the most part as a private sector enterprise supported by a variety of government policies largely conceived for other public purposes.  This course will provide undergraduate students with an introduction to the history and development of public decision making about the arts and the important role played by the arts creative industries in a post-industrial world of rapid technological, social, political, and economic change. \n\nWhile the course will focus on U.S. non profit issues, the arts and culture sector is broadly defined to include relevant for profit and commercial arts as well as international comparisons.  Class meetings will include guest lecturers and field trips\n\n      less description for UPADM-GP  263 «",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 264",
            "course_name": "",
            "description": "UPADM-GP  264\n\n   Understanding Social Entrepreneurship\n\nThis course investigates the different ways social entrepreneurs can make a difference here in the United States and around the world. The class will address questions like: Why do we need social innovation? How can founders protect their mission is an age when entrepreneurship is largely governed by venture capitalists? How can one innovate inside a large corporation or government institution? How can entrepreneurs plan for and manage the high risks of starting ventures that fail more often than not? The course will also feature visits by successful social entrepreneurs who answered these que...\n\n      more description for UPADM-GP  264 »\n\n      \n\n\n\nThis course investigates the different ways social entrepreneurs can make a difference here in the United States and around the world. The class will address questions like: Why do we need social innovation? How can founders protect their mission is an age when entrepreneurship is largely governed by venture capitalists? How can one innovate inside a large corporation or government institution? How can entrepreneurs plan for and manage the high risks of starting ventures that fail more often than not? The course will also feature visits by successful social entrepreneurs who answered these questions in different ways.\n\n      less description for UPADM-GP  264 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 265",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "14806",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 369",
                    "time": "Tue 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "Spodek, Joshua"
                }
            ],
            "course_name": "Fundamentals of Social Entrepreneurship: Problem Solving and Innovation",
            "description": "UPADM-GP  265 Fundamentals of Social Entrepreneurship: Problem Solving and Innovation \nThe course will highlight innovative case studies of success in restoring the environment, resolving conflicts, curing diseases, overcoming poverty, and addressing other problems of social injustice.  During the term, each student will develop an original blueprint for social innovation: a creative\nproposal for solving a  societal problem.",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 266",
            "course_name": "Advanced Social Entrepreneurship",
            "description": "UPADM-GP  266 Advanced Social Entrepreneurship",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 267",
            "course_name": "Social Entrepreneurship Incubator & Practicum",
            "description": "UPADM-GP  267 Social Entrepreneurship Incubator & Practicum",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 268",
            "course_name": "Social Pov/Inequality",
            "description": "UPADM-GP  268 Social Pov/Inequality",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 269",
            "course_name": "",
            "description": "UPADM-GP  269\n\n   How to Change the World: Advocacy Movements in the US\n\nHow does someone go about changing the world? What can we learn from the past about what it means to be an effective agent of change? This course will focus on several broad social movements in post-war America, including: Occupy Wall Street: the movement for African-American civil rights, including the charter school movement; the conservative movement, including the Tea Party; the Gay & Lesbian Civil Rights Movement, including AIDS activism; and the Consumer Movement including the Food Consciousness Movement.\nThere are two objectives for this course:\nü  To introduce and familiarize students ...\n\n      more description for UPADM-GP  269 »\n\n      \n\n\n\nHow does someone go about changing the world? What can we learn from the past about what it means to be an effective agent of change? This course will focus on several broad social movements in post-war America, including: Occupy Wall Street: the movement for African-American civil rights, including the charter school movement; the conservative movement, including the Tea Party; the Gay & Lesbian Civil Rights Movement, including AIDS activism; and the Consumer Movement including the Food Consciousness Movement.\nThere are two objectives for this course:\nü  To introduce and familiarize students with these social movements that span post-war American history, putting each in its historical context;\nü  To use these movements to illustrate the variety of tactics and strategies employed by advocates to advance social change including demonstrations, boycotts, legislation, regulatory action, electoral politics, marches, and voter referenda.\n\n \n\n\n\t\n\n      less description for UPADM-GP  269 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 270",
            "course_name": "",
            "description": "UPADM-GP  270\n\n   Global Social Entrepreneurship: Field Experience\n\nThe purpose of this course is to provide students with an academic overview and direct experience with the issues and challenges in contemporary Global Social Entrepreneurship. This area has become one of the fastest growing segments for business and academic development, and this course is a component of the Minor in Social Entrepreneurship for NYU undergraduates. Both business applications and social entrepreneurship areas will be explored in research, theory and practice during this class, through relevant readings, case studies, discussion and presentations by global social entrepreneurs. ...\n\n      more description for UPADM-GP  270 »\n\n      \n\n\n\nThe purpose of this course is to provide students with an academic overview and direct experience with the issues and challenges in contemporary Global Social Entrepreneurship. This area has become one of the fastest growing segments for business and academic development, and this course is a component of the Minor in Social Entrepreneurship for NYU undergraduates. Both business applications and social entrepreneurship areas will be explored in research, theory and practice during this class, through relevant readings, case studies, discussion and presentations by global social entrepreneurs. There will also be an experiential component to the class: students will both learn skills for cultural competency and global social entrepreneurship, and engage in a week long field experience in cultural immersion in a country outside of the United States. The field experience will focus on the various issues, possibilities and results, and the people involved with social entrepreneurial ventures in that country. To accomplish this goal, students will attend 15 hours of class at NYU during the spring semester and 35 hours of class in Shanghai, China the last week in May, 2012. The Shanghai segment includes 3 hours each morning in the classroom and at least 4 hours each afternoon in a cultural immersion practicum experience in the field. Altogether in Shanghai and NYC, the students will have at least 50 hours of class time and supervised practical experience for this 4 credit course. The New York-based classes are combined into longer meetings on two weekends rather than the more typical weekly sessions across the semester. Each class will include a segment on skill building and practice. The primary text here is CORE 4, with a focus on skills related to global experience. Global social entrepreneur skills center on cultural competency, emphasizing four specific themes: connection, liner (setting boundaries), convertor and strategist. These skill sets will enable students to be more effective global citizens and contributors for positive change in the world.\n\n      less description for UPADM-GP  270 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 271",
            "course_name": "Advocacy & Mvmnt Pol US",
            "description": "UPADM-GP  271 Advocacy & Mvmnt Pol US",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 272",
            "course_name": "Criminal Justice Reform: New Frontiers and Strategies",
            "description": "UPADM-GP  272 Criminal Justice Reform: New Frontiers and Strategies",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 273",
            "course_name": "Juvenile Justice Reform",
            "description": "UPADM-GP  273 Juvenile Justice Reform",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 280",
            "course_name": "Global Politics of Green Growth",
            "description": "UPADM-GP  280 Global Politics of Green Growth",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 281",
            "course_name": "Advanced Seminar:  Mapping",
            "description": "UPADM-GP  281 Advanced Seminar:  Mapping",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 282",
            "course_name": "Urban Planning and Design: Past, Present , Future",
            "description": "UPADM-GP  282 Urban Planning and Design: Past, Present , Future",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 283",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "17345",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Mon 4.55 PM - 7.25 PM",
                    "open": true,
                    "professor": "WAVE 668"
                }
            ],
            "course_name": "",
            "description": "UPADM-GP  283\n\n   Geographic Information Systems\n\nIn this hands-on Geographic Information Systems (GIS) course students will learn to work with the leading mapping software, ArcGIS.  Class and homework exercises will focus on methods of preparing, analyzing, visualizing/mapping a variety of urban planning data, crime data, and data on emergency/disaster impacts and more.  They will also learn to save and share the maps they create, and the analysis results, in both printed form and on the internet.\n\nThroughout this Introduction to GIS course students will be working with data that will be supplied by Prof. Naphtali but they will also learn to...\n\n      more description for UPADM-GP  283 »\n\n      \n\n\n\nIn this hands-on Geographic Information Systems (GIS) course students will learn to work with the leading mapping software, ArcGIS.  Class and homework exercises will focus on methods of preparing, analyzing, visualizing/mapping a variety of urban planning data, crime data, and data on emergency/disaster impacts and more.  They will also learn to save and share the maps they create, and the analysis results, in both printed form and on the internet.\n\nThroughout this Introduction to GIS course students will be working with data that will be supplied by Prof. Naphtali but they will also learn to search for and download GIS data from various internet sites.\n\nBy the end of this GIS course, students will have a solid understanding of how GIS maps and ArcGIS tools can be used to visualize and analyze real-world features, to discover patterns in data, to obtain information and to communicate it with others using maps in printed form and on the internet.\n\n      less description for UPADM-GP  283 «",
            "offering": true
        },
        {
            "course_id": "UPADM-GP 290",
            "course_name": "Labor Rights and Job Creation in the 21st Century",
            "description": "UPADM-GP  290 Labor Rights and Job Creation in the 21st Century",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 295",
            "course_name": "Seminar in Moral Leadership",
            "description": "UPADM-GP  295 Seminar in Moral Leadership",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 299",
            "course_name": "Independent Studies in Citizenship",
            "description": "UPADM-GP  299 Independent Studies in Citizenship",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 410",
            "course_name": "Sustaining Social Change in the New Economy",
            "description": "UPADM-GP  410 Sustaining Social Change in the New Economy",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 420",
            "course_name": "Economic Crises in a Globalizing World",
            "description": "UPADM-GP  420 Economic Crises in a Globalizing World \nThis course examines thenature of recent and ongoing global economic crises.  What are the leading causes of turbulence inthe global economy?  Are there prospectsfor positive change?  What role doemerging economic powers like China and India play?  Students will begin with a ‘deep dive’through a specific set of past crises and how governments, businesses, and NGOsresponded.  We will then focus on recentand looming global economic problems, including the 2008 near-collapse of thefinancial system and the current fate of troubled European economies.",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 430",
            "course_name": "The Politics of Development",
            "description": "UPADM-GP  430 The Politics of Development",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 440",
            "course_name": "Gender and Development",
            "description": "UPADM-GP  440 Gender and Development",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 548",
            "course_name": "Sex & Movements: Gender, Class and Social Movements in the Caribbean & Latin Am",
            "description": "UPADM-GP  548 Sex & Movements: Gender, Class and Social Movements in the Caribbean & Latin Am",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 550",
            "course_name": "Crafting Your Career",
            "description": "UPADM-GP  550 Crafting Your Career",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 560",
            "course_name": "Service Learning: Fieldwork",
            "description": "UPADM-GP  560 Service Learning: Fieldwork",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 562",
            "course_name": "Service Learning Fieldwork:  New Orleans",
            "description": "UPADM-GP  562 Service Learning Fieldwork:  New Orleans",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 801",
            "course_name": "",
            "description": "UPADM-GP  801\n\n   Social Entrepreneurship:  Finanical and Budget Strategies\n\nThis course is as much about story telling as it is about the underlying financial managerial, and strategic concepts that are critical to mission achievement and financial success. The class will provide an introduction to the financial concepts, tools, and analytical thinking that integrates programmatic and strategic priorities which enable innovative ideas to start and grow to financially viable sustainable projects and organizations. The focus will be on models and practices common to both the non-profit and for-profit sectors as well as understanding the implications of their differences...\n\n      more description for UPADM-GP  801 »\n\n      \n\n\n\nThis course is as much about story telling as it is about the underlying financial managerial, and strategic concepts that are critical to mission achievement and financial success. The class will provide an introduction to the financial concepts, tools, and analytical thinking that integrates programmatic and strategic priorities which enable innovative ideas to start and grow to financially viable sustainable projects and organizations. The focus will be on models and practices common to both the non-profit and for-profit sectors as well as understanding the implications of their differences.\n\n      less description for UPADM-GP  801 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 9101",
            "course_name": "Public Policy in the US",
            "description": "UPADM-GP 9101 Public Policy in the US",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 9202",
            "course_name": "The Politics of Social Impact",
            "description": "UPADM-GP 9202 The Politics of Social Impact \nThis course will explore the role of the president in designing, promoting, lobbying, shaping, enacting, and implementing social change. It will focus specifically on the president’s foreign and domestic policy agendas, but will also examine the congressional policymaking process as a constraint on the president’s policymaking tools and strategies.",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 9217",
            "course_name": "Globalizing Social Activism:",
            "description": "UPADM-GP 9217 Globalizing Social Activism:",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 9221",
            "course_name": "",
            "description": "UPADM-GP 9221\n\n   The President and Social Impact\n\nPresidents have enormous power to create social impact.  They help set the national agenda of problems, use their words and actions to convince the public and Congress to act, provide legislative solutions, and execute the laws.  They face limits, too, including constitutional checks and balances, polarization, and what some experts call a dysfunctional Congress.  This course will examine these and other issues that affect the president's ability to create durable social change.  The course will also introduce students to the presidential policy process, and explore emerging doubts that presid...\n\n      more description for UPADM-GP 9221 »\n\n      \n\n\n\nPresidents have enormous power to create social impact.  They help set the national agenda of problems, use their words and actions to convince the public and Congress to act, provide legislative solutions, and execute the laws.  They face limits, too, including constitutional checks and balances, polarization, and what some experts call a dysfunctional Congress.  This course will examine these and other issues that affect the president's ability to create durable social change.  The course will also introduce students to the presidential policy process, and explore emerging doubts that presidents have any effect at all on solving the \"wicked\" problems that face the nation and world.  Students will be asked to provide detailed advice to the president on a social problem of their choice, and will meet with policymakers in Congress, the executive branch, lobbying and polling firms, polling and interest groups to assess the key issues raised in the course.  They will also present their proposals for presidential action to selected policymakers for review.\n\n      less description for UPADM-GP 9221 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 9236",
            "course_name": "Topics in Health: Policy, Politics and Power",
            "description": "UPADM-GP 9236 Topics in Health: Policy, Politics and Power",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 9253",
            "course_name": "",
            "description": "UPADM-GP 9253\n\n   Multi-Faith Leadership in the 21st Century\n\nIn all spheres of society, individuals from different faiths are coming into contact with each other more and more often. Effective leadership plays an integral role in bridging communities that historically were separate, but today exist side-by-side in a culture that is religiously and spiritually diverse.   This course seeks to prepare students to become aware of faith traditions other than their own, with a strong emphasis on learning techniques and theories of how to engage others.   We will look at different theories of religions, current examples of leadership and communities, influence...\n\n      more description for UPADM-GP 9253 »\n\n      \n\n\n\nIn all spheres of society, individuals from different faiths are coming into contact with each other more and more often. Effective leadership plays an integral role in bridging communities that historically were separate, but today exist side-by-side in a culture that is religiously and spiritually diverse.   This course seeks to prepare students to become aware of faith traditions other than their own, with a strong emphasis on learning techniques and theories of how to engage others.   We will look at different theories of religions, current examples of leadership and communities, influence of media, and movements around social justice and service in hopes of laying a foundation for solid connections across religious communities.\n\n      less description for UPADM-GP 9253 «",
            "offering": false
        },
        {
            "course_id": "UPADM-GP 9900",
            "course_name": "Policy, Power, Politics: Washington, DC",
            "description": "UPADM-GP 9900 Policy, Power, Politics: Washington, DC",
            "offering": false
        }
    ]
}