{
    "major_id": "URBMA-GU",
    "file": "./2015-2016/Urban_Management_(URBMA-GU).html",
    "courses": [
        {
            "course_id": "URBMA-GU 1001",
            "course_name": "",
            "description": "URBMA-GU 1001\n\n   Markets, Design, and the City\n\nCourse description*: Cities today drive the world economy: they contain\njust over half of the world's population but generate over 80% of the\nworld's GDP. Cities create this value by being dynamic environments where\npeople and ideas can come together and mix in unplanned, spontaneous ways.\nDespite the critical role for city leaders in supporting this dynamism,\nthose leaders too often do not understand the role of the market in urban\nareas. Instead, urban planning often remains one of the last vestiges of\nthe of 20th century Soviet-style central planning, imposing untold costs on\ncities and the...\n\n      more description for URBMA-GU 1001 »\n\n      \n\n\n\nCourse description*: Cities today drive the world economy: they contain\njust over half of the world's population but generate over 80% of the\nworld's GDP. Cities create this value by being dynamic environments where\npeople and ideas can come together and mix in unplanned, spontaneous ways.\nDespite the critical role for city leaders in supporting this dynamism,\nthose leaders too often do not understand the role of the market in urban\nareas. Instead, urban planning often remains one of the last vestiges of\nthe of 20th century Soviet-style central planning, imposing untold costs on\ncities and their residents.  Planners too often try to micromanage land use\nwhile neglecting the design and development of infrastructure, which\nmarkets alone cannot provide.\n\nThis class, based on Alain Bertaud's forthcoming book, Order Without\nDesign, will examine the critical role of the market in cities, show how\nthe popular urban planning and policy approach usually ignores the market,\nharming cities, and explore how a proper understanding of the market can be\nincorporated into city planning, management, and policy to improve the\nsuccess of cities. Subject areas will include urban labor markets, urban\nspatial structures, land prices, population densities, mobility and\ntransport, and housing affordability. The course is open to graduate\nstudents and advanced undergraduates from all disciplines.\n\n      less description for URBMA-GU 1001 «",
            "offering": false
        },
        {
            "course_id": "URBMA-GU 1101",
            "course_name": "",
            "description": "URBMA-GU 1101\n\n   Crime Control, Drug Policy, and the City\n\nThe course considers the basic questions of policy analysis, as applied to\ndrugs and crime: What is the nature and extent of the problem? What are the\noptions for dealing with it? What are the likely consequences of pursuing\nvarious crime and drug control activities? Taking the consequences into\nconsideration, which are the most attractive policy approaches?\n\nThe goal of the course is to enable students to formulate responsible\nopinions on policy issues related to drugs and crime, to defend those\nopinions with good analysis, and to understand the logic behind differing\nopinions.\n\nThe course ha...\n\n      more description for URBMA-GU 1101 »\n\n      \n\n\n\nThe course considers the basic questions of policy analysis, as applied to\ndrugs and crime: What is the nature and extent of the problem? What are the\noptions for dealing with it? What are the likely consequences of pursuing\nvarious crime and drug control activities? Taking the consequences into\nconsideration, which are the most attractive policy approaches?\n\nThe goal of the course is to enable students to formulate responsible\nopinions on policy issues related to drugs and crime, to defend those\nopinions with good analysis, and to understand the logic behind differing\nopinions.\n\nThe course has no formal prerequisite; concepts from economics, law,\npharmacology, psychology, sociology, political science, moral philosophy,\norganizational behavior, public management, and operations analysis will be\nintroduced as we go along. The reading list is long and conceptually\ndemanding.\n\n      less description for URBMA-GU 1101 «",
            "offering": false
        }
    ]
}