{
    "major_id": "WRII-UF",
    "file": "./2015-2016/Writing_II_(WRII-UF).html",
    "courses": [
        {
            "course_id": "WRII-UF 102",
            "classes": [
                {
                    "format": "Lecture",
                    "class_id": "11997",
                    "section": "001",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": null,
                    "time": "Tue,Thu 2.00 PM - 3.15 PM",
                    "open": true,
                    "professor": "GCASL 374"
                },
                {
                    "format": "Lecture",
                    "class_id": "12203",
                    "section": "002",
                    "period": "09/02/2015 - 12/15/2015",
                    "location": "GCASL 465",
                    "time": "Mon,Wed 9.30 AM - 10.45 AM",
                    "open": true,
                    "professor": "Goldfin, Robin"
                }
            ],
            "course_name": "",
            "description": "WRII-UF  102\n\n   Writing II\n\nIn Writing II, students develop their skills in analysis and argumentation by exploring the ways in which the ideas of others can be incorporated into their own writing. Students read and discuss longer, more challenging texts; in their own writing, students are expected to incorporate a broad range of primary and secondary sources to develop and support their increasingly complex ideas. Students are familiarized with a wide variety of possible resources at the library and learn the mechanics and conventions of the academic research essay. The course continues to encourage in-class participati...\n\n      more description for WRII-UF  102 »\n\n      \n\n\n\nIn Writing II, students develop their skills in analysis and argumentation by exploring the ways in which the ideas of others can be incorporated into their own writing. Students read and discuss longer, more challenging texts; in their own writing, students are expected to incorporate a broad range of primary and secondary sources to develop and support their increasingly complex ideas. Students are familiarized with a wide variety of possible resources at the library and learn the mechanics and conventions of the academic research essay. The course continues to encourage in-class participation, collaborative learning, and workshop presentations.\n\n      less description for WRII-UF  102 «",
            "offering": true
        },
        {
            "course_id": "WRII-UF 9102",
            "course_name": "Writing II",
            "description": "WRII-UF 9102 Writing II",
            "offering": false
        }
    ]
}