{
    "major_id": "WRIT-AD",
    "file": "./2015-2016/Writing_(WRIT-AD).html",
    "courses": [
        {
            "course_id": "WRIT-AD 10",
            "course_name": "B Advanced Reading: Journeys and Emancipations",
            "description": "WRIT-AD   10B Advanced Reading: Journeys and Emancipations \nThis is a Gap Year Program level course designed to prepare students with necessary college level reading English skills.",
            "offering": false
        },
        {
            "course_id": "WRIT-AD 11",
            "classes": [
                {
                    "format": "Workshop",
                    "class_id": "12791",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "Methods of the Written Voice",
            "description": "WRIT-AD   11 Methods of the Written Voice \nThis is an Opportunities Program course designed to prepare students with necessary college level writing English skills.",
            "offering": true
        },
        {
            "course_id": "WRIT-AD 11",
            "course_name": "B Advanced Writing: Part 2",
            "description": "WRIT-AD   11B Advanced Writing: Part 2 \nThis is a Gap Year Program level course designed to prepare students with necessary college level writing English skills.",
            "offering": false
        },
        {
            "course_id": "WRIT-AD 50",
            "course_name": "J",
            "description": "WRIT-AD   50J\n\n   The Quill and the Chisel: A Study of Michelangelo’s Artistic Expression\n\nLooking at the sonnets, letters and sculptures of Michelangelo, we will explore Michelangelo as a communicator through the writing and art he produced. Our discussions will be driven by the essential question: How is art similar to language and how is it different? The class will examine the form of the Petrarchan sonnet and Michelangelo’s intention to use the sonnet form as a means of artistic expression. We will further explore how his sonnets are connected to the visual art he created. Upon observation of the artist’s sculptures, instructors will facilitate discussion of the language used t...\n\n      more description for WRIT-AD   50J »\n\n      \n\n\n\nLooking at the sonnets, letters and sculptures of Michelangelo, we will explore Michelangelo as a communicator through the writing and art he produced. Our discussions will be driven by the essential question: How is art similar to language and how is it different? The class will examine the form of the Petrarchan sonnet and Michelangelo’s intention to use the sonnet form as a means of artistic expression. We will further explore how his sonnets are connected to the visual art he created. Upon observation of the artist’s sculptures, instructors will facilitate discussion of the language used to respond to the visual expression as a strategy for understanding the world. In doing so, we will investigate the difference between of “seeing” and “viewing” as a method of analysis. Students will identify the principal themes that connect all forms of his artistic expression, including commitment to artistic endeavors and psychological imprisonment.\n \nStudents will be given the opportunity to express a conceptual claim from the artist with a visual medium. Together we will explore whether the intentions of the artist can be conveyed more plausibly with words or through sculpture. Our discussion will address whether art is an imitation of words or a source of knowledge that can stand alone without words. What can be communicated without words? Does Michelangelo’s writing serve as an inspiration for his sculpture or do his sculptures further ignite his writing?\nDid the existence of an artist like Michelangelo keep a certain type of language or art alive and thus help others to see the world with new eyes?\n\n      less description for WRIT-AD   50J «",
            "offering": false
        },
        {
            "course_id": "WRIT-AD 110",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12731",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": "CAMP E050",
                    "time": "Mon,Wed 10.40 AM - 11.55 AM",
                    "open": true,
                    "professor": "Savio, James"
                },
                {
                    "format": "Seminar",
                    "class_id": "12748",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "12732",
                    "section": "003",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "12733",
                    "section": "004",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "12749",
                    "section": "005",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "12827",
                    "section": "006",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "12832",
                    "section": "007",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "12847",
                    "section": "008",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "",
            "description": "WRIT-AD  110\n\n   Analysis and ExpressionGhastly Beauty-A Brief History of Human EmotionImagi(nation)Pattern LanguageTextiles in Culture, Art & ScienceWriting In Disguise\n\nThere are a number of different topics that can be taken in this course.\nGhastly Beauty-A Brief History of Human Emotion\nAs an aural, visual, and written expression of our humanity, art relies on the senses to make meaning.  The texts examined in this course are designed to underscore the provocative and creative ways an idea can be expressed and responded to. Artists are visionaries. They reconfigure what they see into countless forms and multi-dimensional shapes, and in the process they transform the way we see, and engage with the world. This Analysis and Expression course introduces studen...\n\n      more description for WRIT-AD  110 »\n\n      \n\n\n\nThere are a number of different topics that can be taken in this course.\nGhastly Beauty-A Brief History of Human Emotion\nAs an aural, visual, and written expression of our humanity, art relies on the senses to make meaning.  The texts examined in this course are designed to underscore the provocative and creative ways an idea can be expressed and responded to. Artists are visionaries. They reconfigure what they see into countless forms and multi-dimensional shapes, and in the process they transform the way we see, and engage with the world. This Analysis and Expression course introduces students to various art forms, studying them in the context of time (history), culture (place) and aesthetics (philosophy and form). They are examined through the lens of four dialectical themes: Faith & Reason, the Individual & Society, Tragedy & Beauty, and Conflict & Resolution. Students become familiar with formal analysis and the basic language of the arts – film, photography, painting, music, sculpture and literature – to be able to write and discuss the work with more fluency. They develop skills in close-reading both visual and written texts, with weekly writing exercises designed to stimulate analytical thought. The writing exercises move them toward the completion of three scholarly papers through a drafting process: a well argued response to a single reading; an analytical dialogue between two or more texts, and a more deeply researched/argument based essay of their own choosing. Students give one oral/visual presentation on an assigned topic, and a shorter oral presentation outlining the ideas for their final paper.\nTextiles in Culture, Art & Science \nTextiles surround us, literally. Unlike other animals, humans are clothed, and therefore have a long history of using cloth for both functional and ritual purposes. Textiles carry culture and craft, are powerful political symbols and tools, and there are numerous examples of textile thinking in art, design, and the sciences. Analysis & Expression: Textiles in Culture, Art & Science takes up the exploration of textiles in order to teach writing as a process that leads to polished scholarly essays. All students who take A & E will complete the course with a deepened understanding of thinking through writing, shaping an essay, making arguments and using evidence, writing multiple drafts, proofreading and revision, conducting research, adopting a citation method, and achieving fluency in writing, including how to achieve error-free English grammar. Students will write three formal essays through a progression of exercises and give a final oral presentation on their research. We will explore and write about textiles with the following questions in mind: How is the study of textiles also the study of global flows: globalization in trade, labor, and economics? How do textiles challenge the division between “craft” and “fine art”? What do textiles teach us about ecology, nature, and environmentalism? How are textiles used in scientific and mathematical thinking and modeling? What does the study of clothing tell us about culture, identity, politics?\nPattern Language \nAnalysis & Expression: Pattern Language explores the patterning of societies, drawing on anthropology, sociology, economics, and the arts. A “pattern language” is a term used by architect Christopher Alexander to argue that buildings that have been produced by an iterative process—a process for arriving at a decision or a desired result by repeating rounds of analysis or cycles of operations—are better to live in and look at then ones imposed by an outside intelligence. Humans use patterns to make sense of the world and also create patterns that have lasting effects. We will investigate how humans are shaped by their environment and in term shape them. We’ll explore writing as a ritual and how rituals came to be written down. Finally, we’ll identify common aspects of human experience that are shared across cultures and historical epochs.\nWriting In Disguise\nThis section of A&E looks at the problems and pleasures of “writing in disguise,” and considers how diverse forms of literary deception relate to other social, cultural, artistic, and political uses of disguise, broadly defined.  In conversation with historical and contemporary investments in authenticity and objectivity, we will explore the stakes of persuasive writing across multiple genres. We will examine the questions raised when a writer, for example, “disguises” one literary form within another (Jennifer Egan’s Black Box), embellishes a true story with fictional details (Mike Daisey’s The Agony and the Ecstasy of Steve Jobs), or self-censors her work in anticipation of official censorship (Alexandra Kollontai’s Autobiography).  Alongside texts like these, which require us to “read between the lines,” we will look at texts that investigate the many ways in which disguise infiltrates, orders, and disorders our daily lives. We will ask and attempt to answer some of the many questions these texts, taken together, raise: How is “writing in disguise” like what we do everyday? How is it like what an actor does, or a politician? When a writer chooses a voice with which to speak, whether a voice she would call her own or a voice she borrows, how might this relate to the way we often present ourselves differently in different contexts? And then, how do examples of “writing in disguise” mirror or differ from our own efforts when we write academic essays?\nYou will write often in class and expect to have lively discussions about written and visual texts.  You will complete four major assignments: three persuasive essays, all with an extensive drafting process, and a final oral presentation about the material of Essay 3.  For the first two essays you will be given a progression of low-stakes writing exercises that lead to the drafting process.  These exercises are designed to push you to higher levels of critical thinking: they ensure a recursive process so that you are always reexamining your original take on the texts at hand.  You will use the material of these exercises in addition to in-class and tutorial work as you write your essays. For Essay 3 you are on your own to choose your favorite topic of the course and write a research essay that showcases all the skills you have practiced in the class.  This final essay will be assessed as a means of determining your facility with these skills and how prepared you are to take more writing-intensive courses.  \nA&E: Writing in Disguise, will give you innovative and sometimes controversial material; ask you to revel in the world of ideas and debate; give you practice speaking about your ideas in public; and most importantly help you build a solid foundation of writing and critical thinking skills that will serve you well in the university.\nImagi(nation)\nWe tend think of locales as something physical, something experienced. We know where we are (and where we are from) partly because we have physical experiences of those places: a grandmother’s kitchen, a summer cottage, a smell of the ocean, the particular light on Scandinavian summer nights, or the sound of the jungle. Locale is typically the embodied geography of our lives and experiences.  However, what happens when geographies and their relation to identity—national and/or personal—are imagined in cultural products? In this seminar, we will read a variety of fiction and non-fiction texts in order to investigate how space and national and/or personal identity get imagined by the reader and, not least, how the text opens a space for the reader to imagine a world personally unknown.  We will think of the seminar’s foundational texts as being simultaneously in and out of time and space, thereby forcing us to also think about our own lived geographies.   \n\nWe set out by thinking about essays, short stories, and poems that all attempt to capture an experience of self in relation to a locale.  Writers will include Joan Diddion, Richard Blanco, Karen Blixen, Tony Kushner, and Jamaica Kincaid. For the second paper we turn our attention to how the popular genre of crime fiction—from Agatha Christie to Henning Mankell—functions in the construction of imagined geographies. For the third paper, students choose a cultural artifact (poems, plays, monuments, films, memoires, paintings, newspaper articles etc.) and make an argument about the imagining of nation.  Finally, students will produce an oral conference presentation of their research. Theoretical texts include Edward Said, Benedict Anderson, Anthony Kwame Appiah, Judith Butler and Gayatri Chakravorty Spivak.\n\n      less description for WRIT-AD  110 «",
            "offering": true
        },
        {
            "course_id": "WRIT-AD 111",
            "classes": [
                {
                    "format": "Seminar",
                    "class_id": "12844",
                    "section": "001",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                },
                {
                    "format": "Seminar",
                    "class_id": "13070",
                    "section": "002",
                    "period": "08/30/2015 - 12/17/2015",
                    "location": null,
                    "time": null,
                    "open": true,
                    "professor": null
                }
            ],
            "course_name": "X",
            "description": "WRIT-AD  111X\n\n   Analysis and Expression: Contemporary Debates about Islam\n\nScarcely a day goes by without some controversy or critical comment about ‘Islam’ -- Muslims -- and its role and significance in the 21st century. Yet trying to make sense of the sheer volume of information and diversity of opinions about what constitutes ‘Islam’, who speaks for it, what it represents for the modern era, and how it relates to the non-Muslim world can—to the unsuspecting observer—seem an almost impossible task. To complicate matters further, what tends to pass as ‘informed’ commentary on ‘Islam’ often turns out to be colored by competing agendas, experiences, and narratives wit...\n\n      more description for WRIT-AD  111X »\n\n      \n\n\n\nScarcely a day goes by without some controversy or critical comment about ‘Islam’ -- Muslims -- and its role and significance in the 21st century. Yet trying to make sense of the sheer volume of information and diversity of opinions about what constitutes ‘Islam’, who speaks for it, what it represents for the modern era, and how it relates to the non-Muslim world can—to the unsuspecting observer—seem an almost impossible task. To complicate matters further, what tends to pass as ‘informed’ commentary on ‘Islam’ often turns out to be colored by competing agendas, experiences, and narratives within and beyond the realms of ‘Islam’. With these challenges in mind, this course will revisit some of the key debates about the culture, society, and institutions of Islam, and invite students to form and defend their opinions on a range of controversial issues. \nA significant feature of the course will be the focus on in-class writing as well as discussions and debate about written and audio-visual media. Over the duration of the semester, students will complete four major assignments: three persuasive essays, all with an extensive drafting process, and a final oral presentation on the subject matter of Essay 3.\n\n      less description for WRIT-AD  111X «",
            "offering": true
        },
        {
            "course_id": "WRIT-AD 130",
            "course_name": "",
            "description": "WRIT-AD  130\n\n   Analysis and Expression II: Ideas of the Tragic\n\nA man pokes his eyes out upon realizing he has killed his father and slept with his mother. A king returning from war finds his adulterous wife in a murdering mood, and before long he is dead. A wife betrayed by her philandering husband slaughters her two children as revenge. Tragedies portray human actions and emotions at their most extreme. What have these performances of suffering offered audiences for millennia? What social function does tragedy have? What cultural anxieties are revealed or exorcised by these spectacular representations of acute passion, rage, and pain? We begin by examini...\n\n      more description for WRIT-AD  130 »\n\n      \n\n\n\nA man pokes his eyes out upon realizing he has killed his father and slept with his mother. A king returning from war finds his adulterous wife in a murdering mood, and before long he is dead. A wife betrayed by her philandering husband slaughters her two children as revenge. Tragedies portray human actions and emotions at their most extreme. What have these performances of suffering offered audiences for millennia? What social function does tragedy have? What cultural anxieties are revealed or exorcised by these spectacular representations of acute passion, rage, and pain? We begin by examining Aeschylus’s Agamemnon and Shakespeare’s Hamlet in a philosophical context by engaging Aristotle’s, Hegel’s, and George Steiner’s philosophies of tragedy. We next explore what modern tragedy might look like through an analysis of Nuri Bilge Ceylan’s award-winning Once Upon a Time in Anatolia, a meditation on loss, sin, and inheritance. For the research paper, students select a contemporary cultural artifact and make an argument about how it represents tragedy in the post 9/11 world. Possible topics range from online communities of mourning or the debate over how to commemorate the attacks and their consequences to the continuing influence of classical tragedy on contemporary culture in The Wire or Lars von Trier’s Melancholia.\n\n      less description for WRIT-AD  130 «",
            "offering": false
        },
        {
            "course_id": "WRIT-AD 131",
            "course_name": "X",
            "description": "WRIT-AD  131X\n\n   A & E ll: Contemporary Debates about the Middle East and Islamic World\n\nIt is perhaps not too much of an exaggeration to suggest that there exists no other region or cultural grouping in the world today that has undergone such intense scrutiny as that of Middle East and Islamic world. With the recent rise of ISIS, the emergence of the Arab Spring, and the never-ending conflict in Israel-Palestine there is every reason to believe that worldwide attention on Islam, Arabs and Muslims is likely to continue unabated. Building on ‘Contemporary Debates about Islam’ this course will continue to visit some of the controversial social, political, and cultural topics of the ...\n\n      more description for WRIT-AD  131X »\n\n      \n\n\n\nIt is perhaps not too much of an exaggeration to suggest that there exists no other region or cultural grouping in the world today that has undergone such intense scrutiny as that of Middle East and Islamic world. With the recent rise of ISIS, the emergence of the Arab Spring, and the never-ending conflict in Israel-Palestine there is every reason to believe that worldwide attention on Islam, Arabs and Muslims is likely to continue unabated. Building on ‘Contemporary Debates about Islam’ this course will continue to visit some of the controversial social, political, and cultural topics of the day with particular focus on the Middle East.\n\n      less description for WRIT-AD  131X «",
            "offering": false
        },
        {
            "course_id": "WRIT-AD 210",
            "course_name": "",
            "description": "WRIT-AD  210\n\n   Advanced Seminar in Writing and Speaking: Taste, Culture and the Self\n\nThis course builds upon the skills from Analysis and Expression and the Writing-Intensive Core courses to prepare students for advanced writing across the curriculum.  The course calls upon students to be creative, critical, and curious, as they rigorously practice their written and spoken expression.  Students engage with a variety of texts and research topics to gain greater self-awareness and confidence with their writing.  Each major assignment is the result of a progression of exercises with an emphasis on drafting and revision strategies. Students work collaboratively, offering construct...\n\n      more description for WRIT-AD  210 »\n\n      \n\n\n\nThis course builds upon the skills from Analysis and Expression and the Writing-Intensive Core courses to prepare students for advanced writing across the curriculum.  The course calls upon students to be creative, critical, and curious, as they rigorously practice their written and spoken expression.  Students engage with a variety of texts and research topics to gain greater self-awareness and confidence with their writing.  Each major assignment is the result of a progression of exercises with an emphasis on drafting and revision strategies. Students work collaboratively, offering constructive critique through class discussion, peer workshops, and one-on-one conferences.\n\n      less description for WRIT-AD  210 «",
            "offering": false
        }
    ]
}